{
  "": {
    "F7B3E3134BDFD4D9A7D52692CDFF720D": "12,7mm",
    "45D2C1E8485F1B0D876989BAAC564C0C": "120-68 “Koronides” Feldartillerie",
    "916138E445876798C80845824CF00F8A": "120-68 “Koronides” Feldartillerie",
    "70E8F99F481D13F68E84B0B73F53CEC8": "20 Neville Panzerbüchse",
    "059BF4FD4EFEB8A20D326F8C64D3EA5E": "30-250 “Tisiphone” Feld Kanone",
    "467412EF4AC24CA85CC25C80576833FD": "35-250 “Alekto” Schwere Feldkanone",
    "CAB09D624FC3C44F8E72E784DB49B0FA": "3C-Hochexplosiv Rakete",
    "207EFC4040D06114E7C593BE1A96F7A4": "4C-Feuer Rakete",
    "7208C0F2499AF0909F6934B938937C44": "7,62mm",
    "64C33C4C4C5AD7FD90EBBA97A012B49A": "7,92mm",
    "D8750ABC4423022DBF1E25BD003F2F54": "94,5mm",
    "ABE92E8B41355AF0EF2BF89C9F6AE45D": "Ein für den Orts- und Häuserkampf geeigneter Colonial Panzerwagen, effektiv gegen feindliche Infanterie. Er nutzt 7,92mm Munition und ist am Heck vergleichsweise schwach gepanzert.",
    "DB42CDE2472CDA9F938C8EB6E78BCF2A": "Ein Colonial Fahrzeug, das zur Mobilisierung von Truppen und Vorräten genutzt wird.",
    "6E22A7064B8B01616C97DCACB5358CA7": "Ein Kraunian-Gewehr, das für den Einsatz auf große Entfernungen modifiziert wurde. Es verfügt nicht über die Reichweite oder Durchschlagskraft anderer Scharfschützengewehre, macht dies aber durch seine unübertroffene Zuverlässigkeit in einer Vielzahl von Umgebungen und eine überlegene effektive Feuerrate mehr als wett.",
    "E8DF220F4C61FFF4E87167BDB240E8F5": "Eine große Garnison verbindet diese Basis dauerhaft mit nahegelegenen Verteidigungsanlagen.\r\n\r\nEine große Garnison ist erforderlich, um die Basis auf Stufe 3 aufzurüsten.",
    "09DB63E248C2413C6D5953940E7D3898": "Ein Stromleitung-Verbindungspunkt, mit dem der gesamte Bunker an ein Fabrikanlagen-Stromnetz angeschlossen wird.",
    "2E3A145542F1B378AB5ABCB091BAF82C": "Ein Stromleitung-Verbindungspunkt, mit dem der gesamte Bunker an ein Fabrikanlagen-Stromnetz angeschlossen wird.",
    "6C6AA92542639CD9DDFA66951C793A52": "Ein Stromleitung-Verbindungspunkt, mit dem der gesamte Bunker an ein Fabrikanlagen-Stromnetz angeschlossen wird.",
    "F9E5B5BF470BC17D83FCA6830C4AE867": "Ein Stromleitung-Verbindungspunkt, mit dem der gesamte Bunker an ein Fabrikanlagen-Stromnetz angeschlossen wird.",
    "D0B5C6594E1D21848FCBB3B8F4B5BA31": "Eine improvisierte Garnison verbindet diese Basis mit naheliegenden Verteidigungsanlagen. Die Verteidigungsanlagen sind inaktiv, wenn die Spieleraktivität zu niedrig ist.\r\n\r\nDies dient außerdem dazu, dass Städte zu den Siegbedingungen gezählt werden.",
    "2E97128843820EB35C9F7594653DE298": "Eine Raffinerie zur Umwandlung von Rohstoffen in Materialien.",
    "DB8F146845B3D2707EEE4FAA7E9F3FB0": "Eine kleine Garnison verbindet diese Basis dauerhaft mit nahegelegenen Verteidigungsanlagen.\r\n\r\nEine kleine Garnison ist erforderlich, um die Basis auf Stufe 2 aufzurüsten.",
    "9BC06F1F45F3DFB47E850090FE338208": "Ein Warden-Motorrad, das bei Patrouillen eingesetzt wird und mit einem Beiwagen ausgestattet ist. Das Kivela Power Wheel kann, durch das Verbrennen zusätzlichen Kraftstoffes, einen vorübergehenden Geschwindigkeitsschub erhalten.",
    "E67197AD45F7368F5E843F85DB73B7C6": "Ein für den Orts- und Häuserkampf geeigneter Warden Panzerwagen, effektiv gegen feindliche Infanterie. Er nutzt 7,92mm Munition und ist am Heck vergleichsweise schwach gepanzert.",
    "C1ADB43947CBF8A0166097B86CEA58D5": "Ein Warden Lastkraftwagen, der dazu dient Truppen und Vorräte zu mobilisieren.",
    "0810394D4C98AC57B6375A9556ADFDAF": "Eine einfache Barriere, die benutzt wird, um den Durchgang durch ein Gebiet zu verhindern.",
    "CB0B50A44DDC10BE211DC4B4B7381153": "Eine Barriere, die benutzt wird, um den Durchgang durch ein Gebiet zu verhindern.",
    "42F6EE1B42458373F5AD0FACFAB8D199": "Eine simple Mauer, die den Durchgang zu bestimmten Gebieten verhindert.",
    "849F766947B123B6F7AC2B9B46735242": "Ein Hochofen, der Schweröl weiter zu einem angereicherten Öl veredelt, das dann für fortgeschrittene Prozesse benötigt wird.",
    "1B9EA5094C9510ADD875C682CD9695E1": "Ein Blutbestandteil, der dazu verwendet wird verwundete Soldaten auf dem Schlachtfeld zu versorgen.",
    "071146C64F45BB20DC7F9097F2927408": "Ein Schwarzes Brett mit verschiedensten Karten und Daten der Regionen. Sorgfältige Planung und Navigation sind die Schlüssel für einen erfolgreichen Einsatz.",
    "79E7DF2446C683B4A4C5BBBF7E6F0F00": "Die \"Ixion\" ist eine gepanzerte Variante der T12 Tankette und bietet der Besatzung mehr Stahl rundum. Zudem hat sie nun ein angebautes Infanteriegeschütz - kurz \"ISG\". Natürlich führt all das zusätzliche Gewicht der Panzerung zu einer geringeren Gesamtagilität.",
    "1D3E7E0B40AD5A10BA91D0A502DFCD97": "Ein Eimer für Wasser. Sie können Wasser in Brände schütten, um diese zu löschen.",
    "1BB9EE714B7B944A7C40E6A347767920": "Ein Bunker mit einer mechanischen Station, die im Brandfall automatisch Wasser sprüht. Beinhaltet eine Rohrverbindung.",
    "6E889F4B49524DE8CF0C29B3E8EB1D9B": "Ein Bunker mit einer mechanischen Station, die im Brandfall automatisch Wasser sprüht. Beinhaltet eine Rohrverbindung.",
    "5613ECB84871EAF807AF3C94E7410811": "Eine Sammlung von Stationen zur Erleichterung der Montage von Infanteriewaffen und Sprengstoffen.",
    "35906D654E7DA1A4DC94708B247DBD88": "Eine kompakte Panzerabwehrgranate, die als Gewehrgranate oder aus Granatwerfertürmen abgefeuert werden kann. Ihre Sprengladung eignet sich hervorragend zum Vernichten gepanzerter Fahrzeuge, während sie gleichzeitig vielseitig und leicht zu transportieren ist.",
    "3374580C4828A038F890F0865E7A4404": "Eine Verbindung von extrem seltenen Materialien die für die Produktion der fortschrittlichsten Fahrzeuge und Waffen benötigt wird.",
    "7E40D2154CE6CB3C3E6061949B00885E": "Eine Betonmischung, welche zum Bau von stark befestigten Gebäuden genutzt wird.",
    "9DF94D654A1A4D7A9594109BDFF73675": "Eisenbahntender zum Transport der benötigten Kohle und zur Befüllung von Zügen im Fernverkehreinsatz. ",
    "5E7A0E644EAC8007BB97D79FC018D9C2": "Ein Container, der große Mengen an Kisten fassen kann und mit, von Kränen beladbaren Fahrzeugen und Schiffen transportiert werden kann. Diese Containerart kann nur an Lagerdepots oder Häfen entladen werden.",
    "E23C94E74E90656A4646E4B76C1064A2": "Ein Behälter zur Aufbewahrung großer Flüssigkeitsmengen. Gebäude und Fahrzeuge in der Nähe können direkt aus diesem Behälter tanken. ",
    "0940EACD44FCACF5968E3D973AC19D10": "Ein Rohstoff Container, der große Mengen an Ressourcen fassen und durch bestimmte Fahrzeuge transportiert werden kann.",
    "ABE5635E4960DF03209C51B702D6B9A4": "Eine Kiste mit Gegenständen. Muss einem Vorratslager hinzugefügt werden bevor die enthaltenen Gegenstände genutzt werden können.",
    "ACF04FFB45D3815A46FBA8A4817BAB49": "Eine Kiste, gefüllt mit versandfertigen Strukturen.",
    "92413FCE410B5FD33CC7E7BECF7DFEEB": "Eine Kiste, gefüllt mit versandfertigen Fahrzeugen.",
    "E41316F941B33903879094BC79330D6A": "Eine abgespeckte Variante des Silverhand-Sturmpanzers, die bereitwillig Panzerung und Schutz zugunsten einer leistungsstarken 94,5mm Kanone opfert. Diese offene Waffenplattform wurde speziell entwickelt um feindliche Panzer zu knacken, bevor diese überhaupt die Zeit für einen Gegenschlag haben. Sein Spitzname ist eine Hommage an die Verunglimpfung des großen Königs, dem Namensvetter dieser Silverhand-Variante. Obgleich dem König sein Titel entzogen wurde und zudem sein Stolz beschädigt, wurde seine ungebrochene Wut nie gestillt.",
    "0670B3AB41061136BDA48382F2BA1F64": "Ein Schutzwall, der Feindbewegungen einschränkt und als Deckung in Kampfsituationen dient.",
    "41E8BDBD43A5DBAA714F13BB9B8F345F": "Ein Schutzwall, der Feindbewegungen einschränkt und als Deckung in Kampfsituationen dient.",
    "A8CDA9DA405A9520FCAB96A5C7E7CCEE": "Eine Verteidigungsstellung mit einer 68mm Panzerabwehrkanone. Diese rudimentäre Waffe wurde einst gebaut, um auf dem Rumpf großer Marineschiffe zu passen, wurde aber schließlich ausgemustert und umfunktioniert.",
    "00358E364B11C747248F818F086B46CD": "Ein Schutzwall, der zur Einschränkung von Feindbewegungen und als Deckung im Kampf dient.",
    "3105F0534A0D724D774462A341DAA801": "Ein Schutzwall, der Feindbewegungen einschränkt und als Deckung in Kampfsituationen dient.",
    "99C132674FFD45DF7D2E56B3BC711991": "Ein zerstörter Schützengraben mit Geschützstellung.",
    "BE5E36F541B479B4216542B5A6ADFC4B": "Ein zerstörter Schützengraben mit Geschützstellung.",
    "D66C394A48367596582750A9659F5C0C": "Ein zerstörter Schützengraben mit Geschützstellung.",
    "68092C204DF23054102EA1AA67500C02": "Ein zerstörter Schützengraben Verbinder.",
    "91F78F5F4497E20D3A4795993359477D": "Ein zerstörter Schützengraben Verbinder.",
    "BD1F34F343EC150E2863888593CE9063": "Ein zerstörter Schützengraben Verbinder.",
    "2C46569947371E295E55CE9C92500740": "Ein zerstörter Schützengraben.",
    "594A7EAA47FD9AAE46EBE090CB2A4429": "Ein zerstörter Schützengraben.",
    "EB7366454EC479B9AD5D1C98A9730D2A": "Ein zerstörter Schützengraben.",
    "4E49999842287992ED3A1386617B3BB1": "Ein Gerät, um feindliche Funknachrichten von naheliegenden Quellen abzufangen.",
    "F19A102C4321B3F939D887A4CABACDA7": "Ein Gerät, um feindliche Funknachrichten von naheliegenden Quellen abzufangen.",
    "662029924BA10BE1FE3BBCA7285337B9": "Ein Fass mit Brennstoff zur Verwendung mit Flammenwaffen.",
    "AED06A8142D5D69B92B9BEA908FCFCE2": "Hochkalibriges, doppelläufiges Anti-Infanterie Maschinengewehr. Der Swallowtail ist mit einer nach vorne gerichteten Panzerung versehen und eignet sich hervorragend zur Unterdrückung. ",
    "412F9B3C4C78EE64DA2A659E761946AE": "Eine doppelläufige Hochkaliber Anti-Infanterie Maschinengewehrlafette. Das \"Sagittarii\" ist mit einer nach vorne gerichteten Panzerplatte ausgestattet und eignet sich hervorragend für Unterdrückungsfeuer. ",
    "9E2135994268AB8584299193965DF80B": "Eine Art von Unterstand, der als Deckung und als Kreuzung zwischen Bunkern und Schützengräben verwendet wird.",
    "B800ED0F4AE60D821A03CD84F8061DAB": "Eine Art von Unterstand, der als Deckung und als Kreuzung zwischen Bunkern und Schützengräben verwendet wird.",
    "E34BA8754C41034B564D3DAE7B04BCB8": "Eine Art von Unterstand, der als Deckung und als Kreuzung zwischen Bunkern und Schützengräben verwendet wird.",
    "07E2E2DF4A18549BA72607ABD8CE60D9": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Verbindet sich mit anderen Gräben und Bunkern.",
    "8431DFE2480D7F58906D40BBE06EB56A": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Verbindet sich mit anderen Gräben und Bunkern.",
    "8875EEB54848F9A52F56AC91D19944A5": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Verbindet sich mit anderen Gräben und Bunkern.",
    "BC51F6BD4705B2E3B4FBCEAB125A1A82": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Verbindet sich mit anderen Gräben und Bunkern.",
    "C673FE8543305548B48B5EB3D053712A": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Verbindet sich mit anderen Gräben und Bunkern.",
    "DD2AB37D4FA6E5A48AD411916356CE29": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Verbindet sich mit anderen Gräben und Bunkern.",
    "76B16A824CBCB1A33968A6BFE11AD03F": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Diese Variante kann in ihrer Größe angepasst und unter Straßen errichtet werden. Verbindet sich mit anderen Gräben und Bunkern.",
    "DFFC4C2D4A663BFF702B08BAB37B7C5A": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Diese Variante kann in ihrer Größe angepasst und unter Straßen errichtet werden. Verbindet sich mit anderen Gräben und Bunkern.",
    "FF9A406C41A2FA315015A38BC88B91CB": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Diese Variante kann in ihrer Größe angepasst und unter Straßen errichtet werden. Verbindet sich mit anderen Gräben und Bunkern.",
    "2F7B619D405D508DFA5DEF94AA028D8C": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Diese Variante dient außerdem als Stellung für bemannte Verteidigungsanlagen. Verbindet sich mit anderen Gräben und Bunkern.",
    "A320DFC84F9F465BBF6EDAB03B974770": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Diese Variante dient außerdem als Position für bemannte Verteidigungsanlagen. Verbindet sich mit anderen Gräben und Bunkern.",
    "FA81A3C548714C37F5F2258FB1420749": "Ein Schützengraben, der als Deckung und Verbindung zwischen Bunkern dient. Diese Variante dient außerdem als Stellung für bemannte Verteidigungsanlagen. Verbindet sich mit anderen Gräben und Bunkern.",
    "23E6D64B495A0A6B46E711BCD9D03A93": "Eine Fabrikanlage, in der Ausrüstung und Munition für die Artillerie gelagert werden. Das Abrufen erfolgt bei dieser Struktur besonders schnell.",
    "3B196CD540FB62AD3622579FBF626BFE": "Eine Einrichtung, in der Ausrüstung und Munition für die Artillerie gelagert wird. Das Abrufen erfolgt bei dieser Struktur besonders schnell.",
    "BB7C28194487CA425C4DF98A61D4FE2C": "Eine Fabrik zur Herstellung fortschrittlicher Munitionstypen wie großkalibrige Granaten, Raketen und Flammenwerfer-Brennstoff.",
    "BE177EE4441C5F046CC8049B97050210": "Eine Fabrik zur Veredelung von Rohstoffen zu verarbeiteten Baumaterialien. Zusätzliche Modifikationen können zusätzliche hochveredelte Materialien ermöglichen, die für noch fortgeschrittenere Fabrikanlagenoperationen benötigt werden.",
    "77F7A5C245872D31C6810B8DFAFF6296": "Eine Fabrik, die Rohstoffe zu Baumaterialien für fortschrittliche Einrichtungen veredelt. Zusätzliche Modifikationen ermöglichen die Entwicklung einer Vielzahl unterschiedlicher Materialien.",
    "321CB9FD49796CE9AB81229C03CB0B01": "Eine Fabrikanlage, die sich auf die Herstellung von Infanterieuniformen spezialisiert hat. Änderungen können vorgenommen werden, um zudem Infanteriewaffen und schwere Munition herzustellen.",
    "87312142472EB68405C143887E747795": "Ein rasend schnelles und explosives Projektil, das mit Raketenwerfern verwendet wird.",
    "D80FAAA943B11E8EE5B1FD8917D0EB63": "Ein Sanitätszelt, in dem kritisch verwundete Soldaten direkt an der Front behandelt werden. ",
    "401E46D3461494D138A23482166A0EDB": "Eine Feuerstelle",
    "DACD4BF34D13FA3410AFD4B1ADE16D36": "Der Skycaller ist eine Variante des Niska Motor Carriage mit einer von Rycker entwickelten Raketenbatterie in der Ladefläche. Dieses einzigartige gepanzerte Fahrzeug feuert mit Leichtigkeit Raketen über große Entfernungen ab und kann in kürzester Zeit neu bewaffnet und verlegt werden. Der Skycaller ist das tödliche Ergebnis einer Kombination aus Nevischer und Caoivischer Technologie.",
    "BD812A6742F1D60A2CA2E09E408378F3": "Ein Flachwagen für den Transport großer Ressourcen und Munition über weite Strecken mit dem Zug. ",
    "13D9448B439D377ACF804D9C57381E7C": "Ein flutbares Becken und Bauplattform. Ermöglicht den Bau und die Reparatur der größten Marineschiffe.",
    "0C71638A4003A5349C54ECAF3E566645": "Eine formelle Uniform, die einen führenden Offizier eines Regiments bezeichnet. Obwohl unpraktisch, kann der diensthabende Offizier seine Autorität nutzen um Untergeordnete ohne jede Strafe zu disziplinieren. Offiziere tragen eine wichtige Rolle in dem Warden Militär, die bis zu einer Zeit zurückreicht, als Caoiva noch von einem Dutzend Königen regiert wurde.",
    "CDDD81B84541976034E1D6BA163C62BB": "Ein Fundament, das eine geeignete Oberfläche für den Bau von Einrichtungen bietet.",
    "66CC30DF45FBD48814720C8A697FCD15": "Ein Gießereibereich, der die Herstellung und Montage schwerer Munitionsklassen für Panzer und schwerere Infanteriewaffen erleichtert.",
    "8DA8488E4CCE724BE7D96595F1312DAE": "Eine Werkstatt, die Fahrzeugmodifikationen und -aufrüstungen ermöglicht.",
    "44C193C343183902EC1598A00A0E7236": "Ein zentrales Gebäude mit Garnison, das für die Verteidigung einer Stadt von entscheidender Bedeutung ist. Spieler können hier ins Spiel wiedereinsteigen und Gegenstände einlagern.",
    "6FBF40EC4148F845D6E9838CCE86CE5E": "Ein zentrales Gebäude mit Garnison, das für die Verteidigung einer Stadt von entscheidender Bedeutung ist. Spieler können hier ins Spiel wiedereinsteigen und Gegenstände einlagern.",
    "BEAB2C24421E9FFAC1FD26B28C0F991B": "Ein zentrales Gebäude mit Garnison, das für die Verteidigung einer Stadt von entscheidender Bedeutung ist. Spieler können hier ins Spiel wiedereinsteigen und Gegenstände einlagern.",
    "F85BCBE9434061E78F8BBBA1F83C0D89": "Ein befestigter Stützpunkt, der zur Verteidigung einer Stadt eingesetzt wird. Spieler können hier ins Spiel wiedereinsteigen und Gegenstände einlagern.",
    "75C05BD74EA44B3459F6DD9AE7D7477F": "Ein Tor, das den Zugang zu einem ummauerten Bereich ermöglicht.",
    "F40945DD48E7FE4C35DD0188F1295FE7": "Ein Tor, das den Zugang zu einem ummauerten Bereich ermöglicht.",
    "FCF631C147D5FEC5ECAAEABFBEF23D0E": "Ein Tor, das den Zugang zu einem ummauerten Bereich ermöglicht.",
    "C123BDFD4EAF70CBDB604F8DBA641B22": "Ein Generator, der Kohle verbrennt, um Strom zu erzeugen.",
    "798C0A354153FA97DF4B9EA6536829E6": "Ein Generator, der Benzin verbrennt, um noch mehr Strom zu erzeugen.",
    "2F41A7A64A16C1223014DE81956F79B9": "Ein Generator, der Strom nutzt, um Öl durch angeschlossene Rohre zu pumpen.",
    "BD0BCA3543C3C29E448EE9A8A07A0E05": "Die Lionclaw ist eine schwerere und modernere Variante der Pitch Gun und eignet sich gut als Allround-Maschinenpistole, die als Primärwaffe für Orts- und Häuserkampfeinsätze konzipiert wurde.",
    "4D00771B4B5B472A271215A91FDC3430": "Eine schwer gepanzerte Ausführung des King Spire. Der Gallant Mk. II ist mit einer schweren 30mm Kanone ausgestattet, unter der jedoch die Höchstgeschwindigkeit leidet.",
    "4C3B15ED42125D7480A52F9BC253DD30": "Eine schwer verstärkte Weste, die entworfen wurde, um Grenadiere vor Schrapnellen zu schützen. Aus diesem Grund ist die Flak Weste dazu geeignet, die Anzahl an Schnitten und Kratzern zu verringern, während sie außerdem die Wucht von Projektilen reduziert. ",
    "2A8BE1C34C0526F79ACF6D91681CC82B": "Eine weit schwerere Lanze-Variante, die 25 oder \"Hasta\", wurde bei der ersten Belagerung von Brightwall eingesetzt, einer Stadt, die heute umgangssprachlich als \"The Blemish\" bezeichnet wird. Von schwerem, gepanzertem Widerstand im nördlichen Veli gebeutelt und bombardiert, forderten Colonial-Panzerregimenter ein schweres Panzerfahrzeug mit einer effektiveren 'Aufklären' und 'Zerstören' Kapazität. Ausgestattet mit einer nach vorne gerichteten 94,5mm Kanone ist der „Hasta“ ein mehr als fähiger Panzerknacker.",
    "9116C94743283A454087F4ACE0D29789": "Eine schwere Panzerabwehrgranate.",
    "46724B5540021ABA9BCBB096CCD52C7E": "Eine schwere automatische Presse, die Materialien in eine dichtere Form veredelt.",
    "A26D7B604F08AA4B21D755B90489E34E": "Ein schweres Geschütz, das entworfen wurde, um vorgelagerte feindliche Befestigungen zu zerstören. Das Exalt ist am effektivsten, wenn es in einer Verteidigungsanlage eingebettet ist, um dann seine volle Reichweite ausnutzen zu können.",
    "B30E60B44B6340C80E9B3CBA1C235AAF": "Ein schwerer Tieflader entwickelt von der Bassett Motor Society. Dieser dient dem einfachen Transport schwerer kranverladbarer Güter über lange Strecken.",
    "7312CF5F420C4840C1D6F8B7AB84AAC2": "Ein schweres und befestigtes Artilleriegeschütz, das zerstörerischen Beschuss auf weit entfernte feindliche Ziele niederregnen lässt.",
    "F9A90325487C80A2A8DB16B087D95B58": "Eine schwere Keule aus massivem Holz, die mit Bleinieten besetzt ist. Wird häufig bei Angriffen auf befestigte Gräben auf engem Raum eingesetzt, wo sperrige Feuerwaffen weit weniger effektiv sind und sich altmodische Prügel besser für eignen.",
    "A040D2D145966F1A2E0D22B32ACB68AD": "Ein mobiler Schwerlastkran, der zum Anheben von Fahrzeugen und sehr schwerer Ausrüstung genutzt werden kann.",
    "325F6DAF49E428E1E2423F8083F0DC00": "Ein schwerer und mobiler Mörser. Ausgestattet mit einem soliden Schild in der Front. Sehr nützlich im Angriff auf befestigte Feindstellungen",
    "3C9D234C4A0EFD3161554E8A42C845F0": "Eine robustere und verstärkte Version des Dunne Lastkraftwagens. Ausgestattet mit einem stabileren Rahmen ist der Leatherback zwar in der Lage mehr Schaden einzustecken, jedoch leidet seine anfängliche Beschleunigung darunter. ",
    "B8101D7F4ABFB0076157E78860DFD2DB": "Ein schwerer Kampfpanzer bzw. Schlachtpanzer mit dicker Panzerung und zerstörerischer Feuerkraft. Der \"Flood\" Schlachtpanzer ist mit einem 75mm Panzerturm und einem nach vorne gerichteten 12,7mm Maschinengewehr ausgestattet. Die schwere Panzerung begrenzt seine Höchstgeschwindigkeit, dafür kann er aber Einiges einstecken.",
    "557888F2425D443A3754D38FF3E68F46": "Ein schwerer Kampfpanzer bzw. Schlachtpanzer mit dicker Panzerung und zerstörerischer Feuerkraft. Der \"Lanze\" Schlachtpanzer ist mit einem 75mm Panzerturm und einem nach vorne gerichteten 12,7mm Maschinengewehr ausgestattet. Die schwere Panzerung begrenzt seine Höchstgeschwindigkeit, dafür kann er aber Einiges einstecken.",
    "6BCE5705403F3D8062BC3D983238B63B": "Ein Colonial Lastkraftwagen, der zum Mobilisieren von Truppen und Vorräten eingesetzt wird.",
    "9BC20CBD4F82B56B829926AAB0EFFFD9": "Ein Warden Lastkraftwagen, der zum Mobilisieren von Truppen und Vorräten eingesetzt wird.",
    "340573BC403E8059BF8EA7A91BFC2D18": "Ein schweres Langstreckenschützengewehr. Der Clancy-Raca hat einen höllischen Rückstoß, hat aber ein leistungsstarkes Zielfernrohr, welches der Infanterie erlaubt das Schlachtfeld zu überwachen. Es ermöglicht auch die Unterstützung von einer sicheren Position.",
    "1994D61046CF0C62DCDBA8B98CE3EED0": "Eine großkalibrige Anti-Infanterie Geschützlafette. Eignet sich hervorragend für Unterdrückungsfeuer.",
    "08390D0C46412A24EF34288CAA71FC09": "Ein hochwertiger Kraftstoff, der aus Öl raffiniert wird. Wird in einer Vielzahl von Anwendungen in Fabrikanlagen verwendet.",
    "CCBBD74C4EB9271DBBECA0B96391FAC3": "Ein Hochleistungsofen, der Kohle auf hohe Temperaturen bringt, um nichtflüchtigen Koks abzutrennen.",
    "DF0E3525485D81F6072D3C84FA8F3497": "Ein Hochtemperaturofen, der Rohöl in raffiniertes Schweröl katalysiert.",
    "0E47C84B4819C0B2C1C2E0B22660C5F8": "Eine leistungsstarke Sprengladung, die einen begleitenden Zünder erfordert. Die \"Havoc\" Explosivladung ist sehr effektiv bei der Zerstörung großer Strukturen. Die Ladung muss durch einen Schuss gezündet werden. Das wahre Potenzial der Havoc Charge wird freigesetzt, wenn strategische Sprengungen aus sicherer Entfernung ausgeführt werden.",
    "7D8FA1B34320EA7C8774D89576D22C1A": "Eine hochmoderne Abhörvorrichtung, die zum Abfangen und Entschlüsseln von feindlichen Übertragungen entwickelt wurde. Die Aufklärungszentrale kann auf weit entfernte Orte ausgerichtet werden und wird kontinuierlich geheime Übertragungen entschlüsseln.",
    "63CA92E04D0FE15E13FC298EDF912E3C": "Ein hochtechnologisches meteorologisches Modul, das auf soliden Fundamenten innerhalb eines Bunkernetzes aufgebaut ist. Diese Stationen unterstützen die Bediener bei der Vorhersage von Wettermustern. Mehrere Wetterstationsmodule können miteinander verkettet werden, um weitaus genauere Vorhersagen zu treffen, so dass sich Armeen selbst auf die schlimmsten Wetterbedingungen vorbereiten können.",
    "97678A9F4AE94DBACE6C1B8F000042E9": "Ein äußerst manövrierfähiger Leichtgewichtpanzer. Der Devitt wurde für städtische Umgebungen entwickelt und ist mit einer 40mm-Kanone ausgestattet.",
    "891DFDAC45CBDAD6EB7D39B2B7A58F5B": "Ein äußerst manövrierfähiger und vergleichsweise leichter Panzer. Der \"Hatchet\" ist mit einer 40mm-Kanone ausgestattet und wurde für städtische Umgebungen entworfen.",
    "5EEBA409482F1AD6C7AE7E85C975002F": "Eine große Montagestation für die Produktion fortschrittlicher Fahrzeuge und Ausrüstung wie Schlachtpanzer und Züge. Die Montage wird einige Zeit in Anspruch nehmen und kann gestoppt werden, wenn die Ressourcen erschöpft sind.",
    "EC62CC58412440D4E23C7CBA9AC21CFF": "Ein großes Gebäude zur Lagerung von Ausrüstungskisten, Fahrzeugen und versandbereiten Befestigungen.",
    "2E7E0DB244163440077CE7A62C37E0D4": "Ein großes Gebäude zur Lagerung von Ausrüstungskisten, Fahrzeugen, Schiffen und versandbereiten Befestigungen.",
    "06A4877C416917417F9ACBA44DB999B0": "Eine große vorgezogene Operationsbasis. Spieler können hier ihren Wiedereinstiegspunkt setzen und Gegenstände lagern.",
    "1999FECB40FF4DE9FF6E91A65B0004F0": "Eine große vorgezogene Operationsbasis. Spieler können hier ihren Wiedereinstiegspunkt setzen und Gegenstände lagern.",
    "B572582B475475CC0EAC4396606C91DA": "Eine große vorgezogene Operationsbasis. Spieler können hier ihren Wiedereinstiegspunkt setzen und Gegenstände lagern.",
    "ECF915A74AF418023D2351A1CB61F605": "Ein großer industrieller Kessel zum Verflüssigen von Metallen, um Verunreinigungen aus fortschrittlichen Materialien zu entfernen.",
    "985FCAC54A7A91242513AB92B016817E": "Eine große medizinische Einrichtung zur Behandlung kritisch verwundeter Soldaten die vom Schlachtfeld zurückkehrten.",
    "21DC32A84CC9B1B06A33D0B902E7E975": "Eine große Verarbeitungstrommel, die die kontrollierte Einleitung von Wasserstoff ermöglicht, um die gleiche Benzinproduktion für weniger Rohöl zu erzielen. ",
    "A71A14434198515B2130449921B346AD": "Bei dem Aquatipper handelt es sich um einen größeren Lastkahn, der zum Transport von Fahrzeugen, Ausrüstung und Personen über größere Gewässer genutzt wird.",
    "94B578314EBB3B9E7F4F24A53ED1ED57": "Ein leicht gepanzertes mechanisiertes Fahrzeug, das zum ersten Mal in Konflikten an der Grenze zwischen Caoiva und Veli gesichtet wurde. Aufgrund seines recht dünnen Rahmens wurde es oft in breiten Formationen genutzt, um feindliche Truppen zu übermannen.",
    "ADE614A6470D0CB66831B2A910D3D874": "Ein leichtes Artilleriegeschütz, das als Teil von Verteidigungsanlagen entworfen wurde. Das Lariat hat eine beeindruckende 120mm Kanone mit langer Reichweite, entworfen um feindliche Fußsoldaten mit schwerem Beschuss einzudecken.",
    "F00BFEEC43676E5CE6440DB3D2B5BE81": "Ein kleines Licht, das die Umgebung erhellt. Benötigt eine Mindestmenge an Strom, um zu funktionieren.",
    "0863B6A543ECCD93995DD2AC4968D4C9": "Eine Position, die von einer Rakete aktiv anvisiert wird.",
    "310C20A047D44550CB384F8FDAF5226A": "Eine mobile Langstrecken-Artillerie der Colonials zur Belagerung befestigter Stellungen.",
    "79122FD246C033F537757FA0D88CF3AA": "Eine mobile Artillerie der Colonials, mit großer Reichweite, die zur Belagerung befestigter Stellungen eingesetzt wurde.",
    "40DD8C8E4A58BB0AA2E145AD0DFDF9A3": "Eine Leuchtrakete mit langer Brenndauer, die, solange sie in der Luft ist, eine große Fläche ausleuchtet und feindliche Ziele aufdeckt.",
    "906435B8438E53184E6B5CA9EA7AE97A": "Ein Funkgerät mit großer Reichweite, dazu ausgelegt Befehle im Handumdrehen zu übertragen. Manchmal hat man einfach keine Zeit die Nachricht persönlich zu überbringen.  ",
    "3CF4A6404018F2698D30D1BFA541252C": "Ein kleiner Flachbettwaggon für den Kurzdistanz-Transport sperriger Ressourcen und Munition auf Schmalspurbahnen.",
    "75BE38574144D6EE1C1F1085D925297F": "Eine Maschine, die Risse in der Erde öffnet, indem sie Wasser mit hohem Druck injiziert, um die Förderung von Rohöl zu erhöhen.",
    "5134C9D844FBDCE85A83E29BF38D7C00": "Eine magische Kiste, die den Gegenstand im ersten Inventarplatz vervielfältigt.",
    "F16C032A4356D6B5945DD1AD7C5D07E9": "Eine vorübergehende Brücke, um den Transport von leichter Ausrüstung zu ermöglichen. Die Brücke wird beschädigt, wenn sie von Fahrzeugen zur Überfahrt genutzt wird.",
    "5AE32C83458629A923D0A0ACE0C852CC": "Eine bemannbare einfache Mörserkonstruktion, die zur Verteidigung einer Stadt verwendet wird.",
    "AF5E0C7B4953A4E92C6C48836B169E7E": "Eine Fabrikanlage für die Großserienfertigung von militärischer Ausrüstung.",
    "57EB5012423821DF377391A599C0C6FE": "Eine Fabrikanlage für die Herstellung von Militärausrüstung.",
    "35DC470B411457F604EDC78818A6EF99": "Eine Materialpalette.",
    "2FC15D1940E24085A4DC9DAFE755B1E3": "Ein Sanitäter-Bunker, in dem kritisch verwundete Soldaten direkt an der Front behandelt werden.",
    "5D5F091A4333F9BDF12730B4B22BA67F": "Ein Sanitäter-Bunker, in dem kritisch verwundete Soldaten direkt an der Front behandelt werden.",
    "9F05AAD54ADB63D64CA29EA1EF2C5E54": "Ein Sanitäter-Bunker, in dem kritisch verwundete Soldaten direkt an der Front behandelt werden.",
    "B8E16A6F4322F73241A86B8E99FBBDCD": "Ein mittelschwerer Kraftstoff, der aus Öl raffiniert wird. Wird als hochwertiger Kraftstoff für Fahrzeuge und in verschiedenen Anwendungen in Einrichtungen verwendet.",
    "52F819C94A4FB7D68080FEA14921C197": "Eine modifizierte Variante des Devitt, ausgestattet mit einem angepasstem Caine Mörser Geschützturm. Dank des zusätzlichen Gewichtes leidet die Höchstgeschwindigkeit jedoch darunter.",
    "3729EE67488A5DDA39955096FCC3346C": "Ein Motorrad mit Beiwagen. Nützlich, um in weitläufigen Gebieten zu patrouillieren. Mit der Nutzung von zusätzlichem Treibstoff kann die Höchstgeschwindigkeit deutlich gesteigert werden.",
    "EB42FEA34CE79F8CAB36C0A8DF52C365": "Ein Motorboot, um kleinere Infanteriegruppen über Flüsse und von Insel zu Insel zu befördern.",
    "095F90EA4DBE1E287F589E95E8303BC7": "Ein Befestigungspunkt für schwere Infanteriewaffen und Ausrüstung.",
    "53E5E9F6485E6A05C7AAB5AA17F64602": "Ein Mehrzweck-Schlachtpanzer mit noch stärkerer Verbundpanzerung, schwerer Feuerkraft und geringer Mobilität. Er ist mit einem großkalibrigen Geschützturm und einem frontal montierten Maschinengewehr ausgestattet, das nach vorne gerichtet Infanterie in Schach hält. Wird bestückt mit 75mm Panzergranaten.",
    "4A725EBD4FD3211B67054EB4E0551E0A": "Ein Colonial Mehrzweck Geländefahrzeug, das zur Aufklärung von naheliegenden Zielen genutzt werden kann.",
    "12F425DF4BB2CA39EB0D76BC2FF4B033": "Ein Warden Mehrzweck-Off-Roader, der nahegelegene Ziele aufklären kann.",
    "329A5E954C449A6D068FE3B014FE2303": "Ein Multifunktionswerkzeug. Kann dazu verwendet werden, Minen und Stacheldraht zu entfernen und um Fahrzeuge aufzubrechen.",
    "81B26A394866F839029F09AB4976253E": "Eine geheimnisvolle Kiste, die einen niemals endenden Vorrat an Ressourcen bietet",
    "9A3557304EF64924F26FBDB3CB19F583": "Eine besonders festliche Flagge.",
    "B427B38E4B6A375CB9664590C5B78984": "Die Ferro 879 ist eine aus dem Osten Estrellas importierte Pistole. Sie ist auf vielen Schlachtfeldern zu sehen.",
    "67D734954C830181A4C42BA3CCB28371": "Ein Lagerfeuer, das Soldaten während Schneestürmen Wärme bietet. Benötigt Diesel, um die Flamme am Leben zu halten.",
    "898522CC4AC93FBD1DE535896836D8CF": "Eine tragbare Maschine, die zur Herstellung von Beton, verschiedene Materialien mischt. Welcher zum Bau von stark befestigten Anlagen genutzt werden kann.",
    "02C98F7147B981B0F235D890FB98C008": "Eine Leistungsschnittstelle zum manuellen Deaktivieren der Stromversorgung in einem Stromkreis.",
    "6C4EC81A4984D707E50FBFAD4AB329B9": "Ein Kraftwerk, das eine große Menge Strom aus Öl oder Kohle erzeugt.",
    "5212939C48FF1C642B8E6EB662591ED1": "Ein vorbereiteter Bereich zur späteren Anlage von Panzer- und Infanterie-Minenfeldern.",
    "AF36B46549B82B8327C173B20E6E0342": "Eine Verarbeitungsanlage, die Kohle zu nützlichen Materialien veredelt, die in der Anlagenproduktion und Energiegewinnung verwendet werden.",
    "42490F284579F2525B717597767F805B": "Eine Waffenlafette um verschiedenste Schusswaffen zu montieren.",
    "952D2A4746C7A202922E04831AD73301": "Ein Funkbunker, der verbündeten Einheiten Aufklärungsinformationen über die Umgebung liefert.\nDiese zuverlässige Struktur aus massivem Beton hat, im Gegensatz zu den zwei weniger befestigten Funkanlagen, eine weit größere Reichweite und ist ebenfalls mit einem Fernglas ausgestattet, das den Benutzern ein größeres Sichtfeld bietet.",
    "1012DB424CD0852F610772A1CE74AB88": "Ein Funkbunker, der verbündete Einheiten in der Umgebung mit Informationen versorgt. Zudem ausgestattet mit einem Fernglas, das den Benutzern ein größeres Sichtfeld bietet.",
    "C08F59AF40C5D83D647E19B12B194312": "Ein Funkbunker, der verbündete Einheiten in der Umgebung mit Aufklärungsinformationen versorgt. Der Bunker ist in dieser Strukturstufe im Wirkungskreis gesteigert, und ist mit einem Fernglas ausgestattet, das den Benutzern ein größeres Sichtfeld bietet.",
    "98FDD84247786AD3619A06A7C390649A": "Ein Regensturm tobt in dem Gebiet.",
    "2041E1E94A36F25C11F23DBC6B1E7491": "Ein erhöhter Gehweg zum Erstellen von Wegen über komplexen Fabrikanlagen.",
    "601D72B24860CDD8206351BEE71FC3AC": "Ein erhöhter Gehweg zum Erstellen von Wegen über komplexen Fabrikanlagen.",
    "9C356F4C482A99F34DB28891873D9290": "Eine Rampe, die den Zugang zu unterirdischen Bunkern erlaubt.",
    "A548DAAE458E69AB6A32C39E233CBD17": "Eine Rampe, die den Zugang zu unterirdischen Bunkern erlaubt.",
    "F1F91A014F23A3D3B484BDBD771E25E6": "Eine Rampe, die den Zugang zu unterirdischen Bunkern erlaubt.",
    "548DACD345555EDD93D43DB8A81C5327": "Eine viskose Rohflüssigkeit, die in Anlagen zu Kraftstoff raffiniert werden muss.",
    "4F428A6749B2C8811BE67A9F3B7F53B6": "Ein Reaktor, der Wasser mit Schweröl oder raffiniertem Koks kombiniert, was zu einem reineren Erdgas führt, das wiederum effizienter Strom erzeugt. Als Nebenprodukt entstehen kleinere Brocken rohen Schwefels.",
    "4E219CEF49D98D8D1D97558D22BB0462": "Ein geborgener Colonial Prototyp, der in der frühen mechanisierten Kriegsführung eingesetzt wurde. Dieses gepanzerte Fahrzeug, aufgebaut auf dem Chassis einer starken Zugmaschine, wurde zum Geleitschutz von Fußsoldaten oder später als Unterstützung größerer und gepanzerter Streitkräfte eingesetzt.",
    "15C63D144D30014F7685FBBE9A21A092": "Eine Raffinerie, die Öl zu anderen nützlichen Materialien für die Produktion und Stromerzeugung verarbeitet.",
    "F3EE5685426B24F5F00A219BF984F928": "Ein verstärktes Fass mit extrem explosiven Substanzen, die für die tödlichsten Sprengköpfe benötigt werden.",
    "3FC569FC40B27F9AD9E26FA03F50CF7F": "Ein verstärkter Unterstand, der den einquartierten Gewehrschützen eine befestigte Verteidigungsposition gibt, um aus relativer Sicherheit auf die sich nähernden Feinde zu wirken.",
    "A620ADF748599DC11DAF30B347F2F263": "Eine Forschungseinrichtung, in der Spieler zur Erforschung des Forschungsbaums ihrer Fraktion beitragen können.",
    "6B158AB149C22B70F67B998F1FFCA739": "Ein Ressourcenfeld zum Sammeln von Kohle, sei es zur Verwendung als Brennstoff, zur Produktion in Einrichtungen oder zum Transport zur Raffinerie.",
    "925DFE2241AE18D5525CF7BEE32DC272": "Ein Ressourcenfeld zum Sammeln von Komponenten, die zu einer Raffinerie gebracht werden sollen.",
    "420703524C55DF6F7802A69F8F0653DB": "Ein Ressourcenfeld zum Sammeln von Schrott, welches zu einer Raffinerie gebracht werden soll.",
    "932ED7584D5AE02116EC9A85FB19086B": "Ein Ressourcenfeld zum Sammeln von Schwefel, der zu einer Raffinerie gebracht werden soll.",
    "A341B03B40416F682A8BAD8F317DC096": "Ein Gewehraufsatz, der Granaten mit pneumatischer Kraft abfeuert. Zusammen mit spezialisierten Granaten kann es auch die Standardhandgranaten abfeuern.",
    "FF4760F8403753E1A1C0949DBEE74515": "Ein sicherer Ort um sein Geschäft zu verrichten. Immerhin muss jeder irgendwann mal auf's stille Örtchen.",
    "3D7398FD48AFD855E42AD1A4F4C1D058": "Ein sicherer und sauberer Platz um Rationen oder geplünderte Essensvorräte zuzubereiten. ",
    "EAE29E5647F210251BF383AE3E9DC1A3": "Ein Eisenbahnsegment für überschwere Kräne. Diese Art von Schienenbahn kann nur auf stabilen Fundamenten gebaut werden.",
    "666A59564F4699BB4E6CA99411AEF1E5": "Ein Schmalspurbahnabschnitt für kleine Waggons. Schmalspurbahngleise können an bereits bestehenden Schienen angeschlossen werden oder von diesen abzweigen, um dann komplexe Netze zu bilden.",
    "2D40CD2B4A4B36D17C5712BB6E3CB22F": "Ein Eisenbahnabschnitt für Schmalspurwaggons. Gleise können an bestehende Schienen angeschlossen oder von diesen abzweigen, um komplexe Netze zu bilden. Diese Art von Schmalspurbahn kann nur auf Fundamenten gebaut werden.",
    "DE5BB7E34093B270F67BB082224C6468": "Ein Eisenbahnabschnitt für Waggons. Gleise können an bereits bestehenden Schienen angeschlossen werden oder von diesen abzweigen, um dann komplexe Netze zu bilden.",
    "85B5B9A141B0C6C44DE9C88D80A2D134": "Ein Eisenbahnabschnitt für Eisenbahnwaggons. Gleise können an bestehende Schienen angeschlossen oder von diesen abzweigen, um komplexe Netze zu bilden. Diese Art von Eisenbahngleisen kann nur auf Fundamenten gebaut werden.",
    "AA586EEF445B20AAE11822A26C111DC1": "Ein Eisenbahnabschnitt für Eisenbahnwaggons. Gleise können an bestehende Schienen angeschlossen oder von diesen abzweigen, um komplexe Netze zu bilden. Diese Art von Eisenbahngleisen kann nur auf Fundamenten gebaut werden.",
    "AD9F111648BB9B389954B98DDC0C4432": "Eine Reihe von komplizierten Getrieben, Turbinen und Motoren, die in großen Marineschiffen verwendet werden.",
    "3B08756B4852B8ED7C3FD7AC8B91AE8F": "Eine gemeinsam nutzbare Kiste, in der man Gegenstände lagern kann.",
    "88817B5A41231C3D9AF60BA8CF7DDD58": "Eine Granate, die von einem Spigot-Mörser über kurze Entfernungen abgefeuert wird.",
    "85B3730C41A5F3ED23FAE4956C7618F1": "Ein geschützter Bunker, der die Durchhaltekraft und Widerstandsfähigkeit benachbarter Bunker gegen Artillerie auf Kosten der strukturellen Integrität verbessert.",
    "884B5DCC404A2D0ED574F2A089E3E24B": "Ein geschützter Bunker, der die Durchhaltekraft und Widerstandsfähigkeit benachbarter Bunker gegen Artillerie auf Kosten der strukturellen Integrität verbessert.",
    "E138CA6E4DFED2F7E9B92E98E86781D7": "Ein geschützter Bunker, der die Durchhaltekraft und Widerstandsfähigkeit benachbarter Bunker gegen Artillerie auf Kosten der strukturellen Integrität verbessert.",
    "F5E727A94E4FFA6FF5986B9BF90B3B98": "Ein Schild, das verwendet wird, um Informationen an andere Soldaten weiterzugeben.",
    "774D1EB3444D55BA49E124944E8AF28B": "Ein einfacher Güterwaggon, der für den Transport gewöhnlicher Güter verwendet wird.",
    "4382DC1C459106E7D4EC86B558E25BB4": "Eine einfache Kombüse, die das Bahnpersonal versorgt und ihnen ermöglicht die Gleise weitaus effizienter zu warten.",
    "B8181E7A409FB5D4F6BC258955103FC3": "Eine einfache Kreidetafel, um Einsätze zu planen.",
    "47495A0C4687DB7DCC18089FA7AC8A29": "Ein einfaches, in den Boden gegrabenes, Loch, das Soldaten provisorische Deckung vor Feindbeschuss gibt.",
    "829BDD544B22530FE8108C8A745F4A5C": "Eine einfache Mine, die unter dem Boden verlegt wird und mit einer druckempfindlichen Platte versehen ist, die unter dem Gewicht schwerer Fahrzeuge detoniert. Die Minen sind für Freund und Feind zu Fuß sichtbar.",
    "6C21E17D41EF06A7948B64892AD63978": "Ein einfacher Anhänger, der gewöhnliche Baumaterialien hält.",
    "7548CC834C207668759C83859E31A6FB": "Ein einfacher Anhänger, der schwerere Baumaterialien hält.",
    "6D5D87254EBD72F44EA3F287DADC76AB": "Ein einfacher Anhänger, der verschiedenste Treibstoffe halten kann und auch für das Auftanken von Fahrzeugen geeignet ist.",
    "9260EFD245AA11C91000E6ABB873E77F": "Eine umfunktionierte Wassertankvariante des 3e Dunne \"Responder\", die mit einem Hochleistungsschlauch zum Löschen wütender Brände ausgestattet ist.",
    "50E2CE4A4EECAC54805254885A49251D": "Ein einfaches Blumfield Fahrrad der alten Bauart. Hierbei handelt es sich um ein etwas kleines Nachbau Model, das für kleinere Strecken entworfen wurde.",
    "87E4796C4FADEA341965F8A90D6EBB00": "Eine leicht modifizierte Ausführung des V.110, der \"Gravekeeper\" ist mit einem eingebetteten Bonesaw Granatwerfer ausgestattet, welcher den ansonsten PA-zahmen Panzerwagen in ein nützliches indirektes Panzerabwehrfahrzeug verwandelt.",
    "B39230E34DF8620213AAB5A3D3915EB0": "Eine kleine Basis, die als Ausgangspunkt für die Invasion in feindliche Regionen dient. Spieler können hier ins Spiel wiedereinsteigen und Gegenstände einlagern.",
    "F015AA4645293B138218E495E7B7249E": "Schmalspuriger Containerwaggon für den Transport von Rohstoffen. ",
    "ADC8DAA54AF942CE0633EFA3CA951C55": "Ein kleine Werft bzw. ein Wasserfahrzeugproduktionszentrum.",
    "284764E84E6F56F282D64AB6F0CC51D5": "Ein kleines Fahrzeugproduktionszentrum.",
    "FD14B135475379B5D33DF282DBC4664C": "In dem Gebiet wütet ein Schneesturm. Die Sicht ist eingeschränkt und es droht Erfrierungsgefahr, sollte man sich dem Sturm zu lange aussetzten.",
    "408E42104C80C3FA7E9A56ADE1A96D78": "Ein Soldat, der auf dem Schlachtfeld kritisch verwundet wurde. Transportiere diesen Soldaten zu einem Krankenhaus, um später Soldatenausrüstung einzufordern.",
    "0D5F6D114B77905CE4E6CBB90E199C7E": "Ein Lagerplatz, der für die Aufbewahrung von veredelten Materialien vorgesehen ist, die in und aus Anlagen heraus transferiert werden können. Lagerbestände können öffentlich oder reserviert (!) sein.",
    "4CB8EE134B6F11F903323BA00CA8A395": "Eine spezielle Startplattform, die die Montage und den Abschuss der verheerenden A0E-9 ballistischen Rakete, umgangssprachlich AEON-Rakete genannt, ermöglicht.",
    "8F2967214915F8C861BA64A936304D0F": "Ein Fahrzeug der Bassett Motor Society, spezialisiert und entwickelt für die Konstruktion großer Strukturen.",
    "D92FBE734BC50E5AC519F486000C41E1": "Eine Standard-Montagestation für die Produktion von essenziell wichtigen Fahrzeugen und Ausrüstung. Die Montage wird einige Zeit in Anspruch nehmen und kann gestoppt werden, wenn Ressourcen erschöpft sind. Einige Projekte erfordern, dass ein Basisfahrzeug auf der Montagestation vorhanden ist, bevor die Produktion beginnen kann.",
    "01536C904F6D50E1B42797A2ECD5B7D4": "Die Standardausrüstung eines jeden Fußsoldaten. Basen müssen mit Soldatenausrüstung versorgt sein, damit Spielern ein neuer Wiedereinstieg ermöglicht werden kann.",
    "09A680CE484174FB7CE2DDBA5ED8E8DD": "Eine Standard-Rauchgranate, die entwickelt wurde, um alliierte Truppenbewegungen zu verbergen oder die Sicht des Feindes einzuschränken.",
    "C2DFA4FA46E8A09787B1659EA8E31291": "Ein stationärer Rohstoffsammler, der automatisch Kohle sammelt.",
    "D009E8D7439C6813523AF6AB85D0B356": "Ein stationärer Rohstoffsammler, der automatisch Komponenten sammelt.",
    "2AE345534F3FE5E044BA468C3161D541": "Ein stationärer Rohstoffsammler, der automatisch Schrott sammelt.",
    "2977A856416985D34C006287876745D2": "Ein stationärer Rohstoffsammler, der automatisch Schwefel sammelt.",
    "86B356284D94A0657FBF0FBCE81FDC6D": "Eine Anlage, die durch das Verbrennen von Dieselkraftstoff Strom erzeugt.",
    "211790B44F306BEEAB795C8AEB7DDB3E": "Ein robuster Stoffzylinder, der auf einem Dreibein-Stativ montiert ist und dazu dient die Geschwindigkeit und Richtung des Windes zu bestimmen.",
    "E816135B4A66E8C1220F92AAD576D712": "Ein robuster Stoffzylinder, der auf einem Dreibein-Stativ montiert ist und dazu dient die Geschwindigkeit und Richtung des Windes zu bestimmen.",
    "8C89D3EB468817667A734CA49548F3F6": "Ein robuster alter Bauernlaster, der für militärische Zwecke verstärkt wurde.",
    "FECDF12F4384E339D35524ACE682D1B6": "Eine temporäre vorgezogene Operationsbasis. Spieler können hier ihren Wiedereinstiegspunkt setzen und Gegenstände lagern.",
    "36651F93494A7EA89C15F888D9B041B3": "Ein temporärer Pier, der Warenverkehr und Truppenbewegungen auf große Marineschiffe von der Küste aus ermöglicht.",
    "335505CA4DD2B6823A4271A26234435C": "Eine temporäre Straße, die verwendet wird, um den Fahrzeugzugang zwischen Hauptstraßen und abgelegenen Stützpunkten zu ermöglichen.",
    "D581ABBD48D282A6772C6687B3F2E5A7": "Die Catara ist ein titanisches, leichtes Maschinengewehr, das Infanterielinien mühelos durchbrechen kann und eine moderne Waffe für den modernen Colonial darstellt.",
    "28E25751432CAFB28FB0F5AE61E7AB14": "Ein Werkzeug, um Schützengräben oder Bunkerstrukturen auszuheben.",
    "DED233DD427B065FCD3D17BD30D6F2E9": "Ein Werkzeug, das für den Bau von Anlagen oder zur Gewinnung von Rohstoffen geeignet ist.",
    "E74EC0C648B4F38DAD740FA18DA68158": "Ein Werkzeug um Komponenten aus den Überresten alter Fahrzeuge und Ausrüstung zu gewinnen.",
    "8C5D9CF3428C79BC7BAC86AA4F1AED0E": "Der \"Retiarius\", ein mit einem fortschrittlichen Raketenrampengestell ausgestatteter Lastwagen, überzieht den Himmel mit tödlichen, kreischenden Raketen, die mit hoher Abschussfrequenz über große Entfernungen hin gestartet werden. Hält sechzehn dieser Raketen.",
    "B30AA138497437782A4300886DD21F45": "Eine einzigartige Fabrik zum Schmieden spezieller Maschinenteile, die für den Bau von Fahrzeugen benötigt werden. Benötigt Koks oder Benzin.",
    "4D6A78FB4ABDE01432FC6DB3FD4A8A69": "Ein Fahrzeug, das einst von Offizieren verwendet wurde, um das Schlachtfeld zu überwachen, Befehle zu geben oder Notvorräte zu liefern.",
    "D644BDC44EBC4A4720D92596F71A1003": "Ein Fahrzeug, das hervorragend dazu geeignet ist, feindliche Befestigungen zu zerstören.",
    "4805B3D04DA9C8D7B0D77AB7CFE23D7D": "Ein Fahrzeug, das dazu verwendet wird große Strukturen zu bauen.",
    "2CBCB7104DE035A60695DAB71E567A5F": "Ein vielseitiger leichter Panzer, manövrierfähig auch in engsten Räumen. Wird mit 40mm Panzergranaten bestückt.",
    "F03BE70D45AE1B67DFC7A6B84E626420": "Diese Waffe wurde entworfen, um spezielle Granaten über weite Entfernungen abzufeuern. Diese moderne Kraunian Schusswaffe nutzt fortschrittliche Projektil-Treibladungen, um trotz des Gewichtes von Waffe und Projektil eine hohe Effizienz an den Tag zu legen. ",
    "1134F3234A5F463AE53A268D4DBF6B52": "Ein schwergängiges Ventil, das die Durchflussrate durch eine Rohrleitung steuert. Das Einstellen benötigt einen Schraubenschlüssel.",
    "959786D541061EB81BE0BAAA89BE5E9B": "Dieser gut verstärkte Unterstand ist mit einem Maschinengewehr ausgestattet. Einquartierte Infanterie wird in dem festgelegten Winkel mit schwerem Unterdrückungsfeuer gegen näherkommende Feinde wirken.",
    "110E6A2C4A6292DA195009B6B22305F9": "Ein Arbeitsplatz der verschiedenste Ansprüche erfüllt. Schreibe einen Brief an Geliebte. Katalogisiere die verbleibenden Rationen. Jeder kann einen stabilen Tisch gebrauchen.",
    "0977932E4101EB7BA35DE7B25A2EE0AE": "Ein verletzter Spieler{0}. Transportiere diesen Soldaten zu einer sicheren Position, um erste Hilfe zu leisten.",
    "05D8FCE14C1B2295EB11CE89E8C6DA24": "A0E-9 Rakete",
    "085BFDBE41391E9BA23112AB03491C2C": "A0E-9 Raketenkörper",
    "91105C03499C3F1BE6BE4DB856E5B0F8": "A0E-9 Raktenbooster",
    "3038291E4F4394EB893544B9BBDE8664": "A0E-9 Raketen Abschussrampe",
    "3A9D0CE146319179E0B675B8853E617F": "A0E-9 Raketenplattform & A0E-9 Rakete",
    "5AF494EB493CBF37E6E7B7B62DCA4D55": "A0E-9 Raketenplattform & A0E-9 Rakete",
    "8467BD9F497428290845D4B6490D2764": "A0E-9 Raketenplattform & A0E-9 Rakete",
    "0D4AD0F8419784E10400D89AFACEF068": "A0E-9 Raketensprengkopf",
    "D3FBCCB84F1965C600B7309A9D140B4F": "A3 Harpa Splittergranate",
    "80E2872049BF2FD7F3715D977773C189": "AC-b \"Trident\"",
    "646F134C496CB8DF04030CA679818E71": "AP/RPG Munition",
    "5CF6980649BE7DDCB1FB02B440A3C159": "ARC/RPG Munition",
    "C65EBD67408C6507E5F42C9384641ED2": "Bunker mit Panzerabwehrkanone (Stufe 1)",
    "DC94FD1A4F04C9345DCF44AC5D776051": "Bunker mit Panzerabwehrkanone (Stufe 2)",
    "452C02DC44682EA5ED964781258A5910": "Bunker mit Panzerabwehrkanone (Stufe 3)",
    "B17D8640441F07CF889D20B79C0FE262": "Aalto Sturmgewehr 24",
    "8D2244F645195B7E119FB798C7C9E2E7": "Verlassenes Arsenal",
    "F9BF31BF4559937622E6CBB5EEDB4A1D": "Verlassenes Arsenal",
    "1A5343D24EF1242FED4038B6AEE5B624": "Auf reserviertes Vorratslager zugreifen",
    "10FBAC1C42EA44693A3D079F99BB9049": "Link zu dem Discordserver des Regiments anzeigen",
    "13E260D342466EC4C7BA899ACA57FB6A": "Forschungsbaum anzeigen.",
    "299EE0114E937B661974C38629F1DB42": "Zusätzliche 100% Wahrscheinlichkeit gepanzerte Fahrzeuge zu durchschlagen.",
    "3748D06A4CF0E1CD9651E7BF1B716D7B": "Fügt eine Pumpe hinzu, um das Wasserrohr mehr unter Druck zu setzen. Fügt zudem einen Ausgabeport für eine Pipe hinzu.",
    "4CA02B2448DF735B8D722D8848020E1D": "Zur Position Vorrücken",
    "4F9290BD4F6302937D8F129F7752839D": "Fortschrittliche Bunker",
    "404395D5452B7AB804E20A8002ABE71F": "Weiterentwickelte Kohleverflüssigung",
    "00DC251C418EAE33D484529CE31D12B2": "Weiterentwickeltes Baufahrzeug",
    "1E0FBF114D54147462F29E80BEE129CC": "Erweitertes Training",
    "EBC7C18745F760E825037881F5F017B4": "Erweitertes Training",
    "421C15994938A964D86582AA9EA01082": "Fortgeschrittene Verarbeitungsbottiche, die große Mengen Kohle zu Schweröl raffinieren.",
    "F3C429E744EF3DCA6D577FAEE0AF046E": "Fortschrittliche Sortiermaschinen zum Sieben der Schrotthaufen nach nützlichen Materialien.",
    "2E0DB61849B0CB28D43254924C986178": "Die ganze Kraft einer stationären \"Storm Cannon\", aber ohne Aufwand über Eisenbahnschienen relokalisierbar. Diese verheerende Kanone ist in der Lage sehr weit entfernte feindliche Befestigungen dem Boden gleichzumachen.",
    "C1473BF745CF7EE5418F0CB724254A6E": "Alle Fahrzeuge werden von Spielern hergestellt. Zu Trainingszwecken haben wir im nahegelegenen Lagercontainer, Box bzw. Gefechtskiste alles bereitgestellt, was Sie zum Bau eines Transport-Lkws benötigen. \r\n\r\nDrücken Sie in der Fahrzeugfabrik \"{0}\", um das Produktionsmenü zu öffnen, und wählen Sie „Transport“. \r\n\r\nEine Blaupause wird angezeigt. \r\n\r\nWenn Sie die Grundmaterialien bzw. Basismaterial in Ihrem Inventar haben und Ihren Hammer ausgerüstet haben (drücken Sie \"{1}\"), gehen Sie zur Blaupause und drücken Sie \"{2}\". Dadurch wird ihr Material zum Bauprojekt beigetragen. Wiederholen Sie dies, bis Ihr Lkw gebaut ist.",
    "BCA32FE64613C72EAFE9ABBF703FDA5D": "Erlaubt es anderen Spieler, das reservierte Vorratslager zu begutachten und Vorräte hinzuzufügen.",
    "20ADE92945A533482C8C2DB147EE0579": "Erlaubt jedem Spieler dieses Fahrzeug zu sperren oder diese Struktur zu reservieren.",
    "0267C9334395904AE96613934D92044E": "Ermöglicht es grundlegende Unterstützungsbunker in diesem Bunkernetzwerk zu konstruieren.",
    "4B7A9A9944CC88C79313BEA8758EE3A6": "Ermöglicht es betonbefestigte Unterstützungsbunker in diesem Bunkernetzwerk zu konstruieren.",
    "3FE159FD4A1B21E847106BA1E627CB1F": "Ermöglicht einen einfachen Zugang zum Dach des Bunkers",
    "6E54502B466D07F2D90679BEFDC66ECA": "Ermöglicht den Bau von fortschrittlichen Fabrikanlagen.",
    "980899F241BB51BB958708973B66D0BA": "Ermöglicht den Bau von fortschrittlichen Fabrikanlagen.",
    "A13BE7FE468697F92836E58F1788F22C": "Ermöglicht den Bau von fortschrittlichen Fabrikanlagen.",
    "21EB240942BDDA7DD7796093DE1E3CA6": "Ermöglicht den Bau spezialisierter Anlagenstrukturen.",
    "2666CC914A81BA338AA9B1A0DB20A2CF": "Ermöglicht den Bau spezialisierter Fabrikanlagenstrukturen.",
    "4CB9CB2C42C092D9A66F438B181D4B0C": "Ermöglicht den Bau von fortschrittlichen Fabrikanlagen.",
    "7D6F6EB64F68531718A733A81EC1418C": "Erlaubt die Konstruktion der A0E-9 Raketenplattform und A0E-9 Rakete.",
    "9E4796A947D48A9E06F0B1A311B18FAF": "Erlaubt die Konstruktion der A0E-9 Raketenplattform und A0E-9 Rakete.",
    "AC67792C499B7966C2A74B9D86A2E5E1": "Erlaubt die Konstruktion der A0E-9 Raketenplattform und A0E-9 Rakete.",
    "538B62F341F334A5CA837BA831FA63C0": "Ermöglicht es, mit Infanteriewaffen im Schutze des Bunkers zu feuern.",
    "230F4A96430DC4B88DA4F8A3C9F13B21": "Erlaubt es Gruppenmitgliedern dieses Gebäude/Fahrzeug auf- und abzuschließen und ermöglicht ihnen dauerhaften Zugang.",
    "8BC98A3C4F41647812F1EFA0276BF98D": "Erlaubt es Gruppenmitgliedern dieses Gebäude/Fahrzeug auf- und abzuschließen und ermöglicht ihnen dauerhaften Zugang.",
    "397653894046CE62685644B9A017BEA5": "Ermöglicht es diesem Gebäude Aufklärungsberichte für die Karte zu sammeln.",
    "803F34C244FFCA727C342E982D37A100": "Ermöglicht es Fahrzeugen, diesen Schützengraben zu überqueren.",
    "1020D6A7418CD1D8CC71AF82029D5B90": "Erlaubt es dir die Startsequenz abzubrechen. Dies muss von mehreren Soldaten getan werden.",
    "24BB1904401D5F96B9FFE7B008C73C32": "Ermöglicht Ihnen die Verbindung mit einer anderen Wetterstation durch Übermittlung des Wetterstationscodes des Ziels.\r\n\r\n<RichText.Regular12.Orange>Muss inaktiv bzw. untätig sein.</>",
    "E0881685464D545BEB93A0B60BC2FFBE": "Ermöglicht die Eingabe eines 4-stelligen Abschusscodes um die Startsequenz der Langstreckenrakete einzuleiten. Dies muss von mehreren Soldaten durchgeführt werden.",
    "2E5ACDEA4438E2F950C1CDB635352352": "Aluminium",
    "25479D654A5B62650D03918F90C80C78": "Aluminiumlegierung",
    "7B423C2F4346D3306680DDBA6690A3D4": "Aluminiumlegierungen können genutzt werden, um Ausrüstungsprototypen im Ingenieur-Zentrum zu produzieren.",
    "4333024F454F5914F0C770BC54248A10": "Aluminium kann zu Aluminiumlegierungen veredelt werden, welche für Prototypen neuer Fahrzeuge und Gegentände verwendet werden können.",
    "9CB69A3C4427264B80F202A1C4E8EAE4": "Legt zuverlässig Panzerketten lahm",
    "1685A3AE449CD183D22747B8DD802943": "Hat immer eine Chance Bunker zu brechen",
    "52F50CC345C1F616061A009029D90815": "Hat immer eine Chance Bunker zu brechen",
    "F83A9FA94B18539000FF6082C32B2836": "Hat immer eine Chance Bunker zu brechen",
    "7A42C8054E3C9474D8C8F1903FEBB151": "Krankenwagen",
    "7C1727B141791F9A3774EB8176B883C3": "Krankenwagen",
    "969561C94645A423173ACDB0D8FEDA5D": "Munition",
    "B5A0F44D4F1548AD58DCBF9D9A2E6048": "Munition für die Willow’s Bane Model 845",
    "2B47BB6A40FB28BC50D80D874FA2C301": "Brennstoff für den “Molten Wind” v.II Flammenwerfer",
    "573A0901430DAC42F31B1DA2869B8D97": "Munition ist auf einzelne Magazine aufgeteilt. \r\n\\\r \nPass auf, dass du nicht zu viele mitnimmst, da es sonst schwer und (wenn du nicht aufpasst) schnell verschwenderisch werden kann. \r\n\r\nWenn du mit der \"{0}\"-Taste nachlädst, verlierst du das gesamte alte Magazin, also lade nur nach, wenn es absolut notwendig ist.",
    "6B3F590A435AB55946EC4291BD9DBB64": "Munitionsfabrikanlage",
    "287EACEA4FA5B040658F949D3114043E": "Ein Beobachtungsturm, der Informationen über verbündete und feindliche Streitkräfte in einem Gebiet liefert.",
    "BB9C41C34BE95CF524D9A68ADB7BD364": "Ein Ölfeld, das Öl zur weiteren Raffination oder zur Stromerzeugung produzieren kann.",
    "359C0BBD41434663D2210BAE34FE0A3B": "Ein verlassenes Gebäude, das befestigt und garnisoniert wurde.",
    "520E40A4465897CB6909AB982EF89947": "Ein verlassenes Gebäude, das befestigt und garnisoniert wurde.",
    "6925715A41430C49B7133BA0ED9E7CCC": "Ein verlassenes Gebäude, das befestigt und garnisoniert wurde.",
    "7287B08A4554E0A48253F18A141CCF13": "Ein verlassenes Gebäude, das befestigt und garnisoniert wurde.",
    "C403C1CE4EC2D6BC384A2598C81413F0": "Eine Haftgranate, die schwere Panzerungen durchschlagen kann. Die Sticky Bomb kann nur über kurze Distanzen geworfen werden und ist gegen Strukturen wirkungslos.",
    "E6753E7042D00FBC1FE9F18B965519E0": "Der BMS - Fabricator ist eine fortschrittliche Variante des Universal Assembly Rig (Baufahrzeugs) und mit einem einzigartigen Kit ausgestattet, das für fortgeschrittene oder spezialisierte Bau- und Aushubarbeiten entwickelt wurde.",
    "CF5CA88E4B25F8D5D333F8BD457CA68E": "Eine Hindernis für Panzer, das den Fahrzeugzugang zu einem Bereich verhindert. Ist resistent gegen die meisten Arten von Beschädigungen.",
    "BCB57CE24277EE614493D3870232C97D": "Eine Hindernis für Panzer, das den Fahrzeugzugang zu einem Bereich verhindert. Kann mit einem Schraubenschlüssel demontiert werden.",
    "3E767BF54AD3C8CD8C5794A295366BBC": "Ein Gebiet, das von einer Raketendetonation verwüstet wurde.",
    "4FF9AEB9471E5F32F05AD0978CD2E4D9": "Ein Bereich, in dem bestimmte Anlagen errichtet und für den Versand vorbereitet werden können.",
    "DAECD1FE49B2986E11E4C7A1F87F053C": "Ein gepanzertes Colonial Geländefahrzeug, das zur Unterstützung von Fußsoldaten während Angriffen dient.",
    "A8D45D054678B1E87811FD92753189FC": "Ein gepanzertes Warden Geländefahrzeug, das zur Unterstützung von Fußsoldaten während Angriffen dient.",
    "0C110267401A61E4812700A5D1D9DA5F": "Ein gepanzertes Colonial Amphibienfahrzeug, welches zum Truppentransport auf Land und See benutzt wird.",
    "3B508C464E0D71999AEA6C865D3FD3E3": "Ein gepanzertes Warden Amphibienfahrzeug, welches zum Truppentransport auf Land und See benutzt wird.",
    "38210D904CEC56EA82684A81ED481C39": "Ein panzerbrechendes Geschoss, das in indirekten Raketenwerfern Verwendung findet.",
    "6128D3124DA308F4F754EA9A04B8934C": "Ein panzerbrechendes Geschoss, das nur in speziellen Raketenwerfern Verwendung findet.",
    "D46DC87D4F9D8BD90738F395045E66A1": "Ein gepanzertes Landschiff, das mit einer Legierung verstärkt wurde deren Geheimnis im Laufe der Zeit verloren gegangen ist. Dieses nahezu unzerstörbare Biest befördert bis zu 8 Passagiere. Gerüchte über dessen Existenz gehen auf den ersten \"Durchbruch\" zurück.",
    "089A31E0489395AADF4E83B5605D23C8": "Ein gepanzerter Zugwaggon mit einer montierbaren Maschinengewehrposition zum sicheren Transport von Infanterie über lange Strecken.",
    "CAF0D5B94820FA9927F5CFA48CA6FC91": "Eine Montagehalle mit Spezialausrüstung zum schnellen Bauen und Verpacken von Materialien, die an vorderster Front benötigt werden.",
    "F98FB64E41B0B50D3D2C3596A50D8578": "Eine aufgerüstete Werkstatt zur Herstellung von Teilen für den Marineschiffbau an einem Trockendock.",
    "C2DBF65D49CC8B89D774859A5C7BC1D2": "Eine Montagestation zur Herstellung von Befestigungen, Waffenplattformen und Spezialpanzern.",
    "2F254DC44891E6535C6201B4724A13AA": "Eine Montagestation zur Herstellung von Feldwaffen und Nutzfahrzeugen wie z.B. Sammlern.",
    "88E1FE324B36D19DE98FB996E0ABC39B": "Eine Montagestation zur Herstellung von Halbkettenfahrzeugen und Raketenträgerfahrzeugen.",
    "20A1C3664007D85568E78E8244AFA21D": "Eine Montagestation zur Herstellung von Fahrzeugen der Schlachtpanzer Panzerklasse.",
    "DDED53D149082D9F5D73E1AE4022BB86": "Eine Montagestation zur Herstellung von leichten Logistikfahrzeugen wie z.B. Lastwagen.",
    "EAE40080413B1A736D3E658ADE6ED717": "Eine Montagestation zur Herstellung von Fahrzeugen der Panzerklasse.",
    "D1C3541147558B79B9EEA9B8BFF91822": "Eine Montagestation zur Herstellung von Eisenbahnwaggons.",
    "4A3D896B46DE138A5BBDB79697293EC7": "Ein Selbstladegewehr, das eine zentrale Rolle bei der Wahrung der Meseanischen Interessen auf dem Kontinent Katoman spielte. Obwohl es nicht ganz so schnell schießt wie seine Sturmgewehr-Brüder, wird das Catena von vielen Soldaten als robuste, leicht zu bedienende und zuverlässige Feuerwaffe gelobt. Es kann zwar in keinem bestimmten Bereich punkten, eignet sich aber hervorragend als Allzweckwaffe.",
    "0AB617BB416D7A8554D488972A67E6D9": "Ein automatisierter Bagger, der mit Schotter bzw. Kies betrieben werden kann, um Bauprojekte zu unterstützen.",
    "D8EDFE25412F16F3D52F71B321EB90C9": "Eine technische Anlage zur Stromversorgung des gesamten Bunkers.",
    "DF6685414ACEF01A0812CE95BB5B0BFD": "Eine technische Anlage zur Stromversorgung des gesamten Bunkers.",
    "2B39808F4BEEE3506D5FE88DCF8B6124": "Eine befestigte Panzerabwehrkanone, bemannt von stationären Truppen.",
    "30F9241E45E138237EF27388086D76A0": "Eine befestigte Panzerabwehrkanone, bemannt von stationären Truppen.",
    "8548255244214F885F3BC987D43CFF8B": "Eine befestigte Panzerabwehrkanone, bemannt von stationären Truppen.",
    "1EA65A55461E4B0A7920AFB286ED6FF8": "Eine befestigte Haubitze, bemannt von stationären Truppen.",
    "88D21E1046880ADCD0C1ECA1E33804F8": "Eine befestigte Haubitze, bemannt von stationären Truppen.",
    "FD4E7168454AA0355E56E0A2B0B5BE3A": "Eine befestigte Haubitze, bemannt von stationären Truppen.",
    "524FA7AF44764FE15E06C597B35BFA23": "Ein eingegrabener Bunker bemannt von stationären Truppen, bewaffnet mit Gewehren.",
    "D67BCCE842BCDAE460EF34AC5925EB38": "Ein eingegrabener Bunker bemannt von stationären Truppen, bewaffnet mit Gewehren.",
    "DD627D894CBEF4FA7B6F74AAC132C532": "Ein eingegrabener Bunker bemannt von stationären Truppen, bewaffnet mit Gewehren.",
    "2AEC4FD94C92D931CA73709E1A0E95FE": "Ein befestigtes Maschinengewehr, bemannt von stationären Truppen.",
    "5D4F55AB45C4585A9C3174B3FC6E4BFE": "Ein befestigtes Maschinengewehr, bemannt von stationären Truppen.",
    "83ADDE8E40F216F4941EA08A42058556": "Eine Abtragungsmaschine, die den Abbau von Kohle ermöglicht, selbst wenn ein Kohlefeld bereits erschöpft ist",
    "3FB2C8014B36DA15F18FDA8096AC97AA": "Eine Abtragungsmaschine, die den Abbau von beschädigten Komponenten ermöglicht, selbst wenn ein Komponentenfeld bereits erschöpft ist",
    "6EA293ED409CC43792912D9C09C71D3A": "Eine Abtragungsmaschine, die den Abbau von Schrott ermöglicht, selbst wenn ein Schrottfeld bereits erschöpft ist",
    "4FA0ECDD4F644E29713105B6429A047B": "Eine Abtragungsmaschine, die den Abbau von Schwefel und Spuren von Kohle ermöglicht, selbst wenn ein Schwefelfeld bereits erschöpft ist",
    "BEBB7F114EFF9D30C893DFA8A48D2F52": "Eine Abtragungsmaschine, die den Abbau von Schwefel ermöglicht, selbst wenn ein Schwefelfeld bereits erschöpft ist",
    "2C2D160A428EC77DFC0529BF2BF56353": "Eine erweiterte Werkstatt für die manuelle Bearbeitung empfindlicher Materialien.",
    "44636ACF41EB1B2E747168901D8D90B3": "Eine explosive Granate der Estrellas, die speziell für die Verwendung mit Handgranatwerfern entwickelt wurde. Diese moderne Granate verfügt über eine größere Nutzlast und ist tödlich für verweilende Infanterie und strukturelle Stützen.",
    "C2B0FD2F4A9ECDEB98F6F49A2C15ED2C": "Eine Sprengladung, die in einer bestimmten Zieltiefe detoniert. Diese Wasserbombe wird vom Deck eines Marineschiffs mit speziellen Abschussgeräten abgefeuert.",
    "1A4965A840057F1C18D592AEA3A3425E": "Ein explosiver Kolben, dessen Inhalt sich mit Leichtigkeit durch Panzerung brennt. Diese mit Bedacht entworfene \"Flüssigbombe\" explodiert beim Aufprall in einen spektakulären Feuerball aus geschmolzenen Trümmern.",
    "E3283173491194AADB200889AEC23823": "Eine explosive Ladung, die in Mörsern Verwendung findet.",
    "AA882514491A33224601429CA4D85AD6": "Eine Brandladung, die als Mörsergranate eingesetzt wird. Entzündet Objekte in der Nähe des Aufpralls.",
    "2FFC493745AD336FA09A7C918F944E58": "Ein industrielles Silo zur Lagerung verschiedener Kraftstoffarten.",
    "9412D2F44236A4C90F19698CC2B4C79F": "Ein industrieller Schmelzofen zum Einschmelzen von Schrott, um Verunreinigungen zu entfernen. Benötigt Koks.",
    "B7EA2E194514BD75337954991CF58FD2": "Ein alter Bergfried. Spieler können hier ins Spiel wiedereinsteigen und Gegenstände einlagern.",
    "7D6629B140F3E6A721CA529CD155C39B": "Ein altes Küstenverteidigungsgeschütz, das zur Verteidigung wichtiger Orte gegen Seebombardierungen wiederverwendet wurde.",
    "A505DB14475E021CA9ED6EB028A9F393": "Eine alte Festung. Spieler können hier ins Spiel wiedereinsteigen und Gegenstände einlagern.",
    "7D4855DD49E6C9200A910E8BBB8FE967": "Eine alte Mine, die automatisch Komponenten fördert, solange sie mit Treibstoff versorgt ist.",
    "2C5C40C644F89632A8A528B61C30E352": "Eine alte Mine, die automatisch Schrott fördert, solange sie mit Treibstoff versorgt ist.",
    "ADC9868E4290EDFEE4D2A99BCE350C68": "Eine alte Mine, die automatisch Schwefel fördert, solange sie mit Treibstoff versorgt ist.",
    "438238C8412EFBC68EFBC6ACB6E9269D": "Ein altes Mesean-Gewehr aus dem Krieg. Sie hat eine hohe Durchschlagskraft, ist aber nicht so präzise wie ihre moderne Version. Die Volta wurde von den Howling Lions bei ihrem Überfall auf die Strände von Fishermans`s Row benutzt und wurde so zu einer legendären Waffe.",
    "7EEE189E4C3E6C2D5DA07688D313B0C8": "Eine alte Kriegsartilleriegranate, die nicht detonierte. Gravierungen an der Seite weisen auf eine starke Ladung hin und sollte vorsichtig behandelt werden.",
    "3994813743F8239B38E1719DA4C69A36": "Als älteres, aber zuverlässiges Modell der Kraunian Langwaffengattungen ist die Omen eine stabile, unkomplizierte Waffe, die sich damit gut für den Schusswechsel über größere Entfernungen hinweg eignet.",
    "BA343B0D481CD54B81AEC9B1B7EB3C94": "Offene Metallcontainer, ein Umschlagplatz zur Lagerung verschiedener Rohstoffe, die in und aus Anlagen heraus transportiert werden können. Lagerbestände sind öffentlich.",
    "3061273B45958F0419EEBC903979244B": "Ein optisches Instrument, um weit entfernte Objekte zu begutachten.",
    "E0713BDF41E80039FBB40F860B7372AF": "Ein mit Schrapnellen gefülltes Geschoss, mit dem Mörser geladen werden. Effektiv gegen Fußsoldaten im direkten Umfeld.",
    "146E3BC4493F5187B80261B519E61AD8": "Ein unterirdischer Schutzraum, der als Fundament für dauerhafte Befestigungen dient. Verbindet sich mit anderen Bunkern und Schützengräben.",
    "1B8A795C4346BF4910F771A9CC959AE0": "Ein unterirdischer Schutzraum, der als Fundament für dauerhafte Befestigungen dient. Verbindet sich mit anderen Bunkern und Schützengräben.",
    "462C2AAC458B967E79A89CB1E96F900E": "Ein unterirdischer Schutzraum, der als Fundament für dauerhafte Befestigungen dient. Verbindet sich mit anderen Bunkern und Schützengräben.",
    "96AEF3EE49134BE9CA3562BFF39C8172": "Ein unterirdischer Schutzraum, der als Fundament für dauerhafte Befestigungen dient. Verbindet sich mit anderen Bunkern und Schützengräben.",
    "CBE454CA4DE3742BC66CDC902E39708C": "Ein unterirdischer Schutzraum, der als Fundament für dauerhafte Befestigungen dient. Verbindet sich mit anderen Bunkern und Schützengräben.",
    "D74CA7D0448C72B0FBAB39AA6E10FDB2": "Ein unterirdischer Schutzraum, der als Fundament für dauerhafte Befestigungen dient. Verbindet sich mit anderen Bunkern und Schützengräben.",
    "AA2D0B2444A7325577C78395E4C05967": "Ginge man nach modernen Maßstäben, dann ist diese Erstausführung des Colonial Sturmpanzers deutlich veraltet. Dennoch ist er mit einer soliden Panzerung und zwei seitlich montierten Geschützen ausgestattet.",
    "7B4B83764CF353FCF65B9D99FAAB15BF": "Panzerabwehr-Munition",
    "7D63A5EF4E99E0E2A4609396B116AD60": "Panzerabwehr-Sprengladung",
    "E34A663C4D6E568183406BB35FC6DC99": "Panzerabwehr-Sprengladung",
    "E8FA475F4322C2BCEFBFA3B564BD9ED5": "Panzerabwehr-Sprengladung",
    "7C8AE01C46A76B339ED3DF91D3C7F51B": "kinetischen Panzerabwehr",
    "E7733BFE47422A5611A7F1969000571C": "kinetischen Panzerabwehr",
    "6F622E7C4ECBCCFD937090A9D714B516": "Befestigter Panzerabwehrunterstand",
    "3E0D45274939B889EC317AAAD8705BB8": "Panzerbüchsen-Munition",
    "6A5752A9482F81ADD20B5D83F37BF45F": "Panzerabwehr-Haftgranate",
    "F34D3737475FA788605F419A2035CF54": "Anti-Infanterie-Mine, die ahnungslosen Soldaten eine tödliche Überraschung zufügt. ",
    "CA01ACE742EB60D6417E0092AE5711D1": "Anti-Infanterie-Minenfeld, das ahnungslosen Soldaten eine tödliche Überraschung zufügt. Nur sichtbar in unmittelbarer Nähe.",
    "676F5FEA4DC1E0D107AA419AFC87486D": "Panzerabwehr-Minenfeld mit schweren Sprengladungen zum Ausschalten feindlicher Fahrzeuge. Nur aus der Nähe sichtbar.",
    "E466A11F42816813A2355989C908791C": "Argenti r.II Gewehr",
    "3B4A004742F4396225D37A89EDA41387": "Bewaffnet mit einem Doppel-75mm Kanonenturm. Was dem \"Ares\" an Geschwindigkeit und Vielseitigkeit fehlt, macht er mit roher Zerstörungskraft mehr als wett. Die Entwicklung des \"Ares\" war voller Konflikte, und seine Geschichte ist mit einer Zeit verflochten, in der mehrere Unruhen auf den Straßen von Dimiourg ausbrachen. Rebellen beschlagnahmten den ersten \"Ares\"-Prototypen, die Version O-75a, und wendeten ihn in der Region gegen Colonial Streitkräfte, was schließlich zu seiner Vernichtung führte – allerdings unter quälend großen Aufwand. Dieses Ereignis verwob den großen Giganten in den Wandteppich der Colonial Legenden.",
    "09284D09449218360DF41C8EAE3F7314": "Bewaffnet mit einem ausgeklügeltem Gestell aus Bonesaw-Mörserwerfern. Der \"Thornfall\" ist darauf ausgelegt einen überfallartigen indirekten mechanisierten Angriff auf feindliche Panzerfahrzeuge zu starten.\nDieses einzigartige Fahrzeug unterstützt demnach einen alliierten Angriff, kann aber jeglicher PA-Gegenwehr nicht standhalten.",
    "4FE32C9E48BEBECA05618A818A15338B": "Die Smelter, nun bestückt mit hocheffizienten 40mm Explosivgeschossen, ist perfekt geeignet für die Bekämpfung von gepanzerten Einheiten. Der massive Frontalschutzschild sorgt für hinreichend Deckung in hitzigen Gefechten.",
    "B57E02DC42C110B1165928AC9F308126": "Panzerwagen",
    "16FE3B95486836B5A7DC768871429B86": "Panzerbrechend",
    "7BC3E3594AF707EE486D10A8B882D85A": "Panzerbrechend",
    "89E1D86C4E0DF0898E165DB38396C7AB": "Panzerbrechend",
    "1499A7DD45E0DC3A5C297B9525DE06AF": "Panzerwagen",
    "1906CDA343887D8C2561EBA7FDA6D151": "Panzerwagen",
    "1AD8DA2A4295C17CF19B62998F4D7FF0": "Panzerwagen",
    "5B382CCC4E70061B9FE1BE9A62C6EFB1": "Panzerwagen",
    "75C3D21B4CD91A107EB544B34B8AD4A8": "Panzerwagen",
    "7D2B50D64A9252C72E56A8897E440D3B": "Panzerwagen",
    "84459BF049B049D1A6CE95B5BB1D6465": "Panzerwagen",
    "ADF89343477EB10E23A2258BA9CCEA44": "Panzerwagen",
    "EDE3E0F345E08F07B7651CA9908F645B": "Panzerwagen",
    "9CC33CDA47786D2C118E63BF964B5B53": "Gepanzerter Kampftraktor",
    "E438AA3B446DB4CE68C5A08CB418A743": "Gepanzerte Raketenplattform",
    "D8C713AD495BBBD6D083FBB673EBE6B3": "Artilleriemunition",
    "032310524326921E393FEC9576A20049": "Artilleriemunition ist ein großes Objekt, das zu deiner Artillerie getragen werden muss, um nachzuladen.\r\n\r\nDrücke \"{0}\" um die Granate zu laden, wenn du neben deiner Artillerie stehst.\r\n\r\nWenn die Aufforderung unten links erscheint, bist du nahe genug.\r\n\r\nArtilleriegranaten werden dir in der nahegelegenen Kiste zur Verfügung gestellt.",
    "1D7D3FF9464EF8F4DBBB77BB5574E183": "Grundlagen zu Artillerie",
    "C71733F740481AADE9029A85262DC54E": "Bunker mit Artillerieabwehrkanone (Stufe 1)",
    "D09EBD9045ED1976D17EDB88A80D47D4": "Bunker mit Artillerieabwehrkanone (Stufe 2)",
    "7F3FB6F741260A09733E61A4B849B932": "Bunker mit Artillerieabwehrkanone (Stufe 3)",
    "E513F8D94DCFF5A1D572258D1216D2D5": "Bunker mit Artillerieabwehrkanone (Stufe 3)",
    "E04D38FD4B4F1EE489829484ED764CF9": "Artillerie Übungsgelände",
    "E7095F264A0F3999B5E535895E442F36": "Artillerie Übungsgelände",
    "BEF308A743681EB0357FAFA43962E180": "Artilleriebeständiger Unterschlupf",
    "1E1DE0FA4A6589CEE664FCB93FCAF22B": "Artillerieschutzraum (Stufe 1)",
    "4C1A6707497CAA6E9E3A00ACA1C82C05": "Artillerieschutzraum (Stufe 2)",
    "0A3E9A1E4A2A0F840AB52CB3298F0522": "Artillerieschutzraum (Stufe 3)",
    "306201AC44F6AA3A4EB10A892ED86CB7": "Artillerieausbildung",
    "768D1A844FAF003406F20DB9811742DD": "Artillerieausbildung",
    "80B30B2E4AD9708143AAF882A43E9A6D": "Artillerie Training",
    "D15DC121499F8111965E4F862889D146": "Artillerieausbildung",
    "4BECA10D446F2DBF7A4C318D0F1ED81A": "Artillerie und Wind",
    "684E41AA4722C781B8AB0D98F71A8F92": "Artillerie und alle Waffen mit indirektem Feuer werden vom Wind beeinflusst.\r\n\r\nDie Stärke und Richtung des Windes beeinflussen die Flugbahn und Streuung jedes Schusses.\r\n\r\nSie können die Windrichtung bestimmen, indem Sie sich die „Flaggen“ auf Strukturen anschauen, wie z. B. auf den nahegelegenen Funktürmen, oder dafür einen vom Spieler aufgestellten Windsack verwenden.\r\n\r\nDie Windgeschwindigkeit kann dadurch bestimmt werden, wie aggressiv die Flagge flattert, oder durch die Ausrichtungshöhe des Windsacks.\r\n\r\nTestschüsse können wichtig sein, um den aktuellen Einfluss des Windes auf Ihre Bombardierungen zu bestimmen.",
    "4C42D2B14B827D18517C9CB619528353": "Sturmgewehrmunition",
    "2D9D3D13424DC64673FD7898A2650118": "Sturmpanzer",
    "44D43340487F92751E665C999A14A61E": "Sturmpanzer",
    "647966CE498AE39FB76178B6BB05C490": "Sturmpanzer",
    "C01E254C43ECE1C45AC4F0B4BBB00D69": "Sturmpanzer",
    "C10C3B9149C8AE06FBC2E1A2D23F9706": "Sturmpanzer",
    "6D3EDC0F417FD13057728BAC27878F22": "Ausgewählte Auswahl zusammenstellen",
    "6D4C5E4843AF60B4F94113BEA220ED19": "Stelle die aktuell gewählte Auswahl zusammen.",
    "962993C94EEE298FB2DB74AA6ACCFAE7": "Werkstatt",
    "9F351F9844C8E89BC33C2682E291A71D": "Montagematerial I",
    "7FEADAB14DDDB46315E04FB48249A768": "Montagematerial II",
    "73092B1B41455FB70F8E3AA5225DEF3B": "Montagematerial III",
    "B8DA40AC47EEBC6838E97E82C92B738D": "Montagematerial IV",
    "4BF3ADB2426347104A372CB3ABD2ECDA": "Montagematerial V",
    "59AA1F294227A46FD442FEB0E31101CE": "Wiedereinstiegspunkt setzen",
    "DC4D892841B6D810A02AD1A140CDD38D": "An den Lauf eines Gewehres angebracht, kann diese kurze Klinge im Nahkampf Gegner aufspießen.",
    "E240EA5F4021348EB53395BDE9D1DC3D": "Zeichnet, wenn ausgerüstet, automatisch Karteninformationen auf.",
    "49AE335D4D6E6A2555F6A99FAB791AFC": "BMS - Klasse 2 Mobiler Auto-Kran",
    "0671D7C7434E205636B487A770356A25": "BMS - Packmule Schwerlasttransporter",
    "A6C68EC44575D472629393947913DE1B": "Verbände",
    "15EC16AC4525900296BA8F849C873642": "Stacheldraht",
    "40DCC52641A2BEA2C8781AA76FBECD01": "Stacheldraht",
    "9C8F3E3F49EED660C7DC1DB0EAB48C4B": "Stacheldraht",
    "AFE26FC442A8A44A6E07078C446F6052": "Stacheldraht",
    "DEFFEB1542F16098DE717CBBC9E0E224": "Stacheldrahtzaun",
    "85C257DD4DE800F5B4A03BB06195F8DC": "Stangen aus extrem seltenen Materialien, die in einigen der fortschrittlichsten und komplexesten Konstruktionen verwendet werden, z. B. in großen Marineschiffen und AEON-Raketen.",
    "5B8CE3C64337A2F9C985C5ADEF61535A": "Basis",
    "DEE926084933FAF21E74388FF496CB28": "Basis Schiff",
    "85FCF46649BD8A17654F6099EE1B3A62": "Grundlegende Steuerung",
    "56E9AB08437B2C3F07B9B6B9A4A97425": "Basis-Materialien",
    "4486854546BDD8408DB1399DF426B84B": "Grundlagen im Schrottsammeln",
    "14F93A8E4DA52E1721BB0AA5C8074B5F": "Grundausbildung",
    "426491D64B0EB5D503D2D7AAF74335CA": "Grundausbildung",
    "428D0601449BEADA5FD30E8732DF8104": "Grundausbildung",
    "48A20D94443D0403F04A3EB845A2E254": "Grundausbildung",
    "C551885241F0829D95C2F7B476F7E6A5": "Grundausbildung - drücke \"E\", um Schilder zu lesen",
    "A21D89EB4DB45C22C77CE8800B557A8C": "Grundausbildung - drücke \"E\", um Schilder zu lesen.",
    "2D728244461A766747E2B1AF999FFE26": "Grundausbildungskurs",
    "918C96D94CD5A98C33932CBEC80273F7": "Grundlegende Fahrzeugsteuerung",
    "8B342E6D4B748A0311B35BB746956FB7": "Grundlegende Steuerung von Wasserfahrzeugen",
    "CA569B7A4E573693319FA2877ABD5F24": "Batterie-Linie",
    "B1A4A34B4DABDBE0A1807FA3B600FA74": "Schlachtpanzer",
    "BADC9CAC45AA98419BBFECBC07730579": "Schlachtpanzer",
    "C9B6FAED4D6A9649507A529FCA2214AC": "Schlachtpanzer",
    "D0CFDF384D7C6540501C4E9D29B19C40": "Schlachtpanzer",
    "E2584992471875960E5AC9831A1C360D": "Schlachtpanzer",
    "EB73DAF04735416C9EDC1CA057B3BF59": "Schlachtpanzer",
    "27CD79F64AD124F90E5DA58C89D0D5BA": "Schlachtschiff",
    "FB6901DF4B521D17E3DB058C29943DD8": "Schlachtschiff",
    "2D231692474A10B835AD15987C4261A9": "Bajonett",
    "384007324813AFE2835C288261F1C85C": "Etagenbetten. Es mag zwar nicht so gemütlich aussehen, aber wenn es Zeit zum Schlafen ist, fühlt sich selbst eine eigene Koje wie ein Zuhause an.",
    "46FF81A846392084A21528B050609541": "Vor dem Fortsetzen des Trainings sollten Sie Ihren Wiedereinstiegspunkt bei der voraus gelegenen Operationsbasis setzen.\r\n\r\nDrücken Sie \"{0}\", um mit der Basis zu interagieren. Es öffnet sich das Gebäudeinventar und diverse Optionen zum Verwalten und Ausbauen der Basis werden sichtbar. Diese können vorerst ignoriert werden.\r\n\r\nKlicken Sie auf das Haus-Symbol mit der Beschriftung \"Wiedereinstiegspunkt setzen\".\r\n\r\nUm mehr zu erfahren bietet sich ein Klick auf das '?'-Symbol in der Ecke des Menüs an.",
    "13E8607E4B11E966FF383C866DBA439E": "Fahrrad",
    "3D0C540D469746133D2B58BDF7720455": "Fernglas",
    "2858687F4D89CC7A45C0969296E6B424": "Hochofen",
    "E52E575F4B007AA26F9B53B54681749C": "Blutplasma",
    "1553632448AAEF6CB6590F92A1807877": "Bomastone Granate",
    "8BB336F4459740A6ADA7B28B2D91748B": "Booker Sturmgewehr Modell 838",
    "3ACD511F4912CB4948C7A6A84A50D586": "Grenzbasis",
    "76C7D6004480F7DF9F16CA97A6AC343C": "Grenzbasis",
    "DAB76DD8460B940642C70183B489D8D3": "Grenzbasis",
    "9F0F65CD4302C4CE3921109029A92512": "Geboren und aufgewachsen in der Kälte des Nordens, schützt dieser schwere Parka die Warden-Infanterie vor jedem noch so schlimmen Schneesturm.",
    "EE33C96F43870BE6829717B79B9424E3": "Brücke",
    "F622BED543979E2D93843895A998A5FB": "Schrotmunition",
    "35255C004C2A84C0BEA2D0BA1076D91C": "Bauen",
    "B2F0A8094EEF74E899DDF0AECCFEC187": "Gebaut wie ein Sägeblatt, ist das Stellungsgeschütz DAE 1b-2 mit drei kaskadierenden Maschinengewehrtürmen ausgestattet. Was der \"Serra\" an Kraft fehlt, gleicht sie für eine Waffe ihrer Größe durch schier unschlagbare Schussrate aus.",
    "67E6082943E82F1416ED919ECF796D27": "Der auf einem umgedrehten Flood-Fahrgestell aufgebaute Mk. IX Stain ist eine voll ausgerüstete mobile Artillerieplattform. Im Einsatz ist der Stain in der Lage, eine 150 mm Granate über große Entfernungen zu verschießen, um feindliche Stellungen mit indirektem Feuer zu beschießen.",
    "060499444E1A1AC48E7009A0B0100C41": "Das „Lamentum“ mm.IV basiert auf den ersten automatischen Waffen der Legion und stellt auf dem Schlachtfeld nach wie vor eine furchteinflößende Kraft dar. Dank seines großen Magazins und seiner beeindruckenden Reichweite eignet sich dieses Maschinengewehr hervorragend für konstantes Sperrfeuer.",
    "129723254F4FA3055EC075AEF8F9EC9D": "Gebaut, um den Hügeln in den westlichen Provinzen der Alliant Union zu trotzen, ist der Taurine Rigger eine von dem Velianern modifizierte Variante, die darauf spezialisiert ist schweres Equipment über tückisches Gelände zu schleppen. Der A150 wird von der Colonial Legion seit drei Jahrhunderten eingesetzt und hat sich zu einem unverzichtbaren Werkzeug bei Operationen der Colonials. Es ist kein Wunder, dass er oft imitiert, aber nie repliziert wurde.",
    "E37CF3AA40FC2B92AE19B2BFFA3DCDAD": "Der stationierbare Huber Starbreaker wurde als Ergänzung zu anderen freistehenden Artilleriegeschützen gebaut und feuert 94,5mm Panzerabwehrgranaten auf relativ große Entfernung ab. Ein notwendiges Werkzeug für die Infanterie, um gepanzerte Colonial Vorstöße zurückzuschlagen.",
    "147F28764AB4F8635892B8B2B7EFE03A": "Bunker (Stufe 1)",
    "3B20BE7C4DDCCFAD455D0BBA60229C46": "Bunker (Stufe 1)",
    "484B31D44BF6AC36F3681B9D05164FBA": "Bunker (Stufe 1)",
    "4D425013497B9B5EE061989B8508767E": "Bunker (Stufe 1)",
    "51F593C0491E0F46E781828704750FE8": "Bunker (Stufe 1)",
    "579E057C497705E274B70E81F4D6EBE2": "Bunker (Stufe 1)",
    "6A00552B43BD6DBAADBA67B3E482B787": "Bunker (Stufe 1)",
    "715409C2407F4D5F0B9D8AB156FECAFE": "Bunker (Stufe 1)",
    "72334DCF44B98E54F677FE912CA3CC0B": "Bunker (Stufe 1)",
    "7A8269F54181E2286A0246B57D0DB0C4": "Bunker (Stufe 1)",
    "7FD22BA74AFB35B58402159E4950E71C": "Bunker (Stufe 1)",
    "A716D3E448E27E14FF848D8BA328B8E2": "Bunker (Stufe 1)",
    "C95659B948066EEE5E9651A374C6342D": "Bunker (Stufe 1)",
    "D408FD2A43D40667A3069D87DB7CB047": "Bunker (Stufe 1)",
    "D85D47F94DB1D5199C477EA8B3B0A960": "Bunker (Stufe 1)",
    "E01F7BC046C550A2B2581584EA0B09D7": "Bunker (Stufe 1)",
    "06CCB64C46D6642AE1C0E5B14617271D": "Bunker (Stufe 2)",
    "1BEA356940B6775D1731C993389ED3C7": "Bunker (Stufe 2)",
    "3C75FB8E4DA1AA89618AABB37738C340": "Bunker (Stufe 2)",
    "5B6887F54694B78C30AD89B1BEDCE865": "Bunker (Stufe 2)",
    "B3300E8C443856E48FD497AA1B34692C": "Bunker (Stufe 2)",
    "CD7E6AEE4109788F963DBCA9042D8073": "Bunker (Stufe 2)",
    "D247709C4335A588B1CED29EB1A74C2D": "Bunker (Stufe 2)",
    "FA07549D4EB90BE75D451BACE7D57213": "Bunker (Stufe 2)",
    "314EDBB04D51BEF8D83A83A75311C7B8": "Bunker (Stufe 3)",
    "316EAAA94E1075F7A84CB59242477740": "Bunker (Stufe 3)",
    "499CBB884BDAA4EAFFB78EB00FB1C160": "Bunker (Stufe 3)",
    "4F52FC234B48AF7C774915B8728E72B9": "Bunker (Stufe 3)",
    "614680D946C3DF5953C2F5B27950E7D6": "Bunker (Stufe 3)",
    "6D2CB739458102DEEA12E3AD09693512": "Bunker (Stufe 3)",
    "7F3ECA5F4B0DE179EB2626A318A06913": "Bunker (Stufe 3)",
    "86D11C314A5F811908C50896374DBDD2": "Bunker (Stufe 3)",
    "91961E2944C28D8AC5A80CA77AC21E88": "Bunker (Stufe 3)",
    "B0AB88974820ED53D2F323BC11B8F8D8": "Bunker (Stufe 3)",
    "B69B10EB41281C5668D64B99B1ADB4AF": "Bunker (Stufe 3)",
    "C5144CC7496D4CC3738BDD9AAE0E26BB": "Bunker (Stufe 3)",
    "FF8B2F7A40650B69D9768FA81E48E725": "Bunker (Stufe 3)",
    "0BE2018C4E7600273BBFB0926A3368F1": "Bunkerbasis",
    "2C90B2094C515F967A530F9FF3B5FD04": "Bunkerbasis",
    "58359C304D7483C5FE2CABB93B9C5565": "Bunkerbasis",
    "89EFC7894E13A4336D3FBBAF5EFF7081": "Bunkerbasis",
    "95E04A1F4A578E6639A4F9A7893B5230": "Bunkerbasis",
    "DE8F6CF34B47D27A97D26498470A0E83": "Bunkerbasis",
    "B79388114A649658BD9B7392F34E3002": "Eckbunker (Stufe 1)",
    "E06894BE4FC768070961C6BA1A7C05F1": "Eckbunker (Stufe 1)",
    "6C5CD6914591DE85BFE23B9B2FF95899": "Eckbunker (Stufe 2)",
    "6D6C0D57456CD5906C50B0BF7C0E6EBC": "Eckbunker (Stufe 2)",
    "2CE3A9FD4C0F548DFC0FA9AA6B4F4A58": "Eckbunker (Stufe 3)",
    "E67FD81A4959011199394B8BFEA05035": "Eckbunker (Stufe 3)",
    "EB8DAEE74DCD07A4DCD890893212EE02": "Eckbunker (Stufe 3)",
    "F1141BC044BBDD2ACFC965938DE0E90C": "Bunkerecken-Baustelle",
    "16E6D2D14DDB9FE61DC987A33B3C2F02": "Bunker-Baustelle",
    "774B74BC480322205AF8DF942CF274AA": "Bunker-Baustelle",
    "9D7C4C6C49C6FE229B83C28E0019262D": "Bunkerherd (Stufe 1)",
    "E32D1103404DCC185BA296A48AA5CA61": "Bunkerherd (Stufe 2)",
    "3CE9D0C346D032C3B85F41BBD98CBC67": "Bunkerherd (Stufe 3)",
    "58C77B2041868E44E07CB7BF59DED5C6": "Bunkerrampe (Stufe 1)",
    "AB0323BD4B2E183A2A6BE18947017318": "Bunkerrampe (Stufe 2)",
    "3527915849504828A54D32B292A55897": "Bunkerrampe (Stufe 3)",
    "6069A42B46A68A3CF4911BB9A0524B6F": "Etagenbetten",
    "8D0564AE4A7D162B63E36CAF21525D17": "Dienstwagen",
    "1E76100A4B41EAD50B1903917C499955": "Schlachtschiffe der Callahan-Klasse sind kolossale, voll ausgerüstete mobile Basen. Sie besitzen genügend Feuerkraft um feindliche Schiffe und deren Besatzung völlig zu vernichten, oder Tod auf nahe Küstenlinien niederregnen zu lassen, während der gepanzerte Rumpf Beschuss überdauert. Benannt nach Caoiva's Gründer und ersten Archon, der im Konflikt mit rivalisierenden Clans, welche nach seinen Kopf trachteten, standhaft blieb. Mehrere Callahans liegen im Hafen von Whedon’s Row vor Anker.",
    "47AE8B944AE9D9ACA5401BA9F2C4B00A": "Kamera",
    "BF6D42B547FDE7EE6A4D469D64FEB21F": "Start abbrechen",
    "773539C34D3E0E6009BBC5BBE7B1FFA3": "Auftanken abbrechen",
    "29A6FC6346783BE4E720D7B5B355FAAF": "Reparaturvorgang abbrechen",
    "679CF0D844CDEE683D4E9AB86C32DBF8": "Geschützmunition",
    "0E6FD8764B655005ECD2B5B4A82764AC": "Kanonier",
    "24EE8195436BD089F03575A0D0E0B84E": "Kanonier",
    "2861CB11481E565228DFC7A6993E92E4": "Kanonier",
    "2930421D47EC21B3C966CC92655D8C70": "Kanonier",
    "2B1C7FD440AB516560C5BB9332E2E878": "Kanonier",
    "4890FFF94F782254756387816D6C0B41": "Kanonier",
    "48BE62C24A52FC1F686B1BA1FD330D14": "Kanonier",
    "4B9EF3A5491D8379E3032B9994F297DB": "Kanonier",
    "51ECB3244FDFF6B8431B9A87093FD7AC": "Kanonier",
    "5C12DF1D4EC4105A66013791A1AF6965": "Kanonier",
    "5CD267614E1A95C8E1C127B005B056B5": "Kanonier",
    "640A9E654294E08A39785C9DE9CC1CAD": "Kanonier",
    "640BE1EE4F6FB1DFDE25238D0A58AB96": "Kanonier",
    "7079246F46B9D85C365C7B916684743A": "Kanonier",
    "756DDD5043ED88F6751E309A05CAB156": "Kanonier",
    "81398FE44552F779D3E7F1B03557195E": "Kanonier",
    "8315C78749C81A289F7AA0AF8EFEC7A6": "Kanonier",
    "8DE3C12B44176B3B9975789CC2F52953": "Kanonier",
    "94BE70E9424A233044C1C2AD1D90A283": "Kanonier",
    "9C87895D4E4F3558EC8AAF8BE01EB827": "Kanonier",
    "9E7AF3424BCB2AF117A041B821666EF6": "Kanonier",
    "A50FD36443E4E23540742B94117A935C": "Kanonier",
    "ADBEAD9F4915E80CBADEAB8546C3460D": "Kanonier",
    "AE91F5844E90DD848834E990B00F96DB": "Kanonier",
    "B2344A2A451F110AC694C2969B536FB3": "Kanonier",
    "B5AEC7DF4951DEFC301CC8AD9B6D791D": "Kanonier",
    "B62DE30642D7AA30A9E817AA5F8B5ADF": "Kanonier",
    "C1C6E730449313C219642FBF75D977C0": "Kanonier",
    "C1EEF8D34895CAC21D787789FD5E92AC": "Kanonier",
    "C2329B84497869D276459891BC0071A4": "Kanonier",
    "C2C799C441879E3849B3D6A00F47F4E6": "Kanonier",
    "C731333E4348DD99535FBC8F99BEAF98": "Kanonier",
    "C79801EE4B6B5C469E9E26A7645D11DC": "Kanonier",
    "D536BC564C4C527E040FAF9C839B0840": "Kanonier",
    "D6A9E89D444DA7F5A8465D850B119AD5": "Kanonier",
    "F84F78494A08049A8BFC2691C9B914F3": "Kanonier",
    "FE33F17647EC0E8F67C91F8089A9D034": "Kanonier",
    "9826FEAA4ADCCBC769AD49B5DB1E3832": "Caoivischer Parka",
    "8B21386A469DEF1ED9EB18ABCCEB5485": "Die Caovishen Panzer sind unübertroffen in ihrer Konstruktion und Robustheit. Alle Besatzungsmitglieder sind mit robusten Maschinenraumanzügen und Taschengürteln ausgestattet, die den Zugriff auf wichtige Werkzeuge für die Wartung und den Betrieb des Panzers ermöglichen.",
    "53DBD4A2463DC1D888364B8F47E1D32C": "Die Caoivish-Ingenieure sind legendär für ihren Gesang und ihre Statur. Sie tragen spezielle Uniformen, die mit Gürteln und Taschen ausgestattet sind, um den Zugriff auf Werkzeuge und Materialien zu erleichtern.",
    "95AA7C9F4FE4BDCF0FDCCB9469598AB2": "Der Fissura gd.I kann verschiedene Granaten schnell und auf große Entfernung abfeuern, ist mobil genug für den einfachen Transport und erhöht gleichzeitig die Effektivität der Infanterie Artillerie. ",
    "F87E18FD4755B4CB776A3EB320EE4892": "Der Fissura gd.I kann verschiedene Granaten schnell und auf große Entfernung abfeuern, ist mobil genug für einen einfachen Transport und erhöht gleichzeitig die Effektivität der Infanterie Artillerie. ",
    "46A596664BD5CA804F24A18218C8B6D0": "Carnyx Panzerabwehrraketenwerfer",
    "038C70F64E276B0BC5124CA96B12234B": "Catena rt.IV Automatikgewehr",
    "A0304AB148E77AF71F6BB183D703BBF4": "Catwalk Brücke",
    "D85BBEEB45FD4DAEC608A489B4EC006B": "Catwalk Plattform",
    "E27BBDD245BCB9327A6B968A5B6C416A": "Catwalk Treppe",
    "3BCDC19C4B2328A73D66208E3873F35A": "Verursacht ein großes Leck auf großen Schiffen",
    "B4F14CE84B8BECD58981A58064C4FAC7": "Fügt, über einen gewissen Zeitraum, Schaden zu",
    "17227DAE4C39D298FD77349E325BF4F2": "Kreidetafel",
    "5DA7887C4258C3E2CB39189DCBFC40BA": "Treibstoff wechseln",
    "011CA5F541D075F50B492CABA5EBFEDD": "Ändere deine Körperhaltung zu Kriechen \"{0}\" oder Liegen \"{1}\" um deine Sichtbarkeit zu verringern und zudem deine Waffen-Stabilität zu erhöhen.\r\n\r\nÜbe das Bewegen in kriechender oder liegender Stellung im vorausliegenden Hinderniskurs.",
    "CA95D7E34CCB1C1AAB7B16AE8F5BE756": "Wechselt den Treibstoffverbrauch dieses Fahrzeuges zwischen Diesel und Benzin. Fahrzeuge, die Benzin nutzen, haben eine erhöhte Motorleistung.",
    "B3DE06B64E0BA3E8F1F93DB181593D80": "Rohkohlebrocken, die zu Materialien veredelt werden können, die für die Produktion und Stromerzeugung in Fabrikanlagen benötigt werden.",
    "C1E6A0284B37E5E5B582D8BD3DED6AEF": "Erobere 1 Logistik-Stadt in einem feindlichen Startgebiet, während deine Fraktion weniger als 35% aller Städte hält",
    "D5ABF0594143D621FFB66B9FA5C0F068": "Eingehende Verbindung kappen",
    "3D8441594CCA8971F9EBA6A5B5831BF7": "Ausgehende Verbindung kappen",
    "F560374A4D6E1F382A29348CA4D28987": "Trennen bzw. kappen Sie die eingehende Verbindung von einer anderen Wetterstation.\r\n\r\n<RichText.Regular12.Orange>Muss inaktiv bzw. untätig sein.</>",
    "486231D94731D5A1C73C108F85618CE4": "Trennen bzw. kappen Sie die ausgehende Verbindung zu einer anderen Wetterstation.\r\n\r\n<RichText.Regular12.Orange>Muss inaktiv bzw. untätig sein.</>",
    "C47DCC72479A6F1DD6307B919D1F32A7": "Klettern",
    "5BA2187146CEB825CB4228AA35F47B70": "Schließe den Dockbereich",
    "E45EDB8F4F9D682155319D8CEF73C968": "Schließt den Dockbereich, was den Bau oder die Reparatur von Schiffen ermöglicht.",
    "D9546E22416383B1AABF059FC045B64E": "Kohle",
    "08AA3BCC4623C87DB4E661A4F8A676CD": "Kohlefeld",
    "7FAF2CEE488B1E9D22282F9DD0A4D416": "Kohleverflüssigung",
    "D79F7FC64BBDB3720DE384B1A449391D": "Kohlekraftwerk",
    "C82D1D704AFAF5F82D9090A61417B3E3": "Kohleraffinerie",
    "05FB560543B6B5D7FB760A932DDF2596": "Küsten-Abwehrgeschütz",
    "B88C47D34201E6ECE458878942B7BC8D": "Küsten-Abwehrgeschütz",
    "1B679B5D4836AC9171AEBABE59DE5239": "Koks",
    "D18901BE48F54CD90D61ABB39940BE7E": "Koks Ofen",
    "B80277BE489804CA7459B39FBB06B7FE": "Collins Geschütz 68mm",
    "335CC5A441994402460A2DA1C6B02C77": "Colm Gallagher’s Ingenieure haben eine Variation des Outlaw entworfen, die sich auszeichnet durch ein unabhängig rotierbares MG-Geschütz, welches auf der aus zwei Panzerabwehrkanonen bestehenden Hauptbewaffnung montiert ist. Seinen Mangel an Feuerkraft relativ zu seinem älteren Schwestermodell gleicht der Highwayman mit seiner vielseitigen Einsetzbarkeit aus.",
    "94F1CEFF4227509BE33B1989F55C6DAE": "Colonial Splitterschutzweste",
    "CE22DA364D75F47BFC847E811CB9DDC2": "Panzerwagen der Colonials, sind schnelle vielseitige Fahrzeuge, die für den Orts- und Häuserkampf geeignet sind. Diese Anti-Infanterie Fahrzeuge sind mit doppelläufigen Sturmgewehren ausgestattet.",
    "06209EF04AC1AF6314401B9F8225E5A8": "Colonial Pionieruniform",
    "CB181E6349AB3EF12388D088EE90B285": "Colonial Grenadieruniform",
    "B4E25007455E19F7C46FA1B02479FFC8": "Colonial Heimatregion",
    "CB7C260743140BD84D36BF86EDE1C785": "Colonial Sanitäteruniform",
    "02C253B140092725D7778DAB1779003B": "Colonial Uniform der Marine",
    "970015384E151C88F0FD219FB6D53F4C": "Colonial Offizieruniform",
    "33C6E9B1418286BEB4216094FB644868": "Colonial Regenschutzuniform",
    "D8DB9DFC4336C5ED55C9A990F246E78C": "Colonial Späheruniform",
    "29AC5303429354A56648F583E51FF6A4": "Colonial Schneeuniform",
    "12DB89BF4E72823287073CA4DF328868": "Colonial Soldatenuniform",
    "3531DF4F4548B0DA79CC23A10FAA95A6": "Colonial Wiedereinstiegspunkt",
    "DC42649544472E4A5C5CA7A9D1F4C78D": "Colonial Panzeruniform",
    "17E625BF4F67CA1B168D2E90D6F48427": "Panzer Waggon",
    "901E2C834747895953A856A5DC67E063": "Panzer Waggon",
    "21E762044E8DE112BAE0F9B2643DDF11": "Kommando",
    "A6C9A53541B0C0D17A1767BC6731ADF4": "Der gewöhnliche Treibstoff, der meist zum Antrieb aller Fahrzeuge und Ressourcenminen verwendet wird.",
    "CFAB025E43945DD5A675929EA1B8735B": "Komponentenfeld",
    "B6CE90A5448C96D16CD38A8E7B2BA03A": "Komponenten-Mine",
    "3C4F4A45409283D939A56AB732B3108C": "Komponenten",
    "7385160042574D376AF15594840C9138": "Aus Komponenten kann man in einer Raffinerie verdedelte Materialien gewinnen",
    "8267F866424460C045FF40A62D7EA10D": "Rechenmaschinen Modul",
    "3F51D1E242EE95695571389D924BB51B": "Befestigte betonierte Artilleriebunker, bemannt von stationären bzw. stationierten Truppen.",
    "92D1428F428EE050351557832DB379BC": "Betonbrücke",
    "2E1BAFC24875F569598C04B027102999": "Betonfundament (1x1)",
    "AC7C340A401CF179EBF08A8F2EA37431": "Betonfundament (1x2)",
    "AE8BCA6D423E26FD2BB2A788298B8526": "Betonfundament (2x2)",
    "62BAABFB4D334D702542EB91C34E9FEB": "Beton-Eckfundament (1x1)",
    "BBA3E405402547B83D4C3FA9A95AD67C": "Beton-Material",
    "D5B404CF40D1E05BD342BEA46DF35623": "Betonmischer",
    "CAF19C714CA9B02DA6B44DB5394C60A6": "Leitet Strom zwischen einem Strommast und einer anderen Struktur.",
    "20368F12419871887C0B36B5F1888802": "Baumaschine",
    "1ACF7DFF490EA4BF1F420C9FF3860726": "Konstruktionsmaterial",
    "71E5E0B04BA4ED56E068DD8D12D97ABE": "Konstruktions-Teilstücke",
    "36C1BF36454836BB112D9480C2E468A2": "Baufahrzeug",
    "5A65DC4C49309C1A165304877B648BBE": "Baufahrzeug",
    "6B24FD3749D698B926AB4EB742380547": "Baufahrzeug",
    "12C895724DA8D5DA673FBCAE80A77FA3": "Bauhof",
    "4CC605274C43052D3B206AB2A4E0DCE8": "Bauhof",
    "054DE0FF4483D71499703B9B68B5D811": "Kohletender",
    "C24ADE5B4EB8622FFA2D779767B962D1": "Wandelt einen genesenen Patienten in Soldatenvorräte um. Dadurch wird der genesene Patient verbraucht, wodurch die Anzahl der verfügbaren medizinischen Wiedereinstiege an diesem Wiedereinstiegspunkt reduziert wird.",
    "C5029282468709AF7937B7BBF877B266": "Kupfer",
    "EAB24E7045D7FBD285D8B59E05492E76": "Kupferlegierung",
    "C6E827854959790FFB6DB8A3EA6480F9": "Kupferlegierungen werden verwendet, um Fahrzeugprototypen am Ingenieur-Zentrum herzustellen.",
    "9867C9B54B91DB2156CF34B791B1B1D1": "Kupfer kann zu Kupferlegierungen veredelt werden, welche für Prototypen neuer Fahrzeuge verwendet werden können.",
    "38273AFC4AACFA88F89A3C9A2D3B2679": "Passwort kopieren",
    "9480EECC44D191EB108306ACBFCEF534": "Gib Mir Feuerschutz",
    "DA7A88824AE3F151D0B26ABF1745EE60": "Deckung und Unterdrückungsfeuer",
    "0F3ADBAF4570F287492A76B98060113F": "Cracking-Einheit",
    "534B3C724A31FF575ABE89A5B9CCC37D": "Kran",
    "60D70F564358A0AA1EB9379D93A0FE66": "Kran",
    "63CC9B4A469EEC8F696C6EA020432AED": "Kran",
    "35503F8748DDFD0502021BBFC576911F": "Gleis für Schwerlast-Kran",
    "8B875CD6417482DAFF18E2AE309567B0": "Kiste",
    "0D5C342746C609324E58D0839D6376A5": "Kistentransferstation",
    "1D9661814728CC3654250D99AABD5C71": "Krater",
    "770167924C272500D86179992E951FC9": "Krater",
    "F15745E8462830CC9AB858ADC6A24C9E": "Reserviertes Vorratslager erstellen",
    "DA61CC4345AE336D97C22BA9FE2E2062": "Richte ein Vorratslager ein, um für eine begrenzte Zeit einen sicheren Lagerplatz für Ausrüstung zu haben. Reservierte Vorratslager sind dazu gedacht, vorübergehend Ausrüstung zur Vorbereitung zu lagern und dienen nicht zum privaten Horten. Der Zugriff kann mithilfe eines Passwortes an andere Spieler weitergegeben werden.",
    "DF9D586046D58FFD050037A54776F41D": "Cremari Mörser",
    "DD97C63C4237E34D2D418785502C209C": "Kritisch verwundeter Soldat",
    "54AE183A45F910F51E5E65956A2D7AA9": "Crow’s Foot Minenfeld",
    "44CDCA2942B6EAB83A8B009F07B96CF7": "Kreuzerpanzer",
    "C083888748E3BEB666C25E961177F552": "Kreuzerpanzer",
    "CF181019476265E687412D8E123DECEF": "Kreuzerpanzer",
    "DC44C1C144DFB2BA01D9BFB0DE19E7AF": "Kreuzerpanzer",
    "901AE71547491F493E627791F4BD21D3": "Flüssigkeitsfilterwechsel",
    "CDDDC92F42A69E0F488D088F3B490226": "Stellen Sie den Flüssigkeitsfilter so ein, dass diese Struktur nur eine bestimmte Flüssigkeit akzeptieren wird.\r\n\r\n<RichText.Regular12.Orange>Muss leer sein.</>",
    "A2923020423029BE99C15C933B982858": "Beschädigte Komponenten",
    "3AB241504786F95F4CCA999EB9244219": "Beschädigte Komponenten, die in Komponenten umgewandelt werden können.",
    "8BA2A8B243CD4CD2EA33C78734DECDC7": "Verursacht Hochexplosivschaden bei Einschlag",
    "1F1D93CF4F203BAE653799BDE8840A44": "Fügt der Fahrzeugpanzerung Schaden zu",
    "F657ED234C95FFA2AC930EA57251B6B8": "Fügt der Fahrzeugpanzerung Schaden zu",
    "A759CE2B4F59026953934D86CB982420": "Manchmal benötigt man mehr als nur Willenskraft, um verschlüsselte Nachrichten zu entziffern. Diese hochmodernen Rechenmaschinen greifen dabei unter die Arme. ",
    "5D21D00045492674DCF49CBEFAB1D4C5": "Verteidigungsgarnison (Stufe 1)",
    "87BCFBA74D68323232ADF4B7558FB7B0": "Verteidigungsgarnison (Stufe 2)",
    "23CAEAAB46DFDA95CB31F3A9D32D6017": "Verteidigungsgarnison (Stufe 3)",
    "3BFCADD34481D0AE0CDC31A58F2EB09B": "Lösche Auswahl",
    "595BD3A94E07DAECB8ACFBADBE370727": "Lösche eine gespeicherte Auswahl.",
    "33F864FA494AC77C7470509A269616B8": "Abreißen",
    "F7F2EAA84112598BD8BB21838CE54349": "Wird dieses Fahrzeug zerstören und von der Welt komplett entfernen.",
    "0E47402D497FB3B729F523B31EA42356": "Demolierung",
    "57C86858450AC994809351BDC08E6142": "Demolierung bzw. \"Abriss\"-Schaden",
    "658602564B92D6B3F6F28EB71D1F113D": "Demolierung bzw. \"Abriss\"-Schaden",
    "3D783BCB4F9168F145609AB5CCCB68E1": "Ausrücken",
    "4C7EC533469CB299847A67A869AA0AD1": "Ausrücken",
    "4D0D72D0452D2DB7E4B2DBA743A63E0B": "Einsatz",
    "5A25BD694237EBA2AFAEBC965B2386BC": "Einsatz",
    "5EC6C3764E3A9055DF183EA607BB7670": "Einsatz",
    "D292E9D04BCF39FE9F157699A38220E7": "Ausrücken",
    "E1C74DB944F2AC7206FBC999F49ACA70": "Stationierte Panzerbüchse",
    "4E4DB2B344BB158A9C0B56829C85122D": "vorbereitete \"Havoc\" Ladung",
    "B65ECBC1481C3213858453A08B6FB4DE": "Eingesetztes Infanterie-Unterstützungsgeschütz",
    "B6F3A3A745AEB338C211239D034879B4": "Stationiertes Maschinengewehr",
    "C90EB41E442883C0502BCD86C596E9DA": "Stationiertes Maschinengewehr",
    "0EDCD2F044E7D1BABCF65F87D05D2AEB": "Stationierte RPG",
    "B584DAC0494452860D7C50B075DD1BF3": "Stationierte RPG",
    "DA7DF8C74D9859AE0E5BE08B5C2AFD1A": "Stationiertes Dreibein",
    "F36D2ACC43944973C83DBAB1FFCE6CB0": "Gefechtskarte",
    "0264CF904E70D8C4F8186E8195DA4F16": "Einsatzpunkt",
    "383B402E474BADFE7252DC83B28F1773": "Wasserbombe",
    "3F86B586405A3BE3C77456B0F2ADF819": "Wasserbombe",
    "908BF3B743992D354B6F789E3E8F1634": "Wasserbombe",
    "9BAF48A647EBE059B00714BC83AF8500": "Das Halbkettenfahrzeug der HH-a-Klasse ist ein gepanzertes, vielseitiges und geländetaugliches Fahrzeug, das für Eskortmissionen und Infanterieunterstützung entworfen wurde. Es kann mit einer Vielzahl an Waffen bestückt werden.",
    "498585524403BA7F3832B5A1EC4824BD": "Bei dem motorisierten Nishka Waffenträger handelt es sich um ein geländetaugliches, gepanzertes und vielseitiges Halbkettenfahrzeug, das als Begleitfahrzeug oder zur Unterstützung von Fußsoldaten entworfen wurde. Es kann mit einer Vielzahl verschiedener Waffen ausgestattet werden.",
    "26ED399A44B866863CC3E58124AABB22": "Dieser Sturmpanzer wurde für die Massenproduktion in Kraunia entworfen und verfügt über einen modularen Geschützturm für maximale Flexibilität. Die \"Falchion\" Klasse ist mit einem starken 40mm Geschütz ausgestattet, das nicht unterschätzt werden sollte.",
    "79B1AA8344606FF1D0AA3DAC3B0BBDA6": "Der eigentlich nur für Flusspatrouillen konzipierte Bootstyp C Charon ist mit zwei Dreibeinlafetten und einer Mörserkanone am Bug des Schiffes ausgerüstet, der richtig eingesetzt im Rudel und mit ausreichend Bemannung sogar gepanzerten Widerstand an den Küsten und auf den weitaus gefährlicheren offenen Gewässern brechen könnte.",
    "99CCB6584F3388BD2B4B9BB0AE9CAB57": "Der \"Centurion\" wurde einzig und allein mit dem Gedanken entworfen, die untoten Horden zurückzudrängen. Bei ihm handelt es sich um ein mechanisiertes Unterstützungs-Fahrzeug, das mit zwei schweren Maschinengewehren und einer frontalen Kanone ausgestattet ist.",
    "AD94AB834E437227E2D2AFBB61FEB2D9": "Die für den Unterwassereinsatz konzipierten Seeminen detonieren bei Kontakt mit feindlichen Schiffen.",
    "BFA4A55D4B3C01FA9114FFA50DD0A9DA": "Zerstöre Ziel",
    "7565C1BB4A349596B1A9C0B64F6C1BBB": "Zerstörte A0E-9 Raketen Abschussrampe",
    "640BA4264BE2F2EE90A8D6B9FB290EAE": "Zerstörte Munitionsfabrikanlage",
    "EB1079FF433990E4027BDA9CF19D3268": "Zerstörte Munitionsfabrikanlage",
    "C1D7DFB54213CB3D075A6A858DC72929": "Zerstörte Kohleraffinerie",
    "A0262E4B402C015853F8B18B07BCF8F2": "Zerstörtes Küsten-Abwehrgeschütz",
    "E86653B943E05A24CA0E22B3E5524719": "Zerstörte Kistentransferstation",
    "8A683CEA40456FF93C9975B833F71755": "Zerstörtes Dieselbetriebenes Kraftwerk",
    "5D7846154C0EAB3905ED519CFBCF7D42": "Zerstörtes Trockendock",
    "FC157C4B49D0310646094086775F97BA": "Zerstörtes Haus mit Mörserstellung",
    "B3282BFA4B54C7FA73DF7C92C499662F": "Zerstörte Feldmodifikation Station",
    "5B6CE9C34D1A721D353FEDAD3EE53991": "Zerstörtes Garnisonshaus",
    "04C2A66849571C27BC0A0590F8537CA8": "Zerstörtes Garnisonshaus",
    "05D64E054A9AEA6A8870F992BC39ACA6": "Zerstörtes Garnisonshaus",
    "0E9B84204D91D666F0475384F315B414": "Zerstörtes Garnisonshaus",
    "183577D245A711D2CFE030B0DEC62619": "Zerstörtes Garnisonshaus",
    "23C52A394A2C6DDA9B3CF38ABEC83C0C": "Zerstörtes Garnisonshaus",
    "25D1C5EC44C45A256B39A381329E8C8A": "Zerstörtes Garnisonshaus",
    "2641E3E74DE2F3DF0B37CF9C6D640D59": "Zerstörtes Garnisonshaus",
    "31041A6A4E8329B1B3EC5C88450E6D46": "Zerstörtes Garnisonshaus",
    "386474574D25E11C900DE89108207B60": "Zerstörtes Garnisonshaus",
    "527049E64919167DA8E4BEA55760BC4C": "Zerstörtes Garnisonshaus",
    "65C02B3443756C3882875A849A10F302": "Zerstörtes Garnisonshaus",
    "6BA4DC11486E7E7A06AA56AA0ECE0C38": "Zerstörtes Garnisonshaus",
    "6C854D8640A267DD19812A9CCF072CE2": "Zerstörtes Garnisonshaus",
    "72554D834F54109F83271E8E8E300636": "Zerstörtes Garnisonshaus",
    "8EA2BE9C45F46EC3660013B96D260F8C": "Zerstörtes Garnisonshaus",
    "9ADFE6B84DD7DD2F34116A93280EB67A": "Zerstörtes Garnisonshaus",
    "9B71AC5241BBE1A347E0C9A6DAC9F2EE": "Zerstörtes Garnisonshaus",
    "9DE304714C744B9FC9793E804505DCC1": "Zerstörtes Garnisonshaus",
    "A2D3D33E47F97B26DDA7F28EC1F6708D": "Zerstörtes Garnisonshaus",
    "B084281A4E0464D5D4A61BA45383CB1B": "Zerstörtes Garnisonshaus",
    "B7E6BA4B42B66B9794C64FB59CFF8668": "Zerstörtes Garnisonshaus",
    "BAFD0E7841FD707C0FC3E8927B60FC68": "Zerstörtes Garnisonshaus",
    "D1CB22D14B682590F9FF4E80F16D66C7": "Zerstörtes Garnisonshaus",
    "D46726DC44584F50975574BB27C55C1F": "Zerstörtes Garnisonshaus",
    "DCEFE81246CFD944F515D79886950C25": "Zerstörtes Garnisonshaus",
    "E591AB8B44D7049016441EA7BF90F2E3": "Zerstörtes Garnisonshaus",
    "E6C4199C43014DB9737BD8B66FBC2035": "Zerstörtes Garnisonshaus",
    "FD701455480BB3FDD30B44AD4C324CE4": "Zerstörtes Garnisonshaus",
    "49144AF243740726C3ACE0B854ADC61A": "Zerstörte Große Montagestation",
    "02BBF10B4E6E5BAE4B4815BE9C0B1EC3": "Zerstörtes Flüssigkeiten-Zwischenlager",
    "23C305AB44A71DB4EB17BB9A9E08FF21": "Zerstörte Flüssigkeitentransferstation",
    "B72FA1B84F426DF6AC51208297986EC4": "Zerstörte Materialtransferstation",
    "BF97A0E0425EA6C7DE97B582813372B2": "Zerstörte Materialien Fabrik",
    "9ED578D946035C24AD0E7C825925A9B9": "Zerstörte Metallbau Fabrik",
    "AC342D774AC4FBAE785BB3B9FD48542B": "Zerstörte Ölraffinerie",
    "EB0E0508430999CC19ED9B923BE9B3EB": "Zerstörte Ölpumpe",
    "EE0B16BA442F876A6C64F9841D8112F0": "Zerstörtes Kraftwerk",
    "A10D31C94C380E975371FB81ABF64A35": "Zerstörte Rohstofftransferstation",
    "16A1282044DF6055D326AABEAF636E42": "Zerstörter Unterschlupf",
    "5FA6E8054562B139B530ABAA7B65547B": "Zerstörter Unterschlupf",
    "B4BFE1684FFA4084504FEABFA47D7D81": "Zerstörter Unterschlupf",
    "C44366554C8FDB5773027BBDC06F7CB0": "Zerstörte Kleine Montagestation",
    "B7AB672A4B1C0A1708E1208FAC70D517": "Zerstörter Stationärer Kran",
    "65E27155458C3491E8324199D1A5BDA9": "Zerstörter Stationärer Rohstoffsammler (Kohle)",
    "2C247A0146DD5C342256BEA146202A35": "Zerstörter Stationärer Rohstoffsammler (Komponenten)",
    "15B71A74488D43F90DFA84A53E0B6173": "Zerstörter Stationärer Rohstoffsammler (Schrott)",
    "92DAFFA448C36DF3920431AA3D9B4052": "Zerstörter Stationärer Rohstoffsammler (Schwefel)",
    "0C76AEF743C765A6E38EF6A58F6CF09A": "Zerstörte Stadtkernbasis",
    "3478C25C4B7D33B34B7217ACBCED00DD": "Zerstörte Stadtkernbasis",
    "E8B4F22842C789E1E3B0DBB10DEF2492": "Zerstörte Stadtkernbasis",
    "06F1BCF74DEDC31BDF53F8B1878F911F": "Zerstörter Schützengraben (Stufe 1)",
    "3F7E7DAE4538B9C70B62D695495177AC": "Zerstörter Schützengraben (Stufe 1)",
    "F634D667469C9D1AE38CC28384E1023C": "Zerstörter Schützengraben (Stufe 2)",
    "FDED509B4BFD4A8CDB70138372C05A4F": "Zerstörter Schützengraben (Stufe 2)",
    "24FD22CB4DC74792791565BE4DE2A339": "Zerstörter Schützengraben (Stufe 3)",
    "EA743F984C22A662B4AC4FBDC38F6CC1": "Zerstörter Schützengraben (Stufe 3)",
    "73B11259426A9E4FB490988B33137570": "Zerstörter Schützengraben-Verbinder (Stufe 1)",
    "E29A87864B41D8E59FA3B5A0558BBCF4": "Zerstörter Schützengraben-Verbinder (Stufe 2)",
    "FF99FCCD4E189A2E15D964A726148AEB": "Zerstörter Schützengraben-Verbinder (Stufe 3)",
    "B6E2C2DA4B64EF7B228846A010627C89": "Zerstörte Wasserpumpe",
    "27B7124540F562B36200BB91E0F1118C": "Zerstörte Ausrüstung, die vom Schlachtfeld geborgen wurde. Kann in einer Raffinerie zu brauchbaren Ressourcen recycelt werden (nutzbar über das Kontext Menü mit Rechtsklick)",
    "1A098F0341B09DFB96E94D8EDA7359D9": "Zerstörer",
    "55D048084C2C90E1F05340B4247D7C43": "Panzerbrecher (oder \"Flammenschreck\")",
    "65F03D9E4801817E140093806CC2F7FB": "Zerstört Hindernisse, die ansonsten nur mit einem Schraubenschlüssel entfernt werden können",
    "CAC7B220492912DC61A5F48E7B4EADDC": "Dreibeinwaffe abbauen",
    "BCE01A144C827D095F363D88D960D305": "Dieselbetriebenes Kraftwerk",
    "BE3F665C4C470BA0F86D529576402594": "Regiment auflösen",
    "601D7FFB46841A19D0802DA9D0E4FDFB": "Alle Verbindungen kappen",
    "D124284B4C8C0841B3B25B9D9341CBB4": "Kappt alle Stromverbindungen zu dieser Struktur.",
    "1402CBA84CCDDF1A689CC194BC75010F": "Tauchoffizier",
    "725EEB36498E0825F76EC3848A837AF5": "Tauchoffizier",
    "5C24E6A14E2BFDCE0BBCB8865B328C00": "Bestimmend und Unerbittlich! Keine andere Armee kann auch nur im Ansatz mit den Mesean Colonials mithalten. Und so kam es, als die Nordländer über unsere Grenzen marschierten, dass eine Flamme tief in unserem Inneren entfacht wurde, die sich seitdem weigert zu erlöschen!\r\n\r\nWenn sie unsere Legionen auf die Probe stellen wollen, dann lasst sie es versuchen!\r\n\r\nDenn das Ende, ist unser Ruhm.",
    "5F377B0E4587CF0D14CE49A42F708DD0": "Durchgang",
    "766FEE094141E47C6C9E68A8AC41D953": "Durchgang",
    "7F7379344E3CC659790552B650A00C7A": "Durchgang",
    "675C196D4FCEE900F74B3790B3DF0DCC": "Stahlbeton Panzersperre",
    "1A400430493335EA1D65F3ABA2F6D63E": "Rohre trockenlegen",
    "0A8060544364E325529ED892023A49CA": "Eisenbahnbrücke",
    "195B6F454DE2CB4C019A3E927748B54B": "Zugbrücke",
    "4BA99805416D455F85C8BE8B3DC6F82B": "Zugbrücke",
    "5EF229AE4007E992CBE4068897EB1A87": "Zugbrücke",
    "88C5F1A143250C1751311C9AE76B303C": "Eisenbahnbrücke",
    "83A395F64258ECEC0802CFB6E5A04E1F": "Fahrzeug Teststrecke",
    "88E7EE18441ECF287D89A9907F9AD571": "Fahrzeug Teststrecke",
    "CB7DFFF54D1B73FA2E800E8A674E7CDD": "Fahrzeug Teststrecke",
    "DC22351B42F5D04D010FCCBAE4F17155": "Fahrzeug Teststrecke",
    "AB977EC5420C8827B93C4994C1735AF7": "Fallengelassene Gegenstände",
    "7996F6FB4893D97468125E9DABF944D7": "Trockendock",
    "11F5FAA9454DCA4D27AF97B947756B7D": "Duncans Coin 20mm",
    "2AAFA04A4A217CE751F9DF8127D2A8FC": "Frühere Versionen dieses Maschinengewehrs waren für den Einsatz in Bunkern und auf Decks leicht gepanzerter Kriegsschiffe konzipiert, der Ratcatcher ist Harvey Malones erste frei montierbare Infanteriewaffe, die für den Einsatz im Feld entwickelt wurde. Wie ihr Vorgänger unterdrückt diese schwere Waffe den Feind mit unvergleichlicher Effizienz. ",
    "D3DB30354C5370C9C481C6B5CC705B6F": "Loadout anpassen",
    "08091B354DE93829851FBEB3CB2ACACD": "Nachricht bearbeiten",
    "EA73E2A24E6D91BE59B3FA8D029F3F4A": "Regiment bearbeiten",
    "C976E1DD42FE9AF7787313AA5DB52927": "Bearbeiten Sie die Zusammenstellungs-Modifikatoren für Ihr aktuell ausgewähltes Infantrie-\"Loadout\".",
    "30D0433A44CA775D26EAD89FBFA2FA05": "Die Nachricht bearbeiten, die auf dem Schild angezeigt werden soll",
    "E39478D4433CB85DB6F0079E93577A5C": "Namen und Kürzel dieses Regiments bearbeiten",
    "B4E3828C4A1B54EB6297D79DE7E90627": "Fahrer Ablösen",
    "7375A5424178BFE027BEED928F1638B8": "Entlässt den aktuellen Fahrer aus dem Fahrzeug. Diese Aktion ist nur verfügbar, wenn das Fahrzeug von einem Trupp beansprucht wurde. Nur Mitglieder dieses Trupps können Fahrer entlassen und nur Spieler, die nicht zu diesem Trupp gehören, können somit aus der Position \"ausgeworfen\" werden.",
    "5B7EEA1143A8752CD6692E8C421C1418": "Elektrischbetriebene Ölpumpe",
    "A11AEEA44D22738E845E61B13E8428D2": "Stationiertes ARC/RPG",
    "8B90A0E4478C66787FB941909ED30F42": "Panzerabwehrkanone stationiert",
    "389F95E44B2F5989B80332A13BECD486": "Schwere Artillerie stationiert",
    "7DFD2FBB4A590C07FAA369AFD838656E": "Schwere Artillerie stationiert",
    "868E97CE4747F87B5102F5A12A89B7A6": "Große Panzerabwehrkanone stationiert",
    "2E5B55924C95AB18310E89BE628C81BA": "Schweres Geschütz stationiert",
    "1F56A18F4A1848A20528FC8178190A00": "Leichte Artillerie stationiert",
    "43C38BDB4DD4869B2639738994F26AD5": "Maschinengewehrlafette stationiert",
    "63C36A4046B3D0B9837B5AA08622E6AC": "Maschinengewehrlafette stationiert",
    "69654C6D4CEA47D18E70DDAFF6830480": "Raketenartillerie stationiert",
    "B9002B7F4C84AAD7D3D369BCD817535A": "Haus mit Mörserstellung",
    "CCF681184F49E8DC1D3D45B7D61F582F": "Haus mit Mörserstellung",
    "6F7AD3C94752591F17B8C69D3D4D8067": "Erlaubt die Konstruktion von Garnisonshäusern und Unterschlüpfen in dieser Stadt.",
    "10FC0F0547FAE13CC3F1A9B656B81148": "Ermöglicht die Errichtung zusätzlicher Verteidigungsanlagen, wie zum Beispiel von Mörserhäusern und Küstengeschützen.",
    "F7E804FA4A16CBB465B6239C61698EEA": "Ermöglicht den Bau von Logistikanlagen wie zum Beispiel Fabriken, Raffinerien und Lagerdepots.",
    "77CF537E46DB75C26ED013B5B5901FF9": "Feldlager",
    "801BE81D4B8E3BCC0A58F29C385A6C72": "Feldlager",
    "D11367964786D174715D918E175A3B25": "Generatorraum (Stufe 2)",
    "A046E43445FD734903AB2AAECAA8CBA1": "Generatorraum (Stufe 3)",
    "1F61C54A4810D57334074C91C42A7EEE": "Ingenieurzentrum",
    "B27C2F014F032FE4AE2FA39C368FA2EC": "Ingenieur Station",
    "8C1183A34EED68DB511D039030F4040C": "Die Ingenieure bilden das Rückgrat der Meseanischen Republik. Sie sind mit einer schweren Tasche und Gürteln ausgestattet, die den Zugriff auf Werkzeuge und Handgeräte erleichtern.",
    "852FBF664CB60C909259479FD1C39313": "Angereichertes Öl",
    "6405A9C4437F95AE40A01E92E854D5BF": "Frachtfahrzeug betreten",
    "90CD31144FC19D0B388AF9B5A50AE486": "In Frachtfahrzeug einsteigen",
    "677B173044BC914F0AC13FA55F44FA46": "Startcode eingeben",
    "C643B4314C376A35063DE5BF256AF52D": "Eingabe Wetterstationscode",
    "A577485C43B2D6DB5FEB2F8B133B2FB3": "Bitte 6-stelliges Passwort eingeben, um Zugang zu einem reservierten Vorratslager zu erhalten.",
    "0F82AD414B67440EDB133FAE27E72468": "Befestigte Bunker, bemannt von stationären bzw. stationierten Truppen.",
    "614660184192294EC40C269F2BFC5A9B": "Befestigte Bunker, bemannt von stationären bzw. stationierten Truppen.",
    "6F8CDC2E421525F3DAA4CCBDAECC8FE1": "Befestigte Bunker, bemannt von stationären bzw. stationierten Truppen.",
    "D907D27F4E3CDBA224F6E88D6D0EF6FD": "Schützengraben",
    "837817FD4C271A212BA53FA37F3C1AFC": "Ausgrabung (Kein Materialbedarf)",
    "0B2745C840F5039E537869A1F1AE81E6": "Abtragungsmaschine",
    "610EC8D949E1E706DF9E9B8D8E03E8CD": "Abtragungsmaschine",
    "94C805FF4CC0EDB282209C93D05E6901": "Abtragungsmaschine",
    "B2BEA7C24561238F07A9969EB9582F95": "Abtragungsmaschine",
    "CDDE2AF043621F7FFE1D268AA8312A98": "Abtragungsmaschine",
    "27CC60CC484F7C544BFDE7A3369C56D8": "Explosiv",
    "6EC4EFBB467656EA5C0146BE84B8A3B7": "Explosiv",
    "99B2FE9A4C6126AEB39E79A364F12511": "Explosiv",
    "A953D201483DD72E1FFDA1A8ED0E8F7D": "Explosives Pulver",
    "F69C80AE41E0C992851904AA92FF9C1B": "Lösch(en)",
    "A5CE13FC47B409EEAC835CAC64554DA2": "Extrahiert Kraftstoff aus Ölfeldern. Muss in unmittelbarer Nähe gebaut werden.",
    "9F80977243AB342F6FF7919A55C8662E": "Fabrikanlagen",
    "1212F89546473A760EEB0A8D92C1B70A": "Fabrikanlagen (Stufe 2)",
    "345E78214C324AACEE51C89D606B3140": "Fabrikanlagen (Stufe 2)",
    "3F54181D490D84B90BBA1B90C8F1AA75": "Fabrikanlagen (Stufe 2)",
    "A5ED3CD24DF76BFC46962BA5A03E87FA": "Fabrikanlagen (Stufe 3)",
    "D5A27FC1449B023F11B7F69677E344AA": "Fabrikanlagen (Stufe 3)",
    "E703D5C3448DA71DE335A8BDEB84A763": "Fabrikanlagen (Stufe 3)",
    "651DB38844D1AAB42DA08B9412829AC6": "Anlagen bzw. Fabrikanlagen sind von Spielern errichtete Industriebasen, in denen Spezialfahrzeuge und -ausrüstung hergestellt werden.\r\n\r\nFolgen Sie den Stromleitungen zum Kraftwerk und schalten Sie den Strom ein, indem Sie \"{0}\" drücken, um das Menü zu öffnen.\r\n\r\nExperimentieren Sie mit der Produktion von Gegenständen in den verschiedenen Strukturen. Bewegen Sie den Mauszeiger über das Fragezeichen, um mehr über jede Struktur und die Gegenstände zu erfahren, die sie produzieren kann. Wenn sich eine Struktur nicht einschaltet, versuchen Sie, den Mauszeiger über den Produktionsschalter zu bewegen, um Informationen darüber zu erhalten, was fehlt.",
    "A7F2259B46F75EC6664B498E99A83D84": "Fabrikanlagen Gleis",
    "B230DE254C8947C96A74CBB72EFD0FBB": "Fabrikanlagenstruktur",
    "DE3E06C34622FE3CEDE99796FF41BAC8": "Fabrikanlagenstruktur",
    "535A0D26489C245363453CA4CB67BD6A": "Fabrikanlagen Grundausbildung",
    "6FFE08F9452458C9E3307290A90F606E": "Fabrikanlagen Grundausbildung",
    "BEB686CB403ADB6C40A4C1905FF498FB": "Fabrikanlagen Grundausbildung",
    "CC44135140FB86737BD520828BE3FCF1": "Fabrikanlagen Grundausbildung",
    "186B9C994E28BD86151443AD2135BC44": "Produktion von Anlagenfahrzeugen und Kleinzügen (Schmalspur)",
    "1C6075E540F596B894E3BA966D66592E": "Fabriken werden benutzt, um verschiedene Gegenstände herzustellen.\r\n\r\nDu kannst die nahegelegene Fabrik benutzen.\r\n\r\nWenn du Ressourcen brauchst, versuche Materialien aus einem der nahegelegenen Haufen auf der Insel aufzubereiten.\r\n\r\nKlicke für eine detailliertere Beschreibung auf das \"?\"-Icon oben rechts im Fabrik-Menü.",
    "21258B35439483DDBF4B77A6D928EB04": "Fabrik",
    "41D126A44DA0520ED5F340871B30C910": "Fabrik",
    "B987893A480C5A66FE7CB3A14605264E": "Festivalflagge",
    "72A344A24B0F050D239CBC989C9F8606": "Fiddler Maschinenpistole Model 868",
    "0E590422497597303D247DB4738E5940": "Panzerabwehr Feldkanone",
    "5BE3900A4BC47B72BF09958D4998F59D": "Panzerabwehr Feldkanone",
    "234479D3480F8D3D8624C99663750E12": "Panzerbüchsenlafette",
    "E22210AF44BD5C5E47C343A8E7B1CBAC": "Panzerbüchsenlafette",
    "3C2E678C4DA8E9DD134C018311963D2F": "Artillerielafette",
    "AC38557546509C33A9011AA0D7C1EC63": "Artillerielafette",
    "D7E5D59A4D09EB59D62313A5641B0F83": "Artillerielafette",
    "CF340BB44E78DB2006B379B249A0B98A": "Artillerielafetten funktionieren weitgehend genauso wie stationierte Artillerie\r\n\r\nEinzelheiten sind im Artillerie-Grundlagen-Tutorial zu finden.\r\n\r\nDer Hauptunterschied besteht darin, dass Artillerielafetten manuell von zwei Spielern bewegt werden können.\r\n\r\nArtillerielafetten haben nicht so viel Reichweite und Kraft, machen dies aber durch die Mobilität wett.",
    "2CF00F5E4322527F4A59138F1E73CAAD": "Feldbrücke",
    "85214B6C4F89526FDAEF1DB46A35F5A5": "Feldkanone",
    "239F672B4BA79C67D3C9CEBE5C420B2F": "Feldlazarett",
    "E6C9B72C47CEBDE3A65DA8BE9E5DDF58": "Werferlafette",
    "79B77B524F98465C23C22D8CA433A6AE": "Maschinengewehrlafette",
    "3A50260049F13414DA4C1487E7DD2861": "Schweres Feldmaschinengewehr",
    "3BEE21A64768DA596100BEA3DB28E2BA": "Schweres Feldmaschinengewehr",
    "2E5DE0834B30862D571B05855A4CBAC7": "Feldmodifikation Station",
    "1043728243CE18491248E0943BD6CFFE": "Feld-Mörser",
    "533F40F54A9071AC64ECAAB47310D6D1": "Feld-Mörser",
    "C2EF1B9746B24FF50700C1B95647A3E7": "Feldofen",
    "C32EF9B64E1DB95E4B60CD909E62C6EF": "Feldstation",
    "1D69619142CC5934A19B5185E751222C": "Zuschütten",
    "1E3F86B849E45AAD4CF31EA4C8D144E4": "Zuschütten",
    "229DCA044477360060A61CBD4B317FE3": "Zuschütten",
    "264F426E4545854159CD719BB8029F44": "Zuschütten",
    "2F964D3D4389D3736BE4388D4E045175": "Zuschütten",
    "3A06383E4980F00A6FF5C581A0ADCCFA": "Zuschütten",
    "83C2B3C246F4B4CFF97E02B118CEA45E": "Zuschütten",
    "8A99D2084476E3E799A0A092203C491E": "Zuschütten",
    "97C7B2C9437C053F71B625B6F141B028": "Zuschütten",
    "B10B65474010C1AA6BE2EAA9BCA5F80B": "Zuschütten",
    "BCFCA7234A083547AE2E77826AFC76B9": "Zuschütten",
    "D2A510C145EF70BF5AA01891F49DFC71": "Zuschütten",
    "DFF1431449484FA10AF26BBE74609724": "Zuschütten",
    "E297AE554DB2A7DF0E1B5EA1AD0C6B09": "Zuschütten",
    "FE7861B340CC5B1AED601487FE979569": "Zuschütten",
    "9252963C4AD30A7AA261E99F29D8B4A4": "Schüttet den Bunker zu, um die Landschaft wiederherzustellen.",
    "9F4E81DD4A6BDBB414426E8E0A4D6656": "Schüttet den Bunker zu, um die Landschaft wiederherzustellen.",
    "ABDCB2F54C4E16644CDDBE904B8B4507": "Schüttet den Bunker zu, um die Landschaft wiederherzustellen.",
    "DB6EB8DD4E001F249E711F9CFD0F8871": "Schüttet den Bunker zu, um die Landschaft wiederherzustellen.",
    "98682818476BCC5EF7A40C87B97A4D48": "Schüttet den Krater zu, um die Landschaft wiederherzustellen.",
    "BC6E7F2A417F27BDA0772A8D0FDD624F": "Schüttet den Krater zu, um die Landschaft wiederherzustellen.",
    "5AE781E14167E6E84C9705B68AF4A532": "Schüttet das Schützenloch zu, um die Landschaft wiederherzustellen.",
    "0295F40B4438AB1A5F506E801EAEE664": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "1205889C44351F8B31D31CBE1CBC59BA": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "4383994645B70DEC33898DBE4C92A08C": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "56297AC04747F5E7561569A2FBED1C6C": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "579F7D7A489202AD79EDBDA26B7B34DB": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "63AE3BE2463DF21E59AD6EB155709ADD": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "CF7920F64F99C5C566F9BDBA9DAF06DC": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "FF6EA9C943416CFE26E47FA4B81F14B6": "Schüttet den Schützengraben zu, um die Landschaft wiederherzustellen.",
    "13CD5C9A47BA879FA87C62865697C904": "Feuerwehrwagen",
    "C19E0D224B5919BEFAA077A102359788": "Feuerwehrwagen",
    "A827BEFF47AEC0621FA9ABADA2393A4A": "Feuerstelle",
    "AE84175D40D77F59902671A049614FF4": "Feuerstelle",
    "14890AAD4C668D32472334B1AB80AD3E": "Sprinkleranlage (Stufe 2)",
    "C9CE360949D265AE0468E288281ACDC6": "Sprinkleranlage (Stufe 3)",
    "318E28E849D5F10341C184B97B832951": "Der Moray Torpedo wird von einem Unterwasserfahrzeug abgefeuert und ist eine selbstfahrende Unterwasserrakete die in einer Vielzahl von Tiefenbereichen gut funktioniert. Er wurde für das Schlagen von Löchern in Rümpfe von großen Schiffen konzipiert, was sie anfällig für Lecks macht.",
    "ABCF56064644F182E927C98DC9572DF9": "Schießscharte",
    "CE02A2D44A9C10F88D627AA84AD96CEF": "Erste-Hilfe-Eisenbahnwaggon",
    "F9B540CD4BC1D59245B7E691EEFE85B3": "Verbandskasten",
    "41DC5BB04EDDDE08A9E340B497FA2090": "Baue zuerst einen neuen Schützengraben und füge einen Bunker an.\r\n\r\nNehme einen Hammer in die Hand und drücke \"{0}\" an der Wand des Bunkers.\r\n\r\nDu solltest ein Menü mit neuen Optionen sehen.\r\n\r\nDu kannst deinen Bunker auf verschiedene Weisen verbessern. Er lässt sich in autonome Verteidigungsanlagen umwandeln, du kannst Schießscharten einbauen und eine Vielzahl an weiteren Änderungen vornehmen.\r\n\r\nUm den Verbesserungsmodus zu aktivieren, drücke \"{1}\" mit dem Hammer in der Hand. Ein Hammersymbol über einer Struktur zeigt an, welche Struktur du gerade zur Verbesserung auswählst. Drücke \"{0}\" um das Verbesserungsmenü zu öffnen.\r\n\r\nSchützengräben und Bunker können mit Basismaterialien/\"basic-material\", d. h. mit Grundwerkstoffen, verbessert werden, später wird dazu Beton benötigt.\r\n\r\nNehme dir einige dieser Materialien aus der hiesigen Box bzw. dem Lagerbehälter. Füge einen Eingang zum Bunker hinzu und verbessere deine Schützengräben zu Stufe 2.",
    "EC0047B7405B350858FF23BD071C7028": "Mit einem schwerem Panzerabwehrgeschütz kann der Binder auch die härtesten Legierungen durchschlagen.",
    "0CF6E79B4112E1583F1E5EA766D9EAE2": "Ausgestattet mit einer noch größeren, noch fortschrittlicheren Kanone und einem stabileren Chassis ist diese Modifikation der “Tisiphone ” Feldkanone auf sogenannte Übergriffe von oben spezialisiert. Was ihr also an allgemeiner Vielseitigkeit fehlt, gleicht diese Kanone mit einem hohen indirekten Schussbogen aus und ist daher ideal für z. B. nächtliche Beseitigungen von ummauerten Grenzbasen und Lagern. ",
    "677F3D7F4F3EC78116002FA9DE6222C0": "Ausgestattet mit Geländeketten bringt der Highlander eine erhebliche Geländegängigkeit mit sich und eignet sich hervorragend für den Gebrauch in schneebedeckten und bergigen Landschaften. ",
    "D91215074858A485C1A09C8661C768B4": "Mit zwei Raketenwerfern ausgestattet ist der T8 bestens dazu geeignet, mit immer wiederkehrenden zermürbenden Überfallangriffen, auf feindliche Gebäude oder Befestigungen zu wirken.",
    "49E7314541C271CFD119489A5B71A408": "Markier störende Platzierung",
    "4CF0F3774AF5DF3CCFB4DEB69818599D": "Markiert diese Struktur als störend. Wenn eine Struktur von genügend verschiedenen Spielern markiert wurde, wird sie anfällig für Eigenbeschuss.",
    "91724B794E1BCFC2D0D172A32C020F56": "Brennstoff",
    "B777FC99442DB88B03A7ECB094119BF0": "Leuchtrakete",
    "D6EFB89F46759391A4051292C45BC925": "Mörser Leuchtraketen-Geschoss",
    "1792CEF147D68089B641D3BC8CAA1387": "Lastwaggon",
    "458F081C470EBD36BD654E8D14B86534": "Schwerlasttransporter",
    "19160B414FA3540EB3F0E08526FB5D7A": "Folge Mir",
    "0AF9B0C64ECCAB0D96434AB223799B95": "Die Uniform der Legions-Sanitäter bietet eine Vielzahl und Taschen und Beuteln, welche dazu dienen ohne Probleme Erste-Hilfe-Ausrüstung zu transportieren und nutzen.",
    "DD746F89475D20526DB12CB524E29926": "Bei Schusswaffen handelt es sich an der Front bedauerlicherweise um eine absolute Notwendigkeit.\r\n\r\nEine breite Auswahl an Schusswaffen wurde Ihnen zu Trainingszwecken in den umliegenden Kisten bereitgestellt.\r\n\r\nNormalerweise muss aber jede Waffe vorher hergestellt werden.\r\n\r\nUm eine Waffe zuzuweisen ruft man das Inventar mit der \"{0}\"-Taste auf und klickt anschließend auf die Waffe. Sie wird dann ihrem rechtmäßigen Platz im Inventar zugewiesen.\r\n\r\nAnschließend den Rucksack mit der gleichen Taste wieder schließen. Eine Primärwaffe wäre jetzt über die \"{1}\"-Taste und eine Sekundärwaffe über die \"{2}\"-Taste zugänglich.\r\n\r\nDas Zielen erfolgt standardmäßig durch Rechts-halten und das Schießen durch Links-klick bzw. aktuell durch die \"{3}\"-Taste und \"{4}\"-Taste.\r\n\r\nVersuchen Sie sich nun an den Übungszielen.",
    "BBA10F004FF8DA0DEA069EBBA952B1F2": "Zu Schulungszwecken wurden Dir verschiedene Wasserfahrzeuge zur Verfügung gestellt um die grundlegende Fahrsteuerung und Funktionalität zu üben. \r\n\r\nVerwende \"{0}\", \"{1}\", \"{2}\", \"{3}\" um Dein Fahrzeug zu steuern genauso wie bei der Fortbewegung zu Fuß. \r\n",
    "38AA2F854873950355FCCAB11415BB06": "Schmiede",
    "0E1D2D8B463556152517EAA9DCDB096E": "Befestigungen",
    "8CB26A0E490845A47C32D1841BA47A8E": "Befestigt",
    "EDF80F4043F09B2A353609A04433D606": "Fundament (1x1)",
    "F45E2F3B4CA544FBFDA6FDA5C67CB547": "Fundament (1x2)",
    "E4FA32114D35A116E686A5A9A555FA7D": "Fundament (2x2)",
    "2FD7C3F44DCC2C64B9EA03BC9D89F25B": "Eckfundament (1x1)",
    "20C300D44111C0ADFAA707B524F40B27": "Grundlegende Elemente benötigt für die Konstruktion der Rümpfe von großen Marineschiffen.",
    "2555CAA049962C34D8C25B8217AFE7E4": "Schützenloch",
    "3CA3BE5F40E4EB02AF87A9AC6626F775": "Treibstoff",
    "888A355449B487EA21C567B94E9C5A34": "Tankwagen",
    "3FBD45A24F877BDAF520A3B3EE3FCFF9": "Treibstoff kann spieltechnisch auf zwei Wegen erlangt werden. \r\n\r\nEntweder kann Schrott zu Diesel, oder Öl aus dieselstrombetriebenen Ölpumpen zu Benzin raffiniert werden. \r\n\r\nBenzin kann dann wiederum dazu verwendet werden, um dann Öl mit noch größerer Effizienz zu fördern.",
    "D37AC5CC4FB8C9EA5FA5BF9D8AD5E33C": "Tanken",
    "8194C7224AD3B4F2C11C23A8309947AE": "Vollständige Reparatur",
    "F96CCD1E42EA9D965B0F3F9F4324E708": "Werkstatt",
    "0E35F8FE49AADCB93D10B785E7B3887B": "Garnison",
    "147D88DF4F4DEB259D18809FEC926EEB": "Gebäude mit Garnison",
    "87E7FB0949BA2A3A803D6FA4D61AE2CC": "Gebäude mit Garnison",
    "A4D7E4EB45CC614B3CEDB292ED3D36FA": "Gebäude mit Garnison",
    "738B8E6D43F6D46F58DF308483807C54": "Garnisonsstation",
    "05B6A7E843290D9F54FAD698DAAF8E63": "Garnisonshaus",
    "07C088CF4658C899D59A4DA11B4C1185": "Garnisonshaus",
    "0C9E7B9D4CAFC30F8AA3F296986D46D4": "Garnisonshaus",
    "15624C00420C72099D88098D8BE07A96": "Garnisonshaus",
    "1B8D4C8047EF5403E75A509C623A3AF2": "Garnisonshaus",
    "1F28F2454C8D6ADA679D67A64F08DF41": "Garnisonshaus",
    "300B0C3E43B337D2E5069B91EACEA441": "Garnisonshaus",
    "33554B4D4A532E58A484D8BD5843DEE1": "Garnisonshaus",
    "4A7D20EE4B1446612B17DA82F676532D": "Garnisonshaus",
    "5116E7B64064AA9B4DBC4BB87BA3CEFD": "Garnisonshaus",
    "570E66F64427D2FAAFC7C093CB49B636": "Garnisonshaus",
    "5DFDF3F1403D4EA5228F99AA585EC21F": "Garnisonshaus",
    "5FAAD2E2445137ECEB717B8FB5789913": "Garnisonshaus",
    "6E530185404D69B28E538CBFC459325C": "Garnisonshaus",
    "7894DAC2488EC4B1525D87973BF4EFDD": "Garnisonshaus",
    "78C21E0247D30223F885D5B7C43D9A6A": "Garnisonshaus",
    "7E370E254D2FC256783CD6B2F60B477F": "Garnisonshaus",
    "8F5145264AD5949E39DE709D66407C8F": "Garnisonshaus",
    "9C59052D48A56D4B209ABD9178D35165": "Garnisonshaus",
    "A4B30AB7403E3D25F6426FA447C5488F": "Garnisonshaus",
    "A85CC501406E34D03E89129A87589AC0": "Garnisonshaus",
    "AF2561B3476AC14CA45ECFA477B1570D": "Garnisonshaus",
    "BDBF38154039C63A314AC297011D3D7D": "Garnisonshaus",
    "BFBDFFE94555AB2AF6DBBB8B367FF86A": "Garnisonshaus",
    "DEF08A374CD6CE786CF41D954BC4D9FD": "Garnisonshaus",
    "E43E5D6A4A964118B53D5B947E7C3DAC": "Garnisonshaus",
    "E485A5E840EE7026518453B0F8CFDED0": "Garnisonshaus",
    "EA56E5E84110E0B8849C2A9CE2F20D55": "Haus mit Garnison",
    "FDE2A6044916483C475099B262B3383C": "Garnisonshaus",
    "CD94F99F497B1785DDBCA5A4CE172A0B": "Gasmaske",
    "D95780024FE7408BBF477792618FC619": "Atemschutzfilter",
    "80762CBB45EF63A73AAB14B3CB2A1B65": "Tor (Stufe 1)",
    "7A40C61448B3FABF060E369BB79F3A06": "Tor (Stufe 2)",
    "4BAC9851464E59D977437285DF1586DC": "Tor (Stufe 3)",
    "999C693D49CD6BA9C4054C97A3D31D84": "Schotter/Kies",
    "4413D3A34597B7499BC5B2AC8CF05C1D": "Green Ash Granate",
    "8739433E4A662267B70B43875E0D8FE9": "Green Ash ist ein Erstickungstoxin. Das Einatmen ohne Schutz führt zu einem schnellen Tod. Tragen Sie beim Umgang mit Green Ash unbedingt eine Gasmaske mit frischen Filtern.",
    "0C04CA104B06B55A857BA697672F62B6": "Granatwerfer Turm",
    "6E061CC544132319F99222ADCE170C42": "Granatwerfer Turm",
    "6F25C5494627639CBFC042B1DBA18F12": "Granatwerfer Turm",
    "436B65CB4E3CC44771E7999EB0B34911": "Granaten",
    "4662E1F44473D9DADEE5FBBC41412A1C": "Granaten werden wie alle Waffen aus dem Rucksack ausgerüstet, sie sind dann im Tertiär-Waffenslot. \r\n\r\nAuszuwählen mit \"{0}\".\r\n\r\nGranaten werden im hohen Bogen geworfen, einsehbar mit \"{1}\" beim Zielen. \r\n\r\nHalte \"{2}\" zum Zünden und \"Vorkochen\", beim Loslassen wirfst du sie.",
    "D0FDDA8F49CC5A0ABFECB3887E62D100": "Granatengurt",
    "069C2F184DCB8877EC178EAF7B7600C2": "Schießplatz",
    "63EB9B6A4C36454FF0FBAB996BF11549": "Kanonenboot",
    "F9A269804162FA069E7C498D5426E537": "Kanonenboot",
    "04E322B3454ACD0A015A5B8280E12436": "Schütze",
    "17A4191745D78A17F8D7D2B5F20B70B3": "Schütze",
    "18CCCD67460DC50D723CD6B803F448D0": "Richtschütze",
    "2163974847583327027B07B07C4ABCCB": "Richtschütze",
    "2170751A4AFCC2E6E5CA8AB281E7767E": "Schütze",
    "2ADB35E74AE7983E1B5088906153814B": "Schütze",
    "2C4C24874EFDD80AAFA1B68886086912": "Richtschütze",
    "2F49FFA546096D798AC247948AB3CF9B": "Maschinengewehrschütze",
    "31E1BFFF4D531B5A837F9782A7BCF0F9": "Schütze",
    "334AD1E5415DEE4F90CC74AC8A5F3A98": "Schütze",
    "3825ADD34E26B099AAC100ACE066FCB3": "Schütze",
    "3B05BD29430E5752D02FAD8176CE935D": "Schütze",
    "4C92DE6A40DB640F3E4E729A61E10A53": "Schütze",
    "58965405402CF955256B5D882083CC8D": "Sturmgewehrschütze",
    "5B4CDB4345ACDAD082C6BEA6F7B85670": "Richtschütze",
    "63C5DCCB46706B3286BD3E9F5BB0041E": "Schütze",
    "6542FF2046B68CCE91FFC78F4C3C5C55": "Schütze",
    "693D63FB444BE0D03C7A9CA25A6A93DF": "Richtschütze",
    "6C4154E742C052BBCD6EC5892B665208": "Schütze",
    "7E2C51E94E4CAD46522A70903F36C33D": "Schütze",
    "80857B6048B21D9E48D3F9B22564CAA3": "Schütze",
    "8A9DF13D4C127B3F3D682E95FA7FE289": "Schütze",
    "9C5353B7423D2D4F160FB091CB3F8C3D": "Schütze",
    "9DD3C5D149636362F37B2B91B5B83395": "Schütze",
    "A168FD5841637EB559657FB4358DFE95": "Richtschütze",
    "AFA79CF642CABF02048445B66613999F": "Schütze",
    "B214B2F74F78E8A67627E58878C61121": "Schütze",
    "B2D8D81F46C6AABB823ECBA220B0AE08": "Schütze",
    "BCE0E2F74366B0FBE3FFA38F8EC62A48": "Richtschütze",
    "C1BC8A9A48E8D2BEEAD23A8065CA54E4": "Torpedoschütze",
    "C75B5EF64B5D207C142A7EA962A837C6": "Schütze",
    "C9E214204CF62ED59440EAA55745641C": "Schütze",
    "CA3022A7402DD35AE04F78BB761F10D0": "Schütze",
    "CA71F11346288EAF1879E7BD7AAFEC9A": "Schütze",
    "CB4956624707DB8429314A861C23591C": "Schütze",
    "D0B6B72746CCD8EDF941B9B0E28B05E0": "Maschinengewehrschütze",
    "D4DB27214875F1A2C9D6B6B3C321C007": "Schütze",
    "D81BEA084F166632A786C9911CD2C893": "Maschinengewehrschütze",
    "E439A8AA4862033B2E20D9B5C4855CE7": "Richtschütze",
    "E7297F474ABC41DFDD242CB9D78D3609": "Sturmgewehrschütze",
    "ED50F32049DEDC3A83266B901A9D8C18": "Panzerturmschütze",
    "F3CB25C540FE9AF9400999AECBC8C229": "Schütze",
    "F72C09CA469B61E3BF7E028B8717CABD": "Panzerturmschütze",
    "00CD9B0242F5A4903A117FB4CEEDC514": "Grabenrüstung",
    "DE3AEE72483623694B6B18A793378204": "HE-Raketenartillerie-Munition",
    "2B7F04BD402638692572B284504F993E": "Halbkettenfahrzeug",
    "36DB40784E861D724CAFA8BED1BB69AA": "Halbkettenfahrzeug",
    "426489BC4E90BAAFDAE138B53875FBF5": "Halbkettenfahrzeug",
    "4C56245747E9E3F8335B688FF9B8F0A5": "Halbkettenfahrzeug",
    "5B73999D47BE22579B0761855721A5FF": "Halbkettenfahrzeug",
    "988B10484A3B004AE00E488E95B576A2": "Halbkettenfahrzeug",
    "9D0F590B4A1333C26A2283A0D451557D": "Halbkettenfahrzeug",
    "BE6DA0764FD4E2162BC7A8947D5DAAED": "Halbkettenfahrzeug",
    "E2006B7D4E0B3015E0EFC38BC74B205F": "Sammler",
    "7A71FA6B447DF998CFFF7FB781D27EE5": "\"Havoc\" Explosivladung",
    "EA6F15844125D4DDF48729BFD92EEA37": "\"Havoc\" Explosivladung",
    "F8156AF3425DD053C3323784874A9FAA": "\"Havoc\" Ladung Zünder",
    "A046CD18495C23B23CD3A8863D6DD9E9": "Eine hitzeabsorbierende Metallabschirmung, die selbst die flüchtigsten Stoffe vor den Elementen schützt und unerwünschte Explosionen verhindert. ",
    "062420D14E9268B73CFC129AD58E67C5": "Schwere Artilleriemunition",
    "3801AADE494D7FFC440720A61F4DE336": "Hochexplosives Pulver",
    "E950F999416631A8104F52B22B02052E": "Schwere Geschützlafette",
    "7B1E2CD54F1AD0EFE056B59A24ED7B0F": "Schwere Geschützlafette",
    "1080BA904A042F251EA61B928680E5A1": "Schwerer Infanterie Transporter",
    "94DAEF7443BC44A8C0AEC289D9BE6AA8": "schweren kinetischen",
    "E24867C443961776A33E09AB756A87F1": "schweren kinetischen",
    "AC28ADCD458ECD65CBE718957B59CE2E": "Gießerei für schwere Munition",
    "6C2143B442DC95C3B44CBA84529E8D6B": "Schweröl",
    "12B07EA44CEEAA75880070896ABC7F44": "Schlachtpanzer Werkstatt",
    "95865B3E41469F28FE777F87287B69F7": "Schwerer Mantel",
    "0049463D43EA65CABE6B5D932462DDF3": "Schwerlastkraftwagen",
    "ACC96D97471EC4ED459C9A992AB13C8C": "Hilf Mir Bauen",
    "E36F7DEC4480A32785A9F4ABBF7453E4": "Hilfreich",
    "8634B6EF4ADD9D581723A78FBF14A597": "Versteckt das reservierte Vorratslager vor anderen Spielern.",
    "038892D84F27968BA112D1A00F5953BB": "Hochexplosiv",
    "217A29504EBD8ACEF16E498C5BA3F9D5": "Hochexplosiv",
    "3060BC11457838B78F82F7B4BFB82F12": "Hochexplosiv",
    "84D7BB05492FD5B7DBFE31B7E34CD0EE": "Hochexplosiv",
    "DB5751184DFBA3C8E768D8B2A064906F": "Hochexplosiv",
    "D01DA79049A89F048906738536AABDD0": "Hohe Wahrscheinlichkeit Ketten lahmzulegen",
    "DE69DD724B8F89FAA24A3F9CA62E23BD": "Hohe Wahrscheinlichkeit Ketten lahmzulegen",
    "2C908B5A48AB40D82570EA903501DF60": "Hohe Wahrscheinlichkeit Fahrzeugpanzerung zu durchdringen",
    "BF2C15C14740C3AB71FB03B3D9B9DC3C": "Hohe Wahrscheinlichkeit Fahrzeugpanzerung zu durchdringen",
    "DF6EEF584BFD5DA2CAF57E8AF4604A9D": "Hohe Wahrscheinlichkeit Fahrzeugpanzerung zu durchdringen",
    "A6A35D25419F581F05548BB8BB896C9F": "Hohe Wahrscheinlichkeit Fahrzeugpanzerung zu durchdringen.",
    "5DDD26B74D919F2F8E88F8B546717B0B": "High-End-Stahlstangen, angereichert mit Schweröl, die für den Bau fortschrittlicher Fahrzeuge und Ausrüstung benötigt werden.",
    "F6127E66469ECD53E180559ABE2465EA": "Höhere Basischance, Fahrzeugsubsysteme zu deaktivieren",
    "05113C3540257453624FCDA145453B61": "Eine hochresistente Außenbeschichtung, welche Marineschiffe vor Schaden und Verschleiß schützt.",
    "25B252A547FDC2F0456CDCAED5F52CF2": "Position Halten",
    "384D311440713FB3E4E188B57DF2CEA0": "Stellung halten",
    "73AE8F2C486724FB3D149DAB8F627017": "Halte mehr als 60% aller Gebiete, zum selben Zeitpunkt während des Krieges",
    "D3C7AC92419EE873FCCB0C95987DDE26": "Halte mehr als 75% aller Gebiete, zum selben Zeitpunkt während des Krieges",
    "6E3FC4AA4BE95498353A3FAED66DF6A5": "Krankenhaus",
    "3F73A30F4289C459C814B38F7A18EFE6": "Haus",
    "9AB609E04DB475C2CC5FAE98AFD42EE3": "Haus",
    "BBD3AA484ADFD961C6C7ECB03D083A6D": "Huber Starbreaker 94,5mm",
    "8462878046431C3E447044A39AC3F726": "Mitfahrgelegenheit?",
    "2C9571954AF0EC526149B38CB1F3C551": "In Foxhole werden die meisten Gegenstände, Ressourcen und Ausrüstung von Tausenden anderen in Ihrem Team geteilt.\r\n\r\nStandardmäßig ist alles öffentlich. Um aber größeren Gruppen bei ihrer Planung zu helfen, können bestimmte Strukturen, Fahrzeuge oder Ausrüstung reserviert werden, wodurch Andere vorübergehend daran gehindert werden, ebenfalls darauf zuzugreifen. \r\n\r\nBeachten Sie, dass selbst Reserviertes im Laufe der Zeit wieder für Jeden öffentlich zugänglich wird.",
    "90629C884E1BC4AD7B1B688D8879CA4F": "In seinen späteren Jahren kam O’Brien beinahe bei einem Angriff auf einen militärischen Personenzug um, als er nach Whedon’s Row reiste. Als Reaktion darauf setzte er sein Team an die Arbeit, nicht nur einen Infanteriewaggon zu entwerfen, der jeder Lokomotive einen starken Schutz bot, sondern auch einen, der schon beim Anblick alle bis auf die engagiertesten Angreifer davonrennen lassen würde – namentlich aufgrund dickster Panzerung und mächtigen Zwillingspanzertürmen. ",
    "00972195402DDCD3343067BE75BBBF22": "Als Reaktion auf die aggressive nördliche Offensive der Legion ist die \"Firebrand\" darauf ausgelegt feindliche Garnisonen mit Leichtigkeit abzufackeln und einzuäschern. Die \"Firebrand\" wurde unter Wiederverwendung des aggressiven Rahmens der \"Widow\" konzipiert und ist eine reine Naturgewalt, wenn sie z. B. von einer gepanzerten Panzer-Eskorte unterstützt wird.",
    "7362FAA74653E5863BF69AA53428206F": "Brand",
    "F8B8718A42B8DF489309BBBE75C21732": "Brand",
    "1BDC3A5C48CCD41A5E8E3F90FFDE15D0": "Brand-Mörsermunition",
    "477F4FB84B4CDDBEF2BCC1A3E429DDDA": "Brand-Raketenartillerie-Munition",
    "A2AD546C48E0C349FF50E190004959B4": "Erhöhte Chance ein Leck zu verursachen.",
    "01A94DA94B83F60520343CAEECD4C718": "Erhöhter Schaden gegen Feldstrukturen",
    "5CA555E84201DBA81236ACA6B2788426": "Erhöhter Schaden gegen Feldstrukturen",
    "8E9C45DD4A934CD02821ACA922532232": "Erhöhter Schaden gegen Feldstrukturen",
    "7D6CDD574431DF05CD67D7937C843885": "Industrielle Rohrleitungen - \"Pipes\", die den automatischen Transport verschiedener Flüssigkeiten und Kraftstoffe in ein Rohrnetz ermöglichen, das mit verschiedenen Fabrikanlagenstrukturen verbunden ist.",
    "012B35954F5CFCBD99DA58BE0B4DE6FA": "Industrielle Rohrleitungen, die den automatischen Transport von verschiedenen Flüssigkeiten und Kraftstoffen ermöglichen. Diese Spezialrohre können über Kopf gebaut werden, um sie an Rohrleitungsnetze in Bereichen mit hohem Verkehrsaufkommen anzuschließen.",
    "8E3D49684068C965DC3796B3488D5075": "Industrielle Rohrleitungen, die den automatischen Transport von verschiedenen Flüssigkeiten und Kraftstoffen ermöglichen. Diese Spezialrohre können unterirdisch verlegt werden, um sie an Rohrleitungsnetze in Bereichen mit hohem Verkehrsaufkommen anzuschließen.",
    "0DF4235247A726CC903B14BC17F6C30B": "Industrie",
    "358F097842F9EBA78C231881FA23567B": "Infanterie Kampfanzug",
    "907A8F2C40C8D4B207F52AB96C810454": "Infanterie Waggon",
    "75BC79854544E53EA78DAD9295277534": "Infanterie-Waffenfabrik",
    "8781ED474F9A299044BC9190688F3475": "Infantry Support Gun (ISG) Munition",
    "B87D2C6849DA008E12681A94DED93880": "Ursprünglich war die Hawthorne eine modifizierte Loughcaster mit einem abgesägten Lauf und einem deutlich niedrigeren Profil als ihr Vorgänger. Die Hawthorne hat zwar an Präzision eingebüßt, ist aber durch ihren leichten Rahmen im Gefecht wesentlich flexibler und kann neben einer schwereren Hauptwaffe getragen werden.",
    "9C4AD1BE4D93664EBFDF3780DFB1AFE1": "Die Raketenbatterie T13 \"Deioneus\", ursprünglich als mobile Plattform für sperrige Feldwaffen konzipiert, ist ein leichtes gepanzertes Fahrzeug, das mit einer neunkalibrigen Raketenartillerie ausgerüstet ist. Diese einzigartige Batterie ist so konfiguriert, dass Brandraketen aus großer Entfernung abgefeuert werden können und gleichzeitig eine hohe Manövrierfähigkeit zwischen den Einsätzen gewährleistet ist.",
    "409B904C4F973C80DE39AB9CAB0A923A": "Aufklärungszentrale",
    "65E7A40F4AFFB93B9A7BB5852FE98F53": "Aufklärungszentrale",
    "B8E1D0E84E3712E3211D3A8542EE3ED4": "Aufklärungszentrale-Teilstücke",
    "7D43D62949624B5D4E92E3A3A83890AF": "Interne Schießscharte",
    "713F895344604DCFFC2599B0B08B4F30": "Eisen",
    "544383254C944A19EFE8AA98A6AF2657": "Eisenlegierung",
    "A5674AE743C58EE9F31A0286F4BFA673": "Eisenlegierungen können genutzt werden, um Fahrzeugprototypen im Ingenieur-Zentrum zu produzieren.",
    "A8496B6F4577208DA9E8939EB017D387": "Eisen kann zu Eisenlegierungen veredelt werden, welche für Prototypen neuer Fahrzeuge verwendet werden können.",
    "9A4F2B204D19BF49A45EA882DBD0C0A9": "Versorgungskiste",
    "018F3B91423A783B639B7FAEC003F268": "Genau wie beim Überspringen von Deckung oder Hindernissen, drücke \"{0}\" um auf eine Leiter zu klettern. \r\n\r\nDrücke \"{1}\" oder \"{2}\" um dich nach oben oder unten zu bewegen.",
    "06CE98FD41666C3DB4F9B8B5E3341354": "Wehrturm",
    "626D70364203D4662E3933A3AE5B600B": "Beobachte dein Fadenkreuz. Wenn die Balken nah beieinander sind hast du eine deutlich größere Chance, das Ziel zu treffen. \r\n\r\nJeder Schuss wird die Stabilität reduzieren.\r\n\r\nEs gibt drei Wege, die Stabilität zu erhöhen. \r\n\r\nErstens, Stillstehen wenn du feuerst.\r\n\r\nZweitens, mit \"{0}\" in die Hocke gehen.\r\n\r\nDrittens, mit \"{1}\" auf den Bauch legen.\r\n\r\nLiegen bringt die größte Stabilität, jedoch auf Kosten von Mobilität.\r\n",
    "4DDDB91A4021DCF5988EE6A930E366A5": "Küche",
    "CBFCB98C4279503AD9449899EDEECAD8": "Dieser schwer gepanzerte Waggon, der in den Kolonien als König der Gleise bekannt ist, wurde entwickelt, um umkämpfte Eisenbahnstrecken zu schützen und deren Vorherrschaft zu halten, insbesondere beim Transport von Vorräten in umkämpftes Gebiet sowie beim gesicherten Transport in Zusammenarbeit mit zusätzlicher Infanterie. Diese gepanzerte Bestie verfügt über einen Kanonenturm sowie seitliche bemannbare Waffenstationen.",
    "76224C6D40DE8F1D52AC6AB1FAD7EBE7": "Leiter",
    "1101872643C4610FEEA5D28FC5EA44D2": "Leitern",
    "0390DF8543C71F69CAD325A43B34555F": "Lampe",
    "2BB6FEE94D9763E4276B338A1B9BB3F6": "Lanze-40 “Halberd”",
    "4690646349F78B22181DDDB00749F8F1": "Landungs MTW",
    "9E1DD4F34DCF42E1265060B5E076F9D3": "Landungs MTW",
    "AD8A7686412CC5E89AA15FAEFCCF4A23": "Landungs MTW",
    "DBF3935B44F68435BDB1DCBB8B794E56": "Landungs MTW",
    "80CF1FBE4EC9A8B3F4001090CBA224A2": "Landungs Strand",
    "0AB28E3B44E885C1C9DAFC8F1CBFE04C": "Landungsschiff",
    "80128971487709E6C47F628F96EA064A": "Große Panzerabwehr-Munition",
    "60A888024ADA81D343D7E785AADA93A1": "Große Montagestation",
    "263EC4E146533F91D0B4239B36B7ACF5": "Großkanonenmunition",
    "02F8B69A49495A42BBFD8FBD9F93E3C0": "Schwerlast-Kran",
    "CAE2A5A44B727D02E924A6B3368E948E": "Schwerlast-Kran",
    "1BEA91F4468C042AEB44E6B841157B14": "Große Geschützlafette",
    "E7FD55034602301A5FCCCEBE1FD5219A": "Große Geschützlafette",
    "C50AC0D74C4B3FC9847373A7C53A2CD4": "Großer Feld-Mortar",
    "21EBE6CE42874FCD5A99A9B892E6259A": "Große Garnison",
    "ADFC63DC480F2DA8D073B0B8F0DEE17F": "Sperriger Gegenstand",
    "D4E792724F704DDEF624C1B827C3A2E2": "Fels",
    "94882C3A447B8955381A79A240E1CF38": "Großkaliber Granatenfabrik",
    "2D9EDC76462AA2683886FB9556E17D03": "Großes Schiff",
    "FF675C99421C0BB79E315BB722898669": "Großstrukturfundament",
    "8249657A46A3EE8E9CA9A4823F4AD7BA": "Letztes Gefecht",
    "0082C2554406CA8E47120E92D77E709B": "mehr über Feuerstellen zu erfahren",
    "32032B8B42A16AE8EF602F819CDABFB0": "mehr über Feuerstellen zu erfahren",
    "74EDDE43424848E1E23C17AB4EB64866": "mehr über Sichtbarkeit zu erfahren",
    "9E46F1564DBB211AF78473851483F7AB": "mehr über Sichtbarkeit zu erfahren",
    "D20EC1ED4E06085C2F0FF99DB9151CAC": "Regiment Verlassen",
    "670A03504B08D046AD0E638F8ED6B724": "Dieses Regiment verlassen",
    "FFD4D9B642832CFABACDC391D68A34BD": "Die Späher der Legion werden für die gefährlichsten Missionen eingesetzt. Ihre Ausrüstung ist leicht, robust und für lange Einsätze in unwegsamem Gelände bestens geeignet.",
    "0FB7E02B4E914C5BD561FAA4040C76CD": "Legionärkampfanzug",
    "651803D243D685B8B874B3A08B3A88EE": "Legionärs-Ölmantel",
    "6A11A2CF453E9B42CB16A3A6D70CD5CE": "Befreie 1 Logistikstadt, die sich in einem verbündetem Startgebiet befindet, während deine Fraktion weniger als 35% aller Städte hält",
    "5EDF69BD461F13ABE71564B80B110EA1": "Befreie 20 verschiedene Städte in verbündeten Startgebieten",
    "4DCE50B74EFD9007E0C63EA0F0B90DD8": "Befreie 40 verschiedene Städte in befreundeten Startgebiet.",
    "C33BD6644BAB32A6DD7B3FA6B2654163": "Befreiung",
    "8E5023BF40374008D15B929B10296CC9": "Leichte Artilleriemunition",
    "D377C25B4BAA7CC2063E208BD257EAA9": "Leichte Fregatte",
    "013AFA104C2289826AB5D48CF9187CC1": "Leichter Infanteriepanzer",
    "48EC82B9455992D945AD6FA1BCD07350": "leichten kinetischen",
    "94E6C52748F974CFF96E8FA4523D63C4": "leichten kinetischen",
    "DEB3F7BF4AAEB54BBEAF81AADE011C24": "Leichtes Maschinengewehr",
    "04CC125A442391864552348644139DDC": "Leichter Panzer",
    "0B8A430C4177ADCB030D988089650B1B": "Leichter Panzer",
    "276EE0EB4F509FDFB7B2C280275641F6": "Leichter Panzer",
    "2E06E5194C85864DBE6D4088CD60F9B4": "Leichter Panzer",
    "4D91A6614EC93344D7E3E7A5962EC665": "Leichter Panzer",
    "CB5ED66A430DE7B766771791DF9F5C85": "Leichter Panzer",
    "F689EE6F4FC29F81ADAAADB13398E6E8": "Leichter Panzer",
    "A871879F492DCA0E83D8D18C6B8F200A": "Leichtes Nutzfahrzeug",
    "647FC4CD4205FD8BB6C92095D228B54A": "Flüssigkeiten Container",
    "1F219F864DE728C7E1BDAF8D79552ACC": "Flüssigkeitensilo",
    "19652C2E4011FD8284C74F8C1208BC18": "Flüssigkeitentransferstation",
    "0E0BCD994DBE7FA08EB7F3A6E3D86FF6": "Horchposten Set",
    "72BFCAE84FD18AE9A6734482B47ED091": "Horchposten Set",
    "F09918C5426DF9ABAAC458A157554256": "Lader",
    "29DB96F34F0DB4211E0BAA96C99A19A7": "Absperren",
    "EBF48BD949DDBE9AED1F86A38C54D484": "Spinde",
    "3CBC2E1C4ACF2344C8E33ABF5261FC58": "Sperrt bzw. schließt dieses Fahrzeug ab, so dass andere Spieler darauf keinen Zugriff haben.",
    "C1D0A4E647117A03ECF77FBDD130B108": "Lokomotive",
    "5C66CB85462BCBEC0403D1961A5C3582": "Logistikausbildung",
    "8CF54F7F4A4F75D458EF318B8EF669A9": "Logistikausbildung",
    "B4BA894F45D24A2F0A6378830AB09308": "Logistikausbildung",
    "EE32052E4F4FDA3E5913AC83AC3CA50C": "Logistikausbildung",
    "39B535BB4CA17D4F0689DABC704ED948": "Logistikausbildung - drücke \"E\", um Schilder zu lesen.",
    "4DE529804B88FBF076B4AC8FD09149DF": "Mobile Großreichweiten Artillerie",
    "DD502CA34C3A8980D2B9ADAC816877AC": "Auf offener See sind die Schlachtschiffe der Titan-Klasse seit langem gefürchtet, und man spricht nur leise und mit großer Ehrfurcht von ihnen. Ausgestattet mit einem breiten Arsenal an Kanonen und Geschützstellungen, werden die Feinde der Titanen schon bald die erdrückende Tiefe spüren. Die Republic Coastal Legion hält Titans als ihre Vorboten und ganze Flotten versammeln sich auf ihrer Position. Nach dem Vorbild des Flaggschiffs von Ambrose Leons berühmter Flotte ist die Titan ein Leuchtfeuer des Sieges für das Meseanische Volk.",
    "DAA7E763486A04D2A8CC8F8FE9BA0C0C": "Schau Hier",
    "402840774A2023C9CDDEBD970E90CF05": "Lyle Rycker baute den ersten Prototyp des Wasp Nest als Test für seine Raketenbatterien auf Gestellen, die schließlich ihren Weg auf gepanzerte Fahrzeuge fanden. Das Wasp Nest kann 12 Raketen in schneller Folge abfeuern und wurde schnell zum Liebling vieler Warden-Infanteristen, die es testeten. Deswegen wurde ein offizielles Design angefordert.",
    "E81BCFC54D3036A22701E9A7262B7248": "Maschinengewehrmunition",
    "5A3631E046C031B8D354ECB975C8A312": "Maschinengewehrbunker (Stufe 1)",
    "5CB174014ACA2C622B96D6B67F7925CC": "Maschinengewehrbunker (Stufe 2)",
    "6BEC07FF448FB9CF98BD24A6A3B1E75D": "Maschinengewehrbunker (Stufe 3)",
    "2ADF25464310AFAC96CECAB3329DA093": "Maschinengewehrunterstand",
    "3BCD84BB47BD5DB19865AA8AF93908D2": "Magische Kiste",
    "AB77783644E9E79C8BBFA98C20F0F7E8": "Hauptballast Steuerung",
    "0C1369294C9CECDCA9A2A9BFF55D8377": "Wartungsausrüstung",
    "BE3131BD41E6F6A39447329C32917188": "Wartungstunnel",
    "13FF02AA490A8D7FCF87BE88A651CBCA": "Großoffensive",
    "21B75FDD49E8283C5AE14BBAEDBB9872": "Öffentlich machen",
    "0BAA828B4103D201AAF356891DB432D4": "Reserviertes Vorratslager verstecken",
    "418CBBF34A74487571404EBA8AB243AC": "Reserviertes Vorratslager sichtbar machen",
    "EBB6FF0340AB4B2D611ED0924892B700": "Denke daran, die vorgezogene Basis mit Soldatenvorräten bzw. Soldatenausrüstung zu versorgen.\r\n\r\nZu Übungszwecken wurden dir selbige Vorräte in diesen Kisten zur Verfügung gestellt.\r\n\r\nDu kannst sie mit der \"{0}\"-Taste öffnen.\r\n\r\nMit der \"{1}\"-Taste kannst du einen einzelnen Gegenstand und wenn du gleichzeitig noch SHIFT drückst einen ganzen Stapel entnehmen.\r\n\r\nDie rechte Maustaste öffnet ein Kontextmenü.\r\n\r\nDie 'STRG'-Taste in Kombination mit einem Linksklick teilt einen Stapel in zwei gleiche Hälften auf.\r\n\r\n'ALT' zusammen mit einem Linksklick lässt den Gegenstand auf den Boden fallen.\r\n\r\nDie gleiche Steuerung gilt für das Legen von Gegenständen in deinen Rucksack oder andere Strukturen, welche du beim Versorgen der vor dir liegenden Basis verwenden wirst.",
    "ED64C5C24077B959A3D447A88C243906": "Massenproduktionsfabrik",
    "68D6C1E748A103D0A695CC863AAD7070": "Materialpalette",
    "82E83E844856E73FD44A93B16E956026": "Materialtransferstation",
    "C776334E42EE0B3A70C7BCA08985DD60": "Materialien Fabrik",
    "3C489B0749F6DF4A3056FB95246871B5": "Sanitäter",
    "8AEBE5904E3ED7D827D57DB87FD31B79": "Sanitäter Uniform",
    "24F8AD7D4FDE265C6AF464A2D54D4711": "Erste Hilfe",
    "E2B0C7674DBC863F0E23E8A82D32B27E": "Sanitäter-Station (Stufe 1)",
    "A02D9C0147824BDEEFF78DBD16AC69AD": "Sanitäter-Station (Stufe 2)",
    "9CACCF434C602968AF451B80FE65F866": "Sanitäter-Station (Stufe 3)",
    "848B7DCE4B91187BAC764B966CEBE50E": "Stahlträger",
    "A1A86EF042657683CB7010B6656CE2E3": "Metallpresse",
    "AD66D050433091A7C8FDB2A1B361A353": "Metallträger, die zur Herstellung von Grundstrukturen und Fahrzeugen in Fabrikanlagen benötigt werden.",
    "C9D214BD494A1340BF6ACD90CE2DE718": "Massive Metallfässer, ein Umschlagplatz zur Lagerung verschiedener flüssiger Kraftstoffe, die in und aus Anlagen heraus transportiert werden können. Lagerbestände sind öffentlich.",
    "3C412CD74E6A9264E9C0A684751CE311": "Metallbau Fabrik",
    "565BE555409EA9717AFF8CB2BE11C4E8": "Sorgfältig konstruierte Legierungsträger, die für die Montage fortschrittlicher Fahrzeuge und Ausrüstung erforderlich sind.",
    "1561FE44404A7191D9DB8A9A975D758C": "Schrottminen",
    "EAEB308E4F14046B1EB4B58AE7C44D63": "Denkmal",
    "408A4C3846145221877C3E87DDE43CD7": "Mörser",
    "6B93E3CE46F78BC0E497E5914B37E09A": "Mörsergranate",
    "1BAA4FC441A303A5879934A4F1E33F5B": "Häufigste Warden Infanterie Uniform, entworfen für die allgemeine Kriegsführung mit ballistischen Waffen wie Gewehren und Maschinengewehren an vorderster Front.",
    "D21852374C0B433C37CDD39F6FBB7279": "Fuhrpark",
    "06274E914F174833CFD85E951FE0B9EA": "Motorboot",
    "66757AE346443F370CBC3292858E142A": "Motorboot",
    "B734852642166FF8CC797192E3C20883": "Motorboot",
    "D0643368477BCA32F57B718BC51137DB": "Montiertes Panzerabwehr-RPG",
    "83A1D52A4F7274E908B85686B3C5B5D3": "Montierte Panzerbüchse",
    "1C90DF354FAD1196EE79099BEE5437DC": "Montierte Bonesaw MK.3",
    "55BFB5094F3A43DA9B04E2B5376871E0": "Montierter Sprengladungs-Detonator",
    "082A52A34CD537E02CA62B8467CC77A4": "Montierte Fissura gd.I",
    "7C04A994408BD6FD9775599FC51FA245": "Montierter Granatwerfer",
    "EF9D8CEA4BF99F4E49F819A4D55F8E45": "Montiertes Infanteriegeschütz",
    "692C46D74E3DDE237B60668B506FDCFA": "Montierter Raketenwerfer",
    "31194C524128B94E3C903583FA559E9E": "Mysteriöse Struktur",
    "42AABD3147EC975BB10C86A114F8E216": "Benannt nach den Bäumen, die bei der Entwicklung dieser zerstörerischen Waffe zu Schaden kamen, verwendet Willow's Bane brennbare Chemikalien, die in einem konzentrierten Strahl durch eine offene Flamme geschleudert werden. Diese flüssige Flamme entzündet die Stellungen und Garnisonen der Colonials, um die Infanterie in die Flucht zu schlagen und ihre Verteidigung in Schutt und Asche zu legen.",
    "3D5C5E1F41D2106BED8F53974091D76E": "Die Fregatte der \"Blacksteele\"-Klasse wurde nach dem unbemalten Erscheinungsbild eines frühen Prototyps benannt und ist ein äußerst wendiges, wenn auch kleines Schiff. Der Einsatz von „Trident“-U-Booten durch die \"Republic Coastal Legion\" (Küstenlegion der Republik) führte dazu, dass das Caoivish-Marinekommando darauf mit der Blacksteele reagierte. Die als U-Boot-Jäger-Eskorte konzipierte Blacksteele zeichnet sich dadurch aus, dass sie U-Boot-Angriffe gegen größere, weitaus trägere Schiffe vereiteln kann. Der leitende Schiffsbauer des Projekts war kein geringerer als Conor O’Briens Top-Schützling Rory Boyd, der in seinen späteren Jahren als Schiffsbaumeister bekannt wurde und weithin als der Mann hinter dem Weltklasse-Ruf des Caoivish-Marinekommando galt.",
    "9FF93FAD4D5B505F5CA208B8F7FC0A53": "Schiffsrumpfsegmente",
    "8327AFDA4620DBE34D0567BD323D4A2B": "Marinepanzerung",
    "C7D6417747F4D15585A5A88A21F10EC2": "Marine Turbinen Komponenten",
    "41EF26954903230764250F868ADB85D0": "Marinewerk",
    "AFE3EC3141AD90EADB4A609EA5ADDAD6": "Marine Pier",
    "831E469040F0CB2CBD98F7BB834AA50C": "Negativballast Steuerung",
    "47219DCA444620491F9F2E815C73C5DA": "Niska Mk. I motorisierter Waffenträger",
    "AEA3035D40B36D003D17A9AFFD9FE831": "Niemand zum Wiederbeleben...",
    "EADD53AC4D23AB75789765B76AED58AF": "No.1 “The Liar” Maschinenpistole",
    "E428C82742147B65A32BE383EDC73ED7": "An dieser Stelle ist das Ausheben nicht möglich",
    "C43A8475409CC002327759AB0441BDC2": "Nicht hilfreich",
    "A1AE84AF44F3AA89CE991A934595AE15": "Um von seinen Gegenstücken nicht übertroffen zu werden, ist die 2a-1 \"Ruptura\" mit einer 75mm Kanone ausgestattet. Die \"Ruptura\" ist ein starkes und effizientes Panzerabwehr-Werkzeug, das entwickelt wurde, um dabei zu helfen, die Stellung für längere Zeit zu halten.",
    "D903D1344D34B8A7CA643A9718FDC26E": "Nichts ist mit der Effizienz und der Zerstörungskraft der Colonial Panzerdivision vergleichbar. Die Panzerbesatzung ist mit robusten Overalls und Gürteltaschen ausgestattet, die den Zugang zu den für die Wartung und den Betrieb des Panzers erforderlichen Werkzeugen erleichtern.",
    "88BAFE634EC3D0BFECA8FE91CB5DA7C8": "Beobachtungsbunker (Stufe 1)",
    "11322B8A4F07DE6381AAE8B7AF73CE2F": "Beobachtungsbunker (Stufe 2)",
    "9165FDDA453ECB943EB77788C065E4F8": "Beobachtungsbunker (Stufe 3)",
    "F62892A14508665628B6A9BDE279D2BF": "Beobachtungsturm",
    "BE55BE3542BA5C1156371F94959D0996": "Gelegentlich werden Sie beim Abbau von Ressourcen andere Materialien entdecken, wie beispielsweise Eisen oder Aluminium.\r\n\r\nDiese Ressourcen können zu Legierungen veredelt werden, die dann zur Erforschung neuer Waffen und Fahrzeuge an das Ingenieurszentrum in Logistikstädten im Hinterland gesendet werden können.",
    "BE8C7AA34D4A75F9A617118735A9BBF6": "Besetzte Stadt",
    "A492C59241101AFA893911ABE85CD3D4": "Eine der vornehmsten Abteilungen der Legion sind die Grenadiere. Sie sind mit speziellen Rucksäcken und Taschen ausgestattet, um ihre Fähigkeit, Sprengstoff zu transportieren, zu maximieren.",
    "EB05984D441EF97815BA78BCBF6886E9": "Offizieruniform",
    "844B4C914A5CF5D0CE0D59A2DF32210A": "Officialis´ Attire",
    "7DC9E23F44237A766B3DB79D7C2C63B8": "Bohrinsel",
    "222115714A24BD2DB20DEBB15557F2C8": "Bohrinseln sind Freiwasser-Fabrikanlagen die verschiedene Öle extrahieren. Da das Extrahieren der Materialien vom Meeresboden ein komplexer Prozess ist muss für bestimmte Operationen auch ein stabiler Vorrat verarbeiteter Kohle vorhanden sein.",
    "19640F8242B75CD52968AF91F2B06169": "Öl",
    "663CE0194E91F6C0425769AB380A7DD3": "Ölfeld",
    "EE4F6EC04863D4B293FFAB8C17A20AAE": "Ölraffinerie",
    "2C355BC64C5D5D2FC051CC9C755B0B2F": "Ölpumpe",
    "CE9FA4504D244C1F45048597B5A976B0": "Öl, das für fortschrittliche Fabrikanlagenprozesse gereinigt und angereichert wurde.",
    "EE12DA2B4EBF3A35C01EFD80EE885B8B": "Die Verwendung von Deckung bietet nicht nur Schutz, sondern erhöht auch die Zielgenauigkeit und Stabilität der Waffe. \r\n\r\nBehalten Sie das Schildzeichen am unteren Bildschirmrand im Auge. Der Boost hängt davon ab, wie \"tief\" Sie in Deckung sind.\r\n\r\nWenn auf Sie geschossen wird, werden Sie schließlich unterdrückt, was den Stabilitätsschub verringert und schließlich ganz zunichte macht. Im Freien unterdrückt zu werden, wirkt sich weit negativer auf Ihre Stabilität aus.\r\n\r\nSie können AI-Strukturen unterdrücken, indem Sie auf sie schießen, was deren Feuerrate verlangsamt, oder sogar stoppt und sogar verhindert, dass Spieler aus ihnen herausschießen bzw zurückschießen. \r\n\r\nTesten Sie die Deckung an den verschiedenen Stellen des kleinen Walls vor Ihnen. Versuchen Sie, auf den Infanterie-Unterstand/in Englisch \"Pillbox\" zu schießen, bis dessen Flagge anfängt weiß zu blinken und damit anzeigt, dass er unterdrückt wird.",
    "AACD73E5404D68218A243AB39778B5B7": "Sobald Du einen ersten Graben oder Bunker gebaut hast können weitere Schützengräben- oder Bunkerabschnitte daran einrasten. \r\n\r\nVersuche neue Gräben an den verschiedenen Seiten des Ursprünglichen einrasten zu lassen. \r\n\r\nUm einen „T“-förmigen Schützengraben zu machen, drehe die Baustelle auf der langen Seite eines bestehenden Grabens. \r\n\r\nVerbinde neue Bunker, indem du einfach neue Abschnitte einrastest.\r\n\r\nSchützengräben können auch von Bunkern aus verlängert werden. \r\n\r\nHalte \"Shift\" gedrückt um das Einrasten zu unterbinden.\r\n\r\nSeparate Schützengräben können mit dem dynamischeren Schützengraben Verbinder verbunden werden.",
    "4CCC4E0A4D10CE052A75A8BE15E975A5": "Eine der besten Eigenschaften von Conor O’Brien war seine Fähigkeit, ältere Technologien in seinen Entwürfen zu modernisieren und zu nutzen. Der V.190 \"Knave\" ist das perfekte Beispiel für diese Philosophie. Ausgestattet mit einem zwar veralteten aber modifizierten Doppel-Granatwerferturm ist der \"Knave\" eine überraschende Kombination aus Geschwindigkeit und List, die den Feind schnell in die Flucht schlägt und oder zersträut zurücklässt.",
    "F50DE88D4A5FB04A6031F5B2BB6DAA12": "Eine der berühmtesten 0-6-2-Lokomotiven für den Massenmarkt, die von der Bassett Motor Society entwickelt wurden. Sein Herzstück, die kohlebetriebene industrielle Zugmaschine ist zuverlässig, ausreichend getestet und unglaublich langlebig. Das Vermächtnis des Black Bolt ist unübertroffen, da er die Bassett Motor Society bei der Belieferung von Ländern auf der ganzen Welt unterstützt hat.",
    "E03783F243DC4FFB8F9D71AFB2F84CB5": "Öffne Dockbereich",
    "3ED75B5C446190B15FEF75816C5BE9CB": "Öffnet den Dockbereich.",
    "37ABEF14452D28933B416FA267B7065A": "Bediener",
    "3627FCE942A0EC4348F4D0B0F2E360F8": "Ursprünglich als Modell für hochentwickelte Raketenplattformen entwickelt, erhielt der Jester seinen Namen als Reaktion auf die waghalsigen ersten Prototypen, die auf demontierte \"King Spires\" geschraubt wurden. Dieses ungewöhnliche Fahrzeug ist in der Lage bunkerbrechende Raketen über eine kurze Entfernung abzufeuern. Durch sein abgespecktes Fahrgestell kann es leicht bewegt werden, ist aber dafür etwas anfällig für Sabotage.",
    "DE0F057C4EC283B2D701F0A0C673783C": "Vorrangig wurde der Outlaw als Antwort auf die immer zahlreicheren Mesean Panzerschwärme entworfen. Bei ihm handelt es sich um einen außerordentlich fähigen mittleren Panzer, der mit einem 40mm Geschützturm ausgestattet ist, welcher selbst auf lange Reichweiten noch effizient genutzt werden kann, zusätzlich bietet er ein montiertes Sturmgewehr zur Unterstützung.",
    "82DCBA4C4DA4BAEA6ABDE78DBFDF1A92": "Kein Blutplasma mehr",
    "858246904EA9CB58D46AE1B303D3FE6C": "Outriders Mantel",
    "CCAFB9B046FDB9D6592995B23949B491": "O'Brien V.101 Freeman",
    "9E7160C444A9A8FC54C680B7EDAEAA8E": "O'Brien V.190 Knave",
    "B1009FD94E96F33A56106C8F696CAB9E": "PT-815 Rauchgranate",
    "A46EC4D2431C5B04200D19B3E5C87D5B": "Versandfertig machen",
    "4694E54448F16D33A72F769C96940628": "verpacken",
    "7336A0D849EE71D00D2444887982DC53": "Verpacke die Ausrüstung im Ladebereich",
    "03936AFA4F1D5152A03D6E81539B7A70": "Verpackt das Liefergut, damit es von bestimmten Fahrzeugen bewegt werden kann.",
    "1AD811F8444E4C52150284A7A93E3755": "Verpackt das Liefergut, damit es von bestimmten Fahrzeugen bewegt werden kann.",
    "27A7676F4E6A3EBDDAED359E5E673784": "Für den Transport verpacken.",
    "E3AABA6F423A53A9336B29ABE7ECA304": "Gepolsterter Maschinenraum-Anzug",
    "75EE3E7E457290010840959DB6403915": "Vorratskammer",
    "41A1785D4CCADD24D847ABB5CE523DF2": "Passagier",
    "90CBF9434D8C90F0DEC11B80AD7A99AD": "Passagier",
    "5369E1A84F6B26908AA4A894CBD8E09A": "Patrouillen-Motorrad",
    "01EFAF3D45DFE2603CAC7097851E6363": "Ladung für schwere Artilleriewaffen.",
    "B3E7F92F4F9B498D3E427685B143EBCC": "Ladung für leichte Artilleriewaffen.",
    "EA9A9C904D8E35E69F1CCF8E2D27F2F0": "Periskop Bediener",
    "0C739E1D4A83CEC5E85186A6C1AD7155": "Erlaubt den Zutritt zum Bunker vom Dach aus.",
    "12478EAB4CE62A389910328226C940E2": "Petrochemische Anlage",
    "3D321D484BE5C1D46A7248B3F9546D6C": "Benzin",
    "D2B4D0444D59F5D54F0AAF9A1FF441F8": "Benzinbetriebenes Kraftwerk",
    "EB2352AE478EED61B230ACB7EEC07D06": "Sanitäter der Warden Armee sind unvergleichbar. Ihre Uniform bietet eine Vielzahl an Taschen und Beuteln, welche dazu dienen ohne Probleme Erste-Hilfe-Ausrüstung zu transportieren und zu nutzen.",
    "3DF6455A4B74CC03B5EB3ABF3A7EA2BC": "Sanitäter Uniform",
    "B36C1FF2420C91471FFE51992BB778AA": "Rohr bzw. \"Pipe\"",
    "DC78D5364E0679EFE74112BA075B833A": "Rohrleitungswasserpumpe",
    "C34C8BF84C3A03BC0F712DAD1A51FD7C": "Pipeline (Über Kopf)",
    "9C33490D44084C0CE861649F1A8B5E55": "Pipeline (Untergrund)",
    "1E0788EE4A2F52EE7ED3EF8EF6DC9EF7": "Pipeline Ventil",
    "124818E1483DD291FCBCC387E4F7AC38": "Rohrleitungen und Ölpumpen",
    "186B2167494C1FA2A88F6AA00873675F": "Pistolenmunition",
    "254731D94200A388888EF6ACB0519A53": "Bitte wählen Sie alle Teilnehmer der Szene aus",
    "8D9EF6C54313E003A2525CA1B9B813E9": "Bitte wählen Sie die \"SphereReflectionCapture\" in der Szene aus",
    "BFB6CA2C407C9265D039A893D3B5CE1B": "Giftgas",
    "B89A8DC3412AE9D0315D5081AD542DD0": "Stromverbindung",
    "6AC6CB4645972A3EB08D62857CF7C4D4": "Stromleitung",
    "5044883B47634DF91999A988219C1898": "Stromleitungsverbindung",
    "7DACDE7544D2E40B360061A7B392888E": "Stromleitungsverbindung",
    "CE1C204246030C54EFCB8988F0140176": "Stromleitungsverbindung",
    "D72CE3E94F7487A69D2DF997D1ED6EB9": "Stromleitungsverbindung",
    "379622544742EF557AD1F0A96130CE84": "Strommast",
    "4D50B52B48B956C73491CF967D25CFA7": "Kraftwerk",
    "FC75427A4FF4A66AAC70D68BAA62202B": "Stromschalter",
    "80A8775D432A25ABB71DCEB4F685B149": "Energie und Beton.",
    "3A5812F147C2653496AA29BD2B69E18D": "Strom zum Einschalten von Garnisonsscheinwerfern und zum Aktivieren von Superstrukturen.",
    "4B255F8543C9C3F3EAA4B4822EEB75AE": "Angetrieben von einem leichten Grouper-Motor der Bassett Motor Society, ist dieses einfache Holzboot ideal für den Transport kleiner Gruppen von Infanteristen über Flüsse und zwischen Inseln.",
    "198D40AC4EAF3CF14B62DA9C3F94A99C": "Vorbereitetes Minenfeld",
    "A196727E40488AF3107A87951A16D84A": "Vorbereitetes Minenfeld",
    "666BA3394B49F1F45D0C8D99DEB50E60": "Drücken Sie \"{0}\" um in Fahrzeuge einzusteigen. \r\n\r\nSie müssen (nicht unbedingt <- die Tutorial-Information ist hier leider veraltet, bzw. das Tutorial ist hier unvollständig, frage daher besser im Chat nach - Anpassungs-Ticket an die Devs eröffnet) neben dem Sitzplatz stehen, in dem Sie einsteigen möchten. \r\n\r\nIm Fahrzeug können Sie aber meist den Sitzplatz nachträglich wechseln, indem Sie \"{1}\", \"{2}\", \"{3}\" etc. drücken. Das Wechseln des Sitzes funktioniert nicht unbedingt bei allen Sitzen im Fahrzeug. ",
    "60427A5F4BC426CEE371C688D55522BB": "Drücke \"{0}\" um zu sprinten. \r\n\r\nFalls du dich verlaufen hast, kannst du die Karte mit \"{1}\" öffnen. Während du in der Kartenansicht bist, kannst du mit 'Mausrad' zoomen und klicken um die Karte zu bewegen.",
    "836DAAAF4B7BA5693722999E2AED16D5": "Drücke die \"{0}\"-Taste um niedrige Deckung bietende Hindernisse zu überwinden, seien es jetzt Sandsäcke, kleine Zäune und oder Steinwälle.",
    "8510E6D94D838BE28E709BB15EE2D8CF": "Drücke 'E' zum Lesen.",
    "9F5B16B3459DAF29AFAE5B91F6C242EB": "Verhindert den Verfall nahegelegener Strukturen, wenn dieser versorgt wird.",
    "77F811F14E7B168F64825D85B52CB85C": "Verarbeitetes Konstruktionsmaterial",
    "E3AAFF5E4CA5596CACB8C08647348BD4": "Verarbeitungsfässer, die Kohle zu Öl veredeln.",
    "B3F8474B4C8254DD9CA773BFDA513167": "Produziert großkalibrige Kampfmittel für deren Einsatz in Panzern und Artilleriegeschützen.",
    "41F71601424CF96B828D7A9D47E8E040": "Produziert verschiedene Arten von Munition für mit Raketen bestückte Fahrzeuge und Strukturen.",
    "2DCB8DDB48017DEAD95A5A937A75BE41": "Stellt verschiedene Arten von Dreibeinwaffen her.",
    "6E5DDF09409408E832AF3CBB62442397": "Schützt vor Giftgas",
    "3CAB8CCE4CE4EBDF9DE04588423DD05C": "Prototyp Bausatz",
    "A9A5EC724303F2184C6F47B9A20217F8": "Prototyp Bausatz",
    "233714384EF32F65D260B4BB2B75F80E": "Prototyp teile zur Herstellung von neuen Ausrüstungstypen.",
    "863E62E54DCD9AE449D147BE06F9B7BA": "Bietet einen Direkteinstiegspunkt für befreundete Streitkräfte. Ermöglicht es Soldaten, sich von der Heimatregion aus direkt zu dieser Basis zu entsenden.",
    "1F61B0004D61359DE18DEDA955506DEF": "Bietet Deckung vor Gegnern, die den Bunker betreten haben",
    "5F8D8E0D4B9700A47014F98555B0438E": "Bietet Deckung vor Gegnern, die den Bunker betreten haben",
    "D55060854349797457E63CAC4B5266B3": "Bietet Deckung vor Gegnern, die den Bunker betreten haben",
    "9CFA53A04AAB8F7D59D78A9065DF03E9": "Ermöglicht es Fußsoldaten, den Schützengraben einfach zu betreten und verlassen.",
    "287E6E724D49CDDF62A27B893324AA9C": "Erlaubt den Zugang zu diesem Bunker.",
    "8B10170E4F33E86CBECDA687A7A67154": "Erlaubt den Zugang zu diesem Bunker.",
    "F64922064BB5F5EE7E927C88240BBD0B": "Erlaubt den Zugang zu diesem Bunker.",
    "8F45600C4A6DE4B169381380331AB9A1": "Provisorische Garnison",
    "A0CF09784A6FDF3703E0238FA6E5941B": "Provisorische Straße",
    "77A87BFB4656E13D28430D80699938EB": "Pumpt Wasser durch Rohre. Muss auf Gewässern gebaut werden.",
    "22559E0249F1D9A4B4F1E98492E04F15": "Feuerlöschen",
    "682A410049D9A602187B0F9C45E31028": "Die Colonials sind an das gemäßigte Klima des Südens gewöhnt und tragen diese Jacke aus Wachstuch zusammen mit dicken Stiefeln, um bei jedem noch so heftigen Sturm effizient arbeiten zu können.",
    "CEEA736D4F63F93274F9F4B5652026DF": "R-12 - “Salus” Krankenwagen",
    "1FBCBCA34E539F85603E14976D9E0576": "R-12b - “Salva” Feuerwehr",
    "1A0289614E9238A19A5EB6919A6BD55A": "RPG Munition",
    "A02D90114437558DB0FFC2B1D0CD65C9": "RR-3 “Stolon” Tankwagen",
    "7882040A4E9DD011B5595396C7678DB9": "Funkgerät",
    "203F155C462839AE5CE288857F52D683": "Rucksack-Funkgerät",
    "11B5651547E72A8A3D82DCAB82416054": "Funkstation",
    "55525820404120F931A25FB3ED589AB7": "Funkstation",
    "58AEFCE54F8E98F2E6AA65AB7604DF4C": "Eisenbahngleis",
    "35E8903B4FEE62FC2F42A8A286BE2253": "Eisenbahngleis (Biarc)",
    "4413370E406D5CD49703D48F1A25C186": "Eisenbahngleis (Biarc)",
    "90CE9F4447D926485D79C3B74325CC63": "Eisenbahngleis (auf Fundament)",
    "CB9BFB744A8A0E2CCA37BF89725F19B4": "Eisenbahngleis (auf Fundament)",
    "F86480E64BFE40A6C69628B0D1C4584C": "Regensturm",
    "B624938C40D0C8908A11598A62E21641": "Seltene Legierungen",
    "D09BE2244DF9D9BE4934C29DE427E2A6": "Seltenes Metall",
    "24E8024C42E83507ACBC9D966442C164": "Schild lesen",
    "61469E5549BF60D9BE0C0687A36E0B03": "Schild lesen",
    "89379DD942E913A7636BA3B45E7F1D2A": "Schild lesen",
    "B1367643468F5BD3334E01A278B08341": "Schild lesen",
    "7727A7E94F29E56EB088A6B7CFEE1F00": "Plakette lesen",
    "48EDBB7147EB5FE9076D49988AAFA9EB": "Empfängt aktuelle Kartenaufklärungsinformationen",
    "B53C95C64C4ACBD9FD9547AED07D8C8D": "Späher Tarnkleidung",
    "7B14805B4515430A6FC8B4B9CA1871A9": "Verringerter Schaden an Schützengräben",
    "84E6D20D46064C6668E1BFA6133F9120": "Verringerter Schaden an Schützengräben",
    "9B9CF76243BAC0B3EC597EBC7EB330CF": "Verringerter Schaden an Schützengräben",
    "C0D4E8084AE9E5A1C4A490A4D7D4A42F": "Raffinierte Kohle, die für verschiedene Anlagenprozesse benötigt wird.",
    "964344C74C8342461DA2C8B341121701": "Veredelte Materialien",
    "7C5055A34306F42B649CF29F6C0292A8": "Veredelte Metallbarren, die zur Herstellung fortschrittlicher Strukturen und Fahrzeuge in Fabrikanlagen benötigt werden.",
    "BD756A6244CDA9F2EE9D38B4E428F2D8": "Raffinerie",
    "D2170AA740CF4177019D7598C7BAE7B7": "Raffinerie",
    "5EEE3A3B4EC1A7ED5D703F9FE5BAFAE3": "Reservierungen auffrischen",
    "3B89366345C4FA458F38C59488BAAC90": "Reserviertes Vorratslager aktualisieren",
    "F00954E5483B0E6983A01A94535E1055": "Verstärkt die Außenwände des Gebäudes und verhindert, ab einem bestimmten Punkt, jeglichen Schaden, es sei denn, die kritischen Stützen innerhalb der Struktur werden beschädigt.",
    "BA34A1504540E1C723EB278332599B0A": "Reserviertes Vorratslager öffentlich machen",
    "9939E62745B383B1EAE8F88AE69B05CF": "Gibt die Ausrüstung für das öffentliche Vorratslager frei.",
    "5D808EA043600A821616ABB9064DD4DF": "Reliktpanzertraktor",
    "26AE3CA94C1D9C8B101C4DA0B27B9542": "Relikt Sturmpanzer",
    "3DFA137548BC3989A80FA1BE5C874960": "Reliktbasis",
    "1E2D4B44417842CE5ADFF2850BD214DA": "Leichter Reliktpanzer",
    "BC080A664D772FF047FB29ABFC533C59": "Relikt-Materialien",
    "9797954F4F595C1F1E0ED5AC8FDE80F4": "Reliktlastkraftwagen",
    "C6EB4A374C74BC8F9E47388F83F7BDBB": "Reservierung aufheben",
    "EF2885BD4BEA3FB4B63BB5A371B647F2": "Entferne alle Mitglieder und löse dieses Regiment permanent auf. ACHTUNG: Diese Operation kann nicht rückgängig gemacht werden.",
    "A3E7A1B94A9A46FBF3AACFA70276323F": "Entfernt die am nächsten angebrachte Dreibeinlafettenwaffe.",
    "538987FB41DB7DA27AE04A86EB001B65": "Repariere",
    "A00E5DE6442055A1DBEE2CB17FF2BBBC": "Überträgt Feindbewegungen aus unmittelbarer Nähe an die mit Funkgeräten ausgerüsteten Spieler",
    "0CA94AFC4D90B50CC3635F912B396CDB": "Umfunktionierter Lastkraftwagen",
    "14734E1441AD3F2D3F5736B465F0B518": "Diese, aus alten Kriegen stammenden, Plattenpanzer wurden zu einer Grabenrüstung umfunktioniert, die auch sehr effektiv darin ist kleinkalibrigen Beschuss abzufangen. Dieser extra Schutz kommt leider mit einem hohen Gewicht einher und schränkt den Träger deutlich ein. ",
    "564E30B04DD216CDF4637782A446A0E1": "Erforderlich, um \"Havoc\" Ladungen zu detonieren. Die \"Havoc\" Explosivladung muss platziert werden, bevor der Zünder eingesetzt werden kann.",
    "AF1B7A034F1EAD11DEEF83A57F596B1F": "Reservierung System",
    "9B77C6FB4FD38E4223DF3896281B11EE": "Für die aktive Gruppe reservieren",
    "DF6832A44E1855CECD701B93FDFB5726": "Für die aktive Gruppe reservieren",
    "375D7CD84DBF0AF587ADD1A480E2F311": "Für die Gruppe reservieren",
    "FA295505471D354F4C279F8C77046DE7": "Für die Gruppe reservieren",
    "B15400FD4480235C31383C88F57298D9": "Mehrere reservieren",
    "7B17FA48428E34E8A16F399988B2D1C3": "Stromspeicher",
    "80262EC14116DEB9A0A52388D4C6EBA2": "Stromspeicher",
    "FC2AA8E44F8A5EDDE408C491E93D9309": "Passwort zurücksetzen",
    "A9FA41214C4940AA99B96D8C4C6841B2": "Setzt die Ablaufzeiten von allen verfügbaren reservierten Vorratslagern zurück.",
    "32B13E984EC7FD17460BC2846509EBBB": "Setzt den Zahlencode für diesen Reservevorrat zurück und widerruft zudem jeglichen Zugriff.",
    "6D103E044CC5EA36B2862FAF0EBF6DBE": "Rohstoffkiste",
    "645260194768CFE6B510E38EA6DEC620": "Rohstoff Container",
    "F6FC895F40774A018359F9BC423990D2": "Rohstoffsammler",
    "5E22DF22438E32BA5D1B28A564E722F3": "Ressourcen Training",
    "AA79F755487A6E61B35B1BA49AE433EF": "Ressourcenausbildung",
    "6147E0B3480979F73A3F85B922D685DD": "Rohstofftransferstation",
    "0C4533A44DFA9CC271010CA96A95F9D1": "Ressource welche für den Bau von Straßen und Fundamenten gebraucht wird.",
    "D506B5FD47C0B9A3B5D9C5B8361DE488": "Ressource, die für den Bau von fortschrittlichen Strukturen und speziellen Gegenständen benötigt wird.",
    "63DAF590439D5D73B0C4C9B1B4F8CF43": "Eine Ressource, die zum Bau von einfachen Gebäuden und Gegenständen genutzt wird.",
    "C19CCA2F41FDEFFC10683A890F0115FA": "Ressource, die für die Produktion von explosiven Waffen bzw. explosiver Munition benutzt wird.",
    "A504F8984C562CEC686E90B9263BB755": "Ressource, die für die Produktion von hochexplosiven Waffen benutzt wird.",
    "1A74322C4B604CD5CC9082A7A329AA10": "Ressourcen werden genutzt, um alles herzustellen: von Munition über medizinische Vorräte bis hin zu Panzern.\r\n\r\nNimm deinen Hammer in die Hand und verwende ihn mittels \"{0}\" gegen Schrotthaufen. Sammler (große Abtragungsfahrzeuge) können ebenso benutzt werden um Ressourcen zu sammeln. Komponenten und Schwefel können nicht mit einem regulären Hammer abgebaut werden, für sie werden Vorschlaghammer oder besagte Sammler benötigt. Du kannst übrigens Vorschlaghämmer gleich hier in der Nähe in der Kiste finden. \r\n\r\nJeder Gegenstand verbraucht in deiner Produktion verschiedene Materialien, die aber zuerst aus Rohstoffen raffiniert werden müssen.\r\n\r\nSammle einige der weiter vorne befindlichen Rohstoffe. Du kannst sie auf einen der bereitgestellten Lastwagen laden und sie zu der nahestehenden Raffinerie bringen.\r\n\r\nDort wirst du ebenfalls eine Fabrik vorfinden, um die raffinierten Materialien zu Ausrüstungsgegenständen verarbeiten zu können.",
    "ADEADD7841513BA9D876B987D8873E52": "Ressourcen kann auch durch Abbau erworben werden.\r\n\r\nRohstoffminen benötigen zum Betrieb Treibstoff und erzeugen im Laufe der Zeit automatisch Ressourcen. \r\n\r\nWelche Art von Treibstoff verwendet wird, bestimmt die Effizienz der Mine. \r\n\r\nFür Trainingszwecke wurde Treibstoff in einer Lagerbox in der Nähe bereitgestellt. \r\n\r\nKlicke für weitere Informationen auf das „?“-Symbol in der Ecke des Minen-Menüs. ",
    "69D02ADF41C00920BC8C55B4606006B7": "Patienten abholen",
    "6F8704274D00A2A6C4CD0E93D4560945": "Ausrüstung Abholen",
    "9DD10CBE4FB59CF1842847B34A87F181": "Bringen Sie den Wasserstand wieder in den Normalzustand und beenden Sie die Reparatur.",
    "2234EB4E4BD90C64BCF4D4BD5CA1091D": "Wird wiederbelebt...",
    "4EB0EE2E4B1492B5B6D9D3AE877A6EA3": "Revolvermunition",
    "10C68B5E4BB769968137B0BC408CD4A0": "Gewehrmunition",
    "AF001371424A286E942DCC860760278C": "Schützenbunker (Stufe 1)",
    "075868EB4E94FD51FD380F8C381DBD37": "Schützenbunker (Stufe 2)",
    "42EEA7854D28A34A1AF60E82A560C939": "Schützenbunker (Stufe 3)",
    "D96BE66A4A0B3DCBD89C599748F59F5B": "Gewehrunterstand",
    "60EE65154F4BCE6F74E6D6B493A64D58": "Gewehr S",
    "A87BF94843794987636CFCB63939103B": "Langstreckenrakete",
    "B585C67849600DA80772ACB071952CFB": "Raketenbatterie Werkstatt",
    "C4080A27459B901F3D243EB3FA8099EE": "Raketen Ground Zero",
    "8A45620B4F96D41204955FB73AA2C3FA": "Raketen Ziel",
    "08151D0642DC1E8836613682BB961F4F": "Unterschlupf",
    "39EA8D5F433B7A38700E7BB3C46862A5": "Unterschlupf",
    "3CEAF83648F676DB8CB431B02451461E": "Unterschlupf",
    "404334B8403C9E3A2287C1B00F64170C": "Sicherheitsballast Steuerung",
    "988F4FAA476CA69FC27EFD9FB02DC6A7": "Schrott",
    "94EA0585470D4FC455D802A36F5B4DA4": "Schrottfeld",
    "9A3374E243514176D6E8C89DE671639B": "Schrottmine",
    "FFF91C3540533ECCF2D46EA90D1100F6": "Schrott, aus welchem in einer Raffinerie andere Ressourcen gewonnen werden können",
    "023A1A44419A8DCFE45230A0A9BB15A8": "Sampo Automatikgewehr 77",
    "E6DCD38B491324D8D006BA970DC00C70": "Sandsack",
    "442E5D434410A70B0829D39B1B23BA32": "Sandsack Wall",
    "3277B2694BA3B6C9005989849F22FAC6": "Sandsack-Wall",
    "1F8EF85844956D33889CD2A8CCA6F273": "Sandsäcke",
    "48B66EE041A2F7B1E8D9E4911C544F41": "Sandsäcke",
    "37B739C040326A295FBAD29A69980A24": "Sandkasten",
    "66B0E0E4463094D80CF8E18B6331D5B4": "Pionierausrüstung",
    "5BE2AA79466E620400AC6482093AD4A1": "Speichere Auswahl",
    "C6572999441BBB31A9B52AA5A8D3E687": "Speicher und vermerke alle aktuell ausgerüsteten und Rucksack Gegenstände für später.",
    "085EFC314A5ED7E6AE5689B0618A8C76": "Verteilt Euch",
    "0B3D2EA049369C0D3FD8F396D7B613F1": "Spähpanzer",
    "F07C33B944902581150548A9AAF7F565": "Spähpanzer",
    "FC650B6C4EF1535986D761B04AAF89FD": "Seemine",
    "68D59DCE485CB775AEE12EB44299E838": "Seehafen",
    "FF73F38B42484E3E1D06C496753F7A0E": "Echolot Bediener",
    "DFE2613E4B8ABE897743AEAC4ED2EA6F": "Die \"Conquerors\" dienen an vorderster Front der \"Republic Coastal Legion\" und machen ihrem Namen Ehre. Diese Ungetüme sind mit Waffen ausgerüstet, um Bedrohungen über und unter dem Meerespiegel zu bekämpfen, darunter eine spezielle Sonarstation und zudem Wasserbombenwerfer. Diana Geminus, war die erste Kommandantin eines Conquerors, nachdem sie schnell mit neuen Ideen zur Verteidigung gegen die, wie man sich erzählt, unwürdigen Bemühungen der Nordländer aufgestiegen war.",
    "06DBF90B4DD3240C1C40098DB1CFE015": "Deinen Wiedereinstiegspunkt setzen",
    "4F3E821E4FDA318CF08B058FD386F55C": "Geformte Stahlträger, die für die fortschrittlichsten Prozesse in Fabrikeinrichtungen erforderlich sind.",
    "B73B1D4D43DA9CB8DB0136BC11344A66": "Regale zur Aufbewahrung von Rationen, Vorräten und alltäglichen Werkzeugen.",
    "AC70734C44CA3C54CA0560A8605501EA": "Versandfertig",
    "445A7C634ED69D6D52C88E82EA77C058": "Versandfertiger Zementmixer",
    "11FE739244FAF8351552FCACBB9E2EC9": "Versandbereite Baumaschine",
    "A7F3B6EB4123CFC0FA416FA20171BF74": "Fracht-Container",
    "02A51A4F4CB0A44DEB11619062590179": "Frachtcontainer",
    "D058A4D446C86625165A51A257F46A11": "Werft",
    "9D09A3A146AC3E155096D1A43D1F9208": "Schießstand",
    "FCAFF62D41E098930CC6AC91EA1A0A5D": "Schießstand",
    "FDC400AE4D0E84CEEB23E28CC3021174": "Schießstand",
    "6E2396D34D5BB4F399460894228605EF": "Kurzstreckenraketen, die auf das Durchbrechen von Bunkern und der Beseitigung feindlicher Strukturen spezialisiert sind.",
    "052BCF5841333D1C3CC377A057A52E4C": "Schrotflintenmunition",
    "2DF761024848E3380A5A1186CE4EE625": "Schaufel",
    "A923DB774DBB0E5B5AA872A38AE17DD4": "Schrapnell",
    "82BF8D5B4E37F6DCABA5029156BC176F": "Mörser Schrapnellgranate",
    "A13110FE4D0F08DE3EE819A4ED437CE1": "Belagerungspanzer",
    "A197F0D64ADFF54553133EA38D4B2F89": "Belagerungspanzer",
    "5A701006423EBFF956AC69A033696A12": "Schild",
    "FE03995B40473603D6AAC885C356B6D3": "Unheimlicher Seelenstein",
    "75BDCECF46934EAD9C0FF688FBA4A48E": "Vorschlaghammer",
    "01DACD804657A304B84552B0D7952670": "Verlangsamt feindliche Infanterie die versucht den Graben zu stürmen.",
    "E896C1614A3C0A02B95E33A55EE0E5DB": "Dient dazu, feindliche Fußsoldaten, im Versuch den Schützengraben zu stürmen, zu verlangsamen.",
    "A72B74744C2626A4D64CD7A7477004CB": "Kleinkaliberwaffenwerkstatt",
    "4FB16CB541D9FCA9974A1196EA097D00": "Kleine Montagestation",
    "BA5D14694F6EBC50DB9ACDA9841DB447": "Schmalspurgüterwaggon",
    "D72085A44C5EEA57347568B340632DAD": "Schmalspur Kipplore",
    "53787B52481BBFEF3FDCD2BD7563602F": "Schmalspur Lastwaggon",
    "4B3C13F94BE2C8B3746692A339A67DC2": "Kleine Garnison",
    "B0E0E1AA475B9C9CB80F739E843DF3AB": "Schmalspurbahngleis",
    "AB54351A4B0E35D06E641984B743B607": "Schmalspurbahngleis (Biarc)",
    "0FF966ED4A82F7C75C3F3EAE4F88F3E7": "Schmalspurbahngleis (auf Fundament)",
    "781A583A4DC82C26C74B0ABB7841568C": "Schmalspur Tankwaggon",
    "96AB0C5C45F9E3D456FDAEABD0AF8C1C": "Schmalspurbahn Lokomotive",
    "A09F66644EAC732CBE1BA9B67F0FC537": "Schmelzofen",
    "BEC08E1949B113CF432AFC95233EE8A4": "Rauch",
    "EFD138C94F4E6ACA0BAC20BABB58DDAA": "Einrastende Schützengräben",
    "08A2A0654E9646ADF476A3987B409B4A": "Schneesturm",
    "355D8D104EF58C36507C4DB1BC7EE9C0": "Soldatenausrüstung",
    "793748BA4CC8F2C2CB1751837CB12EF0": "Soldatenausrüstung",
    "CC8548A448DFF546A96E309678841337": "Soldatenrucksack",
    "2B8B7F1148548A936E6B2F94A562E096": "Einige Fahrzeuge sind bewaffnet und können mithilfe weiterer Teammitglieder großen Schaden beim Feind anrichten. \r\n\r\nAls Schütze benötigen Sie Munition im Fahrzeuginventar, um mit \"{0}\" nachladen zu können. Um sich an die Position zu gewöhnen empfiehlt es sich den Panzerwagen mit einem Partner auszuprobieren. \r\n\r\nJedes Fahrzeug im MMO Foxhole erfüllt verschiedene Rollen. Wenn Sie sich dennoch mal unsicher über die Funktionen von etwas sind, fragen Sie einfach nach.  ",
    "43C9867E4E3B5B3D6E3588AC743681DD": "Spezialeinsatz",
    "70003FDD4D67F7F978E61A9C5D8871AE": "Spezielle Ressourcen",
    "7F9002FE42143E7E4F63B0828656DC2E": "Spezialisten Mantel",
    "8CFFFD224396FD43CB02DB8F031218C5": "Spezielle, unter Zugabe von Kohle geschmiedete Bleche, die für den Bau fortschrittlicher Fahrzeuge und Ausrüstung benötigt werden.",
    "D56912E64A1A127922EAFDB69FD686BE": "Spezielle, mit Benzin angereicherte Metallstangen, die für den Zusammenbau fortschrittlicher Fahrzeuge und Ausrüstung benötigt werden.",
    "B4C7683A495ED66B32FCE8B1EBFF0B33": "Spigot-Mörsermunition",
    "E9EB179744897069222843A5CC03BD93": "Spigot-Mörsermunition",
    "17C2335C49DB89EA0BD85A810EFEA909": "Stabilität",
    "2858B95D477BE3616909268BA1A0170D": "Offizierlimousine",
    "C34A2FB94857EC9D681AF892CC709B74": "Offizierlimousine",
    "4C1C4A0B4F1B09604DBDF8A0A404000A": "Stiege",
    "A4220DDE4849335CD5B4C7A5F1EA43DB": "Treppe",
    "051641854BE178DDD204AF91A4B95291": "Treppen, die mit erhöhten Laufstegen verbunden sind, die Wege über komplexe Fabrikanlagen schaffen.",
    "9BBCA83C49AFD1EB1B2556AAF6B16DF6": "Körperhaltungen",
    "4A3D5405439242282D540AA77E2D234A": "Standardmunition für Schrotflinten.",
    "4AFE485746BDCB89EF2A16AE5CECF883": "Standardmunition für Sturmgewehre und Panzerwagen.",
    "BD8270B74380C56E45276E9E7E8F9426": "Standardmunition für Panzerbüchsen.",
    "D31A1FF745293A203BE77DA22EEBB595": "Standardmunition für Maschinengewehre.",
    "2C5595CA46B3170887D872B2F2F54571": "Standardmunition für Pistolen.",
    "A9DA31444CE32A93710583973166EF10": "Standardmunition für Revolver.",
    "3ABC7EBC4B512555E3DBA8AD24347CCF": "Standardmunition für Gewehre.",
    "7158D09B4ED91F7E9216D89DAB7C0269": "Standardmunition für Maschinenpistolen.",
    "D1548AD64E2FFE72656849ADCB43AFEB": "Standartkaliber-Rakete mit einer schweren explosiven Nutzlast.",
    "1DE572914DDA8E281BACD9915438413E": "Standardkaliberrakete mit einer Brandexplosion. Entzündet Objekte in der Nähe des Einschlags.",
    "AD9FC2BE4173A0DB094CFCBE92D33101": "Standard-Sprenggranate, die bei bestimmten kleinen Fahrzeugen und Infanteriewaffen verwendet wird.",
    "0CB0AF234F9F31685BA8ADAC7E4D0B24": "Die Standard-Pistole der Wardens. Das von einem Waffenschmied aus Nevish entworfene Ahti Model 2 ist eine zuverlässige Seitenwaffe, auf die jeder Soldat stolz sein sollte.",
    "9A6DA0AE460C590A50180B94CCA2E10D": "Die Standarddienstuniform der Colonial Legion. Sie wurde für den konventionellen Fronteinsatz mit ballistischen Waffen wie Gewehren und Maschinengewehren entworfen.",
    "B2358CD049AFFE980ED73C82A6BCE85F": "Standardmunition für Schlachtpanzer.",
    "9B3A3BC74C32D661B1C839BD38B1B105": "Standardladung für kleine Kanonen.",
    "F0DC8DD047EDA70763142A87D753AF81": "Standardnutzlast die mit den Storm Cannons genutzt wird.",
    "CBF9459943B64C6C8E11D4AA292255D0": "Standardgranate für Panzerabwehrwaffen.",
    "39355B634ECF285E119E119E05600D5F": "Standardmäßiger meseanischer Militärdolch. Seine lange, schlanke Klinge eignet sich hervorragend für den Nahkampf sowie für zahlreiche weitere Einsatzmöglichkeiten im Alltag.",
    "F1CB945245AA1CEFC60420A168B3E5CE": "Warden-Gewehr in seiner Grundausführung. Dieses Repetiergewehr ist so robust wie es nur sein kann und hat bereits mehr als ein Jahrhundert auf dem Schlachtfeld erlebt.",
    "533D7D4245ED3B754C6389B8AD37C383": "Stationärer Kran",
    "0B79039143E31337A3FE37B7C9CCB277": "Stationärer Rohstoffsammler (Kohle)",
    "3193D7AD409492DA9D7E549048AC026A": "Stationärer Rohstoffsammler (Komponenten)",
    "0866E2E4410561ACD0173EADA388F07C": "Stationärer Rohstoffsammler (Schrott)",
    "49F6320A42E76498200CDA99A782CABD": "Stationärer Rohstoffsammler (Schwefel)",
    "899CCE394D1CD3C5FA6F6CABEBD9B621": "Stahl-Konstruktionsmaterial",
    "8B527792437A4243830FC29706A49A8D": "Auftanken von einer nahen Quelle abbrechen.",
    "D2BA20A445410CFFC9C78B9F85ED8A31": "Gefechtskiste",
    "6DB4ABFC45B8FCD7F96B8BBEDA844760": "Lagerdepot",
    "9900BC104072715445127597CB3B16B7": "Lagerdepot Einrichtung",
    "0B894BCC45D5553B2373019737947734": "Lagerraum (Stufe 2)",
    "903CBC5C4DB8775BEA393C85D1047486": "Lagerraum (Stufe 3)",
    "D51F160B4175A8C18D3098A35D5F41EC": "Lagerschiff",
    "80FE424149FBDC1DC5458B8824C8A520": "Storm Cannon Munition",
    "7A4C1BF2407A3F2BEE023BA03D49F926": "Storm Cannon Teilstücke",
    "7AC7D1C84ECA532598277C84B7B969EE": "Sturmgewehr S",
    "8366FD1F48B499D05AEA7A980A5104BB": "Sturmpanzer",
    "57052C6B49A9A576E8768DA30903B338": "Strategische Karte",
    "D88C1B644C2C0C27B896F980A1374438": "Strukturkiste",
    "CEEEC598400AAF04665E9F8F1F5110D1": "Struktur Teilstücke",
    "319613AA4E24F741FCCF55B58D253EAA": "Gebäude Bergegut",
    "1D099E8045D6579643ECA5B095EBA317": "Gebäude und Spieler können Feuer fangen.\r\n\r\nVerhindern Sie, dass sich Feuer auf andere Gebäude ausbreitet, indem Sie diese mit Wasser löschen bzw. \"feuerfester\" machen. Nehmen Sie einen Wassereimer und füllen Sie ihn mit Richtung zum Brunnen. Drücken Sie dann \"{0}\".\r\n\r\nRichten Sie dann den Wassereimer mit \"{1}\" auf das brennende Gebäude aus und leeren ihn darüber, indem Sie auf \"{2}\" klicken.",
    "2A211FBC4AFE19F017F33AA53AEE3A78": "Maschinenpistolenmunition",
    "0B4B70F64D4072C42D87F190721BFC7B": "U-Boot",
    "CE7236AB46FB868883B90582D70DF74F": "U-Boot",
    "BD9BF6F94FA2065AC528F6B9C859F0CA": "Übertrage sperrigen Gegenstand",
    "2C5AFB1D4F92381ED13DD6ABC59E3BF4": "Übertrage die Ausrüstung aus dem Ladebereich",
    "B07DBC4C4BE06930EA53C480A2EBC43E": "Patient einweisen",
    "EA1D54C04DA274D8BD5C118DF3850282": "Übertrage deine Startausrüstung",
    "0201D35240A1D38F7B6B889B754BB27F": "Gegenstände aus dem Vorratslager einlagern",
    "D64EF3BC44CE2FABAA4ECBB8EAF5B822": "Übertrage Fahrzeug",
    "854D88434F54C8F105B699913FE7744A": "Überweist einen kritisch verwundeten Soldaten von dem Inventar dieses Gebäudes in das Krankenhaus. Soldaten können nur dann überwiesen werden, wenn ein leerstehendes Bett vorhanden ist.",
    "C4EB8C984A19BD1DD490CCAF9220B5C6": "Übermittelt die Ausrüstung vom Ladebereich ins Lager.",
    "0146D004490AC3150D0A4A9F23D6F35F": "Fügt Gegenstände aus dem Gebäudeinventar diesem Vorratslager hinzu.",
    "A97B377D4D65B419A582BEBD7D8EE8AA": "Überträgt die Gegenstände, die nach jedem Wiedereinstieg im Inventar des Spielers erscheinen.",
    "68876C9049BF21CDAA575DA9766993FC": "Übermittelt das Fahrzeug, das Sie gerade fahren. Das Fahrzeug darf außer dem Fahrer keine Passagiere haben und muss ein leeres Inventar haben.",
    "751850F4463C0223822544A4F3918231": "Übertrage deinen aktuell ausgerüsteten sperrigen Gegenstand.",
    "F546B4DD4883E4AF4C7FF59D6533F5AD": "Schwefel",
    "7F451D4442D7EE1241C7E49D1CD718EA": "Schwefelfeld",
    "820AE531463912B16EAE5F976C2FC0DA": "Schwefelmine",
    "80B758FE4E346EE2AC991085E2A8AE76": "Schwefel, der in einer Raffinerie zu hochexplosiven Schießpulver raffiniert werden kann",
    "FDF2D3094624CFB09EED95B3A0AEB9CA": "Mit Schwefel angereicherte Metallstangen, die für die Montage fortschrittlicher Fahrzeuge und Ausrüstung benötigt werden.",
    "86C830CF475A1F7961779CBE4F8D8022": "Schwefel Reaktor",
    "8E2344B74E1F94020521D28B189DF9A8": "Superschwerer Schlachtpanzer",
    "E67DC6294A30B98591EF8A9E28C95864": "Superschwerer Schlachtpanzer",
    "26BE69E14476BAC566418FAEF5981A0E": "Vorräte zur Wartung von Gebäuden. Verhindert den Verfall von umliegenden Strukturen, solange diese in Basen oder Wartungstunneln eingelagert sind.",
    "DAA0DD25433A2B62086644B379B83717": "Unterstützungsbunker (Stufe 1 & Stufe 2)",
    "AE1573994B153ED04FD89CAA3717AE1C": "Unterstützungsbunker (Stufe 3)",
    "925C5D6C49E62D09957BA488EDA21D50": "Unterdrückt feindliche Fahrzeuge",
    "821295C1473A530D7B78578A505EBE08": "Unterdrückungsfeuer",
    "9B0706D84171E947C9329182248ED082": "Überlebe für mehr als 1 Tag, während deine Fraktion weniger als 25% des Gesamtgebietes besitzt",
    "1B17069946CA8573587B88BA39E29B1D": "Überlebe für mehr als 2 Tage, während deine Fraktion weniger als 25% des Gesamtgebietes besitzt",
    "564F2BAB42C15509140750B7041BF5F3": "Überlebe für mehr als 4 Tage, während deine Fraktion weniger als 40% des Gesamtgebietes besitzt",
    "308E98C54020C1B935B9A6951714C6D9": "Schwimmen",
    "8F4F84214641CBC48D256AAD8E439F72": "T13 “Deioneus” Raketenbatterie",
    "B06CAE044DC4163948A50E87ECD326D8": "Panzerwaffenmontage",
    "1122285143C897768611A1B57A27BE56": "Panzersperre",
    "F1929C02492EE23B0E74E298A81B3B65": "Panzerbesatzung-Overalls",
    "03B7C25C48FF9FC5BA38F5801CB1CC7A": "Tempest Kanone RA-2",
    "59137A27421F416A8EB0B6B27FC1750B": "Testkurs",
    "86EF6C0D48C2CB0D740B7A9B6E1FC1FE": "Besten Dank",
    "9A7E36B74B8178096CDFB38CC56CC567": "Der \"Acheron\" ist ein gepanzertes Amphibienfahrzeug, das für den Truppentransport über große Wasserflächen konzipiert wurde, um koordinierte Strandlandungen und Flankenangriffe zu unterstützen. ",
    "B85728FD47AB02CB9CE5BD9F71F1092F": "Die \"Battering Ram\" ist ein mobiles Panzerabwehr Feldgeschütz, welches 68mm panzerbrechende Geschosse verschießt.",
    "F7DC4D4349BBEA58C3D503A2C46B621C": "Der \"Talos\" ist eine Velian-Modifikation der 85er-Serie, die mit einer übergroßen 75mm Kanone ausgestattet ist. Die Ingenieure wussten, dass eine so schwere Kanone wahrscheinlich nicht geeignet wäre. Sie tüfftelten so lange an ihr herum bis sie schließlich in der Lage waren das Gewicht so umzuverteilen, dass das Chassis der 85er-Serie sie tragen konnte.",
    "FB7C5ECC404CCE6802B43BA9EB96FBBC": "Die 30-250 “Tisiphone” Feld Kanone ist die Verkörperung der mobilisierten Zerstörung. Eine mit diesen Mörserkanonen bewaffnete Infanterieeinheit signalisiert feindlichen Gebäuden und Stellungen schlichtweg die unmittelbar bevorstehende Zerstörung.",
    "60AAF3CF47DB617613EA11B55CBEE9E3": "Das 74b-1 Ronan Kanonenboot ist darauf spezialisiert, sich trotz der hohen Verdrängung mit flinker Geschwindigkeit zwischen größeren Schiffen zu bewegen und deren Rumpf mit Leichtigkeit zu traktieren. Es ist mit zwei Dreibeinlafetten bestückt, die so das hochexplosive Mörsergeschütz in der Mitte des Schiffes unterstützen können.",
    "EDC1300845D4F76D0D84589AA2DE48DE": "Der A0E-9-Sprengkopf ist ein verheerender Sprengkopf, der ganze Stadtteile oder gar Kleinstädte zerstören kann. Er verbrennt die Landschaft und erschwert dem Feind den kurzfristigen Wiederaufbau. ",
    "80F355904A74E81A1017958EFD7FEDEA": "Das AC-b oder „Trident“-Klasse-Tauchboot verleiht der Republic Coastal Legion die dringend benötigte Marine-Vielseitigkeit. Ausgestattet mit einer Art Schnelllade-Munitionsschacht ist die „Trident“ in der Lage sich äußerst schnell Wiederzubewaffnen und zur Jagd zurückzukehren. Combat Magister Curia beauftragte die erfahrenen Ingenieure aus Dimiourg mit der Entwicklung eines Tauchboots, um der schnell fortschreitenden Marinetechnologie der Wardens and Nevish Alliance entgegenzuwirken. Ein Großteil des Senats kritisierte Curia für diese Entscheidung, da sie es für weitaus klüger hielten, Ressourcen in Innovationen hinsichtlich der Luftkriegsführung zu investieren. Nachdem diese aber die Rückkehr und taktische Umverlegung mehrerer erfolgreicher AC-b Testoperationen miterlebt hatten, war es schlussendlich nicht schwer den Senat zu überzeugen.",
    "B0971D2F4F52F5CEC1827B91476D630C": "Die \"Ascension\" Mk. V Flood-Variante ist mit einem größeren Lauf ausgestattet und für Fernkampfeinsätze ausgelegt. ",
    "0B79EDEA473AE6A3AB26E89639BA76D3": "Der Bassett Motor Society's Class 2 Mobile Auto-Kran wird für das Anheben und Umverlegen von Fahrzeugen und schwerer Ausrüstung verwendet.",
    "F8699DEE463164BEABD1AC8A6A1BB549": "Dieses Schiff der \"Ironship\"-Klasse, ebenfalls aus dem Hause der Bassett Motor Society, wird für den Transport von versandfähigen Versorgungsmaterial und schweren Fahrzeugen eingesetzt.",
    "7CB2F5544301F83080E54BB7C53660EC": "Das erste Basisschiff der Bassett Motor Society, die BMS - Longhook, ist ein robustes und zuverlässiges Schiff, das sich hervorragend für den Bau und die Wartung kleinerer Transportboote für die Bewegung von Personal sowie Ausrüstung eignet. ",
    "0699A64A4BC0951810E4888500D73451": "Das Blakerow ist ein Karabinergewehr und hat, verglichen mit seinen Repetiergewehr Vorgängern, eine überragende Feuerrate. Darunter leidet jedoch die anfängliche Durchschlagskraft. Ist aber vielseitig einsetzbar und hat ein relativ geringes Gewicht, wodurch es seine Nachteile wieder wett macht.",
    "A2188A324C95D58E8E160FAE3162D0E4": "Das Bluefin-Lagerschiff ist ein massives und mobiles Mehrzweckdepotschiff für Kisten mit Versorgungsmaterial, für Fahrzeuge, für verpackte Fahrzeuge, für verpackte Munition, generell für weit entfernte Einsatzoperationen und schließlich, wenn erstmal vor Ort, für den Transport der Ausrüstung von Strand-zu-Strand. Die Bassett Motor Society ist stolz darauf, ein solch hochmodernes und vielseitig einsetzbares Schiff an Raka, Katoma und die Alliant Union liefern zu können. ",
    "442486104B75F9025ECC9C8A5C4BD5D0": "Die Bomastone ist eine Stielgranate, durch den langen und griffigen Holzstiel wird das Werfen über mittlere Distanzen überhaupt erst ermöglicht.",
    "7A06F99C4E33063B047084890EF18C19": "Das Booker ist ein schlagkräftiges Feuerstoß Sturmgewehr für all Diejenigen, die gerne mal zuerst schießen.",
    "1B2BFAB349D78169CCC6B6A25BA62399": "Die Caoivish errichteten im kalten und tückischen Norden ein Imperium, aber die großen Kriege haben unserer einst so stolzen Nation ihr Soll abverlangt. Diese Wilden aus dem Süden haben unsere Heimat zerstört und gebrochen hinterlassen.\r\n\r\nSie bedrohen nicht nur unsere Heimat, sondern auch unsere Geschichte, unser Vermächtnis.\r\n\r\nHolt es zurück.",
    "6CFB3B86427F52AC29C9D68D64DBC191": "Der Caravaner ist ein Transportfahrzeug, mit dem Personal an die Front gebracht werden kann.",
    "D38B33304A774C0437BB208CBD8CF035": "Der Chieftan Sturmpanzer ist mit einer asymmetrischen Bewaffnung ausgestattet, welche sich aus einem 250mm Mörser und einem 12,7mm doppelläufigem Geschützturm zusammensetzt.",
    "1A9B737E4D83147FCF65518288F3C40B": "Der Clancy Cinder ist eine klassische Hochleistungs-Langwaffe, die für die Begegnungen in der mittleren bis großen Reichweite entwickelt wurde. Erstmals eingesetzt mit den \"Hands\" während einer Hochrisiko Operation in Acrithia.",
    "F6524B1C4152DE0DFC39E1B586166694": "Die Collins Kanone ist ein mobiles Panzerabwehr Feldgeschütz, welches 68mm panzerbrechende Geschosse nutzt.",
    "01BEC28C47A801E21D57A085F66B4EFF": "Die Colonials",
    "1346466449D3A6EB2C65CCAAE033B776": "Die Cometa T2-9 zeichnet sich durch ihre, für eine Seitenwaffe überragende, Mannstopwirkung aus. Dieses Estrellan Unikat hat sich, wegen ihres Entwurfs und feiner Handwerkskunst, über mehrere Generation bewährt.",
    "438F3CD74363F0AAEF56CB98AB2DCEAC": "Der Bauhof wird benutzt, um Container zu bauen.\r\n\r\nContainer können mit Gütern gefüllt und per Schwerlasttransporter ausgeliefert werden. \r\n\r\nUm Container bewegen zu können müssen sie zuerst verpackt werden, um sie dann per Kran verladen zu verladen.",
    "3E60ABC94798611BD07C9BAAEB91230B": "Der Cutler Launcher ermöglicht das verblüffend effiziente Abfeuern von raketengetriebenen ungelenkten Granaten über eine kurze Distanz. Das einfache Design ermöglicht dabei eine leichte Bereitstellung und Lagerung.",
    "15972C7545B83E4A8EB741B5B2FAA94A": "Die DAE 3b-2 feuert aus einer sicheren zumeist befestigten Position heraus Raketen über große Entfernungen ab. Diese einzigartige Waffe erhielt ihren Namen aufgrund der Schreckensschreie, die während ihres ersten Einsatzes auf dem Schlachtfeld zu hören waren, wobei Einige dieses Sperrfeuer auch als das Netz des Todes bezeichneten.",
    "4E1022FE4EF72440780364BDF95AF505": "Die Fiddler Maschinenpistole ist eine weit verbreitete Orts- und Häuserkampf Waffe. Ihre hohe Schussrate und das kompakte Gehäuse machen sie ideal für Scharmützel auf Tuchfühlung.",
    "59DFACCF49AF5464C57237B93B8CC783": "Der \"Foreman\" ist ein universell einsetzbarer, schnörkelloser und einfach zu montierender Anlagenkran. Perfekt für den Transport schwerer Lasten in jeglichen Fabrikanlagen, in denen das Be- und Entladen auf der Tagesordnung steht.",
    "90B06FA44793502825A9689C013556F0": "Der Dunne Fuelrunner Tankwagen ist ein schwerer Lastkraftwagen, der für den Transport und zur Verteilung von großen Mengen an Treibstoffen entworfen wurde.",
    "61DF2EDD494F2CC91D69C89AEDA640C7": "Das Gast ist ein tödliches, aber schweres Maschinengewehr. Es ist am besten dazu geeignet, befestigte Stellungen oder Gebäude vor heranrückenden, feindlichen Fußsoldaten zu verteidigen.",
    "A9B9DA9741EE501731CA1D9D64935983": "Bei dem HC-Class \"Ballista\" handelt es sich um einen schweren Belagerungspanzer, der entworfen wurde, um feindliche Verteidigungsanlagen mit seinem 250mm Hades Mörser dem Erdboden gleichzumachen.",
    "433C5B094AC1C494D76EDAB28F5F76BC": "Die Hangman 757",
    "8779C9AA46D16F3160701EB9B5315BB5": "Der Interceptor PA-12 ist ein Schiff für den Transport von Truppen und leichten Fahrzeugen über große Gewässer. ",
    "2423E72544842BCA2E0DBFB11E9291FD": "Der Ironhide, ist ein leichter Panzer, der dem MK. III sehr ähnlich ist, wurde aber auf Kosten der Geschwindigkeit und Wendigkeit mit schweren Stahlplatten verstärkt.",
    "FFA1F3254EF42A1EB01FFE8BD174C464": "Der Juggernaut ist eine schwer gepanzerte Flood-Variante, die vorne mit einem Flammenwerfer ausgestattet ist, der einen fortschrittlichen Haftbrennstoff abfeuert. Seine schaufelartigen Laufflächen schränken zwar die Höchstgeschwindigkeit ein, aber dafür ist dieses Biest bei extremsten Wetterbedingungen durchaus leistungsfähig.",
    "3C09623B4FA6DDC05E463ABFDE8D2BAC": "Der \"Mineseeker\" ist das mechanisierte Maultier der Bassett Motor Society. Diese kleine 0-4-0-Schmalspur-Lok kann über kurze Entfernungen Tonnen an Gewicht mit wenig Betriebskosten transportieren. Ideal für Abbaugebiete oder Nahversorgungsketten. ",
    "E749786542A80E615EB016AD60BEABE8": "Der Mulloy Landungstruppentransporter ist ein gepanzertes Amphibienfahrzeug, das für den Truppentransport über große Wasserflächen zur Unterstützung koordinierter Strandlandungen und flankierender Angriffe entwickelt wurde.",
    "C19174CB40D6F3613874B7B1346F8545": "Die Neville ist unschlagbar im Punkto Vielseitigkeit als tragbare, mit Magazinen ladbare Panzerbüchse.",
    "D7BA015D4482D3DD4E09E2AB3B642485": "Der Ospreay",
    "D7D148314AAE5AE1F2DC71A2EB029626": "Die Rampart ist eine leistungsstarke Feldkanone, die mit Ausnahme der schwersten gepanzerten Fahrzeuge verheerende Schäden anrichten kann und gleichzeitig der Besatzung einen umfassenden ballistischen Schutz bietet.",
    "850F3CFF42260CE5F0A038986A127D9C": "Die Raffinerie wird Schrott und andere Rohstoffe in Materialien umwandeln, die zur Herstellung von Gegenständen, Fahrzeugen und Strukturen verwendet werden können. \r\n\r\nFür eine ausführlichere Erklärung klicke auf das „?“ Symbol in der oberen rechten Ecke des Raffinerie-Menüs.",
    "F2596A28473784B9B4EE0D87323D3527": "Der Responder Krankenwagen ist effizient beim Transport von kritisch verwundeten Soldaten und beim Transport von medizinischem Material.",
    "A4D3755B41A9F39ACA9074BAC74B3B5B": "Bei dem von der Bassett Motor Society entworfenen \"Scrap Hauler\" (Sammler) handelt es sich um ein mächtiges Stück Schwermaschinerie. Sein Nutzen liegt darin, aus Schrott und anderen Materialien Rohstoffe zu gewinnen. \"Scrap Haulers\" werden häufig nach Gefechten eingesetzt, um zurückgelassene Ressourcen zu sammeln.",
    "B82355164AD3C111D9BB5281DDA2D279": "Der Shorerunner ist ein großes Schiff, das befreundete Truppen und leichte Fahrzeuge transportiert, um entfernte Küsten anzugreifen.",
    "3CAB58034B77E4113A601DA182C623FC": "Der Silverhand Sturmpanzer ist mit einer zerstörerischen, doppel-läufigen Bewaffnung, sowie schwerer Front- und Heckpanzerung ausgestattet. Sein frontal ausgerichtetes 68mm Geschütz wird mit einem leichteren 40mm Geschützturm ergänzt. ",
    "85D2FD8A406336C041573A8F3842271D": "Die Snare Trap ist eine umfunktionierte Flakkanone, die zur Verstärkung von Stellungen mit Zwillingsmaschinengewehren zur Infanterieabwehr eingesetzt wird.",
    "E72E497544109ADFC3642B85BDBFB596": "Das Lagerhaus ist seinem Namen gemäß eine Struktur, in der Gegenstände und Fahrzeuge für eine spätere Verwendung eingelagert werden.\r\n\r\nSie können in Europaletten verpackte Gegenstände, Fahrzeuge oder Lagercontainer einlagern.\r\n\r\nFür eine detailreichere Erläuterung können Sie das '?' - Symbol oben rechts im Menü des Lagerhauses anklicken.",
    "61C42C5947C2AFB915981DB8BFBD3815": "Die Tinderbox ist ein einfacher Schmalspurwaggon, der zum Transport von Flüssigkeiten zwischen den Fabrikanlagen verwendet wird.",
    "2C2BCDB4483B75B4E508C78B75B207A9": "Der Venom Raketenwerfer verschießt Panzerabwehrgeschosse. Sein einfaches Design ermöglicht eine effiziente Nutzung auch bei risikoreichen Einsätzen.",
    "3006E04A4C3219689DAB6BB79BE3CC65": "Die Warden Standarte ist ein Todeszeichen für die Feinde Caoivas. Diejenigen, die unsere Warnung ignorieren, werden feststellen, dass ihre Tapferkeit fehlgeleitet ist.",
    "A39DC435465027E4B57484A26FC3B41E": "Die Warden Standarte ist ein Todeszeichen für die Feinde Caoivas. Diejenigen, die unsere Warnung ignorieren, werden feststellen, dass ihre Tapferkeit fehlgeleitet ist.",
    "75BFB22744B204E1D95020A42DE5259C": "Die Warden Armee verlässt sich auf seine Outrider, wenn es darum geht wichtige Aufklärungsinformationen zu erhalten. Ihre robuste Ausrüstung ist perfekt für lange Einsätze geeignet, selbst wenn sie von unwegsames Gelände bzw. unbarmherziges Wetter überrascht werden.",
    "32CC66094EC863747269CBB41F09B000": "Die Wardens",
    "37EB16184665B74CFE1F8FADC68453A1": "Im Rumpf einer A0E-9 werden Treibstoff und die Instrumente gelagert, die erforderlich sind, um den Sprengkopf über große Distanzen zu befördern.",
    "7A2EDF464686598F27A02389597E2DC6": "Der Beiwagen dieses Motorrads ist zusätzlich mit einem leichten Maschinengewehr für reaktionsschnelle Hit-and-Run-Angriffe ausgestattet.",
    "6D1768DD43D82B3F03D0EEA78D76D72C": "Die für den Start erforderlichen Steuerfinnen, Treibstoffleitungen und Triebwerke sind alle im A0E-9 Booster-System untergebracht.",
    "3FE2286D465132CE9080E1A8636ED174": "Der Fahrkurs bzw. diese Teststrecke soll Ihnen das Üben der grundlegender Fahrzeugsteuerung ermöglichen. Zu Trainingszwecken haben wir eine Auswahl an Fahrzeugen bereitgestellt. \r\n\r\nVerwenden Sie \"{0}\", \"{1}\", \"{2}\", \"{3}\", um Ihr Fahrzeug genauso zu steuern, wie Sie sich auch zu Fuß fortbewegen.\r\n\r\nDrücken Sie \"{4}\", um die Handbremse anzuziehen.\r\n\r\nGehen Sie vorsichtig mit Ihrer Geschwindigkeit um und geben Sie beim Einlenken in Kurven Gas. \r\n\r\nÜberall auf dem Kurs sind Ziele verteilt, damit Sie das Zielen im Beiwagen des Motorrads oder mit dem Panzerwagen üben können. Das Zielen in einem Fahrzeug funktioniert genauso. \r\n\r\nHalten Sie in einer Schützenposition/im Beiwagen \"{5}\" zum Zielen und \"{6}\" zum Schießen gedrückt. ",
    "4A5720EC42E479F32D3EF1AFFA2ADBDE": "Die letzten kritischen Komponenten, die für den Bau einer schlagkräftigen Storm Cannon erforderlich sind. Muss auf einem Großstrukturfundament eingebettet werden.",
    "423976334BFCE1FE1B6014BBB7E47EE8": "Die letzten kritischen Komponenten, die für den Bau einer strategischen Aufklärungszentrale erforderlich sind. Muss auf einem Großstrukturfundament eingebettet werden.",
    "31591D7640E0C231C785C89079DBDF54": "Die letzten kritischen Komponenten, die für den Bau einer hoch aufragenden Wetterstation erforderlich sind. Muss auf einem Großstrukturfundament eingebettet werden.",
    "AAD6E5AE4AD03210B5605B956B3B8E3A": "Die letzten kritischen Komponenten, die für den Tiefbau einer Untergrundfestung erforderlich sind. Muss auf einem Großstrukturfundament eingebettet werden.",
    "815659DC48C8D296E4AB8B809187CB4E": "Die Vesta ist die erste Tankette der T-Klasse, die diesen stabileren Rahmen und die vielseitigen Laufflächen verwendet. Sie ist auch der erste Vorstoß der Velianer in den Bereich der Feuerwaffen. Die \"Vesta\" verfügt über einen leichten Flammenturm und reichlich Stauraum für den erforderlichen zusätzlichen Treibstoffvorrat.",
    "27D0CF7546B4DA33BF60C09F4AF79E55": "Das erste Teilstück einer großen Struktur. Muss auf einem Großstrukturfundament eingebettet werden.",
    "24EB8470474C85C204FA16A6F17CEDF8": "Diese einfache Feuerstelle ist der Grundstein eines jeden Bunkers und fungiert sowohl als Ofen als auch als Wärmequelle bei eiskaltem Wetter. Wenn sie auf einem soliden Fundament errichtet ist, heizt sie einen großen Bereich um sie herum.",
    "9688E2684A7D074F7706E191E9B1BBDE": "Diese einfache Feuerstelle ist der Grundstein eines jeden Bunkers und fungiert sowohl als Ofen als auch als Wärmequelle bei eiskaltem Wetter. Wenn sie auf einem soliden Fundament errichtet ist, heizt sie einen großen Bereich um sie herum.",
    "B1E9D8EA40AB241797F94EA444DC0819": "Diese einfache Feuerstelle ist der Grundstein eines jeden Bunkers und fungiert sowohl als Ofen als auch als Wärmequelle bei eiskaltem Wetter. Wenn sie auf einem soliden Fundament errichtet ist, heizt sie einen großen Bereich um sie herum.",
    "7721733F48656E5E67F9319F10C8F1DB": "Das Passwort für dieses reservierte Vorratslager wird in die Zwischenablage kopiert, sodass er danach woanders eingefügt werden kann.",
    "A6809E4A4CDC018329BB9D801439BE26": "Das Passwort für dieses reservierte Vorratslager wird für einige Sekunden sichtbar sein.",
    "37E8AA9A49160F5C0BB65F8182B46B2F": "Als Vorläufer des Sturmgewehrs ist das Sampo Automatikgewehr ein Meisterwerk seiner Zeit. Mit Einzellader und automatischem Feuermodus erreicht dieses vielseitige Gewehr zwar nicht die Feuerrate von automatischen Waffen, macht dies aber durch seine Nützlichkeit mehr als wett.",
    "93ABBB9F4AC1D651143243A65F44A2E8": "Der Stolz des Panzerabwehr-Arsenals der Wardens. Der Bonesaw MK.3 hat nur eine Aufgabe: Mit seiner Munition die schwere Panzerung der Colonial Panzer zu durchdringen.",
    "17B0C0F54DEBC4AB8643AF8BAD16DD9B": "Das Hauptinfanteriegewehr der Colonial Legion. Sein Vorgänger, der Volta Repeater war eine Robuste und verlässliche Feuerwaffe, hatte aber viele Limitationen, vor allem die Feuerrate. Die Argenti löst diese Limitation und ist auch kompakter und Leichter.",
    "210AC8FB4121E98E21C09C870E58EC2B": "Das zweite Teilstück einer großen Struktur. Muss auf einem Großstrukturfundament eingebettet werden.",
    "115CF636401D8116087368B4F058FD86": "Der \"Overseer\" Sky-Hauler, Star des BMS-Arsenals militärischer Baumaschinen lässt mehrere Tonnen wie eine Feder aussehen und genießt ein hohes Maß an Mobilität, wenn er neben Schwerlastschienen eingesetzt wird.",
    "9295B2ED4880B5F5FE72A3AAC076A630": "Der Star des BMS-Arsenals militärischer Baumaschinen, der \"Overseer\" Sky-Hauler, lässt mehrere Tonnen wie eine Feder aussehen und genießt ein hohes Maß an Mobilität, wenn er auf seinen Kran-Schwerlastschienen eingesetzt wird.",
    "FFE8175A4A9B9AD53B3265AF06D3E1CC": "Bei der dritten Variante des Niska-Motorwagens wurden zwei Maschinengewehre auf Kosten des Schutzes der Insassen und der Feuerkraft montiert. Diese einfache Modifikation war ursprünglich eine Ad-hoc-Modifikation der Feldingenieure, wurde aber bald von den Panzerregimentern der gesamten Caoiva-Veli-Front verlangt.",
    "4AF095F948FB27C90642DA81420D1E42": "Die Hangman ist die bevorzugte Waffe von Piraten und Schmugglern und hat sich zu Recht einen legendären Ruf erworben. Mit ihrer unglaublich hohen Durchschlagskraft und dem einzigartigen Revolvermechanismus spielt die Hangman oft Richter, Jury und Henker.",
    "9AFF016F40CE0959551A75AE28C5C9AA": "Der \"Chariot\" ist ein Transportfahrzeug, mit dem Personal an die Front gebracht werden kann.",
    "D78E1F4C4C2D5620465BA694A619F496": "Der „Halberd“ Schlachtpanzer ist mit Sandsäcken und metallischen Laufflächen verstärkt, was der allgemeinen Schadensresistenz zu Gute kommt. ",
    "BE1BFA70437F1D8BF9FAAA9C3DCEE46D": "Der leichte \"Kranesca\" Panzer ist mit einem hochgezüchteten Motor und verstärktem Fahrgestell ausgestattet. Er ist dazu in der Lage seine Höchstgeschwindigkeit zu erhöhen, büßt dafür aber Beschleunigung und Wendigkeit ein.",
    "BF2C21334B0DD34E51202CAADB695F6E": "Der leichte Panzer der H-Klasse \"Pelekys\" ist stark modifiziert, hat ein offenes Fahrgestell und ist mit einer verheerenden Langstrecken-Panzerabwehrkanone ausgestattet.",
    "99CB4B3F4DACA8B158FCF49B87B63479": "Der \"Salus\" Krankenwagen ist effizient beim Transport von kritisch verwundeten Soldaten und medizinischem Material.",
    "A13BAC034B2297951C46C8A5E6FC5AD0": "Der HC-Klasse-Panzer \"Scorpion\" ist ein angemessen gepanzertes Infanterieunterstützungsfahrzeug mit hochleistungsfähigen Zwillings-MGs und einem Kurzstreckenfunkgerät zur Feindaufklärung. Zusätzlich können sich Infanteristen auf die hinteren Seiten setzen. ",
    "AF3964A2441E144027F8BD83C1F986D1": "Der \"Spatha\" Sturmpanzer ist mit einem einzigartigen und zerstörerischen 40mm Geschützturm ausgestattet, der in der Lage ist Hochgeschwindigkeitsgeschosse zu nutzen. Dieser spezialisierte Geschützturm ist jedoch nicht so gut für die Massenproduktion geeignet wie sein verbessertes Gegenstück, der \"Falchion.\"",
    "38267B8C45DB3CCD445ED19929A2F122": "Der \"Stolon\" Tankwagen ist ein schwerer Lastkraftwagen der R-Serie, der zum Transport und zur Verteilung von großen Mengen an Kraftstoffen entworfen wurde.",
    "E1D7657546240C5031F6E0BAC3D9B99F": "Das schwere Feldgeschütz \"Stygian Bolt\" ist mit einer monströsen 94,5mm Kanone ausgestattet, die mit einem schweren abgewinkelten Explosionsschild gepaart ist. Inspiriert von den Reihen enger Schluchten in ihrer Heimat, der Provinz Lacrista, haben meseanische Ingenieure diese Feldwaffe entwickelt, um ihre Besatzung so sicher wie möglich vor Flankenbeschuss zu machen und dabei gleichzeitig die Vorwärtsbewegung aufrechtzuerhalten.",
    "33A737734A491EB9964D31AF80D98C44": "Es gibt drei Arten von medizinischer Ausrüstung.\r\n\r\nLegen Sie die Verbände in Ihrem Inventar an und drücken Sie \"{2}\", um sie auszuwählen. Legen Sie sich selbst Verbände an, um Blutungen zu stoppen. Der Verband wird verbraucht. \r\n\r\nErste-Hilfe-Sets heilen Wunden und erfordern Verbände. \r\n\r\nTrauma-Sets heilen kritische Wunden und erfordern Blutplasma.\r\n\r\nLegen Sie sie an und verwenden Sie sie wie eine Waffe.\r\n\r\nTrauma-Sets und Erste-Hilfe-Sets können nur bei anderen Soldaten verwendet werden.\r\n\r\nUm einem verwundeten Kameraden zu helfen, wenn Sie keine Vorräte haben, drücken Sie \"{0}\" auf seinen verwundeten Körper, um ihn in Sicherheit zu bringen. Drücken Sie \"{1}\", um ihn vor einem Sanitäter abzusetzen.\r\n\r\nKritisch verwundete Soldaten (<- spielerlos) können mit \"{0}\" aufgenommen und dann in einen Krankenwagen geladen oder in einem Krankenhaus oder Feldlazarett recycelt bzw \"behandelt\" werden.",
    "51D3CD60463C81D302122E9B7586BBA4": "Hitzeschild",
    "1D683EAB4982225ACCBB0980C5FB277F": "Diese persönlichen Schließfächer sind simpel und effektiv. ",
    "5B1EB0054208D30F4F698E9179336AD1": "Dieses BMS-Frachtschiff, die Bowhead, ist speziell für den Transport großer Mengen an Ressourcencontainern konzipiert und mit Laderaum für Ressourcen-Erntemaschinen (Sammlern) ausgestattet. Die Bassett Motor Society hat dieses Schiff nach einem großen Wal benannt. Durch effizientes Laderaumdesign, einem widerstandsfähigen und stabilen Rahmen wird hier dafür gesorgt, dass Ressourcen an die Front geliefert werden, wo sie gebraucht werden und wenn sie gebraucht werden.",
    "342DA28B4C4A3029FBB5F99D1C0C98CA": "Dieses leichte, mit einem leichten Maschinengewehr ausgestattete, Nutzfahrzeug bietet trotz der gewichtigen Waffenplattform eine überragende Geschwindigkeit. Perfekt geeignet zur Unterstützung flankierender Infanterie oder als Teil eines gepanzerten Angriffs.",
    "C56715944D01D0E14051489137350ECD": "Dieses Schiff bzw. Unterseeboot aus dem Hause der Nevish zeichnet sich dadurch aus, dass es brachial Lecks in die Rümpfe der Colonial-Flotte schlägt. Bewaffnet mit rumpfbrechenden Moray-Torpedos und modernster Sonartechnik ist das Nakki ein lautloser Killer. Berühmt ist ein Fall, indem sich drei Nakkis nachts von hinten an eine Colonial-Flotte anschlichen und diese dann nacheinander ausschaltete, woraufhin der Präfekt Evander den Rückzug befahl. Seine \"Legion\" war auf einen Angriff aus der Tiefe überhaupt nicht vorbereitet.",
    "C59ADBAA4C4BEFD92701E991CA0A57EC": "Dieses leichte Nutzfahrzeug verfügt über einen montierten Raketenwerfer und hervorragende Geschwindigkeit. Es ist perfekt dazu geeignet feindliche Gebäude anzugreifen oder einen Panzerangriff zu unterstützen.",
    "BD7CD69B45945AFF7AB118ABB7F2760E": "Dieses leichte amphibische Nutzfahrzeug wurde stark modifiziert, um Flüsse und Seen mühelos zu überqueren. Sich damit auf das offene Meer hinauszuwagen, ist jedoch nicht ratsam.",
    "B400D533415C222C56574C9FA19153D2": "Diese Anti-Personen Splittergranate wurde mit einem Stift-Mechanismus und einem Zeitzünder für Benutzersicherheit entworfen. Rillen in der Hülle sorgen für besseren Griff und verbesserter Splitterwirkung.",
    "3D8515CF482C4AAD3A5D798766060897": "Diese klassische Maschinenpistole ist ein robustes und unersetzliches Werkzeug für Einsätze auf kurze Distanz. Die Pitch Gun verdankt ihren Namen einem Seemann aus Mesean, der damit erfolgreich einen nächtlichen Überfall auf die Geraston Docks abwehrte. ",
    "62EB2C6E4A48A437C7C2BAB1AF591D9E": "Diese komplette Überarbeitung des T3-Panzerwagens ist mit einer Panzerung verstärkt. Diese zusätzlichen Schutzmaßnahmen verringern zwar die Gesamtgeschwindigkeit und das Fahrverhalten des T12, aber die zusätzlichen Laufflächen verbessern die Leistung in weniger idealem Gelände.",
    "562007C64C8855278B7D439C1DD11117": "Dieser Kurs wird dich auf die Probe stellen.\r\n\r\nBesorge dir einen Partner und bitte ihn, dich zu beschießen. Bewege dich dabei von Deckung zu Deckung und erwiedere den Beschuss.\r\n\r\nVersuche, beim Durchlaufen alle Ziele zu treffen.",
    "5FF4998C41288C50E8A0319DDD57BF72": "Dieser mächtige Panzer verwandelt den Jäger in Beute. Als Panzerschreck eignet sich der \"Noble Widow\" hervorragend für Hinterhalte. Auf seine Beute lauernd, bis er sie dann letztendlich dank seiner Hochgeschwindigkeits-Munition zum Erliegen bringt.",
    "704EA4B74AD642B5CDCE20A02A87F4E0": "Diese mit Hochexplosivkraft vollgestopfte Granate wurde entwickelt, um Gebäude und Fahrzeuge zu beschädigen. ",
    "32A37722413D285B62E5BE8741D607F5": "Diese zerstörerische kurzreichweiten Kanone ist für ein direktes Gefecht mit feindlichen Befestigungen geeignet. Der Wolfhound ist mit einer verstärkten Abschirmung und einem 40mm-Lauf ausgerüstet. ",
    "CCA8B7024C61056D854896AFFACF1112": "Bei dem V.101 Freeman handelt es sich um die neueste Ausführung des O'Brien und diese ist mit einem 360 Grad rotierbarem Panzerturm ausgestattet. Jedoch leidet unter dessen Gewicht die Höchstgeschwindigkeit.",
    "D5F4545E44CC54D27B13158991085715": "Dieser einfach aufzubauende Ofen eignet sich perfekt zum Warmhalten in der Kälte und ist gleichzeitig viel robuster als eine einfache Feuerstelle.",
    "17889A604F86533E991EEAA1F68EF899": "Diese Weiterentwicklung des \"Bardiche\" ist mit vier fest-montierten Raketenwerfern und einer 12,7mm Hochgeschwindigkeitskanone ausgestattet. Der \"Ranseur\" zeigt die Fortschritte im kraunischen Design, das bewusst veraltete Ausrüstung nutzend weit tödlich-modernere Panzer kreiert.",
    "0197038F4C7A5B8632F0A4A7A0CF7EBB": "In diesem Umschlagplatz werden Kisten mit Ausrüstung eingelagert, die in nahegelegenen Fabrikanlagen hergestellt wurden.",
    "E366B9564B3EF37C3D682CA2F6CDBA88": "Diese Geschützlafette ist eine leistungsfähige, wenn auch etwas schwache Panzerabwehrwaffe, die mit billigen Materialien, grober Verarbeitung und veralteter Technologie hergestellt wurde. Die aufgesetzte 20-mm-Kanone mag nach modernen Maßstäben alt aussehen, aber sie hat keine Probleme, moderne Panzerungen zu durchschlagen.",
    "4014E36D487D4FBCE39BD7AC9A41D5D6": "Dieses gigantische Biest ist die Idee von Gray Cullen. Einst für unmöglich gehalten, war der Predator Cullens Vorstellung davon, wie ein großes Schiff an Land funktionieren könnte. Es verfügt über zwei Sätze vierläufiger Granatwerfer und eine robuste nach vorne ausgerichtete 94,5mm Kanone. Obwohl die Einschränkungen des bodengestützten Reisens gewisse Einschränkungen für den Umfang des Projekts darstellten, ließ sich Cullen nicht abschrecken und nahm die notwendigen Anpassungen vor, um seine Vision des idealen Land-Schlachtschiffs zu verwirklichen.",
    "5C98C2CE4BF49E1FB1FF05877CB5DE6F": "Dieser schwer verstärkte Unterstand ermöglicht es der einquartierten Infanterie mit ihren Panzerabwehrwaffen gegen näherkommende feindliche gepanzerte Fahrzeuge aus sicherer Position zu wirken.",
    "13BC4C234178F376823DC6B83C56BF19": "Dieses schwere Artilleriegeschütz wurde entworfen, um feindliche Befestigungen aus sicherer Stellung zu zerstören. Ihr langer und schwerer Lauf gibt der \"Thunderbolt\" eine hervorragende Reichweite.",
    "3DE65FF44A5B93C779BE0ABB51397AA0": "Dieses schwere Infanteriegeschütz benötigt ein Dreibein zur Stabilität. Die Daucus wurde dazu entwickelt der Infanterie beim Zusammestoß mit feindlichen Fahrzeugen, leichten Befestigungsanlagen oder befestigten Garnisonen eine Stellung zu verschaffen.",
    "88DE9A454C873522710799A27410DA32": "Dieses schwere Maschinengewehr ist so sperrig, dass es zur Aufrechterhaltung der Stabilität einen festen Untergrund benötigt. Die Maschinengewehre der Malone-Serie sind unübertroffene Verteidiger auf dem Schlachtfeld.",
    "90D4AA2540DFD8CC95F799AF32C3B0D0": "Dieser schwere Sprengkörper ist so konstruiert, dass er großen Schaden an befestigten Gebäuden und stationären Fahrzeugen anrichten kann. ",
    "633F232149DF0FF7181D46834EC83E7F": "Dieses schwere Dienstfahrzeug hat verstärkte Reifen, die ursprünglich für den Transport großer Rohstoffvorräte und schwerer Waffen über die zerklüfteten Klippen von Sorovia entwickelt wurden.",
    "5920BD764CF99DB4CED8A1851C694B2E": "Diese leistungsstarke mobile Artillerieplattform verfügt über einen Satz robuster mechanischer Stützen, um die Leistung der 150 mm Kanone zu unterstützen. Die Lance-Variante \"Sarissa\" ist eine höchst individuelle und geniale Nutzung des Lance-Fahrgestells, die Vielseitigkeit im Panzereinsatz bietet und den Aufwand für Transport und Aufstellung statischer Artilleriebatterien erheblich reduziert. ",
    "13DA94084D18594CC80AB3A9C181D9F9": "Das ist nur verfügbar für den ursprünglichen Erbauer dieser Struktur.\\\r\\\r<RichText.Regular12.Orange>Verfügbar für den ursprünglichen Erbauer dieser Struktur.</>",
    "F47FB4AA4949EA79B9FF5AA1A7A301E5": "Dieser modifizierte \"Hatchet\" verfügt über einen verstärkten Brennstoffkanister am Heck und einem Flammenwerferturm. Dieser leichte Panzer kann literweise Brennstoff über eine akzeptable Distanz hinweg verfeuern, und das alles während die Besatzung hinter seiner leichten Panzerung geschützt bleibt.",
    "3DF1B35D47B9CE4B59046D800F0D9889": "Diese montierte Panzerbüchse bietet bessere Genauigkeit zu seinen frei stehenden Gegenstücken. Die Typhon wurde mit dem Gedanken der Rückstoß-Absorbierung entworfen. Dies erlaubt deutlich schnellere und längere Feuerstöße.",
    "C84F81124E13B14FD56F39B119191D5C": "Diese vom Spieler errichtete Anlage ist mit mehreren Ressourcenminen verbunden. Die Ölquelle ist mit einer Rohrleitung/\"Pipe\" verbunden, die das Öl automatisch in die Raffinerie und dann zum Kraftwerk transportiert.\r\n\r\nBeginnen Sie, indem Sie auf die Ölquelle zugreifen und eine Ölbestellung aufgeben. Legen Sie die Bestellung über das Dropdown-Menü oben links auf „Öffentlich“ fest. Dadurch wird das Öl direkt in die Leitung zur Ölraffinerie geleitet.\r\n\r\nFinden Sie heraus, wie Sie Öl raffinieren und per \"Pipe\" zum Kraftwerk schicken können.",
    "E0F1A98441E920DF8691F5A2A81CBFD4": "Diese robuste Feldkanone ermöglicht es der Infanterie nicht nur mühelos äußerst schwere 75mm Granaten abzufeuern, sondern bietet auch noch einen hochmodernen gebogenen Explosionsschutz für maximalen Schutz vor Kreuzfeuer.",
    "B26890C24C95E023BB20F4B870E107F8": "Diese Kurzstreckenkanone kann die feindliche Infanterie mit indirektem Feuer beschießen.",
    "F25F8A7A4097A9BE49ADDA98C025BA82": "Dieser schwere schultergestütze Raketenwerfer ist der erste seiner Art. Er bietet einen Schild zum Schutz vor Explosionen und ist dazu fähig Panzerabwehr Geschosse über recht weite Entfernungen abzufeuern. ",
    "61093A12400E33498D91E3A332D234F3": "Dieses Schild war hilfreich",
    "E19BBD174F48F50EE6D0CBB3F40D91DC": "Dieses Schild war nicht hilfreich",
    "9FF2ABDF4C581B9D7BDEB4A866238209": "Diese umfunktionierte Wassertankvariante des Krankenwagens „Salus“ ist mit einem Hochleistungsschlauch ausgestattet, der Waldbrände löschen soll.",
    "A1CD91CF4A350FD680590FA848BFA652": "Diese simple Doppelrohr-Panzerabwehrgeschützlafette kann auf kurze Reichweite großen Schaden anrichten. Seine kostengünstige Konstruktion ermöglicht eine relativ einfache Montage auf Kosten der Haltbarkeit. Der Cestus ist für die Panzerabwehr konzipiert und eignet sich am besten für Taktiken aus dem Hinterhalt oder zwischen den Linien schwerer Panzer.",
    "0E64E9AE41E3064701D69F9F30B7E9DF": "Dieses einfache, modifizierte Mehrzweckfahrzeug ist mit einer verstärkten Dachluke ausgerüstet, die einem Besatzungsmitglied verbesserte Umsicht für intensive Aufklärungsmissionen ermöglicht.",
    "CCE57F0A43666D639EA4D793746C078A": "Dieser Einweg Raketenwerfer kann auf kurze Reichweite abgefeuert werden. Die Ignifist wurde dafür entworfen Löcher in Panzer zu sprengen und ist das perfekte Werkzeug für Fußsoldaten um sich gegen gepanzerte Fahrzeuge zur Wehr zu setzen. ",
    "049277874CA7CF1F1F546E86F5E560E6": "Dieser kleine Panzer wurde erst kürzlich wieder von den Wardens in den aktiven Dienst gestellt. Er zeichnet sich durch seine hohe Wendigkeit aus und besitzt eine Antenne für Langstreckenkommunikation zur Unterstützung riskanter Aufklärungseinsätze.",
    "5B043B4442B6B6E25CAFA0B996F519E3": "Dieser Standard Lastkraftwagen ist mit einem leichten Maschinengewehr auf der Beifahrerseite ausgestattet. Er ist sehr gut als Geleitfahrzeug für Kolonnen geeignet und kann sogar bei kleineren Militäroperationen nützlich sein.",
    "49D1A20E444A51680987CDBBCF2AF826": "Dieser Laster wurde mit einer Rohstoffladefläche anstelle der Standard-Frachtfläche ausgestattet. Dies erlaubt den Transport von mehr Rohstoffen, dafür kann aber keine normale Fracht geladen werden.",
    "CA9D64FC4F7A36C81344CAA19107CD67": "Dieser Laster wurde mit einer Rohstoffladefläche anstelle der Standard-Frachtfläche ausgestattet. Dies erlaubt den Transport von mehr Rohstoffen, dafür kann aber keine normale Fracht geladen werden. ",
    "566BD0554C6E2781BCFE47AF86AA07DB": "Dieser Standard Lastkraftwagen ist mit robusten Geländeketten ausgestattet. Diese ermöglichen ihm, auch auf unwegsamen Gelände, nützlich zu sein, dennoch leidet die Höchstgeschwindigkeit ein wenig darunter.",
    "2D47D4064DE790F771F759A9562F1853": "Dieses auf's Nötigste reduzierte Leichtbau Multifunktionsfahrzeug bietet zusätzliche Sitze um einer kleinen Gruppe Überfall-Taktiken zu ermöglichen.",
    "9D4DB74540030159144ED58C39288A18": "Diese Uniform ist zwar im Kampf unpraktisch, kennzeichnet aber den Anführer eines Regiments. Angemessen gekleidete Offiziere können ihre Untergebenen frei disziplinieren. Die antiken Mesean Offiziere waren der Schlüssel zur Organisation der Legion. Diese moderne Bekleidung ehrt ihr bleibendes Erbe.",
    "99BFB4DB4B93D2BF0AFB8FA91B6DCA60": "Dieses einzigartige Sturmgewehr zeichnet sich durch ein großes Trommelmagazin aus, das für anhaltendes Schnellfeuer ausgelegt ist.",
    "102C44154CF1D9B99D1C4D80F9C0175F": "Bei diesem einzigartigen Zerstörungswerkzeug handelt es sich um ein langes Metalrohr gefüllt mit Sprengstoff. Die Hydra's Whisper wurde entworfen, um schwer zugängliche, Blockaden sowie Panzerminen entlang des Sprengrohres zu beseitigen.",
    "8D11C42F444FE99A9760A28D28A3C4EA": "Dieser einzigartige doppelläufige Raketenwerfer ist dazu in der Lage zwei RPG Geschosse in schneller Abfolge zu feuern. Diese erhöhte Feuerkraft macht es, für einzelne Soldaten, nahezu unmöglich ihn zu bedienen, ohne dass dieser auf einer soliden Oberfläche abgelegt oder lafettiert wird.",
    "6F03A66044D0E60A6827568086CA30FB": "Dieses einzigartige Gewehr feuert drei Schüsse in schneller Folge ab. Die Fuscina ist die erste ihrer Art und wurde für das Unterdrückungsfeuer bei Angriffen auf befestigte feindliche Schanzen entwickelt wurde.",
    "E8FF49EE4B17E8AFC3F8818B69550D65": "Diese einzigartige Seitenwaffe feuert in Drei-Schuss-Salven. Die Cascadier hat vielleicht nicht die Durchschlagskraft ihrer Cousins, aber das macht sie mit ihrem leichten Rahmen, ihrer Tarnbarkeit und ihrer Feuergeschwindigkeit mehr als wett.",
    "22CED31B452D226343441E8A3E22814C": "Dieser einzigartige Waggon wurde speziell mit medizinischer Ausrüstung und einem montierten Maschinengewehr (!) ausgestattet und eignet sich daher ideal für den Transport verletzter Soldaten von aktiven Schlachtfeldern in die Sicherheit von Krankenhäusern. Wenn der BMS Bloodtender stationär ist, kann er auch als mobiles Erste-Hilfe-Zentrum zur Behandlung verwundeter Soldaten eingesetzt werden, solange noch reichlich Vorräte vorhanden sind.",
    "1F21E6DD4BFA703C3302BDAA1D3A24F6": "Diese einzigartige schwere Maschinenpistole ist zwar nicht besonders nützlich während der Bewegung, geht man jedoch in Deckung und nimmt sich Zeit mit dem Zielen, schneiden ihre Kugeln durch die Nacht wie Rasierklingen.",
    "BC78409F4C0ECAC44A3231A6A42A9711": "Diese Ausführung des Bonesaw MK.3 wurde dazu entworfen, um mit Dreibeinen genutzt zu werden. Dadurch ist er deutlich besser stabilisiert und bietet eine bessere Reichweite.",
    "3CE22F2F4F3A747CBCDCA884C44E4B2A": "Diese Ausführung des Standard R-5 Hauler wurde mit verbesserten Radaufhängungen und Achsen ausgestattet, welche eine grundlegend bessere Handhabung ermöglichen. Wie dem auch sei, unter starken Wettereinflüssen könnten diese Verbesserungen ihren Anspruch nicht gerecht werden.",
    "A0ADCD954C88D93A356468B1F6FC351A": "Dadurch wird die gesamte in diesem Rohr gespeicherte Flüssigkeit aus dem angeschlossenen \"Pipe\"-Netzwerk entfernt, sodass neue Flüssigkeiten hindurchfließen können.\r\n\r\n<RichText.Regular12.Orange>Nur Pipelines mit einer aktiven Reservierung werden geleert.</>",
    "FA8728E842024F1437E355AA07BCE19D": "Dieser Werkstatt-Zusatz ermöglicht die Herstellung von Infanterie genutzen Sprengwaffen, -stoffen und verschiedenen Munitionsklassen für Kleinkaliberwaffen.",
    "5C6C2EEA4A1AF55FC3A47A9C7248BA3A": "Diese \"Javelin\" Variante wurde mit einer 360° Mörserplattform ausgestattet, um Infanterie an der Front zu unterstützen.",
    "399F6DCE4F5CBA8474C1508C4AB13293": "Diese \"Xiphos\"-Variante ist, anstelle des üblichen doppelläufigen Sturmgewehrs, mit einem leistungsfähigen Panzerabwehrgeschütz ausgestattet.",
    "1B93331345BB6FF3A35BFB903534EABF": "Nutze eine Waschstelle zum Aufräumen vor dem Essen, zum Waschen deiner Hände oder um Geschirr zu putzen. Hygiene ist wichtig, um Infektionen und Krankheiten zu vermeiden.",
    "4DE251764E2E9CB98C51928771111482": "Um den Einfallsreichtum der Caoivish etwas entgegenzusetzen entwickelten die Meseaner ihr eigenes indirektes RPG-Abschusssystem. Doppelwerfer sind auf einer großen Befestigungsplattform angebracht, um damit die Wirkungsabdeckung in einer etablierten Position zu maximieren. So macht diese Schöpfung keinerlei Anstalten zu einem feigen Instrument der Guerillakriegsführung degradiert zu werden.",
    "E65DB2424DF830078402629E7B020C22": "Um ein Fahrzeug aufzutanken brauchst du Diesel oder Benzin, welche du selbst raffinieren oder anderweitig beschaffen musst. Zu Übungszwecken wurde dir in der Kiste neben dem nächsten Haus Treibstoff zur Verfügung gestellt.\r\n\r\nDrücke \"{0}\", um dein Inventar zu öffnen und wähle den Treibstoff aus mit \"{1}\", um ihn auszurüsten. Das Menü kann nun geschlossen werden (wiederholt-\"öffnen\" oder einfach mit ESC schließen).\r\n\r\nGehe nun zu einem Fahrzeug und benutze den Treibstoff durch Halten der \"{1}\". Der Tankvorgang startet und wird erst dann beendet wenn man loslässt bzw. dann wenn der Kanister leer oder das Fahrzeug vollgetankt ist.",
    "052DB1574987024F202489B1FEAE4546": "Ein Vexillum der Colonial Legion zu setzen bedeutet, den Sieg für die Mesean Republic zu erringen. Denn das Ende ist unser Ruhm.",
    "8147B09D47A3391112C181AE2A6AE90E": "Ein Vexillum der Colonial Legion zu setzen bedeutet, den Sieg für die Mesean Republik zu erringen. Denn das Ende ist unser Ruhm.",
    "D4FB33DF4C4840AF16DF0DAB116A02D0": "Zum Rotieren der Kamera die mittlere Maustaste oder \"{0}\" während einer Mausbewegung gedrückt halten.",
    "CA00BF9B4DFD3ADD3A738A835C2E6EC5": "Um einen Schützengraben anzulegen brauchst Du eine Schaufel. Finde eine in einer der nahegelegenen Gefechtskisten. \r\n\r\nDrücke mit ausgerüsteter Schaufel \"{0}\", um das Baumenü zu öffnen.\r\n\r\nTriff Deine Auswahl und platziere dann das gewählte Baugrundstück genau so wie bei jeder anderen Struktur auch. \r\n\r\nSobald Dein Baugrundstück platziert ist, halte \"{1}\" gedrückt, um den ersten Spatenstich zu machen. \r\n\r\nDies wird einige Zeit brauchen, aber das Graben von Schützengräben ist als eine Mannschaftsaufgabe gedacht und dann weitaus einfacher und auch kurzweiliger.",
    "893A70814DA3AA6879BF3BB21D9FA0B9": "Sekundärmodus Umschalten",
    "102EE32A4E97880745819385B4913327": "Stadt",
    "61E0F27C4EE3E93AFE0E509D4A1D310B": "Stadtkernbasis",
    "99DFC1CE459067F35E36F2A2ACF9EFA9": "Stadtkernbasis",
    "EC5440CA43513ABE394C23BBCD530C82": "Stadtkernbasis",
    "1440F4934D50CF78270BE498F0AE0479": "Anhänger",
    "14BE7BEF426146EF3128E78A44636C22": "Anhänger",
    "ECC459C14F0CE48CD3022991CF7CC1CD": "Lokomotiven Werkstatt",
    "44347BB848F32F07DF9580B5C674B41C": "Torpedo Übermitteln",
    "6111A794412124E77DB764BDC5E764B7": "Torpedo Übermitteln",
    "1D919EAF4CA41E718E1921A15807C122": "Transportbus",
    "F21967B14A7EC84736BA428D37F5FA81": "Trauma Koffer",
    "45AE3BE947CAC2B2C6723C9C57D1549C": "Tremola Granate GPb-1",
    "2E32DAAF46065E19232F559B64DE1F69": "Schützengraben (Stufe 1)",
    "90B803D9436F08A222133CA646C4ED14": "Schützengraben (Stufe 1)",
    "74E989B744FF24AB38B10AAE0F9C5B02": "Schützengraben (Stufe 2)",
    "84A7B5704DB2E61F06E91F819C52C317": "Schützengraben (Stufe 3)",
    "37D5017B45C28CAEB3966B87673330F1": "Schützengrabengrundlagen",
    "499F47EC45F69015EDF724A392D57999": "Schützengraben Verbinder (Stufe 1)",
    "4F3155ED443FDFA70F754CB199E4AAAF": "Schützengraben Verbinder (Stufe 2)",
    "C3A55C1546C54FACCFF7CEA671BFB545": "Schützengraben Verbinder (Stufe 3)",
    "2EAB70C34E3EBB05E07D58A1A6D6638B": "Schützengrabenverbinder-Baustelle",
    "A201A9224AF73E0339266C937179F807": "Schützengraben-Baustelle",
    "AEE1E844448E5BDD0B82DEA9791C0CB3": "Schützengraben mit Geschützstellung (Stufe 1)",
    "6510FCE04BBFE9D922B27A832E1D6971": "Schützengraben mit Geschützstellung (Stufe 2)",
    "67668840461C54A7F1420F813820A754": "Schützengraben mit Geschützstellung (Stufe 3)",
    "C76CD2F44CF8F03DE31A7C91D757D976": "Geschützstellung-Baustelle",
    "13A39CAB4683E6DCD140EF817D27B233": "Schützengraben Kreuzung (Stufe 1)",
    "0FA6B97141726FCDAC3548B5FDBF30B7": "Schützengraben Kreuzung (Stufe 2)",
    "7A6BDEBD42EE085F9BC05292A52258D9": "Schützengraben Kreuzung (Stufe 2)",
    "DFF50A9E4DA3DEB523383DA478CCD0CB": "Schützengraben Kreuzung (Stufe 3)",
    "F7647EA5413C777FCBA2D6BE18417172": "Schützengraben Kreuzung (Stufe 3)",
    "366CF5134202DE6C16973BAAA1FD4318": "Überdachung für Schützengräben",
    "4644E1894D3140B8737D43A0CE835F1F": "Überdachung für Schützengräben",
    "4C7D4017497B23EE9166D79AAAADF2C0": "Schützengrabenausbildung",
    "9B3EF5104E40259744989DAC7045AAA9": "Schützengrabenausbildung",
    "A4C117564AE6190AB53CFC8710D3AEA7": "Schützengrabenausbildung",
    "A56BFFF74B9CA30EAB6B24ABAB803187": "Schützengrabenausbildung",
    "F2855D994844C80CA22211B006CFACC3": "Dreibein",
    "542900CE4499CCF909016A876BBE29A6": "Dreibein Fabrikanlage",
    "CE3A76B545B5269AE2FE84B0A85F712F": "Dreibein Befestigungspunkt",
    "D70C348540A1FD5F04D53A9DB446A468": "Lastkraftwagen",
    "40FEEB8C494A469902EF7A87FCEB8813": "Wendepunkt",
    "0DF5EE9B47D23BA89BD8BDBAFE42246C": "Geschützturm",
    "1213DA5A4B0BDF537953448F4D2F8694": "Geschützturm",
    "27BFB08849208F3358852D9667D6546F": "Maschinengewehrschütze",
    "3B3A09084AB6A72C9508359B478D8EDE": "Geschütz",
    "3FEF6CF946193B406D9350945AEEA37B": "Geschütz",
    "4B0724064D1EEDC7A9D5488E52AA09D2": "Geschützturm",
    "598E5B8340153EFCA7A6D3BB161131C8": "Geschütz",
    "60E8089045422DA1B1A2E5A3E544A778": "Geschütz",
    "8A81FBEC4F4AB329D4717BA0F51E2E4E": "Geschützturm",
    "8C2159F0443676232F901EBB7B834510": "Geschützturm",
    "9E00642A4E6B8A6C389472A678A7D255": "Wasserwerfer",
    "A5FC1C564F1C3401609CBEA238365CD9": "Geschützturm",
    "B0FAEB69483CE85A6384A7BBA65EA685": "Geschützturm",
    "CAD26D5E4649E9F5D210FE939D6D929C": "Geschützturm",
    "D3F91CED4CCDE27002DA5DBFA845EFAD": "Geschützturm",
    "DD79EF02455A441AFFEB53A5810F988F": "Geschützturm",
    "F296A32340E52BB50A173DA89FCCC9AD": "Maschinengewehrschütze",
    "22D6D23E4AFB1AB02B6C9C8F31DD4B2A": "Anleitung",
    "7657C9614DE00B19B17B0880BCB44658": "Anleitung",
    "675ED7F84DF98FD6BD2E9AAB03EA4BED": "An die Kälte nicht gewöhnt, müssen sich Legionäre immer anpassen. Dieser schwere Mantel wurde entwickelt, um die Auswirkungen der Kälte zu mildern und gleichzeitig optimale Mobilität und Kampfeffizienz zu gewährleisten.",
    "8C2074D74312E8A6ABD693994FFA7802": "Untergrundfestung",
    "E9BB37744102C02B19BAF1A164EDF4C4": "Untergrundfestung Teilstücke",
    "EE118DA84850EE1C3792A4A747CF7174": "Blindgänger",
    "F01F202E419CB6695A4B519C5F6067F5": "Gegenüber der 85-Serie hat der \"Bardiche\" eine deutlich schwerere und auch stabilere Bauweise. Zusätzlich ist er mit einem koaxialen Maschinengewehr im Zusammenspiel mit einem mächtigen 68mm Kurzlaufgeschützturm ausgestattet. Dank dem modernen Kraunian Ingenieurwesen kann man das Geschütz sehr schnell nachladen, was ihn zu einer effektiven Waffe gegen feindliche Panzer macht.",
    "75AB8FE84A86F6D4277D48B7ACF8B6C4": "Aufsperren",
    "7EB9C9D944A4229BC78D8DBADF5A6ED0": "Entsperrt dieses Fahrzeug, so dass andere Spieler wieder Zugriff darauf haben.",
    "390C066E4C2FA2F6C2E3D38BBB687C2E": "Entpacken",
    "97D3273D4EEB0CD842F7EFAAF4A917E0": "Entpacke die Ausrüstung im Ladebereich",
    "C572EB50426026BC88591DB9307C44AD": "Entpackt das Versandgut im Ladebereich.",
    "A900FC5D41B661D32B0BF6B4AAD68C60": "Entpackt die Fracht, damit sie wieder genutzt werden kann.",
    "EA7E8F024DB199250BE79BA08DC92610": "Instabile Substanzen",
    "D4B956C346CA1E5642177289D323532D": "Verbessern und Modifizieren von Schützengräben",
    "1A369228461BEFED3E331880C8F35514": "Benutzen Sie das Mausrad, um die Schienen anzuheben",
    "A075E56945A48EB182E37B92490E117E": "Benutzen Sie das Mausrad, um die Schienen anzuheben",
    "98D8E4BA4632C629A811DEAB3787192A": "Nutze diesen Stein, um einen tödlichen Fluch zu akzeptieren und werde zum Wirt für einen verdammten Geist eines Avartach.",
    "8F545E0048426B7F3E9299B3EE48F5BF": "Nutze diesen Stein, um einen leichten Fluch anzunehmen und Wirt für einen längst verstorbener Geist zu werden.",
    "11F3C4D84BA7C71A4D3501AC9BB423B3": "Nutze diesen Stein, um den urzeitlichen Fluch zu akzeptieren und werde zum Wirt für den bösartigen Geist einer Balor-Ausgeburt.",
    "8E82923E4335B05159E475AD5ADF4C61": "Verwenden Sie dieses Übungsgelände, um mit Artillerie zu experimentieren. In den nahegelegenen Lagerkisten finden Sie Munition und Ferngläser. Lesen Sie die Schilder für weitere Informationen.",
    "F17D729E4F340088340D20A5D33A4BA1": "Verwenden Sie dieses Übungsgelände, um mit Artillerie zu experimentieren. In den nahegelegenen Lagerkisten finden Sie Munition und Ferngläser. Lesen Sie die Schilder für weitere Informationen.",
    "5DD8ADCB4CB3A226F190A1AA1DB58A1F": "Wird von Sanitätern dazu verwendet, andere Soldaten zu heilen.",
    "B34EDE9E464113E9D2727D8F515BE792": "Wird von Sanitätern dazu verwendet, verletzte Soldaten wiederzubeleben.",
    "9A407F074260034D38B3A3910AB1F582": "Wird zum Bau fortschrittlicher Fahrzeuge verwendet.",
    "6A8A96BF4BFA6BF5A1D36FAAF6D3F982": "Wird verwendet, um Stromleitungen zu verbinden. Bis zu 4 Stromleitungen können an einem einzigen Mast befestigt werden.",
    "84E9996949F3F9A11ABCADA4EF3ECEB3": "Wird verwendet, um Verteidigungsanlagen aus Stacheldraht zu bauen.",
    "FAF8B2D74AA8A6AB2CE540907D2E30FA": "Wird verwendet, um Verteidigungsanlagen aus Stahlträgern zu bauen.",
    "49B8A1CF43181E9825221AA0B060DE83": "Wird verwendet, um Verteidigungsanlagen aus Sandsäcken zu bauen.",
    "AFDBDBB445543513C7DD549D7E397910": "Wird verwendet, um verschiedene Arten von Pipelines für den Transport von Flüssigkeiten zu bauen.",
    "EC925A914580E90ADB6568904B743699": "Nützlich, um das Vordringen von feindlichen Fußsoldaten in ein Gebiet zu verhindern. Dieser Zaun ist mit herkömmlichen Waffen nur schwer zu zerstören und muss mit einem Schraubenschlüssel demontiert werden.",
    "292BF39646EB298A64B12AA92E865556": "Dient zum verlangsamen feindlicher Fußsoldaten. Kann mit einem Schraubenschlüssel beseitigt werden.",
    "EBB791414DBF7EED5D7129B9D59B93F8": "Wird benutzt, um eine Blutung zu stoppen.",
    "022C953248AF6ED5FEF83FA8F2E86696": "Mit einer tödlichen Mischung aus brennbaren Gasen und chemischen Verbindungen ist der \"Molten Wind\" die verheerendste Infanteriewaffe der Colonial Legion. Unter Anwendung antiker Verfahren entwickelten meseanische Chemiker eine Technik zur Stabilisierung und Waffennutzung flüssiger Flammen, die jede brennbare Struktur schnell in ein tobendes Inferno verwandeln.",
    "A71DF305443FCA5170FED896D5AC982D": "Hindernisse überwinden",
    "17E4C14547F7A71AAA51BB86BEF12BB9": "Fahrzeug- und Artillerieübungsplatz",
    "20F447FC4BDF66099EC70097CA9F4369": "Fahrzeug- und Artillerieausbildung",
    "BE46601E4365581494C9AEA56425C932": "Fahrzeug Gefecht",
    "459EEE8541430DE62B269381AE88F9E2": "Fahrzeugbau",
    "72D954B54F5FEB3A119A8EBFD74B5EB8": "Fahrzeug Container",
    "B70E5E1546EA67EA21D02AAAB032BFCD": "Fahrzeug Bergegut",
    "0A06D02F4F1C6AA36F1E72983602B77C": "Fahrzeugausbildung",
    "7A08F5DA42AB4991EB99F5B8A111E030": "Fahrzeugausbildung",
    "60BCB3404D4EB0A4C301C79852BE1596": "Fahrzeugausbildung - drücke \"E\", um Schilder zu lesen.",
    "62CC261E4E964EC0D6C093B9FB735CDF": "Fahrzeugausbildung - drücke \"E\", um Schilder zu lesen.",
    "0A8A828945E1DA4C991466A5C1D6A104": "Fahrzeug- und Artillerieübungsplatz",
    "AD7A3A644ABD866DB2F32C8FA46C5A28": "Fahrzeugteile, die zum Zusammenbau von Reliktfahrzeugen genutzt werden.",
    "B95F48F444B13FD8D00E719ED5AC27ED": "Fahrzeuge",
    "E3061F75450C77B4E60E299E6D59B962": "Velianische Splitterschutzweste",
    "D38017A043AE35CFEB2F05BFFEE7CF5E": "Aktionsprotokoll anzeigen",
    "2F4842DD437179837A5AEFBB97554DD7": "Maschinenstatus ansehen",
    "303E6BAF46672F827D298F89D541090F": "Maschinenstatus ansehen",
    "C279E6CE4BDE62C945649786FAE6A4F9": "Globales Ereignisprotokoll anzeigen",
    "B3F3C92A465C4140F42E8CAA25C11785": "Passwort anzeigen",
    "039F9BB6447E1116D611818272C9FFC2": "Region Ereignisprotokoll anzeigen",
    "18AFFBEC4AB3882672067FB09EE390B0": "Aktionsprotokoll für Reservebestände Sichten",
    "486DDFBE41947322EC68068E52A0A271": "Aktionsprotokoll für das Vorratslager anzeigen",
    "0E12E2E24E1CFB7B0A277BA2D4FD48B4": "Technologiebaum anzeigen",
    "E8ED3E5E4457413CE9AB36AC83258442": "Aktionsprotokoll für das aktuelle Reservevorratslager anzeigen.",
    "D7AC356C496F19916B50C0950DAC467A": "Aktionsprotokoll für das öffentliche Vorratslager anzeigen",
    "929135D14764A4DE4D1D758BBEA86003": "Aktionsprotokoll für diese Struktur anzeigen.",
    "8D764ECC436284BB0A5A10B746C7447A": "Das Protokoll für überregionale bedenkliche Spielertaten einsehen.",
    "1F621C1648CD0F6F797ABA8BD26C451C": "Das Protokoll für bedenkliche Spielertaten in der Region einsehen.",
    "00EABA4949026D59CBFC278A8C37F1E6": "Sichtbarkeit",
    "EC98CEBB478918935CE7DDB5D34E879B": "Sichtweite ist ein wichtiger Faktor bei der Navigation auf dem Schlachtfeld.\r\n\r\nAlles, was dein Charakter nicht sehen kann, wird auf deinem Bildschirm ausgeblendet.\r\n\r\nGras, Mauern und Gebüsch sind nützliche Optionen, um sich unbemerkt anzuschleichen. Wenn du dich in Verstecken wie Gras oder Rauch bewegst, legt das deine Position Feinden offen. Versteckst du dich im gleichen Gras oder der gleichen Rauchwolke wie jemand anderes, könnt ihr euch trotzdem sehen.\r\n\r\nProbiere die Sichtbarkeitsmechaniken zusammen mit anderen Soldaten im vorrausliegenden Gras aus.",
    "918C049D42456C9C70DD2092396AC802": "Mauer (Stufe 1)",
    "DC034AAE488D643B6B1597A56C68D2CF": "Mauer (Stufe 1)",
    "2722AC8F406D98EB1286028B6A7AA2A1": "Mauer (Stufe 2)",
    "477869B14534F0ECCC356B81E835BC25": "Mauer (Stufe 2)",
    "235F30394CED001CF6916696D97B5DDC": "Mauer (Stufe 3)",
    "AD1A583646C7176663CD2E91E344D554": "Mauer (Stufe 3)",
    "036F7BF040A93855689455A324717E7A": "Standarte",
    "B771F26C4772777CF3F2618EE3609A33": "Standarte",
    "C436707642C26FC615E3158ECFD09DF5": "Warden Rüstungsuniform",
    "00CA251B463F135BBF3EDDA4EAF8746F": "Panzerwagen der Wardens, sind schnelle vielseitige Fahrzeuge, die für den Orts- und Häuserkampf geeignet sind. Diese Anti-Infanterie Fahrzeuge sind mit doppelläufigen Sturmgewehren ausgestattet.",
    "EA2128214680435E3B4BBEA83D4E4C9E": "Warden Pionieruniform",
    "4D0AC5244B13A47C8941009C85BCB6F5": "Warden schwere Munition Uniform",
    "694BDF4449C49C96C5B048A3438DE700": "Warden Heimatregion",
    "424D68304F36C7F3F293E69FBDFE04BD": "Warden Sanitäteruniform",
    "C79BE0124B1F0987826673A893B491E0": "Warden Uniform der Marine",
    "6D98174942355A95E6AD3BA2F8222859": "Warden Offizieruniform",
    "833AD3274528861D543C7FB14E4720ED": "Warden Späheruniform",
    "6F0900EA48A8B58CDB6E828B2AA8D91E": "Warden Winteruniform",
    "AE2B8CB44BD34A19BB744581D8135EEE": "Warden Soldatenuniform",
    "E6E31CA445C3C6B7EB325191EA4894C2": "Warden Wiedereinstiegspunkt",
    "B8FE7D614032796029CC4FBF1422EEEA": "Warden Panzeruniform",
    "05281AB24E21E26A705DBE9AAC46DBB8": "Warden Spezialisten brauchen eine Uniform welche entwickelt wurde, um den Transport von schwerer Munition zu optimieren.",
    "1764606E426FEC81B69305B4734DE38A": "Waschplatz",
    "BF346DD64665AECE25CA7A99F559900A": "Beobachtungsposten",
    "824288EE43F33BA537D0A898D74027D6": "Wasser",
    "FF730C1E469AE4A99D457F886B7631C9": "Wassereimer",
    "9E06F53144AC52789E387B86072A8BC9": "Wasserpumpe",
    "1035CEFF4BE551D6496A9E9C6D9F8094": "Wasserfahrzeugausbildung",
    "428EB85A4F85F55F5EB752BABEBBE174": "Wasserfahrzeugausbildung",
    "8433448C4D683BCAA53DFF8E67BE580D": "Wasser... in einer Blechkanne!",
    "07C5D94D4BBEBF8187110AB4DBABB7BB": "Wasserfahrzeugausbildung",
    "6D84A2D54B59F48498F7D99A884CFD10": "Wasserfahrzeugausbildung",
    "B811505D48BE6582F67DB1AFB593784C": "Waffenregal",
    "371422D246DF0EFF137498AE1508E008": "Waffen",
    "AC69DB27422EDABB3D96D39974DFD8FC": "Waffenplattform",
    "315186DE41216D8FFEDA299279385EDA": "Wetterstation",
    "87EDCA2B472EB27F49235BA7EDA6D38C": "Wetterstation Teilstücke",
    "FB726F6049EE79E99E8FC4A14DBA35AF": "Willkommen zur logistischen Grundausbildung. \r\n\r\nHier können Sie mit verschiedenen Logistikgebäuden im Spiel interagieren. \r\n\r\nDrücken Sie \"{0}\" um mit jeder dieser Strukturen zu interagieren. Dies öffnet jeweils ein einzigartiges Menü sowie das Inventar der Struktur bzw. des Gebäudes. \r\n\r\nWenn Sie sich nicht sicher sind wie eine Struktur verwendet werden soll, dann klicken Sie auf das '?' (obere rechte Ecke des Menübereichs) für weitere Informationen. Scheuen Sie sich nicht in der Runde herumzufragen!",
    "51FD8B2E4DFBBFDF4D56D9B36BC4C1F8": "Willkommen im Grundlagentraining!\r\n\r\nHier kannst du die verschiedenen zum Erfolg an der Front notwendigen Werkzeuge ausprobieren und üben.\r\n\"{0}\", \"{1}\", \"{2}\", \"{3}\"\r\nFolge dem vorausliegenden Übungskurs. Erklärende Hinweisschilder werden dich auf dem Weg begleiten.\r\n\r\nSollten Fragen aufkommen, zögere nicht, im Chat nachzufragen.",
    "12FF44B542E14ECC02F8269D9734EEFD": "Willkommen auf dem Schießstand",
    "E9B503F942ED2A2ADAC8F79B0D77053F": "Willkommen auf dem Schießstand",
    "0B8DC5AA4943CB768A61BAAD3F1EABBA": "Willkommen auf dem Schießplatz. \\\r\\\rHier kannst du die Grundlagen von Waffenhandhabung und Kampf üben.",
    "B401AA914B004B5937511A9BF775A69C": "Wenn dieser Filter an einer Gasmaske angebracht ist, versorgt er den Träger mit sauberer Luft.",
    "22D8AB584B5470EB43C7FFB73C3C7BAA": "Bei der Bedienung von Artillerie hast Du die Kontrolle über Richtung und Distanz.\r\n\r\nACHTUNG: Zum Drehen werden zwei Spieler benötigt.\r\n\r\nDrücke \"{0}\", um das Geschütz zu benutzen.\r\n\r\nAuf der rechten Seite kannst Du mit \"{1}\" die Distanz einstellen. Auf der linken Seite kannst Du mit \"{2}\" und \"{3}\" die Ausrichtung, bzw. den Azimut (dt.) einstellen.\r\n\r\nAuf der rechten Seite kannst Du mit \"{4}\" feuern, wenn Dein Ziel bestätigt ist.\r\n\r\nEs gibt einen Haken. Du wirst einen dritten Spieler benötigen, der mit Ferngläsern Ausschau hält. Ferngläser reichen nicht so weit, wie diese Artillerie schießen kann. Deswegen ist die Koordinierung mit Deinem Aufklärer sehr wichtig, um genaue Koordinaten zu bekommen.\r\n\r\nDein Aufklärer sollte sich nach \"Vorne\" (an die Front) bewegen und Dir bestätigen, ob das Ziel getroffen wurde, oder nicht.\r\n\r\nFerngläser werden zu Übungszwecken in der nahegelegenen Kiste bereitgestellt.",
    "5A2593F2474A8350890231AB87E6E934": "Der Noble Firebrand Mk. XVII ist zwar ein tödlicher Flammenwerferpanzer, aber es wurde ein effizienteres Mittel für den Einsatz von Flammenwaffen benötigt. Hier kommt der Wild Jack. Benannt nach den von Kindern für Dead Harvest gefertigten Feueridolen, ist der Wild Jack eine Variante des Highlanders.",
    "8957B70144F68175D0FA9CAB7D1B1F21": "Das Aalto gilt weithin als das erste Sturmgewehr und ist ein Wunderwerk des Caovishen Ingenieurwesen. Mit seinen zwei Feuermodi kann es als Schnellfeuer-Sturmgewehr oder als Mittelstreckengewehr verwendet werden.",
    "0027C25143C7C3CFA1A9B390BC088D5B": "Willow's Bane Munition",
    "8743966042226481CA97D2AC0A86BE4D": "Windsack",
    "AF7B30484B84F7CB3B281FB4EC8DDD28": "Windsack",
    "F8A3D28742D634ECEC6163ADACD70588": "Mit all dieser Ausrüstung ist Schwimmen schwierig und kostet jede Menge Energie. \r\n\r\nDu kannst es nicht sehr weit schaffen ohne dabei zu ertrinken also achte auf Deine Ausdauer. Sobald sie aufgebraucht ist gehst Du unweigerlich unter. \r\n\r\nVersuche daher nur mit voller Ausdauer zu den Leitern der gegenüberliegenden Seite zu schwimmen und drücke \"{0}\", um am Dock hochzuklettern.",
    "9CAE023F4D6042AF4DACB4AC7370BC80": "Mit seinem montierten Maschinengewehr ist der \"Doru\" hervorragend für die Unterstützung von Küstenüberfällen geeignet. ",
    "54D8167245B1B50D9CE74B9F8C8E00A7": "Mit verstärkter Panzerung auf Kosten der Geschwindigkeit ist der \"Hoplite\" eine beeindruckende Macht in der Hitze des Gefechts.",
    "1A0B19764918FEB377779D9985BC3B4E": "Einen kritisch verwundeten Soldaten aus einem der belegten Betten abordnen bzw. entfernen. Patienten können nur abgeordnet werden, wenn sie noch nicht vollständig genesen sind.",
    "B8AEACB148375A119C80A3838F06BD14": "Schreibtisch",
    "AA602FB24C71152B3EE62896715959FD": "Weltkarte",
    "74F1E8D84EEC202C23F02F959E1E4183": "Verwundeter Spieler",
    "7FB58D0147267F48E9CF2D8FA1AB33EB": "Verwundeter Spieler",
    "02D4F1714058A0CE72F733B8FC8314D5": "Wrackteil",
    "979F348E476AB09C06619CBF2E6995C2": "Wrack",
    "69F2D0974F432FDCE56A81BDE1DD86DF": "Schraubenschlüssel",
    "2E4B840B4AED4B87E6D74CA93E5D98FA": "Fahrzeugsteuerung",
    "3AE507584369FD2FC1DDB8A4B8737DE8": "Fahrzeugsteuerung",
    "52A39AEC4BA7A075D47F82A76AF30FD7": "Fahrzeugsteuerung",
    "8DC17D5049D5C53800E416A5849A23AE": "Fahrzeugsteuerung",
    "E46F446B4FB93483B329D6B781BE29AB": "feuerbasierend",
    "D2FFEB7A4DDFF3E02982FFB82938DAD5": "mehr über Munition zu erfahren",
    "E9C2441C44E9328C21405B9ECD8A5B4E": "mehr über Munition zu erfahren",
    "E747912D4465E130809C94B5A1180DED": "mehr über Bauhöfe zu erfahren",
    "FE16BB5A4178EBDDC9BB86A2F3350916": "mehr über Bauhöfe zu erfahren",
    "A2B07D6D44094B7CA842C5A93A04D408": "mehr über Fabrikanlagen zu erfahren",
    "DE5DAC9C4B5F7FD886D106B6C843C494": "mehr über Fabrikanlagen zu erfahren",
    "ED00BAF94AF2C27F68EC4BBF640E134D": "mehr über Fabrikanlagen zu erfahren",
    "05052DAD41CF9D748271B8BC61E763A4": "mehr über die Produktion von Anlagenfahrzeugen und Kleinzügen (Schmalspur) zu erfahren",
    "B15766254CBE636492CB0080D846985F": "mehr über die Produktion von Anlagenfahrzeugen und Kleinzügen (Schmalspur) zu erfahren",
    "C91E1797417390787B3FB59436DB01CB": "mehr über die Produktion von Anlagenfahrzeugen und Kleinzügen (Schmalspur) zu erfahren",
    "0AE4C8F34A5F6212CCAE4A976607CBB6": "mehr über Fabriken zu erfahren",
    "FEC11FD847A9C6DD31D197AD6D46AAB3": "mehr über Fabriken zu erfahren",
    "A309E0B0403AF0804C7ACCB0DD9E0035": "mehr über Rohrleitungen/\"Pipes\" und Ölpumpen zu erfahren",
    "DAA0AF194D3AA860AB0664AF00C27B6B": "mehr über Rohrleitungen/\"Pipes\" und Ölpumpen zu erfahren",
    "E5A7A1B84B050EB4165EE88DB78AF4F0": "mehr über Rohrleitungen/\"Pipes\" und Ölpumpen zu erfahren",
    "30B855D14F4AEFBDE1676CBE54F4ACC6": "die grundlegende Steuerung zu erlernen",
    "97E0A56A40BFC7F65568AFBAF40C5D42": "die grundlegende Steuerung zu erlernen",
    "EC63965742494F58F11D309A1FCCE8A9": "die grundlegende Steuerung zu erlernen",
    "C368E4ED4CA40114892452977F45DD4F": "mehr über die grundlegende Logistik zu erfahren",
    "E24061E84F11225974EB8DB0D111F6A2": "mehr über die grundlegende Logistik zu erfahren",
    "7EE1C3A44047C1B57E37529CA65790BA": "mehr über die Grundausbildung zu erfahren",
    "86CBA7F8444C4B7B43BE3DBFE39A9E50": "mehr über die Grundausbildung zu erfahren",
    "8EF9CA7642541BE5AB6FB99009B8745C": "zu erlernen, wie man Gebäude errichtet",
    "DB2FB8054A66961C6F0B7CB7C1D33F20": "zu erfahren, wie man baut und Strukturen errichtet",
    "7AD262E44C3C77920290DD835E1B8883": "zu erlernen, wie man die Kamera steuert",
    "8334DA784C51F1050F20668B66F70035": "zu erlernen, wie man die Kamera steuert",
    "15CBAAAF444E8BB14B0225A8B9C2A8A3": "zu erlernen, wie man Fahrzeuge baut",
    "B8F903D64635261730FDE9985CBE4555": "zu erlernen, wie man Fahrzeuge baut",
    "0088363B4641F06AFB1B6D8434D8CC45": "mehr über Deckung und Unterdrückungsfeuer zu erfahren",
    "596A4C18475A884A349DA89C998F9125": "mehr über Deckung und Unterdrückungsfeuer zu erfahren",
    "1648D9CB40AD089B019BACB7367D558F": "mehr über Treibstoff und Kraftstoff zu erfahren",
    "3D0704E24CCF2CB9AA1235A8F65C5221": "mehr über Treibstoff zu lernen",
    "4083E87C4DAC28C312D348ADCB9AAA2C": "mehr über Treibstoff und Kraftstoff zu erfahren",
    "45C660634250266DDC004084FB427F4E": "mehr über Treibstoff und Kraftstoff zu erfahren",
    "7ECC25004268E3CA76406683EA80A357": "mehr über Treibstoff zu lernen",
    "A744CD30491C9AF5983FAF8851351001": "mehr über Treibstoff und Kraftstoff zu erfahren",
    "C29878954260D69AF4656BABB040DB3B": "mehr über Treibstoff und Kraftstoff zu erfahren",
    "038D3B2148F31508E344E6A50EEF5FC5": "mehr über den Umgang mit Granaten zu lernen",
    "43E16D3848F8183807D6488C68464915": "den Umgang mit Granaten zu erlernen",
    "3D0B5D1744B51D052CAB7E9AD792C289": "zu erlernen, wie man Leitern benutzt",
    "E68E55A5481559D0EA824D98657DDB89": "zu erlernen, wie man Leitern benutzt",
    "338AAFAE4F262FAE27EF109D9A92EBAD": "die erste Hilfe zu erlernen",
    "D698F1D7470753ED87798BBF8912B018": "die erste Hilfe zu erlernen",
    "A0C195214C9186376B85B8A0E07D22C1": "mehr über Minen zu erfahren",
    "C4ADEC65428F7683E98259ADCEB9AD1B": "mehr über kraftstoffbetriebene Ressourcen Minen zu erfahren",
    "020540A545F5F426A471F79933DB5F7B": "mehr über Strom, Rohrleitungen/\"Pipes\" und Beton zu erfahren",
    "44A907C8455E25A7FB9296ADA6F28752": "mehr über Strom, Rohrleitungen/\"Pipes\" und Beton zu erfahren",
    "3BB992D54076D3702B06E4BEEE604E47": "mehr über die Ressourcen zu erfahren",
    "B2F15C704927A49523FB22837FE94AF0": "mehr über Ressourcen zu erfahren",
    "A403145C4DAD6312956840BC2F94429D": "zu erlernen, wie Sie einen Wiedereinstiegspunkt festlegen",
    "D07A2DCF4E4FA1966CF19883A74152C1": "zu erlernen, wie du deinen Wiedereinstiegspunkt festlegst",
    "200F5D2948953AF1D5561B8CB45FF3EE": "mehr über Rückstoß und Stabilität zu erfahren",
    "8C7B95FD4724AE91E4DAC983B46270ED": "mehr über Rückstoß zu erfahren",
    "1D0CDFFA404E58CDEB32A4992CC9E736": "mehr über Körperhaltungen zu erfahren",
    "F0BD5D1A4908CF32CE87979297B8A204": "mehr über Körperhaltungen (im Gefecht) zu lernen",
    "D506A6924D602B067A7AF2BFA3E1B355": "mehr übers Schwimmen zu erlernen",
    "EF97D9524BD64CBDA61469BDEEA094C2": "mehr übers Schwimmen zu erlernen",
    "2B32EA074E6A4EE1C11EC39FC4A4C81F": "mehr über den Testkurs zu erfahren",
    "BE91DB20459FAC26A3E71A9CA3E03203": "mehr über den Testkurs zu erfahren",
    "293C49F74943881F631C7A8C056B9A50": "mehr über die Raffinerie zu erfahren",
    "51A7B2794418A064FD3D1385BE4AA6F9": "mehr über die Raffinerie zu erfahren",
    "A142E4034F175C32125BDA9DFC2FD53B": "mehr über die Raffinerie zu erfahren",
    "E1F7024F4B3A52DC2F7768BB2049A147": "mehr über die Raffinerie zu erfahren",
    "760780A44F68536E8D769D8806B5D6D6": "mehr über die Lagereinrichtungen zu erfahren",
    "970418F24E274F2DF6140AA674E73BE4": "mehr über die Lagereinrichtungen zu erfahren",
    "4E714FF343F9AFF20F76DE97DDF061E3": "mehr über das Artillerie Übungsgelände zu erfahren",
    "E2014FD546985D97B8AE4F8805CE855B": "mehr über das Artillerie Übungsgelände zu erfahren",
    "780E80A946C193372A5B86BDEEE9295B": "mehr über Schützengräben und deren Grundlagen zu erfahren",
    "A5C5B02249EC3A683756709DA8330671": "mehr über Schützengräben und deren Grundlagen zu erfahren",
    "641312794ECF05A52229039F2435C4D3": "zu erlernen, wie man Schützengräben verbindet",
    "EB61E5F2412949DE0C54FF9558134CC3": "zu erlernen, wie man Schützengräben verbindet",
    "03763D2E47A40D779BFE48ABBD891653": "zu erlernen, wie man Schützengräben aufwertet und modifiziert",
    "BEF99AB346278DA350703EAFACFE8CB7": "zu erlernen, wie man Schützengräben aufwertet und modifiziert",
    "D9C68AA04C9DB47E51A7609C4C168ECA": "mehr über das Klettern und Überwinden von Hindernissen zu erfahren",
    "EB4565C64FAE40B37F19A2AB01A61057": "mehr über das Klettern und Überwinden von Hindernissen zu erfahren",
    "21C52C1445DDE46224F6D28133B8651A": "den Umgang mit Waffen zu erlernen",
    "47E331D448BD5876C983D48C5C614B76": "mehr über die Waffen zu erfahren",
    "7ABF21D94A081CBA5F8428A1C4C2F3B6": "Einsatzkarte öffnen",
    "AE6DA3D94266574B76FE289A4466D6B5": "mehr über Munition zu erfahren",
    "FCC34A374DDE1BDF144E1E997F81B7C6": "mehr über Artilleriemunition zu erfahren",
    "08EC3C104782AC39BB860CBF5AAA8944": "mehr über die Grundlagen der Artillerie zu erfahren",
    "E9266B2B49708818A1A8DABB3CECCAEC": "die grundlegende Steuerung zu erlernen",
    "711202284F51E5F3F67B94A259957C3C": "mehr über grundlegendes Schrottsammeln zu erfahren",
    "82BD7AD141DF7DBCA3B8848E052BFC5C": "mehr über die Grundausbildung zu erfahren",
    "94A7480045AF0BD426D06787C4151763": "zu erfahren, wie man baut und Strukturen errichtet",
    "6A1F48124732AF8FBC4EDE96CE1BBEF5": "zu erlernen, wie man die Kamera steuert",
    "2448B8A2473A60B402825293DD660F91": "mehr über Bauhöfe zu erfahren",
    "9CFE905D411686EEFBE935B8220D5129": "mehr über Deckung und Unterdrückungsfeuer zu erfahren",
    "09E3A48C44768734DAB94DB43F236534": "mehr über Fabriken zu erfahren",
    "8F4E011C4B9907EF624E4D84180F54D0": "mehr über Feldartillerie zu erfahren",
    "03F2BD49496DBDCC7CE2EF87EE87FBF5": "mehr über Brandbekämpfung und Wassereimer zu erfahren",
    "9EC484BD418FBBAAA81B13B38C51768E": "mehr über Treibstoff und Kraftstoff zu erfahren",
    "CC221D66405D5D937DDB2DBBD0013109": "mehr über den Umgang mit Granaten zu lernen",
    "3DAFC1904E06A0330CD543AEE9AAC5C4": "mehr über Leitern zu erfahren",
    "03FF59AD481859B5D3F03AAA464ADEB6": "mehr über Erste Hilfe zu erfahren",
    "CCB9F7174B8EF9603CA88C9CFFD31F4F": "mehr über das sogenannte Ressourcen-\"Mining\" zu erfahren",
    "B0FC1C6D436D73B8A215069514BCE298": "mehr über Strom und Beton zu erfahren.",
    "A15E50C842D13938A888D394C57FC648": "mehr über Raffinerien zu erfahren",
    "DBD70EAD498C06984D4D73A6412BACA8": "zu erlernen, wie Sie einen Wiedereinstiegspunkt festlegen",
    "158EA3EE4EAFD6DE2ACE90BB0EAEBBF2": "mehr über Schützengräbenverbindungen zu erfahren",
    "42C9953244A2E547E724F2A084B337F8": "mehr über Soldatenvorräte zu erfahren",
    "5152A8C6472718ADDFC3BB899B8870C4": "mehr über Spezialrohstoffe zu erfahren",
    "BAC568854E21F76ECC6090815A03DFF6": "mehr über Rückstoß und Stabilität zu erfahren",
    "5CDFA67D4CEF0F8585D92AA362482EC1": "mehr über Körperhaltungen (im Gefecht) zu erfahren",
    "5A0BE9F04E26D36AEFCFCEBA55A0EF20": "mehr über Lagerhäuser zu erfahren",
    "524C9CA04B1BEF52EFF8568BFC714EE1": "mehr übers Schwimmen zu erfahren",
    "7A792E304FA050FDE3A54EA1EE886F10": "mehr über Schützengrabengrundlagen zu erfahren",
    "DE6588614A4C91A7B8394E9BC978C669": "zu erlernen, wie man Schützengräben aufwertet und modifiziert",
    "A0D11951442BED25FC916B8748F62176": "mehr über das Klettern und Überwinden von Hindernissen zu erfahren",
    "5B8CB6644F96A5432014D6BBA080C9FC": "mehr über die Sichtbarkeit zu erfahren",
    "0A3063974DD6BA50E078B592865444DC": "mehr über die Steuerung von Wasserfahrzeugen zu erfahren",
    "1F03C87A46C06A8A42506E82B683ED93": "mehr über die Waffen zu erfahren",
    "48353CF944B23C3C2137BABC530388F6": "mehr über die Windverhältnisse zu erfahren",
    "F86E47C7459AA8988ACC359EDE768A70": "mehr über die grundlegende Fahrzeugsteuerung zu erfahren",
    "0280D14E4BEDB25E13AF72B8205F922E": "mehr über Grundlagen der Logistik zu erfahren",
    "BE048D3844ECFB09ECA443ABC68D59F0": "mehr über das Nachtanken zu erfahren",
    "527191D34969B0CE333D1F95180ADD22": "mehr über das Trainingsgelände mit Schießständen zu erfahren",
    "DF72F2B3479ED64AC290BA86B06B7A0C": "mehr über das sogenannte Reservierungssystem zu erfahren",
    "75E3D7774784307D86886AB075C41FCE": "mehr über den Testkurs zu erfahren",
    "97F028E942F5E6E8605FB08AF2CE03AF": "mehr über Gefechte mit Fahrzeugen zu erfahren",
    "39DABAB1465FEE3E79767AABA724E8CC": "mehr über den Fahrzeugbau zu erfahren",
    "6450546E4CB6BC314CE09BB057DDA3E8": "mehr über Fahrzeuge zu erfahren",
    "712D0E064A2AB3A2651E44BB5316562A": "Bericht lesen",
    "67E77A2A424BF07EF7C82ABF5819F808": "Schild lesen",
    "51C18A614140C992A0A56AB2E32D7B2D": "aktuellen Stand des Krieges anzeigen",
    "082F996F443450ADAA53759564EB09F6": "mehr über Artillerie zu erfahren",
    "28A0B67A47D6A5005E69C69E81990A9C": "mehr über die Artillerie zu erfahren",
    "B9116999448514474BF020A8533216B0": "mehr über Artillerie zu erfahren",
    "71E8568F4C38101A2F23159D46A04EBE": "mehr über die Bewaffnung von Fahrzeugen zu erfahren",
    "E0BA5C464F90932280B594B962D17DEA": "mehr über die Bewaffnung von Fahrzeugen zu erfahren",
    "011B5AEE44AE74D7485D56B68B3CB9AF": "mehr über Fahrzeuge zu erfahren",
    "11D5F20A432A71B07E745F8FC7D0DF1E": "mehr über den Umgang mit Fahrzeugen zu lernen",
    "887539864C80B1027E005581B6F575E3": "mehr über den Umgang mit Fahrzeugen zu lernen",
    "E8E840F348003C254669E98F8A4FF38F": "mehr über den Umgang mit Fahrzeugen zu lernen",
    "22136F9849FE26E3CB5B679431A1B0FB": "Denkmal betrachten",
    "DC49F557408D54D58463F3B9A504E112": "“Molten Wind” v.II Brennstoff",
    "1B1D7EE34D1F9D18ABDAE0AB42CAAF45": "“Molten Wind” v.II Flammenwerfer",
    "7E46E2A240D435B554270B8520F4BEEB": "“Die Pitch Gun” mc.V"
  },
  "STActions": {
    "ActionAim": "Zielen",
    "ActionAimToggle": "Zielen Umschalten",
    "ActionAppendMapCoordinates": "Kartenkoordinaten Anhängen",
    "ActionBuild": "Bauen",
    "ActionCenterMapOnPlayer": "Karte Auf Spieler Zentrieren",
    "ActionChangeChatTab": "Chat \"Tab\" Wechseln",
    "ActionChangeGear": "Gang Wechseln",
    "ActionEmoteCheer": "Jubeln",
    "ActionCameraZoom": "Cinematic Kamera-Zoom",
    "ActionClimb": "Klettern",
    "ActionCycleTabBackward": "Tabwechsel Links",
    "ActionCycleTabForward": "Tabwechsel Rechts",
    "ActionEmbarkContextMenu": "Kontext Menü Ausklappen",
    "ActionEquipPrimary": "Primärslot Ausrüsten",
    "ActionEquipSecondary": "Sekundärslot Ausrüsten",
    "ActionEquipTertiary": "Tertiärslot Ausrüsten",
    "ActionFire": "Feuern",
    "ActionForceDropLargeItem": "Not-Fallenlassen Sperriger Gegenstände",
    "ActionEmoteGoForward": "Vorwärts",
    "ActionHandbrake": "Handbremse",
    "ActionInteractContextMenu": "Kontextmenü Interaktion",
    "ActionInventory": "Inventar",
    "ActionLockVehicle": "Fahrzeug Absperren",
    "ActionMount": "Montieren",
    "ActionMoveBack": "Rückwärtsbewegung",
    "ActionMoveForward": "Vorwärtsbewegung",
    "ActionMoveLeft": "Linksbewegung",
    "ActionMoveRight": "Rechtsbewegung",
    "ActionInteractLargeItem": "Sperriges Aufheben/Fallenlassen/Überm.",
    "ActionPlaceCallout": "Platziere \"Callout\"",
    "ActionPlaceStructure": "Platziere Struktur",
    "ActionPlayerInteractMode": "Spielerinteraktionsmodus",
    "ActionPushToTalkSquad": "Push-To-Talk aktiver Trupp",
    "ActionPushToTalkLocal": "Push-To-Talk lokaler Sprachchat",
    "ActionRadioBackpackTransmit": "Mobile Funkübermittlung Starten",
    "ActionEmoteRallyPoint": "Hier Versammeln",
    "ActionReload": "Nachladen",
    "ActionReply": "Antworten",
    "ActionRotateCamera": "Kamera Rotieren",
    "ActionRotateCameraLeft": "Kamera Rotieren (Links)",
    "ActionRotateCameraRight": "Kamera Rotieren (Rechts)",
    "ActionRotateStructure": "Struktur Rotieren",
    "ActionEmoteSalute": "Salutieren",
    "ActionSpectateNextPlayer": "Nächsten Spieler Zuschauen",
    "ActionSpectatePreviousPlayer": "Vorherigen Spieler Zuschauen",
    "ActionSprint": "Sprinten",
    "ActionEmoteSurrender": "Ergeben",
    "ActionSwitchSeats": "Sitzplatz Wechseln",
    "ActionSwitchToSeat01": "Wechsel zu Sitz 01",
    "ActionSwitchToSeat02": "Wechsel zu Sitz 02",
    "ActionSwitchToSeat03": "Wechsel zu Sitz 03",
    "ActionSwitchToSeat04": "Wechsel zu Sitz 04",
    "ActionSwitchToSeat05": "Wechsel zu Sitz 05",
    "ActionSwitchToSeat06": "Wechsel zu Sitz 06",
    "ActionSwitchToSeat07": "Wechsel zu Sitz 07",
    "ActionSwitchToSeat08": "Wechsel zu Sitz 08",
    "ActionSwitchToSeat09": "Wechsel zu Sitz 09",
    "ActionSwitchToSeat10": "Sitzplatzwechsel zu Sitz 10",
    "ActionTakeScreenshot": "\"Screenshot\" Aufnehmen",
    "ActionToggleAlerts": "Benachrichtigungen Umschalten",
    "ActionCalloutsMenu": "\"Callout\" Menü Aufrufen",
    "ActionToggleCrouch": "Hocken Umschalten",
    "ActionToggleInterface": "Interface Umschalten",
    "ActionMap": "Zur Kartenansicht Wechseln",
    "ActionToggleMode": "Modus Wechseln",
    "ActionPlayerScreen": "Spielerbildschirm Umschalten",
    "ActionToggleProne": "Liegen Umschalten",
    "ActionSecureMap": "Zur Sicheren Kartenansicht Wechseln",
    "ActionToggleVoiceChat": "Sprachchat Umschalten",
    "ActionToggleVoiceChatLocal": "Sprachchat Umschalten (Lokal)",
    "ActionToggleVoiceChatSquad": "Sprachchat Umschalten (Trupp)",
    "ActionUse": "Benutzen",
    "ActionViewRoofs": "Obere Bunker Ansehen",
    "ActionEmoteWave": "Winken"
  },
  "STChassis": {
    "ChassisATGrenade": "Panzerabwehr-Granate",
    "ChassisATRPG": "Panzerabwehr-RPG",
    "ChassisATRifle": "Panzerbüchse",
    "ChassisAssaultRifle": "Sturmgewehr",
    "ChassisEntrenchment": "Schützengraben",
    "ChassisExplosiveCharge": "Explosive Ladung",
    "ChassisFoundation": "Fabrikanlagen Fundament",
    "ChassisRailwayTrack": "Fabrikanlagen Gleis",
    "ChassisFacility": "Fabrikanlagenstruktur",
    "ChassisFortification": "Feld Befestigung",
    "ChassisFieldGear": "Feldausrüstung",
    "ChassisFieldTool": "Feldwerkzeug",
    "ChassisFlameThrower": "Flammenwerfer",
    "ChassisFlameThrowerAmmo": "Flammenwerfer Brennstoff",
    "ChassisGarrison": "Garnisonshaus",
    "ChassisGrenade": "Granate",
    "ChassisGrenadeLauncher": "Granatwerfer",
    "ChassisRifleHeavy": "Schweres Gewehr",
    "ChassisLargeMaterial": "Sperriges Material",
    "ChassisRifleLong": "Langgewehr",
    "ChassisLore": "\"Lore\" Gegenstand",
    "ChassisMG": "Maschinengewehr",
    "ChassisMedical": "Medizinische Ausrüstung",
    "ChassisMelee": "Nahkampfwaffe",
    "ChassisMinefield": "Minenfeld",
    "ChassisMortarAmmo": "Mörsermunition",
    "ChassisMountedEquipment": "Montierte Gerätschaft",
    "ChassisMountedMG": "Montiertes Maschinengewehr",
    "ChassisPistol": "Pistole",
    "ChassisRawMaterial": "Rohmaterial",
    "ChassisRefinedMaterial": "Veredeltes Material",
    "ChassisHarvester": "Rohstoffsammler",
    "ChassisRifle": "Gewehr",
    "ChassisShippable": "Fracht-Container",
    "ChassisShippableMaterial": "Versandfertiges Material",
    "ChassisShotgun": "Schrotflinte",
    "ChassisSniper": "Scharfschützengewehr",
    "ChassisSMG": "Maschinenpistole",
    "ChassisSupplies": "Ausrüstung (Nachschub)",
    "ChassisUtility": "Versorgungsstruktur"
  },
  "STStructures": {
    "ImodBermDesc": "Eine Barriere, die die Sichtlinie aus einem Graben in eine Richtung behindert. Macht erbeutete Schützengräben weit weniger nützlich.",
    "ImodStrategicMapDesc": "Ein Schwarzes Brett mit diversen Karten und Daten der Region. Sorgfältige Planung und Navigation sind die Schlüssel zu einem erfolgreichen Einsatz.",
    "ImodSandbagsDesc": "Ein Schutzwall, der Feindbewegungen einschränkt und als Deckung in Kampfsituationen dient.",
    "ImodHardPointDesc": "Eine Verteidigungsposition, die Bewegung in eine Richtung blockiert.",
    "ImodRadioStationDesc": "Ein Funkgerät mit großer Reichweite, dazu ausgelegt, Befehle im Handumdrehen zu übertragen. Manchmal hat man einfach keine Zeit, die Nachricht per Brief zu schicken.  ",
    "ImodLatrineDesc": "Ein sicherer Ort um sein Geschäft zu verrichten. Immerhin muss jeder irgendwann mal auf's stille Örtchen.",
    "ImodKitchenDesc": "Ein sicherer und sauberer Platz um Rationen oder geplünderte Essensvorräte zuzubereiten. ",
    "ImodChalkBoardDesc": "Eine einfache Kreidetafel, um Einsätze zu planen.",
    "ImodWorkstationDesc": "Ein Arbeitsplatz, der verschiedenste Anspruch erfüllt. Sei es, indem man einen Brief an Menschen schreibt, die einem nahe stehen oder man eine Bestandsaufnahme über verbleibenden Rationen macht. Einfach jeder kann einen stabilen Tisch gebrauchen.",
    "ImodStairsBunkerDesc": "Ermöglicht einen einfachen Zugang zum Dach des Bunkers",
    "ImodFiringPortDesc": "Ermöglicht es, mit Infanteriewaffen und Lafetten im Schutze des Bunkers zu feuern.",
    "ImodBridgeDesc": "Ermöglicht es Fahrzeugen, diesen Schützengraben zu überqueren.",
    "PipeModInsulationDesc": "Ein Isoliermaterial, das verhindert, dass das Rohr bei rauen Wetterbedingungen einfriert.",
    "ImodBarbedWire": "Stacheldraht",
    "ImodBunksDesc": "Etagenbetten. Es mag zwar nicht so gemütlich aussehen, aber wenn es Zeit zum Schlafen ist, fühlt sich selbst eine eigene Koje wie ein Zuhause an.",
    "ImodBerm": "Sandsackwall",
    "ImodBridge": "Brücke",
    "ImodBunks": "Etagenbetten",
    "ImodChalkBoard": "Kreidetafel",
    "ImodComputerModule": "Rechenmaschinen Modul",
    "ImodComputerModuleDesc": "Manchmal benötigt man mehr als nur Willenskraft, um verschlüsselte Nachrichten zu entziffern. Diese hochmodernen Rechenmaschinen greifen dabei unter die Arme. ",
    "ImodDoorway": "Durchgang",
    "ImodFiringPort": "Schießscharte",
    "PipeModInsulation": "Isoliertes Rohr",
    "ImodInteriorFiringPort": "Interne Schießscharte",
    "ImodKitchen": "Küche",
    "ImodLadder": "Leiter",
    "ImodLockers": "Spinde",
    "ImodPantry": "Vorratskammer",
    "ImodLadderDesc": "Erlaubt Dachzugang zum Bunker.",
    "ImodPipes": "Rohre",
    "ImodInteriorFiringPortDesc": "Bietet Deckung vor in den Bunker eingedrungenen Gegnern",
    "ImodTrenchRoofDesc": "Bietet Deckung vor in den Bunker eingedrungenen Gegnern",
    "ImodStairsDesc": "Ermöglicht einfachen Zugang zum Schützengraben.",
    "ImodDoorwayDesc": "Erlaubt den Zugang zu diesem Bunker.",
    "ImodPipesDesc": "Überträgt Strom von Generatorenräumen zu Bunkererweiterungen.",
    "ImodRadioStation": "Funkstation",
    "ImodSandbags": "Sandsäcke",
    "ImodPantryDesc": "Regale zur Aufbewahrung von Rationen, Vorräten und alltäglichen Werkzeugen.",
    "ImodBarbedWireDesc": "Dient dazu feindliche Infanterie zu verlangsamen, die versucht den Schützengraben zu stürmen.",
    "ImodStairs": "Treppe",
    "ImodStrategicMap": "Strategische Karte",
    "ImodLockersDesc": "Diese persönlichen Schließfächer sind simpel und effektiv. ",
    "ImodWashStationDesc": "Räume vor Mahlzeiten auf, wasche Klamotten oder reinige Geschirr; Hygiene ist zur Infektions- und Krankheitsvermeidung vital.",
    "ImodTrenchRoof": "Überdachung für Schützengräben",
    "ImodWashStation": "Waschplatz",
    "ImodWorkstation": "Schreibtisch"
  },
  "STTutorial": {
    "TutorialActionHoldCamera": "(Halten)\r\nKamera drehen\r\n\r\n(Strg+Scrollen)\r\nCineastischer Zoom",
    "TutorialActionHoldRotateStructure": "(Halten)\r\nStruktur Rotieren",
    "TutorialActionHoldAim": "(Halten) Zielen",
    "TutorialActionCycleWeapons": "Waffenwechsel",
    "TutorialActionEnterVehicle": "In Fahrzeug Steigen",
    "TutorialActionLocalVoiceChat": "Lokaler Sprachchat",
    "TutorialActionMove": "Bewegen"
  },
  "War": {
    "LightUtilityVehicle": "Leichtes Nutzfahrzeug",
    "Turret": "Geschützturm"
  }
}