{
  "": {
    "45D2C1E8485F1B0D876989BAAC564C0C": "Artilharia de Campo 120-68 \"Koronides\"",
    "916138E445876798C80845824CF00F8A": "Artilharia de Campo 120-68 \"Koronides\"",
    "70E8F99F481D13F68E84B0B73F53CEC8": "Rifle anti-tanque Neville 20 mm",
    "060FC4A347CAEAEB15F415A78AC7EFFA": "20 mm",
    "18569AA2442755B30417B9A79CDF9929": "250 mm",
    "CAB09D624FC3C44F8E72E784DB49B0FA": "Foguete Altamente Explosivo-3C",
    "207EFC4040D06114E7C593BE1A96F7A4": "Foguete Incendiário - 4C",
    "ABE92E8B41355AF0EF2BF89C9F6AE45D": "Um veículo de combate urbano anti-infantaria Colonial. Usa munição 7.92mm e é vulnerável na traseira.",
    "DB42CDE2472CDA9F938C8EB6E78BCF2A": "Um veículo Colonial utilizado para transporte de tropas e suprimentos.",
    "6E22A7064B8B01616C97DCACB5358CA7": "Um rifle Krauniano modificado para engajamentos de longa distância. Não possui o alcance ou poder de parada de outros rifles de precisão, mas mais que compensa com confiabilidade inigualável em uma variedade de ambientes e cadência de tiro efetiva superior.",
    "E8DF220F4C61FFF4E87167BDB240E8F5": "Uma guarnição constante grande mantem ativa a inteligência artificial guarnecendo construções em um raio de 80 metros permanentemente.\r\n\r\nPesquisar guarnição constante grande é um requisito necessário para atualizar a base para o nível 3.",
    "D0B5C6594E1D21848FCBB3B8F4B5BA31": "Uma Guarnição Provisória conecta esta base com estruturas defensivas próximas. Estruturas defensivas irão desativar se atividade de jogadores for muito baixa. \r\n\r\nIsto permite Cidades serem reivindicadas para as condições de vitória.",
    "2E97128843820EB35C9F7594653DE298": "Uma refinaria para converter recursos brutos em materiais utilizáveis.",
    "DB8F146845B3D2707EEE4FAA7E9F3FB0": "Uma guarnição constante ativa a inteligência artificial guarnecendo construções em um raio de 80 metros permanentemente.\r\n\r\nPesquisar guarnição constante é um requisito necessário para atualizar a base para o nível 2.",
    "9BC06F1F45F3DFB47E850090FE338208": "Uma motocicleta Warden usada em patrulhas e equipada com um sidecar. A Kivela Power Wheel também pode ganhar velocidade ao ativar um turbo ao custo de consumir mais combustível.",
    "E67197AD45F7368F5E843F85DB73B7C6": "Um veículo de combate urbano anti-infantaria Warden. Usa munição 7.92mm e é vulnerável na traseira.",
    "C1ADB43947CBF8A0166097B86CEA58D5": "Um veículo Warden usado para transportar tropas e suprimentos.",
    "0810394D4C98AC57B6375A9556ADFDAF": "Uma barreira usada para impedir a passagem.",
    "CB0B50A44DDC10BE211DC4B4B7381153": "Uma barreira usada para impedir a passagem por uma área.",
    "42F6EE1B42458373F5AD0FACFAB8D199": "Uma barreira básica utilizada para previnir a passagem por uma área.",
    "849F766947B123B6F7AC2B9B46735242": "Uma fornalha que refina ainda mais o óleo pesado em um óleo enriquecido necessário para processos avançados.",
    "1B9EA5094C9510ADD875C682CD9695E1": "Um componente do sangue usado para tratar soldados caídos no campo de batalha.",
    "071146C64F45BB20DC7F9097F2927408": "Um quadro ajustado com vários mapas da região e gráficos úteis. Planejamento cuidadoso e navegação são as chaves para qualquer operação bem-sucedida.",
    "79E7DF2446C683B4A4C5BBBF7E6F0F00": "O \"Ixion\" é uma variante do tanquete T12 que fornece mais proteção à sua tripulação e monta um canhão 30 mm de apoio à infantaria. Mas o aumento do peso da armadura resultou numa redução na sua velocidade geral.",
    "1D3E7E0B40AD5A10BA91D0A502DFCD97": "Um balde que segura água. Você pode jogar água no fogo para extingui-los.",
    "3374580C4828A038F890F0865E7A4404": "Uma liga de metais extremamente raros utilizados na produção dos mais avançados veículos e armas.",
    "7E40D2154CE6CB3C3E6061949B00885E": "Um composto de concreto usado para construir estruturas mais fortes.",
    "9DF94D654A1A4D7A9594109BDFF73675": "Um vagão contêiner para transportar carvão para abastecer trens em longas distâncias. ",
    "5E7A0E644EAC8007BB97D79FC018D9C2": "Um contêiner para transporte em massa de caixas utilizando veículos transportadores de contêineres. Este tipo de contêiner pode ser descarregado apenas em Depósitos e Portos.",
    "E23C94E74E90656A4646E4B76C1064A2": "Um recipiente para armazenar grandes volumes de líquidos. Estruturas e veículos próximos podem reabastecer diretamente deste recipiente. ",
    "0940EACD44FCACF5968E3D973AC19D10": "Um contêiner que carrega muitos recursos e pode ser transportado por veículos específicos.",
    "ABE5635E4960DF03209C51B702D6B9A4": "Uma caixa de itens. Estas devem ser submetidas a um estoque para que os itens contidos nelas possam ser retirados.",
    "ACF04FFB45D3815A46FBA8A4817BAB49": "Uma caixa de estruturas embaladas.",
    "92413FCE410B5FD33CC7E7BECF7DFEEB": "Caixa de veículos.",
    "E41316F941B33903879094BC79330D6A": "Uma variação do Tanque de Assalto Silverhand que sacrifica armadura e proteção em favor de um canhão de 94,5 mm. Esta variação caça-tanques foi projetada exclusivamente para interceptar e destruir veiculos inimigos antes que eles tenham tempo de retaliar. Seu apelido é uma homenagem à mutilação do grande rei que dá nome ao Silverhand; embora seu título tenha sido retirado e seu orgulho reduzido a pó, seu ódio nunca foi cessado.",
    "0670B3AB41061136BDA48382F2BA1F64": "Uma barreira defensiva que dificulta o movimento inimigo e fornece cobertura durante o combate.",
    "41E8BDBD43A5DBAA714F13BB9B8F345F": "Uma barreira defensiva que dificulta o movimento inimigo e fornece cobertura durante o combate.",
    "A8CDA9DA405A9520FCAB96A5C7E7CCEE": "Uma posição defensiva com um canhão antitanque de 68 mm. Esta arma rudimentar já foi construída para caber no casco de poderosos navios de guerra, mas acabou sendo aposentada e reaproveitada.",
    "00358E364B11C747248F818F086B46CD": "Um muro defensivo que impede o movimento inimigo e dá cobertura em combate.",
    "3105F0534A0D724D774462A341DAA801": "Um muro defensivo que impede o movimento inimigo e dá cobertura em combate.",
    "99C132674FFD45DF7D2E56B3BC711991": "Uma trincheira para armas estacionárias destruída.",
    "BE5E36F541B479B4216542B5A6ADFC4B": "Uma trincheira para armas estacionárias destruída.",
    "D66C394A48367596582750A9659F5C0C": "Uma trincheira para armas estacionárias destruída.",
    "68092C204DF23054102EA1AA67500C02": "Um conector de trincheira destruído.",
    "91F78F5F4497E20D3A4795993359477D": "Um conector de trincheira destruído.",
    "BD1F34F343EC150E2863888593CE9063": "Um conector de trincheira destruído.",
    "2C46569947371E295E55CE9C92500740": "Uma trincheira destruída.",
    "594A7EAA47FD9AAE46EBE090CB2A4429": "Uma trincheira destruída.",
    "EB7366454EC479B9AD5D1C98A9730D2A": "Uma trincheira destruída.",
    "4E49999842287992ED3A1386617B3BB1": "Um dispositivo usado para interceptar as transmissões de rádio inimigas que estão sendo enviadas de fontes próximas.",
    "F19A102C4321B3F939D887A4CABACDA7": "Um dispositivo usado para interceptar as comunicações de rádio inimigas que estão sendo enviadas de fontes próximas.",
    "662029924BA10BE1FE3BBCA7285337B9": "Um barril contendo combustível para uso com armas lança-chamas.",
    "AED06A8142D5D69B92B9BEA908FCFCE2": "Uma metralhadora 12.7 mm anti-infantaria de dois canos. O Swallowtail é equipado com blindagem frontal e é excelente para supressão de estruturas ou infantaria inimiga. ",
    "412F9B3C4C78EE64DA2A659E761946AE": "Uma metralhadora anti-infantaria movel de calibre 12.7 mm de dois canos. O Sagittarii é equipado com armadura frontal e é excelente para supressão de alvos. ",
    "07E2E2DF4A18549BA72607ABD8CE60D9": "Um abrigo usado para cobertura e como passagens entre Bunkers. Se conecta com outras Trincheiras e Bunkers.",
    "BC51F6BD4705B2E3B4FBCEAB125A1A82": "Um abrigo usado para cobertura e como passagens entre Bunkers. Se conecta com outras Trincheiras e Bunkers.",
    "DD2AB37D4FA6E5A48AD411916356CE29": "Um abrigo usado para cobertura e como passagens entre Bunkers. Se conecta com outras Trincheiras e Bunkers.",
    "76B16A824CBCB1A33968A6BFE11AD03F": "Uma trincheira que pode ser usada para cobertura e como passagem entre Bunkers. Conecta a outras Trincheiras e Bunkers. Essa é uma trincheira especial que se redimensiona automaticamente e pode ser construída por baixo de ruas.",
    "DFFC4C2D4A663BFF702B08BAB37B7C5A": "Uma trincheira que pode ser usada para cobertura e como passagem entre Bunkers. Conecta a outras Trincheiras e Bunkers. Essa é uma trincheira especial que se redimensiona dinamicamente e pode ser construída por baixo de ruas.",
    "FF9A406C41A2FA315015A38BC88B91CB": "Uma trincheira modular usada para conectar passagens entre abrigos subterrâneos. Conecta-se a outras trincheiras e abrigos subterrâneos. Esta é uma variante especial da trincheira que pode ser redimensionada dinamicamente e pode ser construída sobre estradas para conectar abrigos subterrâneos.",
    "2F7B619D405D508DFA5DEF94AA028D8C": "Um abrigo usado para cobertura e como passagens entre Bunkers. Se conecta com outras Trincheiras e Bunkers. Esta variante também serve como colocação para defesas manejáveis.",
    "A320DFC84F9F465BBF6EDAB03B974770": "Um abrigo usado para cobertura e como passagens entre Bunkers. Se conecta com outras Trincheiras. Esta variante também serve como colocação para defesas manejáveis.",
    "FA81A3C548714C37F5F2258FB1420749": "Trincheira padrão e não modular que pode conectar bunkers. Conecta-se a outras trincheiras e bunkers. Esta variante também pode ser modificada para ser uma ponte.",
    "D8EDFE25412F16F3D52F71B321EB90C9": "Uma sala de máquinas que fornece energia para Bunkers usando canos de conexão.",
    "DF6685414ACEF01A0812CE95BB5B0BFD": "Uma sala de máquinas que fornece energia para Bunkers usando canos de conexão.",
    "23E6D64B495A0A6B46E711BCD9D03A93": "Uma instalação que armazena equipamentos e munições para artilharia. A retirada de munições é muito rápida para esta estrutura.",
    "3B196CD540FB62AD3622579FBF626BFE": "Uma instalação que armazena equipamentos e munições para artilharia. A retirada de munições é muito rápida para esta estrutura.",
    "BB7C28194487CA425C4DF98A61D4FE2C": "Uma fábrica para produzir tipos de munição avançados, como cartuchos de grande calibre, foguetes e munições inflamáveis.",
    "BE177EE4441C5F046CC8049B97050210": "Fábricas que refinam matérias-primas em materiais de construção refinados. Modificações adicionais poderiam permitir o processamento de outros materiais refinados necessários para operar instalações industriais avançadas.",
    "77F7A5C245872D31C6810B8DFAFF6296": "Uma fábrica que refina recursos brutos em materiais de construção para instalações avançadas. Modificações adicionais permitem o desenvolvimento de uma variedade de materiais diferentes.",
    "87312142472EB68405C143887E747795": "Um projétil explosivo rápido usado com RPGs.",
    "D80FAAA943B11E8EE5B1FD8917D0EB63": "Uma estrutura médica de campo usada para tratar soldados gravemente feridos na linha de frente. ",
    "DACD4BF34D13FA3410AFD4B1ADE16D36": "O primeiro de seu tipo, o Skycaller é uma variação do Niska Motor Carriage com uma bateria de foguete projetada pela Rycker instalada na caçamba traseira. Este veículo blindado único dispara foguetes rapidamente por longas distâncias com facilidade e pode ser rearmado e realocado num piscar de olhos. O Skycaller é o resultado da engenharia combinada das nações Nevish e Caoivish.",
    "BD812A6742F1D60A2CA2E09E408378F3": "Vagão Plataforma para o transporte de grandes quantidades de recursos e munições por trem em longas distâncias. ",
    "13D9448B439D377ACF804D9C57381E7C": "Um estaleiro inundável e plataforma de construção que facilita a montagem e reparo das maiores embarcações navais.",
    "0C71638A4003A5349C54ECAF3E566645": "Um uniforme formal que demonstra que o jogador é um oficial de um regimento. Mesmo sendo pouco prático, o oficial em campo pode usar de esse uniforme para ''disciplinar'' membros do seu regimento sem penalidades. Os oficiais possuem um papel importante na história militar Warden, datando desde de os tempos antigos quando Caoiva ainda era governada por múltiplos reis.",
    "CDDD81B84541976034E1D6BA163C62BB": "Uma fundação que fornece uma superfície adequada para a construção de Instalações Industriais.",
    "8DA8488E4CCE724BE7D96595F1312DAE": "Uma oficina que permite modificações e atualizações de veículos.",
    "44C193C343183902EC1598A00A0E7236": "Um edifício central guarnecido, vital para a defesa de uma cidade. Os jogadores podem renascer e depositar itens aqui.",
    "6FBF40EC4148F845D6E9838CCE86CE5E": "Um edifício central guarnecido, vital para a defesa de uma cidade. Os jogadores podem renascer e depositar itens aqui.",
    "BEAB2C24421E9FFAC1FD26B28C0F991B": "Um edifício central guarnecido, vital para a defesa de uma cidade. Os jogadores podem renascer e depositar itens aqui.",
    "F85BCBE9434061E78F8BBBA1F83C0D89": "Um edifício fortificado, vital para a defesa de uma cidade. Os jogadores podem renascer e depositar itens aqui.",
    "75C05BD74EA44B3459F6DD9AE7D7477F": "Um portão que permite acesso a uma área cercada.",
    "F40945DD48E7FE4C35DD0188F1295FE7": "Um portão que dá acesso a uma área murada.",
    "FCF631C147D5FEC5ECAAEABFBEF23D0E": "Um portão que dá acesso a uma área murada.",
    "C123BDFD4EAF70CBDB604F8DBA641B22": "Um gerador que queima carvão para gerar energia.",
    "798C0A354153FA97DF4B9EA6536829E6": "Um gerador que queima petróleo para gerar mais energia.",
    "2F41A7A64A16C1223014DE81956F79B9": "Um gerador que utiliza eletricidade para bombear óleo crú através dos tubos acoplados.",
    "BD0BCA3543C3C29E448EE9A8A07A0E05": "Uma versão mais moderna e pesada da Pitch Gun, a Lionclaw tem um bom desempenho como uma submetralhadora de uso geral criada para combate urbano e de curto alcance.",
    "4D00771B4B5B472A271215A91FDC3430": "Uma variante do King Spire, o Gallant Mk. II se diferencia pela utilização de um canhão 30 mm, melhoria da blindagem e a redução sua velocidade máxima em comparação ao King Spire.",
    "4C3B15ED42125D7480A52F9BC253DD30": "Um colete fortemente reforçado projetado para proteger granadeiros de explosões de estilhaços. Como tal, o Flak Vest reduz cortes e arranhões e ainda reduz o dano de impactos de projeteis leves a média e longa distancia. ",
    "2A8BE1C34C0526F79ACF6D91681CC82B": "Uma variante pesada do Lance, o 25, ou \"Hasta\", foi utilizado no primeiro cerco de Brightwall, uma cidade popularmente conhecida como \"The Blemish\". Bombardeados por uma feroz resistência ao norte de Veli, os regimentos de tanque Coloniais requisitaram um veículo pesado com maior capacidade de busca e destruição. Armado com um canhão frontal de 94.5mm, o \"Hasta\" é um destruidor de tanques mais do que capaz.",
    "9116C94743283A454087F4ACE0D29789": "Uma munição antitanque pesada.",
    "46724B5540021ABA9BCBB096CCD52C7E": "Uma prensa automática que refina os materiais em uma forma mais densa.",
    "A26D7B604F08AA4B21D755B90489E34E": "Uma artilharia pesada projetada para destruir as guarnições e fortificações. A Exalt é melhor utilizada quando colocada em uma posição defensiva para aproveitar seu alcance impressionante.",
    "B30E60B44B6340C80E9B3CBA1C235AAF": "Um caminhão de transporte de carga pesada projetado pela Bassett Motor Society. Ele é construído para transportar veículos, objetos e suprimentos por longas distâncias com facilidade.",
    "7312CF5F420C4840C1D6F8B7AB84AAC2": "Uma posição de artilharia estacionaria pesada que consegue prover uma capacidade ofensiva devastadora em alvos inimigos distantes.",
    "A040D2D145966F1A2E0D22B32ACB68AD": "Um guindaste móvel pesado usado para levantar veículos e equipamentos muito pesados.",
    "344B222241D96C2B5647BCB4CE9DDD88": "Uma plataforma móvel de morteiro pesado, equipada com um grosso escudo frontar para atacar estruturas fortificadas.",
    "3C9D234C4A0EFD3161554E8A42C845F0": "Um caminhão de transporte Dunne reforçado com blindagem extra. O Leatherback consegue suportar mais fogo ao custo de demorar mais para alcançar a velocidade máxima.",
    "B8101D7F4ABFB0076157E78860DFD2DB": "Um Tanque de Guerra robusto com blindagem espessa e poder de fogo destrutivo. O Flood é equipado com uma torre de 75 mm e uma metralhadora anti-infantaria de 12,7 mm voltada para a frente. A blindagem pesada limita a velocidade máxima, mas, em compensação, ele aguenta muito castigo.",
    "557888F2425D443A3754D38FF3E68F46": "Um Tanque de Guerra robusto com blindagem espessa e poder de fogo destrutivo contra veiculos e estruturas. O Flood é equipado com uma torreta de 75 mm e uma metralhadora anti-infantaria de 12.7 mm voltada para a frente.",
    "6BCE5705403F3D8062BC3D983238B63B": "Caminhão Colonial utilizado para o transporte de tropas e suprimentos.",
    "9BC20CBD4F82B56B829926AAB0EFFFD9": "Um veículo Warden usado para transportar tropas e suprimentos.",
    "340573BC403E8059BF8EA7A91BFC2D18": "Um rifle de longo alcance de alta precisão. O Clancy-Raca possui um grande coice, mas é equipado com uma luneta poderosa, permitindo que a infantaria observe a batalha e forneça suporte de fogo a partir de uma posição segura.",
    "1994D61046CF0C62DCDBA8B98CE3EED0": "Uma arma anti-infantaria de alto calibre. Excelente em supressão.",
    "08390D0C46412A24EF34288CAA71FC09": "Um combustível de alto grau que é refinado a partir de óleo crú. Usado em uma variedade de aplicações nas instalações de indústria.",
    "CCBBD74C4EB9271DBBECA0B96391FAC3": "Uma fornalha de alta potência que leva o carvão a altas temperaturas para separar o coque não volátil.",
    "DF0E3525485D81F6072D3C84FA8F3497": "Uma fornalha de alta temperatura que catalisa óleo crú em óleo pesado refinado.",
    "0E47C84B4819C0B2C1C2E0B22660C5F8": "Uma carga explosiva de alta potência que requer um detonador acompanhante. A Carga Havoc é altamente efetiva em demolir grandes estruturas. A carga deve ser detonada via tiros. O verdadeiro potencial da Carga Havoc é liberado ao executar demolições estratégicas a distâncias seguras.",
    "7D8FA1B34320EA7C8774D89576D22C1A": "Um posto de escuta de tecnologia de ponta projetado para interceptar e decodificar transmissões inimigas. O Centro de inteligência pode ser apontado para locais distantes e irá decifrar transmissões por um período contínuo.",
    "97678A9F4AE94DBACE6C1B8F000042E9": "Um tanque leve altamente manobrável. Projetado para combates em ambientes urbanos, o Devitt Mark III é equipado com um canhão de 40 mm.",
    "891DFDAC45CBDAD6EB7D39B2B7A58F5B": "Um tanque leve altamente manobrável. Projetado para ambientes urbanos, o \"Hatchet\" é equipado com um canhão de 40mm.",
    "5EEBA409482F1AD6C7AE7E85C975002F": "Uma grande Estação de Montagem para produção de veículos e equipamentos avançados, como tanques de batalha e trens. A construção levará tempo e poderá ser interrompida se os recursos necessários se esgotarem.",
    "EC62CC58412440D4E23C7CBA9AC21CFF": "Uma grande construção usada para armazenar caixas, veículos e estruturas trasnportáveis.",
    "2E7E0DB244163440077CE7A62C37E0D4": "Uma grande construção usada para armazenar caixas, veículos e estruturas trasnportáveis.",
    "06A4877C416917417F9ACBA44DB999B0": "Uma grande base operacional de avanço. Os jogadores podem spawnar e estocar itens aqui.",
    "1999FECB40FF4DE9FF6E91A65B0004F0": "Uma grande base de operações avançada. Jogadores podem renascer e estocar itens aqui.",
    "B572582B475475CC0EAC4396606C91DA": "Uma grande base de operações avançada. Jogadores podem renascer e estocar itens aqui.",
    "ECF915A74AF418023D2351A1CB61F605": "Um grande caldeirão industrial para liquefazer metais para remover impurezas de materiais avançados.",
    "985FCAC54A7A91242513AB92B016817E": "Uma grande instalação médica para tratar soldados gravemente feridos retornando do campo de batalha.",
    "21DC32A84CC9B1B06A33D0B902E7E975": "Um grande tonel que permite a introdução controlada de hidrogênio produzindo a mesma quantidade de petróleo e consumindo menos óleo crú. ",
    "A71A14434198515B2130449921B346AD": "Uma grande barcaça de transporte, o Aquatipper é usado para transportar veículos, equipamentos e pessoal sobre a água.",
    "94B578314EBB3B9E7F4F24A53ED1ED57": "Um veículo mecanizado blindado leve visto pela primeira vez nos primeiros confrontos de fronteira entre Caoiva e Veli. Com sua estrutura leve, foi mobilizado em formações amplas, muitas vezes esmagando as forças inimigas.",
    "ADE614A6470D0CB66831B2A910D3D874": "Um canhão leve de artilharia projetado para ser instalado em fortificações defensivas. O 'Lariat' emprega um formidável canhão de longo alcance de 120mm, projetado para impor grande pressão a infantaria inimiga.",
    "F00BFEEC43676E5CE6440DB3D2B5BE81": "Uma luz que ilumina a área próxima. Requer pelo menos uma quantidade mínima de energia para funcionar.",
    "0863B6A543ECCD93995DD2AC4968D4C9": "Um local que é o alvo atual de um míssil.",
    "310C20A047D44550CB384F8FDAF5226A": "Uma artilharia Colonial móvel de longo alcance utilizada para fazer cerco a posições fortificadas.",
    "79122FD246C033F537757FA0D88CF3AA": "Uma artilharia Colonial móvel de longo alcance utilizada para fazer cerco a posições fortificadas.",
    "40DD8C8E4A58BB0AA2E145AD0DFDF9A3": "Um sinalizador de longa duração que acende no ar para iluminar uma grande área e revelar alvos inimigos.",
    "906435B8438E53184E6B5CA9EA7AE97A": "Um rádio de longo alcance projetado para enviar informações em um piscar de olhos. Às vezes, não há tempo para escrever e entregar uma mensagem pessoalmente.",
    "3CF4A6404018F2698D30D1BFA541252C": "Um vagão plataforma de baixo perfil para transportar grandes recursos e munições em curtas distâncias em trilhos de bitola estreita.",
    "75BE38574144D6EE1C1F1085D925297F": "Uma máquina que abre fissuras na terra injetando água em alta pressão para aumentar a produção de óleo crú.",
    "5134C9D844FBDCE85A83E29BF38D7C00": "Uma caixa mágica que duplica o item em seu primeiro slot do inventário.",
    "F16C032A4356D6B5945DD1AD7C5D07E9": "Uma ponte improvisada, usada para transportar equipamentos leves em uma distância curta. Recebe dano enquanto os veículos atravessam.",
    "AF5E0C7B4953A4E92C6C48836B169E7E": "Uma planta industrial para produção de equipamentos militares em larga escala.",
    "57EB5012423821DF377391A599C0C6FE": "Uma fábrica para produção de equipamentos militares.",
    "35DC470B411457F604EDC78818A6EF99": "Palete de materiais.",
    "B8E16A6F4322F73241A86B8E99FBBDCD": "Um combustível de qualidade média refinado a partir do óleo crú. Utilizado como combustível de alto padrão para veículos e em diversas aplicações em instalações industriais.",
    "52F819C94A4FB7D68080FEA14921C197": "Um Devitt modificado equipado com uma torre de morteiro Caine especializada com o custo de sua velocidade máxima.",
    "3729EE67488A5DDA39955096FCC3346C": "Uma motocicleta e um carro lateral usado para patrulhar grandes áreas. A velocidade pode ser aumentada ao custo de combustível adicional.",
    "EB42FEA34CE79F8CAB36C0A8DF52C365": "Um barco motorizado para mover pequenos grupos de infantaria por rios e entre ilhas.",
    "095F90EA4DBE1E287F589E95E8303BC7": "Um ponto de montagem para equipamentos e armas de infantaria implantáveis.",
    "53E5E9F6485E6A05C7AAB5AA17F64602": "Um tanque de batalha multifuncional com blindagem composta reforçada, grande capacidade ofensiva e baixa mobilidade. É equipado com uma torreta de canhão de alto calibre e uma metralhadora frontal que pode eliminar ameaças de infantaria. Utiliza munição de 75 mm.",
    "4A725EBD4FD3211B67054EB4E0551E0A": "Um veículo colonial off-road multiuso que pode detectar alvos próximos com sua antena de radio.",
    "12F425DF4BB2CA39EB0D76BC2FF4B033": "Um veículo off-road multipropósito Warden que pode fazer reconhecimento de alvos próximos.",
    "329A5E954C449A6D068FE3B014FE2303": "Uma ferramenta multiúso. Pode ser usada para desmontar minas, arames farpados e destrancar veículos.",
    "81B26A394866F839029F09AB4976253E": "Uma caixa miseriosa com um suprimento infinito de recursos",
    "9A3557304EF64924F26FBDB3CB19F583": "Uma bandeira particularmente festiva.",
    "B427B38E4B6A375CB9664590C5B78984": "Uma pistola importada de Estrella que fica ao leste, a Ferro 879 é bem comum em vários campos de batalha.",
    "BFD9047B46B1B1F5CE7BC49E3219D20B": "Uma fogueira usada para manter os soldados aquecidos durante Nevascas. Requer Diesel como combustível.",
    "898522CC4AC93FBD1DE535896836D8CF": "Um dispositivo portátil que mistura inúmeros materiais para produzir concreto, que é usado para construir estruturas altamente reforçadas.",
    "02C98F7147B981B0F235D890FB98C008": "Uma interface de energia para desativar manualmente a energia em um circuito.",
    "6C4EC81A4984D707E50FBFAD4AB329B9": "Uma usina de energia que gera uma grande quantidade de eletricidade a partir de óleo crú ou carvão.",
    "AF36B46549B82B8327C173B20E6E0342": "Uma planta de processamento que refina carvão em materiais úteis usados na produção Industrial ou instalações e energia.",
    "42490F284579F2525B717597767F805B": "Uma plataforma usada para montar diversas armadas de fogo.",
    "952D2A4746C7A202922E04831AD73301": "Um bunker de rádio que provê inteligencia sobre uma área ao redor para unidades aliadas. Feito de concreto sólido, essa estrutura pode extender seu alcance para além de outras estruturas de radio menos fortificadas.",
    "C08F59AF40C5D83D647E19B12B194312": "Um bunker de rádio com maior alcance que provê inteligência dos arredores para unidades aliadas. Reforçado com madeira, pode suportar mais danos do que uma torre de rádio padrão.",
    "98FDD84247786AD3619A06A7C390649A": "Está ocorrendo uma tempestade na região.",
    "2041E1E94A36F25C11F23DBC6B1E7491": "Uma passarela elevada para criar caminhos sobre Instalações complexas.",
    "601D72B24860CDD8206351BEE71FC3AC": "Uma passarela elevada para criar caminhos sobre Instalações de Indústria complexas.",
    "9C356F4C482A99F34DB28891873D9290": "Uma rampa que permite a entrada aos Bunkers.",
    "A548DAAE458E69AB6A32C39E233CBD17": "Uma rampa que permite acesso aos Bunkers Subterrâneos.",
    "F1F91A014F23A3D3B484BDBD771E25E6": "Uma rampa que permite acesso aos Bunkers subterrâneos.",
    "548DACD345555EDD93D43DB8A81C5327": "Um líquido viscoso bruto que deve ser refinado em combustível nas instalações da indústria.",
    "4F428A6749B2C8811BE67A9F3B7F53B6": "Reator que combina água com óleo pesado ou coque refinado, resultando em um gás natural puro, que por sua vez é mais eficiente na geração de energia. Pedaços de enxofre bruto são criados como subproduto.",
    "4E219CEF49D98D8D1D97558D22BB0462": "Um protótipo colonial recuperado achado no início da guerra mecanizada. Construído sobre a estrutura de um poderoso trator, este veiculo blindado foi visto escoltando soldados e mais tarde dando apoio a grandes forças blindadas.",
    "15C63D144D30014F7685FBBE9A21A092": "Uma refinaria que processa óleo crú em materiais utilizáveis para produção ou geração de energia.",
    "F3EE5685426B24F5F00A219BF984F928": "Um barril reforçado com substâncias extremamente explosivas necessárias para as ogivas mais mortíferas.",
    "3FC569FC40B27F9AD9E26FA03F50CF7F": "Uma casamata reforçada que dá à infantaria de rifle uma posição defensiva de fogo para engajar inimigos a partir de uma relativa segurança.",
    "A620ADF748599DC11DAF30B347F2F263": "Um centro de pesquisa onde os jogadores podem contribuir com materiais para a pesquisa da árvore tecnológica de sua facção.",
    "6B158AB149C22B70F67B998F1FFCA739": "Campo de recursos para coleta de Carvão para uso como combustível, para produção nas Instalações de Industria ou levado para uma Refinaria.",
    "925DFE2241AE18D5525CF7BEE32DC272": "Um campo de recursos para coletamento de componentes a serem levados para uma Refinaria.",
    "420703524C55DF6F7802A69F8F0653DB": "Um campo de recursos para coletamento de Sucata a serem levados para uma Refinaria.",
    "932ED7584D5AE02116EC9A85FB19086B": "Um campo de recursos para coletamento de Enxofre a serem levados para uma refinaria ou uma fábrica de munições.",
    "A341B03B40416F682A8BAD8F317DC096": "Um acessório de rifle que atira granadas com força pneumática. Juntamente das granadas especializadas, também pode atirar granadas comuns.",
    "FF4760F8403753E1A1C0949DBEE74515": "Um lugar seguro para a realização de negócios. Afinal, todo mundo precisa fazer.",
    "3D7398FD48AFD855E42AD1A4F4C1D058": "Um espaço limpo e seguro para preparar rações militares ou alimentos saqueados. ",
    "EAE29E5647F210251BF383AE3E9DC1A3": "Um segmento de ferrovia para guindastes pesados. Esta categoria de ferrovia só pode ser construída sobre fundações.",
    "666A59564F4699BB4E6CA99411AEF1E5": "Um segmento de ferrovia para vagões de bitola estreita. Os trilhos podem ser anexados ou bifurcados em ferrovias existentes para formar redes complexas.",
    "2D40CD2B4A4B36D17C5712BB6E3CB22F": "Um segmento de linha férrea para vagões de bitola estreita. Os trilhos poderão ser conectados à, ou originarem de, linhas férreas pré-existentes para formarem ligações complexas. Essa linha férrea somente poderá ser construída sobre uma Fundação.",
    "DE5BB7E34093B270F67BB082224C6468": "Um segmento de ferrovia de bitola larga para vagões de trem. Os trilhos podem ser anexados ou bifurcados em ferrovias existentes para formar redes complexas.",
    "85B5B9A141B0C6C44DE9C88D80A2D134": "Um segmento de linha férrea para vagões de bitola estreita. Os trilhos poderão ser conectados à, ou originarem de, linhas férreas pré-existentes para formarem ligações complexas. Essa linha férrea somente poderá ser construída sobre uma Fundação.",
    "AA586EEF445B20AAE11822A26C111DC1": "Um segmento de ferrovia para vagões de trem. Os trilhos podem ser anexados ou ramificados em ferrovias existentes para formar redes complexas. Este tipo de trilho só pode ser construído sobre fundações.",
    "AD9F111648BB9B389954B98DDC0C4432": "Uma série de engrenagens, turbinas e motores complexos usados em grandes embarcações navais.",
    "3B08756B4852B8ED7C3FD7AC8B91AE8F": "Um contêiner de carga compartilhada que pode ser usado para guardar itens.",
    "88817B5A41231C3D9AF60BA8CF7DDD58": "Um projétil que é lançado sobre curtas distâncias por um morteiro de espigão.",
    "F5E727A94E4FFA6FF5986B9BF90B3B98": "Uma placa usada para repassar informações para outros soldados.",
    "4382DC1C459106E7D4EC86B558E25BB4": "Um vagão simples que permite às equipes ferroviárias reparar os trilhos com mais eficiência.",
    "B8181E7A409FB5D4F6BC258955103FC3": "Um simples quadro para planejamento de operações.",
    "47495A0C4687DB7DCC18089FA7AC8A29": "Um simples buraco cavado no chão que fornece cobertura improvisada contra fogo inimigo.",
    "829BDD544B22530FE8108C8A745F4A5C": "Uma mina simples que é colocada sob o terreno e equipada com uma placa de pressão sensível para detonar sobre o peso de veículos pesados. Minas são visíveis para aliados e inimigos a pé.",
    "621C6B76445FF0C1B3E58CAA5E2BFFFB": "Um trailer rebocável simples que contém recursos comuns de construção.",
    "70A1D7C5400E99CB22061FB7326EB7DA": "Um reboque rebocável simples que suporta materiais de construção mais pesados.",
    "387EE7D644BFC53C67D46695ED2F8C9B": "Um trailer rebocável simples que armazena várias fontes de combustível e pode ser usado para reabastecer veículos.",
    "9260EFD245AA11C91000E6ABB873E77F": "Uma variante simples do Dunne Responder 3e equipada com uma mangueira de alta potência projetada para extinguir chamas.",
    "50E2CE4A4EECAC54805254885A49251D": "Uma bicicleta simples e antiga. \"Blumfield\" é um pequeno modelo recreativo, projetada para percorrer curtas distâncias.",
    "87E4796C4FADEA341965F8A90D6EBB00": "Uma variação do V.110, o Gravekeeper vem equipado com um lançador Bonesaw no lugar da metralhadora, transformando o humilde carro blindado em uma ferramenta efetiva contra veículos e veículos blindados.",
    "B39230E34DF8620213AAB5A3D3915EB0": "Uma pequena base usada como ponto de partida para invadir regiões inimigas. Os jogadores podem renascer e depositar itens aqui.",
    "F015AA4645293B138218E495E7B7249E": "Um vagão contêiner de bitola pequena para transportar materiais brutos. ",
    "ADC8DAA54AF942CE0633EFA3CA951C55": "Um centro de produção de barcos em pequena escala.",
    "284764E84E6F56F282D64AB6F0CC51D5": "Um centro de produção de veículos em pequena escala.",
    "FD14B135475379B5D33DF282DBC4664C": "Uma nevasca está acontecendo na área. A visibilidade está reduzida e a exposição prolongada irá causar congelamento.",
    "408E42104C80C3FA7E9A56ADE1A96D78": "O Soldado foi ferido gravemente no campo de batalha. Entregue esse soldado em um Hospital para recuperar Suprimentos de Soldado.",
    "0D5F6D114B77905CE4E6CBB90E199C7E": "Um espaço designado para armazenar materiais refinados que podem ser transferidos para dentro e para fora das instalações. Os estoques podem ser públicos ou reservados.",
    "4CB8EE134B6F11F903323BA00CA8A395": "Uma plataforma de lançamento especializada projetada para facilitar a montagem e disparo do devastador míssil balístico A0E-9, conhecido como Foguete AEON.",
    "8F2967214915F8C861BA64A936304D0F": "Um veículo especializado desenvolvido pela Basset Motor Society usado na construção de estruturas grandes.",
    "2BDB948D435DD27C5479A7959D65F110": "Um portal estabilizado para o submundo. Presenteie oferendas para prender espíritos mortais em pedras de obsidiana.",
    "D92FBE734BC50E5AC519F486000C41E1": "Uma Estação de Montagem padrão para modificação de veículos e produção de equipamentos essenciais. A construção levará tempo e poderá ser interrompida se os recursos se esgotarem. Alguns projetos exigem que um veículo base esteja presente na Estação de Montagem antes do início da modificação.",
    "01536C904F6D50E1B42797A2ECD5B7D4": "Conjunto de suprimentos padrão para um soldado. As bases devem possuir camisas para que os jogadores possam renascer.",
    "09A680CE484174FB7CE2DDBA5ED8E8DD": "Uma granada de fumaça padrão projetada para ocultar o movimento aliado ou ocultar a visão do inimigo.",
    "C2DFA4FA46E8A09787B1659EA8E31291": "Uma colheitadeira estacionária que coleta automaticamente carvão usando somente petróleo como combustível.",
    "D009E8D7439C6813523AF6AB85D0B356": "Uma colheitadeira estacionária que coleta automaticamente carvão usando somente petróleo como combustível.",
    "2AE345534F3FE5E044BA468C3161D541": "Uma colheitadeira estacionária que coleta automaticamente sucata usando somente petróleo como combustível.",
    "2977A856416985D34C006287876745D2": "Uma colheitadeira estacionária que coleta automaticamente enxofre usando óleo pesado como combustível.",
    "86B356284D94A0657FBF0FBCE81FDC6D": "Estrutura que gera energia a partir da queima de Diesel.",
    "8C89D3EB468817667A734CA49548F3F6": "Um caminhão velho e robusto de fazendeiros que foi reforçado para uso militar.",
    "FECDF12F4384E339D35524ACE682D1B6": "Uma base temporária para avanços. Os jogadores podem renascer e estocar itens aqui.",
    "36651F93494A7EA89C15F888D9B041B3": "Um cais temporário que facilita a movimentação de suprimentos e tropas da costa para grandes embarcações.",
    "335505CA4DD2B6823A4271A26234435C": "Uma estrada temporária utilizadas para permitir a passagem de veículos entre estradas principais e bases remotas.",
    "D581ABBD48D282A6772C6687B3F2E5A7": "Leve, formidável, capaz de apagar linhas de infantaria com facilidade, a metralhadora Catara é uma arma moderna para o Colonial moderno.",
    "28E25751432CAFB28FB0F5AE61E7AB14": "Uma ferramenta para cavar trincheiras e outras estruturas que necessitam ser cavadas.",
    "DED233DD427B065FCD3D17BD30D6F2E9": "Uma ferramenta usada para construir estruturas e coletar materiais.",
    "E74EC0C648B4F38DAD740FA18DA68158": "Uma ferramenta usada para recuperar componentes de vestígios de veículos antigos e equipamentos.",
    "8C5D9CF3428C79BC7BAC86AA4F1AED0E": "O \"Retiarius\" é um caminhão equipado com um avançado sistema de lançamento de foguetes capaz de disparar foguetes em alta cadência com um rugido mortal. O lançador pode conter até dezesseis foguetes.",
    "B30AA138497437782A4300886DD21F45": "Uma fábrica única para forjar peças de máquinas especializadas necessárias para construir veículos. Requer coque ou petróleo.",
    "4D6A78FB4ABDE01432FC6DB3FD4A8A69": "Um veículo uma vez usado por oficiais para inspecionar o campo de batalha, ou para entregar suprimentos de emergência e ordens.",
    "D644BDC44EBC4A4720D92596F71A1003": "Um veículo que se destaca na destruição de fortificações inimigas.",
    "4805B3D04DA9C8D7B0D77AB7CFE23D7D": "Um veículo usado para construir grandes estruturas.",
    "2CBCB7104DE035A60695DAB71E567A5F": "Um tanque leve versátil capaz de manobrar em espaços pequenos. Equipado com munições de 40mm.",
    "F03BE70D45AE1B67DFC7A6B84E626420": "Uma arma feita para lançar granadas especializadas em longa distância. Essa arma moderna Kraunian usa propulsão avançada feita para maior eficiência devido ao peso da arma e projéteis. ",
    "1134F3234A5F463AE53A268D4DBF6B52": "Uma válvula ponderada que controla a taxa de fluxo em uma tubulação. Requer uma Chave Inglesa.",
    "959786D541061EB81BE0BAAA89BE5E9B": "Uma posição de bunker bem fortificada equipada com uma metralhadora montada. A guarnição irá prover fogo de supressão pesado contra inimigos que se aproximarem de um certo ângulo.",
    "B46BADA6427C7B4029B045A8DE9B9F96": "Uma plataforma para a montagem de mísseis balísticos multi-partes de longo alcance, como o foguete A0E-9.",
    "110E6A2C4A6292DA195009B6B22305F9": "Uma estação de trabalho com muitas funcionalidades. Escreva uma carta para entes queridos. Catalogue o inventário de mantimentos restantes. Todos podem usufruir de uma mesa robusta.",
    "0977932E4101EB7BA35DE7B25A2EE0AE": "Um jogador ferido{0}. Deixe este soldado em um local seguro para atendimento médico.",
    "05D8FCE14C1B2295EB11CE89E8C6DA24": "Foguete A0E-9",
    "085BFDBE41391E9BA23112AB03491C2C": "Corpo de Foguete A0E-9",
    "91105C03499C3F1BE6BE4DB856E5B0F8": "Propulsor de Foguete A0E-9",
    "3038291E4F4394EB893544B9BBDE8664": "Plataforma de foguete A0E-9",
    "3A9D0CE146319179E0B675B8853E617F": "Plataforma de foguete A0E-9 e foguete A0E-9",
    "5AF494EB493CBF37E6E7B7B62DCA4D55": "Plataforma de foguete A0E-9 e foguete A0E-9",
    "8467BD9F497428290845D4B6490D2764": "Plataforma de foguete A0E-9 e foguete A0E-9",
    "0D4AD0F8419784E10400D89AFACEF068": "Ogiva de foguete A0E-9",
    "D3FBCCB84F1965C600B7309A9D140B4F": "Granada de Fragmentação A3 Harpa",
    "A0DC06784DFE2350A318C0ADE5D1233C": "Guarnição de Arma Antitanque",
    "DC94FD1A4F04C9345DCF44AC5D776051": "Guarnição Antitanque (Nível 2)",
    "452C02DC44682EA5ED964781258A5910": "Guarnição de Antitanque (Nível 3)",
    "B17D8640441F07CF889D20B79C0FE262": "Rifle Automático Aalto 24",
    "5C8CD8E14CB58B8E050860B05C668E40": "Paiol Abandonado",
    "1A5343D24EF1242FED4038B6AEE5B624": "Acessar o Estoque Privado",
    "10FBAC1C42EA44693A3D079F99BB9049": "Acesse o link para o Discord deste Regimento",
    "13E260D342466EC4C7BA899ACA57FB6A": "Acesse a árvore de tecnologias.",
    "299EE0114E937B661974C38629F1DB42": "100% de chance adicional de penetrar veículos blindados.",
    "3748D06A4CF0E1CD9651E7BF1B716D7B": "Adiciona uma bomba para pressurizar um tubo para água. Adiciona uma saída para um tubo.",
    "4CA02B2448DF735B8D722D8848020E1D": "Avançar Posição",
    "4F9290BD4F6302937D8F129F7752839D": "Bunkers Avançados",
    "404395D5452B7AB804E20A8002ABE71F": "Liquidificador de Carvão Avançado",
    "00DC251C418EAE33D484529CE31D12B2": "Veículo de Construção Avançada",
    "421C15994938A964D86582AA9EA01082": "Processamento avançado que refinam grandes quantidades de carvão em óleo pesado.",
    "F3C429E744EF3DCA6D577FAEE0AF046E": "Maquinário de classificação avançado para peneirar pilhas de sucata em busca de materiais úteis.",
    "2E0DB61849B0CB28D43254924C986178": "Todo o poder destrutivo de um Storm Cannon estacionário, mas facilmente realocável por meio de trilhos. Este canhão devastador consegue destruir fortificações inimigas a distâncias muito grandes.",
    "C1473BF745CF7EE5418F0CB724254A6E": "Todos os veículos são produzidos por jogadores. Para fins didáticos, fornecemos tudo o que você precisa para produzir um caminhão de transporte no Contêiner de Armazenamento próximo. \r\n\r\nPressione ‘E’ dentro de uma Fábrica de Veículos para abrir o menu de produção e então selecione ‘Transporte’.\r\n\r\nUm projeto irá aparecer.\r\n\r\nCom os materiais básicos no seu inventário e o martelo equipado (pressione ‘1’), vá até o projeto e pressione o botão esquerdo do mouse. Isso irá contribuir um material ao projeto. Repita até que o caminhão seja construído.",
    "BCA32FE64613C72EAFE9ABBF703FDA5D": "Permite que outros jogadores vejam esse Estoque Privado e depositem nele.",
    "4B7A9A9944CC88C79313BEA8758EE3A6": "Permite que estruturas de concreto sejam construídas por entre as conexões.",
    "3F51D1E242EE95695571389D924BB51B": "Permite que Bunkers de Observação sejam construídos nesse complexo.",
    "20ADE92945A533482C8C2DB147EE0579": "Permite qualquer que qualquer jogador tranque/destranque este veículo/estrutura.",
    "3FE159FD4A1B21E847106BA1E627CB1F": "Permite acesso fácil ao telhado deste Bunker",
    "6E54502B466D07F2D90679BEFDC66ECA": "Permite a construção de estruturas avançadas de Indústria.",
    "980899F241BB51BB958708973B66D0BA": "Permite a construção de estruturas especializadas de Indústria.",
    "A13BE7FE468697F92836E58F1788F22C": "Permite a construção de estruturas avançadas de Indústria.",
    "21EB240942BDDA7DD7796093DE1E3CA6": "Permite a construção de estruturas especializadas de Indústria.",
    "2666CC914A81BA338AA9B1A0DB20A2CF": "Permite a construção de estruturas especializadas de Indústria.",
    "4CB9CB2C42C092D9A66F438B181D4B0C": "Permite a construção de estruturas especializadas de Indústria.",
    "7D6F6EB64F68531718A733A81EC1418C": "Permite a construção da Plataforma de Foguetes A0E-9 e do Foguete A0E-9.",
    "9E4796A947D48A9E06F0B1A311B18FAF": "Permite a construção da Plataforma de Foguetes A0E-9 e do Foguete A0E-9.",
    "AC67792C499B7966C2A74B9D86A2E5E1": "Permite a construção da Plataforma de Foguetes A0E-9 e do Foguete A0E-9.",
    "538B62F341F334A5CA837BA831FA63C0": "Permite que armas da infantaria sejam disparadas da segurança de um Bunker.",
    "230F4A96430DC4B88DA4F8A3C9F13B21": "Permite que membros do esquadrão tranquem/destranquem essa estrutura/veículo e acessem-no a qualquer momento.",
    "8BC98A3C4F41647812F1EFA0276BF98D": "Permite que membros do esquadrão tranquem/destranquem essa estrutura/veículo e acessem-no a qualquer momento.",
    "A4538C06460D98B2A6BC65923E2F3357": "Permite que o Storm Cannon e o Centro de Inteligência sejam construídos neste bunker.",
    "397653894046CE62685644B9A017BEA5": "Permite que essa estrutura forneça inteligência ao mapa.",
    "803F34C244FFCA727C342E982D37A100": "Permite veículos a atravessar essa trincheira.",
    "1020D6A7418CD1D8CC71AF82029D5B90": "Permite cancelar um lançamento iniciado. Isso deve ser feito por vários soldados.",
    "E0881685464D545BEB93A0B60BC2FFBE": "Deixa com que você coloque um código de lançamento de 4 dígitos para iniciar a sequência de lançamento do Foguete. Isso deve ser feito por múltiplos soldados.",
    "2E5ACDEA4438E2F950C1CDB635352352": "Alumínio",
    "25479D654A5B62650D03918F90C80C78": "Liga de alumínio",
    "7B423C2F4346D3306680DDBA6690A3D4": "Liga de Alumínio pode ser usada para produzir Protótipos de Itens no Centro de Engenharia.",
    "4333024F454F5914F0C770BC54248A10": "Alumínio pode ser refinado em Ligas de Alumínio, que são usadas no processo produção de protótipos de itens.",
    "9CB69A3C4427264B80F202A1C4E8EAE4": "Sempre desabilita o subsistema de esteiras",
    "7A42C8054E3C9474D8C8F1903FEBB151": "Ambulância",
    "7C1727B141791F9A3774EB8176B883C3": "Ambulância",
    "969561C94645A423173ACDB0D8FEDA5D": "Munição",
    "B5A0F44D4F1548AD58DCBF9D9A2E6048": "Munição para Willow’s Bane Model 845",
    "2B47BB6A40FB28BC50D80D874FA2C301": "Munição para o \"Molten Wind\" v.II lançador de chamas",
    "573A0901430DAC42F31B1DA2869B8D97": "Munição é separada em pentes individuais. \r\n\r\nCuidado para não carregar muitos pentes, já que você pode se sobrecarregar, ou, pior ainda, desperdiçá-los. \r\n\r\nAo recarregar com ‘R’, você descarta o pente antigo, então só recarregue quando necessário.",
    "6B3F590A435AB55946EC4291BD9DBB64": "Fábrica de Munições",
    "287EACEA4FA5B040658F949D3114043E": "Uma Torre de Observação que fornece informações sobre forças aliadas e inimigas em uma área.",
    "BB9C41C34BE95CF524D9A68ADB7BD364": "Um campo de prospecção que produz óleo crú para refinamento posterior ou para produção de energia.",
    "359C0BBD41434663D2210BAE34FE0A3B": "Uma construção abandonada no mundo que foi fortificada e guarnecida.",
    "520E40A4465897CB6909AB982EF89947": "Um edifício abandonado no mundo que foi fortificado e guarnecido.",
    "6925715A41430C49B7133BA0ED9E7CCC": "Um edifício abandonado que foi fortificado e ocupado.",
    "7287B08A4554E0A48253F18A141CCF13": "Um edifício abandonado no mundo que foi fortificado e guarnecido.",
    "C403C1CE4EC2D6BC384A2598C81413F0": "Uma granada aderente projetada para penetrar a blindagem pesada de blindados. Essa bomba grudenta pode apenas ser jogada a curta distância e é ineficaz contra estruturas.",
    "E6753E7042D00FBC1FE9F18B965519E0": "Uma variante avançada da plataforma de montagem universal, o BMS - Fabricator é equipado com uma configuração exclusiva projetada para realizar trabalhos de construção e escavação avançados ou especializados.",
    "CF5CA88E4B25F8D5D333F8BD457CA68E": "Um obstáculo antitanque que impede o acesso de veículos a uma área e é resistente à maioria dos tipos de danos.",
    "BCB57CE24277EE614493D3870232C97D": "Um obstáculo antitanque que dificulta o acesso de veículos a uma área. Pode ser desmontado com uma Chave Inglesa.",
    "3E767BF54AD3C8CD8C5794A295366BBC": "Uma área que foi devastada pela detonação de um foguete A0E-9.",
    "4FF9AEB9471E5F32F05AD0978CD2E4D9": "Uma área onde certas estruturas podem ser construídas e preparadas para o trasporte.",
    "DAECD1FE49B2986E11E4C7A1F87F053C": "Um veículo colonial blindado usado para apoiar a infantaria durante assaltos a posições inimigas. Também pode transportar tropas.",
    "A8D45D054678B1E87811FD92753189FC": "Um veículo Warden blindado usado para apoiar a infantaria durante assaltos a posições inimigas. Também pode transportar tropas.",
    "0C110267401A61E4812700A5D1D9DA5F": "Um veículo anfíbio blindado Colonial usado para transportar infantaria por terra e mar.",
    "3B508C464E0D71999AEA6C865D3FD3E3": "Veículo anfíbio Warden. Usado para o transporte, de no máximo quatro soldados, seja pela terra ou pelo mar.",
    "38210D904CEC56EA82684A81ED481C39": "Um projétil perfurante de blindagem usado por lançadores RPG indiretos.",
    "6128D3124DA308F4F754EA9A04B8934C": "Um projetil perfurante de blindagem utilizado em lançadores RPG especializados.",
    "D46DC87D4F9D8BD90738F395045E66A1": "Uma máquina blindada reforçada com uma liga metálica perdida ao tempo. Esta besta quase indestrutível carrega até 8 passageiros. Boatos de sua existência são datados a primeira brecha.",
    "089A31E0489395AADF4E83B5605D23C8": "Um vagão blindado com uma posição de metralhadora montada para o transporte seguro de infantaria por longas distâncias.",
    "CAF0D5B94820FA9927F5CFA48CA6FC91": "Uma estação de montagem com equipamentos especializados para construir e embalar rapidamente os materiais necessários para a linha de frente.",
    "F98FB64E41B0B50D3D2C3596A50D8578": "Um estação de produção preparada para fabricar peças utilizadas na construção de embarcações de guerra na doca seca.",
    "C2DBF65D49CC8B89D774859A5C7BC1D2": "Uma estação de montagem para a modificação de plataformas de armas de campo e tanques especializados.",
    "2F254DC44891E6535C6201B4724A13AA": "Uma estação de montagem para a produção de armas de campo e veículos utilitários como as Colheitadeiras.",
    "88E1FE324B36D19DE98FB996E0ABC39B": "Uma estação de montagem para a modificação de veículo Meia-Lagarta e veículos lançadores de foguete.",
    "20A1C3664007D85568E78E8244AFA21D": "Uma plataforma de produção para tanques pesados.",
    "DDED53D149082D9F5D73E1AE4022BB86": "Uma estação de montagem para a modificação de veículos logísticos leves, como caminhões.",
    "EAE40080413B1A736D3E658ADE6ED717": "Uma estação de montagem para a modificação de veículos da classe tanque.",
    "D1C3541147558B79B9EEA9B8BFF91822": "Uma estação de montagem para a produção de vagões de trem.",
    "4A3D896B46DE138A5BBDB79697293EC7": "Um rifle automático que desempenhou um papel central na proteção dos interesses Mesean no continente Katoman. Embora não dispare tão rapidamente quanto outros fuzis de assalto, a Catena é elogiada por muitos soldados como uma arma robusta, fácil de usar e confiável. Embora não possa marcar pontos em nenhuma área específica, é ideal como arma para todos os fins.",
    "30F9241E45E138237EF27388086D76A0": "Um canhão antitanque entrincheirado e tripulado por tropas estacionadas.",
    "8548255244214F885F3BC987D43CFF8B": "Um canhão antitanque entrincheirado e guarnecido por tropas estacionadas.",
    "1EA65A55461E4B0A7920AFB286ED6FF8": "Uma artilharia automática que revida fogo indireto.",
    "524FA7AF44764FE15E06C597B35BFA23": "Um bunker entrincheirado e guarnecido por tropas estacionadas armadas com Rifles.",
    "D67BCCE842BCDAE460EF34AC5925EB38": "Um bunker entrincheirado e guarnecido por tropas estacionadas armadas com Rifles.",
    "DD627D894CBEF4FA7B6F74AAC132C532": "Um bunker entrincheirado e guarnecido por tropas estacionadas armadas com Rifles.",
    "2AEC4FD94C92D931CA73709E1A0E95FE": "Uma metralhadora tripulada por tropas estacionadas (IA).",
    "5D4F55AB45C4585A9C3174B3FC6E4BFE": "Uma metralhadora entrincheirada tripulada por tropas estacionadas.",
    "3FB2C8014B36DA15F18FDA8096AC97AA": "Uma escavadeira que permite a mineração de componentes danificados quando um campo de componentes está esgotado",
    "2C2D160A428EC77DFC0529BF2BF56353": "Uma oficina expandida para o processamento manual de materiais delicados.",
    "44636ACF41EB1B2E747168901D8D90B3": "Uma granada Estrellan altamente explosiva que foi especialmente projetada para uso com o lança-granadas de mão. Essa granada moderna tem mais explosivo e é mortífera contra estruturais.",
    "C2B0FD2F4A9ECDEB98F6F49A2C15ED2C": "Uma carga explosiva que detona a uma profundidade selecionada. Esta munição antissubmarino é disparada do convés de navios navais usando lançadores especializados.",
    "1A4965A840057F1C18D592AEA3A3425E": "Um frasco explosivo usado para derreter blindagem inimiga. Essa bomba líquida feita com cuidado explode em um clarão de fragmentos derretidos no impacto.",
    "E3283173491194AADB200889AEC23823": "Uma carga explosiva usada em tubos de morteiro.",
    "2FFC493745AD336FA09A7C918F944E58": "Um silo industrial para armazenagem de diversos tipos de combustíveis.",
    "9412D2F44236A4C90F19698CC2B4C79F": "Uma fundição industrial para derreter Salvage para remover impurezas. Requer Coque.",
    "B7EA2E194514BD75337954991CF58FD2": "Um antigo forte. Os jogadores podem renascer e depositar itens aqui.",
    "7D6629B140F3E6A721CA529CD155C39B": "Um antigo canhão de defesa costeira que foi reutilizado para a defesa de locais importantes contra bombardeios navais.",
    "A505DB14475E021CA9ED6EB028A9F393": "Um antigo forte. Os jogadores podem nascer e depositar itens aqui.",
    "7D4855DD49E6C9200A910E8BBB8FE967": "Uma mina antiga que, quando abastecida, produz componentes.",
    "2C5C40C644F89632A8A528B61C30E352": "Uma mina antiga que, quando abastecida, produz sucata.",
    "ADC9868E4290EDFEE4D2A99BCE350C68": "Uma mina antiga que, quando abastecida, produz enxofre.",
    "438238C8412EFBC68EFBC6ACB6E9269D": "Um antigo rifle de guerras passadas de fabricação Mesean. Possui um alto poder de parada, mas não é tão preciso quanto armas mais modernas. Uma arma lendária, os Howling Lions empunharam o Volta durante seu ataque as praias de Fisherman's Row.",
    "7EEE189E4C3E6C2D5DA07688D313B0C8": "Um velho projétil de artilharia de uma guerra do passado que não detonou. Gravuras nas laterais indicam se tratar de um explosivo poderoso que deve ser manuseado com muito cuidado.",
    "3994813743F8239B38E1719DA4C69A36": "Um modelo mais antigo, porém confiável de rifle Krauniano. O \"Omen\" é uma arma robusta e simples, melhor usada em combates de longo-alcance.",
    "BA343B0D481CD54B81AEC9B1B7EB3C94": "Um contêiner aberto marcado para armazenar recursos brutos que podem ser transferidos para dentro e para fora das Instalações. Os estoques podem ser públicos ou reservados.",
    "3061273B45958F0419EEBC903979244B": "Um instrumento óptico usado para observar objetos distantes.",
    "E0713BDF41E80039FBB40F860B7372AF": "Uma carga explosiva cheia de estilhaços usada em tubos de morteiros. Devasta infantaria próxima.",
    "146E3BC4493F5187B80261B519E61AD8": "Um abrigo subterrâneo que serve como fundação para uma fortificação permanente. Conecta com outros Bunkers e Trincheiras.",
    "1B8A795C4346BF4910F771A9CC959AE0": "Um abrigo subterrâneo que serve como fundação para uma fortificação permanente. Conecta com outros Abrigos Subterrâneos e Trincheiras.",
    "462C2AAC458B967E79A89CB1E96F900E": "Um abrigo subterrâneo que serve como fundação para uma fortificação permanente. Conecta com outros Bunkers e Trincheiras.",
    "96AEF3EE49134BE9CA3562BFF39C8172": "Um abrigo subterrâneo que serve como fundação para fortificações permanentes. Pode ser conectado com outros Bunkers e Trincheiras.",
    "CBE454CA4DE3742BC66CDC902E39708C": "Um abrigo subterrâneo que serve como fundação para uma fortificação permanente. Pode ser conectado com outros Bunkers e Trincheiras.",
    "D74CA7D0448C72B0FBAB39AA6E10FDB2": "Um abrigo subterrâneo que serve como fundação para uma fortificação permanente. Pode ser conectado com outros Bunkers e Trincheiras.",
    "AA2D0B2444A7325577C78395E4C05967": "Antigo para padrões modernos, a primeira iteração do fortemente blindado Tanque de Assalto Colonial é instalado com blindagem de cobertura total e equipado com duplos canhões contrafeitos.",
    "7D63A5EF4E99E0E2A4609396B116AD60": "Antitanque Explosivo",
    "E34A663C4D6E568183406BB35FC6DC99": "Explosivo antitanque",
    "5A46915A45815F648E76D5B15E42D7E8": "Granada antitanque",
    "E7733BFE47422A5611A7F1969000571C": "Antitanque Cinético",
    "6F622E7C4ECBCCFD937090A9D714B516": "Casamata Antitanque",
    "0E81F8184420E52AF987BD986FB141A4": "RPG Antitanque",
    "24F2C7C6451FF1CEFC9D27BAD50DD344": "RPG Antitanque",
    "62CF12984D72C537677948A56CF26831": "RPG Antitanque",
    "8096C964450D09D71E53F1920124E819": "RPG Antitanque",
    "6FD3271E4C2FB2E080106997F21A1866": "Rifle Antitanque",
    "6A5752A9482F81ADD20B5D83F37BF45F": "Bomba de explosivo plástico pegajoso antitanque",
    "E466A11F42816813A2355989C908791C": "Rifle Argenti r.II",
    "3B4A004742F4396225D37A89EDA41387": "Armado com dois canhões 75 mm, o que falta ao “Ares” em velocidade e versatilidade, ele mais do que compensa com poder destrutivo bruto. O desenvolvimento do “Ares” foi repleto de conflitos e a sua história está entrelaçada com um período de vários tumultos que eclodiram nas ruas de Dimiourg. Os rebeldes capturaram o primeiro protótipo “Ares”, o O-75a, e viraram-no contra as forças Coloniais na região, levando à sua destruição – embora não sem grande esforço Colonial. Este evento transformou o “Ares” em parte da historia Colonial.",
    "09284D09449218360DF41C8EAE3F7314": "Armado com um bastidor de morteiros lançadores Bonesaw, o Thornfall é projetado para lançar um ataque mecanizado indireto à blindagem inimiga. Este veículo único dá suporte a um ataque aliado e não pode suportar grandes quantidades de punição.",
    "4FE32C9E48BEBECA05618A818A15338B": "Armado com munição explosiva de 40 mm, a Smelter é perfeita para engajar veículos inimigos e estruturas. O aço frontal protege contra explosões.",
    "B57E02DC42C110B1165928AC9F308126": "Carro Blindado",
    "16FE3B95486836B5A7DC768871429B86": "Perfurante",
    "7BC3E3594AF707EE486D10A8B882D85A": "Penetração de Armadura",
    "89E1D86C4E0DF0898E165DB38396C7AB": "Penetração de Armadura",
    "1499A7DD45E0DC3A5C297B9525DE06AF": "Carro Blindado",
    "1906CDA343887D8C2561EBA7FDA6D151": "Carro Blindado",
    "1AD8DA2A4295C17CF19B62998F4D7FF0": "Carro Blindado",
    "5B382CCC4E70061B9FE1BE9A62C6EFB1": "Carro Blindado",
    "75C3D21B4CD91A107EB544B34B8AD4A8": "Carro Blindado",
    "7D2B50D64A9252C72E56A8897E440D3B": "Carro Blindado",
    "84459BF049B049D1A6CE95B5BB1D6465": "Carro Blindado",
    "ADF89343477EB10E23A2258BA9CCEA44": "Carro Blindado",
    "EDE3E0F345E08F07B7651CA9908F645B": "Carro Blindado",
    "9CC33CDA47786D2C118E63BF964B5B53": "Trator de combate blindado",
    "D8C713AD495BBBD6D083FBB673EBE6B3": "Munição de Artilharia",
    "032310524326921E393FEC9576A20049": "Munição de artilharia é um objeto grande e deve ser fisicamente levado até seu canhão de artilharia para recarregar. \r\n\r\nPressione “V” para carregar a munição quando próximo de seu canhão.\r\n\r\nVocê perceberá quando está próximo o bastante quando a opção se mostrar disponível no canto inferior esquerdo da tela.\r\n\r\nHá munição de artilharia disponível no baú próximo.",
    "1D7D3FF9464EF8F4DBBB77BB5574E183": "Basicos de artilharia",
    "E04D38FD4B4F1EE489829484ED764CF9": "Campo de artilharia",
    "E7095F264A0F3999B5E535895E442F36": "Campo de artilharia",
    "BEF308A743681EB0357FAFA43962E180": "Abrigo de Artilharia",
    "306201AC44F6AA3A4EB10A892ED86CB7": "Treinamento de Artilharia",
    "768D1A844FAF003406F20DB9811742DD": "Treinamento de Artilharia",
    "80B30B2E4AD9708143AAF882A43E9A6D": "Treinamento de Artilharia",
    "4BECA10D446F2DBF7A4C318D0F1ED81A": "Artilharia e vento",
    "684E41AA4722C781B8AB0D98F71A8F92": "Artilharias e armas de disparo indireto são afetadas pelo vento.\r\n\r\nA força e a direção do vento irá afetar a trajetória e dispersão de cada disparo.\r\n\r\nVocê pode determinar a direção do vento observando as ‘bandeiras’ nas estruturas, como as das torres de rádio próximas. \r\n\r\nQuanto mais agressivamente uma bandeira se agita, mais forte é o vento naquele momento.\r\n\r\nDisparos de teste podem ser importantes para determinar o impacto atual do vento nos seus disparos.",
    "29D51F9B45A364ACF11B27A1879A268F": "Rifle de Assalto",
    "7D6C68A7498074E1BC64ABA586E26830": "Espingarda de Assalto",
    "B98E97D8418EB19A4D2DCFBE7E2796B5": "Rifle de Assalto",
    "44D43340487F92751E665C999A14A61E": "Tanque de Assalto",
    "647966CE498AE39FB76178B6BB05C490": "Tanque de Assalto",
    "C01E254C43ECE1C45AC4F0B4BBB00D69": "Tanque de Assalto",
    "C10C3B9149C8AE06FBC2E1A2D23F9706": "Tanque de Assalto",
    "962993C94EEE298FB2DB74AA6ACCFAE7": "Estação de montagem",
    "9F351F9844C8E89BC33C2682E291A71D": "Materiais de Montagem I",
    "7FEADAB14DDDB46315E04FB48249A768": "Materiais de Montagem II",
    "73092B1B41455FB70F8E3AA5225DEF3B": "Materiais de Montagem III",
    "B8DA40AC47EEBC6838E97E82C92B738D": "Materiais de Montagem IV",
    "4BF3ADB2426347104A372CB3ABD2ECDA": "Materiais de Montagem V",
    "59AA1F294227A46FD442FEB0E31101CE": "Selecionar como ponto para renascer",
    "DC4D892841B6D810A02AD1A140CDD38D": "Atarrachado no barril do rifle, essa lamina curta pode esfaquear inimigos em encontros de combate corpo a corpo.",
    "E240EA5F4021348EB53395BDE9D1DC3D": "Recebe e transmite automaticamente informações do mapa periodicamente quando equipado.",
    "49AE335D4D6E6A2555F6A99FAB791AFC": "BMS - Guindaste Autopropulsado Classe 2",
    "0671D7C7434E205636B487A770356A25": "Caminhão de Caçamba BMS \"Packmule\"",
    "A652FDF2436E1C3E5A60DEABF3FE15E4": "Balfour Rampart 68 mm",
    "D23195CE47C3C7F9FC9AB687FEBCB432": "Balfour Stockade 75 mm",
    "51EF2ACC4A46A94B876D79A2A5CA914F": "Balfour Wolfhound 40 mm",
    "A6C68EC44575D472629393947913DE1B": "Bandagens",
    "15EC16AC4525900296BA8F849C873642": "Arame Farpado",
    "40DCC52641A2BEA2C8781AA76FBECD01": "Arame Farpado",
    "9C8F3E3F49EED660C7DC1DB0EAB48C4B": "Arame Farpado",
    "AFE26FC442A8A44A6E07078C446F6052": "Arame farpado",
    "DEFFEB1542F16098DE717CBBC9E0E224": "Cerca de Arame Farpado",
    "85C257DD4DE800F5B4A03BB06195F8DC": "Barras de materiais incrivelmente raros usadas em algumas das construções mais avançadas e complexas, como grandes embarcações navais e foguetes AEON.",
    "DEE926084933FAF21E74388FF496CB28": "Navio Base",
    "85FCF46649BD8A17654F6099EE1B3A62": "Controles Básicos",
    "56E9AB08437B2C3F07B9B6B9A4A97425": "Materiais Básicos",
    "4486854546BDD8408DB1399DF426B84B": "Coleta Básica",
    "14F93A8E4DA52E1721BB0AA5C8074B5F": "Treinamento básico",
    "426491D64B0EB5D503D2D7AAF74335CA": "Treinamento básico",
    "428D0601449BEADA5FD30E8732DF8104": "Treinamento básico",
    "48A20D94443D0403F04A3EB845A2E254": "Treinamento Básico",
    "C551885241F0829D95C2F7B476F7E6A5": "Treinamento Básico - Aperte \"E\" para ler as placas.",
    "A21D89EB4DB45C22C77CE8800B557A8C": "Treinamento Básico - Aperte \"E\" para ler as placas.",
    "2D728244461A766747E2B1AF999FFE26": "Percurso de Treinamento Básico",
    "918C96D94CD5A98C33932CBEC80273F7": "Controles básicos de direção",
    "8B342E6D4B748A0311B35BB746956FB7": "Controles de embarcações básicos",
    "CA569B7A4E573693319FA2877ABD5F24": "Linha de produção de artilharia",
    "B1A4A34B4DABDBE0A1807FA3B600FA74": "Tanque de Batalha",
    "BADC9CAC45AA98419BBFECBC07730579": "Tanque de Batalha",
    "C9B6FAED4D6A9649507A529FCA2214AC": "Tanque de Batalha",
    "D0CFDF384D7C6540501C4E9D29B19C40": "Tanque de Batalha",
    "E2584992471875960E5AC9831A1C360D": "Tanque de Batalha",
    "EB73DAF04735416C9EDC1CA057B3BF59": "Tanque de Batalha",
    "27CD79F64AD124F90E5DA58C89D0D5BA": "Encouraçado",
    "FB6901DF4B521D17E3DB058C29943DD8": "Encouraçado",
    "2D231692474A10B835AD15987C4261A9": "Baioneta",
    "384007324813AFE2835C288261F1C85C": "Camas postas uma em cima da outra. Pode não parecer tão confortável, porém, quando o assunto é descansar, a cama de um soldado é a sua casa.",
    "46FF81A846392084A21528B050609541": "Antes de continuar o seu treinamento, defina o seu ponto de surgimento na Base Avançada adiante. \r\n\r\nPressione ‘E’ para interagir com a Base. Aqui você verá o inventário da base e várias opções para aprimorar/gerenciar ela. Vamos ignorar essas opções por enquanto.\r\n\r\nClique no ícone piscante de ‘casa’ que diz: ‘Definir ponto de surgimento.’\r\n\r\nPara mais informações, clique no botão ‘?’ no canto do menu de Posto Avançado.",
    "13E8607E4B11E966FF383C866DBA439E": "Bicicleta",
    "3D0C540D469746133D2B58BDF7720455": "Binóculos",
    "2858687F4D89CC7A45C0969296E6B424": "Fornalha",
    "E52E575F4B007AA26F9B53B54681749C": "Plasma sanguíneo",
    "1553632448AAEF6CB6590F92A1807877": "Granada de fragmentação Bomastone",
    "8BB336F4459740A6ADA7B28B2D91748B": "Rifle de assalto Booker modelo 838",
    "3ACD511F4912CB4948C7A6A84A50D586": "Base Fronteiriça",
    "DAB76DD8460B940642C70183B489D8D3": "Base Fronteiriça",
    "9F0F65CD4302C4CE3921109029A92512": "Nascida e forjada no frio do norte, este uniforme pesado protege a infantaria dos Wardens de todas as nevascas, exceto as piores.",
    "E133B1F84BF4829072F91D9C9E334F57": "Espingarda Brasa",
    "EE33C96F43870BE6829717B79B9424E3": "Ponte",
    "F622BED543979E2D93843895A998A5FB": "Cartucho de Escopeta",
    "35255C004C2A84C0BEA2D0BA1076D91C": "Construção",
    "B2F0A8094EEF74E899DDF0AECCFEC187": "Construída como uma lâmina de serra, a arma estacionária DAE 1b-2 está equipada com três metralahoras sobrepostas em ângulo vertical. O que falta em potência na “Serra” ela compensa com a velocidade de tiro para uma arma deste tamanho.",
    "67E6082943E82F1416ED919ECF796D27": "Construído sobre um chassi do Tanque de Batalha Flood invertido, o Mk. IX Stain é uma plataforma de artilharia autopropulsada completa. Uma vez em modo de fogo, o Stain pode disparar seu canhão de 150 mm em longas distâncias para atacar posições inimigas com fogo indireto.",
    "060499444E1A1AC48E7009A0B0100C41": "Construída sobre os ossos das primeiras armas automáticas introduzidas na Legião, a \"Lamentum\" mm.IV ainda é uma força bastante intimidadora para se encontrar no campo de batalha. Com um grande carregador e um impressionante alcance ativo, essa metralhadora montada é excelente para disparar fogo supressivo consistente.",
    "129723254F4FA3055EC075AEF8F9EC9D": "Construído para enfrentar as colinas das províncias ocidentais da Alliant Union, o Taurine Rigger é uma variante modificada de Velienne especializada em rebocar equipamentos pesados ​​e transportar suprimentos em terreno traiçoeiro. Empregado pela Legião Colonial durante quase três séculos, o A150 tornou-se uma ferramenta essencial para as operações Coloniais. Portanto, não é surpreendente que tenha sido frequentemente imitado, mas nunca replicado até agora.",
    "E37CF3AA40FC2B92AE19B2BFFA3DCDAD": "Construído para complementar outras armas antitanques independentes, a arma estacionária Huber Starbreaker dispara projéteis de 94,5 mm em distâncias muito longas. Uma ferramenta necessária para a infantaria repelir os avanços de colunas blindadas Coloniais.",
    "484B31D44BF6AC36F3681B9D05164FBA": "Bunker (Nível 1)",
    "7FD22BA74AFB35B58402159E4950E71C": "Bunker (Nível 1)",
    "3C75FB8E4DA1AA89618AABB37738C340": "Bunker (Nível 2)",
    "CD7E6AEE4109788F963DBCA9042D8073": "Bunker (Nível 2)",
    "614680D946C3DF5953C2F5B27950E7D6": "Bunker (Nível 3)",
    "B0AB88974820ED53D2F323BC11B8F8D8": "Bunker (Nível 3)",
    "0BE2018C4E7600273BBFB0926A3368F1": "Base de Casamata",
    "2C90B2094C515F967A530F9FF3B5FD04": "Base de Bunker",
    "58359C304D7483C5FE2CABB93B9C5565": "Base de Bunker",
    "89EFC7894E13A4336D3FBBAF5EFF7081": "Centro do Bunker",
    "95E04A1F4A578E6639A4F9A7893B5230": "Centro do bunker",
    "DE8F6CF34B47D27A97D26498470A0E83": "Base de Bunker",
    "B79388114A649658BD9B7392F34E3002": "Canto de Bunker (Nível 1)",
    "E06894BE4FC768070961C6BA1A7C05F1": "Canto de Bunker (Nível 1)",
    "6C5CD6914591DE85BFE23B9B2FF95899": "Canto de Bunker (Nível 2)",
    "6D6C0D57456CD5906C50B0BF7C0E6EBC": "Canto de Bunker (Nível 2)",
    "2CE3A9FD4C0F548DFC0FA9AA6B4F4A58": "Canto de Bunker (Nível 3)",
    "EB8DAEE74DCD07A4DCD890893212EE02": "Canto de Bunker (Nível 3)",
    "F1141BC044BBDD2ACFC965938DE0E90C": "Local de Escavação de Bunker de Canto",
    "774B74BC480322205AF8DF942CF274AA": "Local de Escavação de Bunker",
    "58C77B2041868E44E07CB7BF59DED5C6": "Bunker com rampa (Nível 1)",
    "AB0323BD4B2E183A2A6BE18947017318": "Rampa de Bunker (Nível 2)",
    "3527915849504828A54D32B292A55897": "Rampa de Bunker (Nível 3)",
    "7441C17F4DFCF19400DA0E8F44B14AEC": "Suprimentos de Manutenção",
    "6069A42B46A68A3CF4911BB9A0524B6F": "Beliches",
    "8D0564AE4A7D162B63E36CAF21525D17": "Vagão de Frenagem",
    "1E76100A4B41EAD50B1903917C499955": "Os Encouraçados da classe Callahan são literalmente bases móveis enormes e repletas de recursos. Eles possuem poder de fogo suficiente para devastar embarcações inimigas e sua tripulação, ou fazer chover fogo em zonas costeiras próximas enquanto ignoram fogo de contrabateria com seu casco reforçado. Nomeado em homenagem ao fundador e primeiro Archon de Caoiva, que notoriamente se manteve firme em conflitos com clãs rivais que queriam sua cabeça. Vários Callahans permanecem ancorados em Whedon’s Row Harbor.",
    "47AE8B944AE9D9ACA5401BA9F2C4B00A": "Câmera",
    "BF6D42B547FDE7EE6A4D469D64FEB21F": "Cancelar lançamento",
    "773539C34D3E0E6009BBC5BBE7B1FFA3": "Cancelar reabastecimento",
    "29A6FC6346783BE4E720D7B5B355FAAF": "Cancelar Reparo",
    "0E6FD8764B655005ECD2B5B4A82764AC": "Canhoneiro",
    "2861CB11481E565228DFC7A6993E92E4": "Canhoneiro",
    "4890FFF94F782254756387816D6C0B41": "Canhoneiro",
    "48BE62C24A52FC1F686B1BA1FD330D14": "Canhoneiro",
    "4B9EF3A5491D8379E3032B9994F297DB": "Artilheiro",
    "51ECB3244FDFF6B8431B9A87093FD7AC": "Canhoneiro",
    "5C12DF1D4EC4105A66013791A1AF6965": "Canhoneiro",
    "5CD267614E1A95C8E1C127B005B056B5": "Canhoneiro",
    "640A9E654294E08A39785C9DE9CC1CAD": "Canhoneiro",
    "640BE1EE4F6FB1DFDE25238D0A58AB96": "Canhoneiro",
    "7079246F46B9D85C365C7B916684743A": "Canhoneiro",
    "756DDD5043ED88F6751E309A05CAB156": "Artilheiro",
    "81398FE44552F779D3E7F1B03557195E": "Canhoneiro",
    "8315C78749C81A289F7AA0AF8EFEC7A6": "Canhoneiro",
    "8DE3C12B44176B3B9975789CC2F52953": "Canhoneiro",
    "94BE70E9424A233044C1C2AD1D90A283": "Canhoneiro",
    "9C87895D4E4F3558EC8AAF8BE01EB827": "Canhoneiro",
    "9E7AF3424BCB2AF117A041B821666EF6": "Canhoneiro",
    "A50FD36443E4E23540742B94117A935C": "Canhoneiro",
    "ADBEAD9F4915E80CBADEAB8546C3460D": "Canhoneiro",
    "AE91F5844E90DD848834E990B00F96DB": "Canhoneiro",
    "B2344A2A451F110AC694C2969B536FB3": "Canhoneiro",
    "B5AEC7DF4951DEFC301CC8AD9B6D791D": "Artilheiro",
    "B62DE30642D7AA30A9E817AA5F8B5ADF": "Canhoneiro",
    "C1C6E730449313C219642FBF75D977C0": "Artilheiro",
    "C1EEF8D34895CAC21D787789FD5E92AC": "Canhoneiro",
    "C2329B84497869D276459891BC0071A4": "Artilheiro",
    "C2C799C441879E3849B3D6A00F47F4E6": "Artilheiro",
    "C731333E4348DD99535FBC8F99BEAF98": "Artilheiro",
    "C79801EE4B6B5C469E9E26A7645D11DC": "Canhoneiro",
    "D536BC564C4C527E040FAF9C839B0840": "Canhoneiro",
    "D6A9E89D444DA7F5A8465D850B119AD5": "Canhoneiro",
    "F84F78494A08049A8BFC2691C9B914F3": "Canhoneiro",
    "FE33F17647EC0E8F67C91F8089A9D034": "Canhoneiro",
    "9826FEAA4ADCCBC769AD49B5DB1E3832": "Uniforme Caoivish Parka",
    "8B21386A469DEF1ED9EB18ABCCEB5485": "Blindados Caoivish são incomparáveis em seu design e resiliência. Todos os tripulantes são equipados com uniformes robustos e vários bolsos para acessar ferramentas essências para a manutenção e operação de tanques.",
    "53DBD4A2463DC1D888364B8F47E1D32C": "Engenheiros Caoivish são legendários em canções do passado e estatura. Eles vestem uniformes especializados, equipados com cintos e bolsos para acesso fácil as ferramentas e materiais de mão.",
    "95AA7C9F4FE4BDCF0FDCCB9469598AB2": "Capaz de disparar diferentes granadas rapidamente e a longas distâncias, o Fissura gd.I é móvel o suficiente para ser facilmente transportado, enquanto aumenta a capacidade ofensiva da infantaria. ",
    "F87E18FD4755B4CB776A3EB320EE4892": "Capaz de disparar diferentes granadas rapidamente e a longas distâncias, o Fissura gd.I é móvel o suficiente para ser facilmente transportado, enquanto aumenta a capacidade ofensiva da infantaria. ",
    "A0304AB148E77AF71F6BB183D703BBF4": "Ponte Passarela",
    "D85BBEEB45FD4DAEC608A489B4EC006B": "Passarela",
    "E27BBDD245BCB9327A6B968A5B6C416A": "Escadas de passarela",
    "B4F14CE84B8BECD58981A58064C4FAC7": "Causa dano por tempo",
    "17227DAE4C39D298FD77349E325BF4F2": "Lousa",
    "5DA7887C4258C3E2CB39189DCBFC40BA": "Trocar combustível",
    "011CA5F541D075F50B492CABA5EBFEDD": "Se agache ‘C’ ou deite ‘X’ para reduzir seu perfil e aumentar a estabilidade. \r\n\\\r \nPratique se mover agachado ou deitado no trajeto adiante.",
    "CA95D7E34CCB1C1AAB7B16AE8F5BE756": "Troque o tipo de combustível deste veículo entre diesel e petróleo. Veículos movidos a petróleo têm um torque de motor mais forte.",
    "B3DE06B64E0BA3E8F1F93DB181593D80": "Pedaços de carvão bruto que podem ser refinados em materiais necessários para produção de materiais ou geração de energia nas instalações industriais.",
    "C1E6A0284B37E5E5B582D8BD3DED6AEF": "Capture uma cidade de logística em território inimigo inicial enquanto sua facção tem menos de 35% de todas as cidades",
    "C47DCC72479A6F1DD6307B919D1F32A7": "Escalar",
    "5BA2187146CEB825CB4228AA35F47B70": "Fechar Área de Doca",
    "E45EDB8F4F9D682155319D8CEF73C968": "Fecha as comportas da doca seca para permitir a construção ou reparação de navios.",
    "D9546E22416383B1AABF059FC045B64E": "Carvão",
    "08AA3BCC4623C87DB4E661A4F8A676CD": "Campo de Carvão",
    "7FAF2CEE488B1E9D22282F9DD0A4D416": "Estação de liquefação de carvão",
    "D79F7FC64BBDB3720DE384B1A449391D": "Central Elétrica a Carvão",
    "C82D1D704AFAF5F82D9090A61417B3E3": "Refinaria de Carvão",
    "05FB560543B6B5D7FB760A932DDF2596": "Canhão Costeiro",
    "1B679B5D4836AC9171AEBABE59DE5239": "Coque",
    "D18901BE48F54CD90D61ABB39940BE7E": "Fornalha de Coque",
    "B80277BE489804CA7459B39FBB06B7FE": "Arma de campo de 68 mm \"Collins\"",
    "335CC5A441994402460A2DA1C6B02C77": "Engenheiros de Colm Gallagher projetaram uma variante do Outlaw que apresenta uma torre rotatória independente equipada com uma metralhadora, esta fixada no teto do armamento principal composto de um canhão anti-tanque duplo. O que lhe falta em poder de fogo comparado ao seu irmão mais velho é compensado por sua versatilidade.",
    "94F1CEFF4227509BE33B1989F55C6DAE": "Uniforme Blindado Colonial",
    "CE22DA364D75F47BFC847E811CB9DDC2": "Os Carros Blindados Colonial são plataformas de assalto urbano e rápidos. Esses veículos anti-infantaria são equipados com metralhadoras de dois canos.",
    "06209EF04AC1AF6314401B9F8225E5A8": "Uniforme de Engenheiro Colonial",
    "CB181E6349AB3EF12388D088EE90B285": "Uniforme de Granadeiro Colonial",
    "B4E25007455E19F7C46FA1B02479FFC8": "Região Inicial Colonial",
    "CB7C260743140BD84D36BF86EDE1C785": "Uniforme de Médico Colonial",
    "970015384E151C88F0FD219FB6D53F4C": "Uniforme de Oficial Colonial",
    "33C6E9B1418286BEB4216094FB644868": "Uniforme de chuva Colonial",
    "D8DB9DFC4336C5ED55C9A990F246E78C": "Uniforme de Batedor Colonial",
    "29AC5303429354A56648F583E51FF6A4": "Uniforme de Inverno Colonial",
    "12DB89BF4E72823287073CA4DF328868": "Uniforme de Soldado Colonial",
    "3531DF4F4548B0DA79CC23A10FAA95A6": "Spawn Colonial",
    "DC42649544472E4A5C5CA7A9D1F4C78D": "Uniforme de Tanquista Colonial",
    "17E625BF4F67CA1B168D2E90D6F48427": "Vagão de Combate",
    "901E2C834747895953A856A5DC67E063": "Vagão de Combate",
    "21E762044E8DE112BAE0F9B2643DDF11": "Comando",
    "A6C9A53541B0C0D17A1767BC6731ADF4": "Combustível comumente usado para abastecer todos os veículos e minas de recurso.",
    "CFAB025E43945DD5A675929EA1B8735B": "Campo de Componentes",
    "B6CE90A5448C96D16CD38A8E7B2BA03A": "Mina de Componente",
    "3C4F4A45409283D939A56AB732B3108C": "Componentes",
    "7385160042574D376AF15594840C9138": "Componentes que podem ser transformados em Material Refinado em uma Refinaria",
    "8267F866424460C045FF40A62D7EA10D": "Módulo de Computador",
    "92D1428F428EE050351557832DB379BC": "Ponte de Concreto",
    "2E1BAFC24875F569598C04B027102999": "Fundação de Concreto (1x1)",
    "AC7C340A401CF179EBF08A8F2EA37431": "Fundação de Concreto (1x2)",
    "AE8BCA6D423E26FD2BB2A788298B8526": "Fundação de Concreto (2x2)",
    "62BAABFB4D334D702542EB91C34E9FEB": "Canto de Fundação de Concreto (1x1)",
    "BBA3E405402547B83D4C3FA9A95AD67C": "Concreto",
    "D5B404CF40D1E05BD342BEA46DF35623": "Betoneira",
    "AE1573994B153ED04FD89CAA3717AE1C": "Estruturas de Concreto",
    "CAF19C714CA9B02DA6B44DB5394C60A6": "Conduz energia entre um poste de energia e outra estrutura.",
    "1ACF7DFF490EA4BF1F420C9FF3860726": "Materiais de Construção",
    "36C1BF36454836BB112D9480C2E468A2": "Veículo de Construção",
    "6B24FD3749D698B926AB4EB742380547": "Veículo de construção",
    "12C895724DA8D5DA673FBCAE80A77FA3": "Pátio de Construção",
    "4CC605274C43052D3B206AB2A4E0DCE8": "Pátio de Construção",
    "054DE0FF4483D71499703B9B68B5D811": "Vagão de Contêiner",
    "C5029282468709AF7937B7BBF877B266": "Cobre",
    "EAB24E7045D7FBD285D8B59E05492E76": "Liga de Cobre",
    "C6E827854959790FFB6DB8A3EA6480F9": "A Liga de Cobre pode ser usada para produzir Protótipos de Veículos no Centro de Engenharia. O número de unidades varia de acordo com o nível da pesquisa.",
    "9867C9B54B91DB2156CF34B791B1B1D1": "Cobre pode ser refinado em Ligas de Cobre, usadas no processo produção de protótipos de veículos.",
    "38273AFC4AACFA88F89A3C9A2D3B2679": "Copiar código",
    "DA7A88824AE3F151D0B26ABF1745EE60": "Cobertura",
    "9480EECC44D191EB108306ACBFCEF534": "Cubra-me",
    "0F3ADBAF4570F287492A76B98060113F": "Unidade de craqueamento",
    "60D70F564358A0AA1EB9379D93A0FE66": "Guindaste",
    "63CC9B4A469EEC8F696C6EA020432AED": "Guindaste",
    "35503F8748DDFD0502021BBFC576911F": "Trilho para Guindastes",
    "8B875CD6417482DAFF18E2AE309567B0": "Caixa",
    "1D9661814728CC3654250D99AABD5C71": "Cratera",
    "770167924C272500D86179992E951FC9": "Cratera",
    "F15745E8462830CC9AB858ADC6A24C9E": "Criar Estoque Privado",
    "DA61CC4345AE336D97C22BA9FE2E2062": "Cria um estoque para armazenar, com segurança, equipamento por um tempo limitado. Estoques de reserva são para temporariamente armazenar equipamentos de preparação e não para armazenagem privada. Acesso pode ser compartilhado com outros jogadores via senha.",
    "DF9D586046D58FFD050037A54776F41D": "Morteiro Cremari",
    "DD97C63C4237E34D2D418785502C209C": "Soldado Gravemente Ferido",
    "44CDCA2942B6EAB83A8B009F07B96CF7": "Tanque Cruzador",
    "CF181019476265E687412D8E123DECEF": "Tanque Cruzador",
    "DC44C1C144DFB2BA01D9BFB0DE19E7AF": "Tanque Cruzador",
    "901AE71547491F493E627791F4BD21D3": "Mudar o Filtro de Líquido",
    "680338D649C87C7AEAD96C92174E29E3": "Voltar para a guia anterior",
    "F670876845A76AB26C4D7897F9CE3EB5": "Mover para a próxima guia",
    "CDDDC92F42A69E0F488D088F3B490226": "Modifique o filtro do líquido para permitir que esta estrutura aceite apenas o líquido específico desejado.\r\n\r\n<RichText.Regular12.Orange>Deve estar vazio.</>",
    "A2923020423029BE99C15C933B982858": "Componentes Danificados",
    "3AB241504786F95F4CCA999EB9244219": "Componentes danificados que podem ser transformados em Componentes.",
    "8BA2A8B243CD4CD2EA33C78734DECDC7": "Gera dano altamente explosivo no impacto",
    "A759CE2B4F59026953934D86CB982420": "Decifrar mensagens codificadas às vezes requer mais do que apenas mão de obra. Esses módulos de computador de última geração podem fazer o trabalho e roubar inteligência inimiga.",
    "33F864FA494AC77C7470509A269616B8": "Demolir",
    "F7F2EAA84112598BD8BB21838CE54349": "Destrói este veículo, removendo-o completamente do mundo.",
    "0E47402D497FB3B729F523B31EA42356": "Demolição",
    "4D0D72D0452D2DB7E4B2DBA743A63E0B": "Ingressar na guerra",
    "5A25BD694237EBA2AFAEBC965B2386BC": "Ponto para ingressar na guerra",
    "5EC6C3764E3A9055DF183EA607BB7670": "Ponto para ingressar na guerra",
    "E1C74DB944F2AC7206FBC999F49ACA70": "Rifle Antitanque Montado",
    "4E4DB2B344BB158A9C0B56829C85122D": "Havoc Charge armada",
    "B65ECBC1481C3213858453A08B6FB4DE": "Arma de suporte de infantaria montável",
    "B6F3A3A745AEB338C211239D034879B4": "Metralhadora instalada",
    "C90EB41E442883C0502BCD86C596E9DA": "Metralhadora instalada",
    "0EDCD2F044E7D1BABCF65F87D05D2AEB": "R.P.G. Montado.",
    "B584DAC0494452860D7C50B075DD1BF3": "R.P.G. Montado",
    "DA7DF8C74D9859AE0E5BE08B5C2AFD1A": "Tripé montado",
    "F36D2ACC43944973C83DBAB1FFCE6CB0": "Mapa de Mobilização",
    "0264CF904E70D8C4F8186E8195DA4F16": "Ponto de Ingresso",
    "383B402E474BADFE7252DC83B28F1773": "Carga de profundidade",
    "3F86B586405A3BE3C77456B0F2ADF819": "Carga de profundidade",
    "908BF3B743992D354B6F789E3E8F1634": "Carga de profundidade",
    "9BAF48A647EBE059B00714BC83AF8500": "Projetado para missões de escolta e para o suporte de operações de infantaria, o meia-lagarta classe HH-a \"Javelin\" é um veículo blindado, versátil para terreno difícil que pode ser equipado com uma variedade de armas montadas.",
    "498585524403BA7F3832B5A1EC4824BD": "Projetado para missões de escolta e para o suporte de operações de infantaria, o meia-lagarta Niska Gun Motor Carriage é um veículo blindado, versátil para terreno difícil que pode ser equipado com uma variedade de armas montadas.",
    "26ED399A44B866863CC3E58124AABB22": "Projetado para produção em massa em Kraunia, esse tanque de assalto possui um sistema modular de torre, para máxima versatilidade. A classe \"Falchion\" possui um poderoso, se discreto, canhão de 40mm.",
    "79B1AA8344606FF1D0AA3DAC3B0BBDA6": "Projetado para patrulhas fluviais, o Type-C Charon é equipado com tripés duplos e um canhão de morteiro central projetado para destruir qualquer resistência blindada na costa ou em águas abertas.",
    "99CCB6584F3388BD2B4B9BB0AE9CAB57": "Desenvolvido com o único propósito de lutar contra os mortos-vivos, o Veículo Mecanizado Utilitário \"Centurion\" é equipado com duas poderosas metralhadores pesadas e um canhão frontal mortal.",
    "AD94AB834E437227E2D2AFBB61FEB2D9": "Projetadas para colocação subaquática, as Minas Navais detonam ao entrar em contato com embarcações inimigas.",
    "BFA4A55D4B3C01FA9114FFA50DD0A9DA": "Destruir Estrutura",
    "A0262E4B402C015853F8B18B07BCF8F2": "Arma Costeira destruída",
    "FC157C4B49D0310646094086775F97BA": "Casa de Morteiro Destruída",
    "5B6CE9C34D1A721D353FEDAD3EE53991": "Casa de Guarnição Destruída",
    "04C2A66849571C27BC0A0590F8537CA8": "Casa Guarnecida Destruída",
    "05D64E054A9AEA6A8870F992BC39ACA6": "Casa Guarnecida Destruída",
    "0E9B84204D91D666F0475384F315B414": "Casa Guarnecida Destruída",
    "183577D245A711D2CFE030B0DEC62619": "Casa Guarnecida Destruída",
    "23C52A394A2C6DDA9B3CF38ABEC83C0C": "Casa Guarnecida Destruída",
    "25D1C5EC44C45A256B39A381329E8C8A": "Casa Guarnecida Destruída",
    "31041A6A4E8329B1B3EC5C88450E6D46": "Casa Guarnecida Destruída",
    "386474574D25E11C900DE89108207B60": "Casa Guarnecida Destruída",
    "527049E64919167DA8E4BEA55760BC4C": "Casa Guarnecida Destruída",
    "65C02B3443756C3882875A849A10F302": "Casa Guarnecida Destruída",
    "6BA4DC11486E7E7A06AA56AA0ECE0C38": "Casa Guarnecida Destruída",
    "6C854D8640A267DD19812A9CCF072CE2": "Casa Guarnecida Destruída",
    "72554D834F54109F83271E8E8E300636": "Casa Guarnecida Destruída",
    "8EA2BE9C45F46EC3660013B96D260F8C": "Casa Guarnecida Destruída",
    "9ADFE6B84DD7DD2F34116A93280EB67A": "Casa Guarnecida Destruída",
    "9B71AC5241BBE1A347E0C9A6DAC9F2EE": "Casa Guarnecida Destruída",
    "9DE304714C744B9FC9793E804505DCC1": "Casa Guarnecida Destruída",
    "A2D3D33E47F97B26DDA7F28EC1F6708D": "Casa Guarnecida Destruída",
    "B084281A4E0464D5D4A61BA45383CB1B": "Casa Guarnecida Destruída",
    "B7E6BA4B42B66B9794C64FB59CFF8668": "Casa Guarnecida Destruída",
    "BAFD0E7841FD707C0FC3E8927B60FC68": "Casa Guarnecida Destruída",
    "D1CB22D14B682590F9FF4E80F16D66C7": "Casa Guarnecida Destruída",
    "D46726DC44584F50975574BB27C55C1F": "Casa Guarnecida Destruída",
    "DCEFE81246CFD944F515D79886950C25": "Casa de Guarnição Destruída",
    "E591AB8B44D7049016441EA7BF90F2E3": "Casa Guarnecida Destruída",
    "E6C4199C43014DB9737BD8B66FBC2035": "Casa Guarnecida Destruída",
    "FD701455480BB3FDD30B44AD4C324CE4": "Casa Guarnecida Destruída",
    "16A1282044DF6055D326AABEAF636E42": "Casa Fortificada Destruída",
    "5FA6E8054562B139B530ABAA7B65547B": "Casa Fortificada destruída",
    "B4BFE1684FFA4084504FEABFA47D7D81": "Casa Fortificada Destruída",
    "B7AB672A4B1C0A1708E1208FAC70D517": "Guindaste Estacionário Destruído",
    "0C76AEF743C765A6E38EF6A58F6CF09A": "Base da Cidade Destruída",
    "3478C25C4B7D33B34B7217ACBCED00DD": "Base de Cidade Destruída",
    "E8B4F22842C789E1E3B0DBB10DEF2492": "Base de Cidade Destruída",
    "06F1BCF74DEDC31BDF53F8B1878F911F": "Trincheira Destruída (Nível 1)",
    "3F7E7DAE4538B9C70B62D695495177AC": "Trincheira destruída (Nível 1)",
    "F634D667469C9D1AE38CC28384E1023C": "Trincheira Destruída (Nível 2)",
    "FDED509B4BFD4A8CDB70138372C05A4F": "Trincheira Destruída (Nível 2)",
    "24FD22CB4DC74792791565BE4DE2A339": "Trincheira Destruída (Nível 3)",
    "EA743F984C22A662B4AC4FBDC38F6CC1": "Trincheira Destruída (Nível 3)",
    "73B11259426A9E4FB490988B33137570": "Conector de Trincheira Destruído (Nível 1)",
    "E29A87864B41D8E59FA3B5A0558BBCF4": "Conector de Trincheira Destruído (Nível 2)",
    "FF99FCCD4E189A2E15D964A726148AEB": "Conector de Trincheira Destruído (Nível 3)",
    "27B7124540F562B36200BB91E0F1118C": "Equipamento destruído recuperado do campo de batalha. Pode ser reciclado para recursos utilizáveis em uma Refinaria (por meio do menu de contexto clicando com o Botão Direito do mouse)",
    "1A098F0341B09DFB96E94D8EDA7359D9": "Contratorpedeiro",
    "55D048084C2C90E1F05340B4247D7C43": "Destruidor de Tanques",
    "65F03D9E4801817E140093806CC2F7FB": "Destrói obstáculos que só podem ser desmontados com Chaves Inglesas",
    "CAC7B220492912DC61A5F48E7B4EADDC": "Retirar arma do tripé",
    "BCE01A144C827D095F363D88D960D305": "Usina Elétrica movida a Diesel",
    "BE3F665C4C470BA0F86D529576402594": "Desfazer Regimento",
    "601D7FFB46841A19D0802DA9D0E4FDFB": "Desconectar tudo",
    "D124284B4C8C0841B3B25B9D9341CBB4": "Desconecta todas as linhas de energia conectadas a esta estrutura.",
    "1402CBA84CCDDF1A689CC194BC75010F": "Oficial de Mergulho",
    "725EEB36498E0825F76EC3848A837AF5": "Oficial de profundidade",
    "D97EFDCD4552EE3ED3B6A991ACE82A3D": "Cais",
    "5C24E6A14E2BFDCE0BBCB8865B328C00": "Dominante. Implacável. Nenhum exército no mundo se compara com os Colonials de Mesea. Então, quando os nortenhos marcharam por cima de nossa fronteira, uma chama que se recusa a ser apagada foi acesa.\r\n\r\nSe eles querem testar nossas legiões, deixe-os tentar.\r\n\r\nPois o fim, é nossa glória.",
    "5F377B0E4587CF0D14CE49A42F708DD0": "Porta",
    "766FEE094141E47C6C9E68A8AC41D953": "Porta",
    "7F7379344E3CC659790552B650A00C7A": "Porta",
    "675C196D4FCEE900F74B3790B3DF0DCC": "Dente de dragão",
    "1A400430493335EA1D65F3ABA2F6D63E": "Tubos de Drenagem",
    "0A8060544364E325529ED892023A49CA": "Ponte Levadiça",
    "195B6F454DE2CB4C019A3E927748B54B": "Ponte Levadiça",
    "4BA99805416D455F85C8BE8B3DC6F82B": "Ponte Levadiça",
    "5EF229AE4007E992CBE4068897EB1A87": "Ponte Levadiça",
    "88C5F1A143250C1751311C9AE76B303C": "Ponte Levadiça",
    "83A395F64258ECEC0802CFB6E5A04E1F": "Teste de direção",
    "88E7EE18441ECF287D89A9907F9AD571": "Teste de direção",
    "CB7DFFF54D1B73FA2E800E8A674E7CDD": "Teste de direção",
    "DC22351B42F5D04D010FCCBAE4F17155": "Curso de direção",
    "AB977EC5420C8827B93C4994C1735AF7": "Itens largados",
    "7996F6FB4893D97468125E9DABF944D7": "Doca Seca",
    "11F5FAA9454DCA4D27AF97B947756B7D": "Duncan’s Coin 20 mm",
    "D1306F394665FBD1A787E483078A1562": "Dunne Loadlugger 3C",
    "2AAFA04A4A217CE751F9DF8127D2A8FC": "As primeiras iterações desta metralhadora foram feitas para serem fixadas em bunkers ou nos déques de navios de guerra levemente armados, a Ratcatcher é a primeira arma de infantaria de Harvey Malone projetada para uso no campo. Assim como suas predecessoras, esta arma pesada tem o poder de suprimir soldados inimigos com uma eficiência formidavel. ",
    "08091B354DE93829851FBEB3CB2ACACD": "Editar Mensagem",
    "EA73E2A24E6D91BE59B3FA8D029F3F4A": "Editar Regimento",
    "30D0433A44CA775D26EAD89FBFA2FA05": "Edite a mensagem exibida pela placa de sinalização",
    "E39478D4433CB85DB6F0079E93577A5C": "Edite o nome desse Regimento e a sigla",
    "B4E3828C4A1B54EB6297D79DE7E90627": "Expulsar Motorista",
    "7375A5424178BFE027BEED928F1638B8": "Expulsa o motorista atual do veículo. Esta ação está disponível se o veículo foi reivindicado por um Esquadrão. Apenas membros desse Esquadrão podem expulsar motoristas e apenas jogadores que não estão nesse Esquadrão podem ser expulsos.",
    "5B7EEA1143A8752CD6692E8C421C1418": "Poço elétrico de óleo crú",
    "5AE32C83458629A923D0A0ACE0C852CC": "Casa de Morteiro",
    "B9002B7F4C84AAD7D3D369BCD817535A": "Casa de Morteiro",
    "6F7AD3C94752591F17B8C69D3D4D8067": "Permite a construção de Casas Guarnecidas e Casas Fortificadas nesta cidade.",
    "10FC0F0547FAE13CC3F1A9B656B81148": "Permite a construção de defesas adicionais, como Casas de Morteiro e Canhões Costeiros.",
    "F7E804FA4A16CBB465B6239C61698EEA": "Permite a construção de estruturas de logística, como Fábricas, Refinárias e Armazéns.",
    "77CF537E46DB75C26ED013B5B5901FF9": "Acampamento",
    "801BE81D4B8E3BCC0A58F29C385A6C72": "Acampamento",
    "D11367964786D174715D918E175A3B25": "Motores de produção de energia (Nível 2)",
    "A046E43445FD734903AB2AAECAA8CBA1": "Motores de produção de energia (Nível 3)",
    "1F61C54A4810D57334074C91C42A7EEE": "Centro de Engenharia",
    "B27C2F014F032FE4AE2FA39C368FA2EC": "Estação de Engenharia",
    "8C1183A34EED68DB511D039030F4040C": "Engenheiros são os pilares da República Mesean. Eles são equipados com uma mochila resiliente e bolsos que permitem um fácil acesso as suas ferramentas e materiais portáteis.",
    "852FBF664CB60C909259479FD1C39313": "Óleo enriquecido",
    "6405A9C4437F95AE40A01E92E854D5BF": "Entrar no veículo de carga",
    "90CD31144FC19D0B388AF9B5A50AE486": "Entrar no veículo de carga",
    "677B173044BC914F0AC13FA55F44FA46": "Digitar códigos de lançamento",
    "A577485C43B2D6DB5FEB2F8B133B2FB3": "Digite um código de 6 digitos para ter acesso a um Estoque Privado.",
    "0F82AD414B67440EDB133FAE27E72468": "Bunkers entrincheirados ocupados por tropas armadas com rifles.",
    "07B5544541C637F54A9A91BDADAB6C0E": "Equipamento",
    "837817FD4C271A212BA53FA37F3C1AFC": "Escavação (não é necessário materiais)",
    "610EC8D949E1E706DF9E9B8D8E03E8CD": "Escavadeira",
    "27CC60CC484F7C544BFDE7A3369C56D8": "Explosivo",
    "6EC4EFBB467656EA5C0146BE84B8A3B7": "Explosivo",
    "99B2FE9A4C6126AEB39E79A364F12511": "Explosivo",
    "03FBC6B44B4194FA5E88BA8820F42152": "Carga Explosiva",
    "3ED26AAB488A5A5C7F6A07BEEC12B3AD": "Carga explosiva",
    "55BFB5094F3A43DA9B04E2B5376871E0": "Carga explosiva",
    "AA5C90F940A4FC5E410D3781804EE0B6": "Carga explosiva",
    "A953D201483DD72E1FFDA1A8ED0E8F7D": "Materiais explosivos",
    "F69C80AE41E0C992851904AA92FF9C1B": "Extinguindo o fogo",
    "A5CE13FC47B409EEAC835CAC64554DA2": "Extrai combustível de campos de óleo crú. Deve ser construído nas proximidades do mesmo.",
    "C43BF1774AACEB7B3125CDBAA140D417": "Uniforme Fabri Rucksack",
    "1212F89546473A760EEB0A8D92C1B70A": "Indústria (Nível 2)",
    "345E78214C324AACEE51C89D606B3140": "Indústria (Nível 2)",
    "3F54181D490D84B90BBA1B90C8F1AA75": "Indústria (Nível 2)",
    "A5ED3CD24DF76BFC46962BA5A03E87FA": "Indústria (Nível 3)",
    "D5A27FC1449B023F11B7F69677E344AA": "Indústria (Nível 3)",
    "E703D5C3448DA71DE335A8BDEB84A763": "Indústria (Nível 3)",
    "1C6075E540F596B894E3BA966D66592E": "Fábricas são utilizadas para produzir vários items. \r\n\r\nSinta-se livre para utilizar a fábrica próxima. \r\n\r\nCaso precise de recursos, tente refinar materiais que podem ser coletados em vários campos na ilha. \r\n\r\nPara uma explicação mais detalhada clique no ícone “?” no canto superior direito do menu da fábrica.",
    "21258B35439483DDBF4B77A6D928EB04": "Fábrica",
    "41D126A44DA0520ED5F340871B30C910": "Fábrica",
    "72A344A24B0F050D239CBC989C9F8606": "Submetralhadora Fiddler Modelo 868",
    "0E590422497597303D247DB4738E5940": "Canhão Antitanque de Campo",
    "5BE3900A4BC47B72BF09958D4998F59D": "Canhão Antitanque de Campo",
    "234479D3480F8D3D8624C99663750E12": "Rifle antitanque de campo",
    "E22210AF44BD5C5E47C343A8E7B1CBAC": "Rifle antitanque de campo",
    "3C2E678C4DA8E9DD134C018311963D2F": "Artilharia de Campo",
    "AC38557546509C33A9011AA0D7C1EC63": "Artilharia de Campo",
    "D7E5D59A4D09EB59D62313A5641B0F83": "Artilharia de Campo",
    "CF340BB44E78DB2006B379B249A0B98A": "Artilharia de Campo funciona de maneira muito semelhante às Artilharias Fixas.\r\n\r\nVerifique o tutorial Fundamentos de Artilharia para questões específicas.\r\n\r\nA diferença principal é que a Artilharia de Campo pode ser movida manualmente quando dois jogadores estão a utilizando.\r\n\r\nA Artilharia de Campo não possui tanto alcance e poder, mas é bastante móvel.",
    "2CF00F5E4322527F4A59138F1E73CAAD": "Ponte de Campo",
    "85214B6C4F89526FDAEF1DB46A35F5A5": "Canhão de Campo",
    "239F672B4BA79C67D3C9CEBE5C420B2F": "Hospital de Campanha",
    "E6C9B72C47CEBDE3A65DA8BE9E5DDF58": "Lançador de campo",
    "79B77B524F98465C23C22D8CA433A6AE": "MG de Campo",
    "3A50260049F13414DA4C1487E7DD2861": "Metralhadora Leve",
    "3BEE21A64768DA596100BEA3DB28E2BA": "Metralhadora Leve",
    "2E5DE0834B30862D571B05855A4CBAC7": "Centro de Modificação de Campo",
    "C59C329548265373EEF4548DEDCFFE7E": "Morteiro de campo",
    "C32EF9B64E1DB95E4B60CD909E62C6EF": "Estação de Campo",
    "1D69619142CC5934A19B5185E751222C": "Preencher",
    "1E3F86B849E45AAD4CF31EA4C8D144E4": "Preencher",
    "229DCA044477360060A61CBD4B317FE3": "Preencher",
    "2F964D3D4389D3736BE4388D4E045175": "Preencher",
    "3A06383E4980F00A6FF5C581A0ADCCFA": "Preencher",
    "83C2B3C246F4B4CFF97E02B118CEA45E": "Preencher",
    "8A99D2084476E3E799A0A092203C491E": "Preencher",
    "B10B65474010C1AA6BE2EAA9BCA5F80B": "Preencher",
    "BCFCA7234A083547AE2E77826AFC76B9": "Preencher",
    "D2A510C145EF70BF5AA01891F49DFC71": "Preencher",
    "DFF1431449484FA10AF26BBE74609724": "Preencher",
    "E297AE554DB2A7DF0E1B5EA1AD0C6B09": "Preencher",
    "FE7861B340CC5B1AED601487FE979569": "Preencher",
    "9252963C4AD30A7AA261E99F29D8B4A4": "Preenche este Bunker, restaurando o terreno ao redor.",
    "9F4E81DD4A6BDBB414426E8E0A4D6656": "Preenche este Bunker, restaurando o terreno ao redor.",
    "ABDCB2F54C4E16644CDDBE904B8B4507": "Preenche esta Trincheira, restaurando o terreno ao redor.",
    "DB6EB8DD4E001F249E711F9CFD0F8871": "Preenche este Bunker, restaurando o terreno.",
    "98682818476BCC5EF7A40C87B97A4D48": "Preenche esta cratera, restaurando o terreno ao redor.",
    "BC6E7F2A417F27BDA0772A8D0FDD624F": "Preenche esta cratera, restaurando o terreno ao redor.",
    "5AE781E14167E6E84C9705B68AF4A532": "Preenche esta Trincheira, restaurando o terreno ao redor.",
    "0295F40B4438AB1A5F506E801EAEE664": "Preenche esta Trincheira, restaurando a terreno ao seu redor.",
    "1205889C44351F8B31D31CBE1CBC59BA": "Preenche esta Trincheira, restaurando o terreno ao redor.",
    "4383994645B70DEC33898DBE4C92A08C": "Preenche esta Trincheira, restaurando a terreno ao seu redor.",
    "579F7D7A489202AD79EDBDA26B7B34DB": "Preenche esta Trincheira, restaurando o terreno ao redor.",
    "63AE3BE2463DF21E59AD6EB155709ADD": "Preenche esta Trincheira, restaurando o terreno.",
    "CF7920F64F99C5C566F9BDBA9DAF06DC": "Preenche esta Trincheira, restaurando o terreno.",
    "13CD5C9A47BA879FA87C62865697C904": "Caminhão de Bombeiro",
    "C19E0D224B5919BEFAA077A102359788": "Caminhão de Bombeiro",
    "07548A88486A71FF3E2BB385B00429DC": "Fogueira",
    "DD746F89475D20526DB12CB524E29926": "Armas de fogo são uma necessidade infeliz na linha de frente. \r\n\r\nPara fins de treinamento, uma variedade de armas de fogo foi fornecida nos contêineres de armazenamento próximos.\r\n\r\nNormalmente, todas as armas devem ser fabricadas.\r\n\r\nPara atribuir uma arma ao slot correspondente, abra seu inventário com 'TAB' e clique na arma desejada. \r\n\r\nUma vez atribuído, feche sua mochila e equipe a arma com '1' se for primária ou '2' se for secundária. \r\n\r\nMire segurando 'o botão direito do mouse' e atire usando ' o botão esquerdo do mouse'.\r\n\r\nTente praticar nesses alvos.",
    "318E28E849D5F10341C184B97B832951": "Disparado a partir de embarcações submersíveis, o Moray Torpedo é um torpedo subaquático autopropelido que funciona bem em vários alcances e profundidades. Ele foi projetado para perfurar cascos de navios de grande porte, deixando-os vulneráveis ​​a vazamentos.",
    "ABCF56064644F182E927C98DC9572DF9": "Embrasura",
    "F9B540CD4BC1D59245B7E691EEFE85B3": "Kit de primeiros-socorros",
    "41DC5BB04EDDDE08A9E340B497FA2090": "Primeiro, construa uma nova Trincheira e a anexe a um Bunker.\r\n\r\nEquipe um martelo e se direcione ao Bunker. De frente à parede, pressione ‘E’. \r\n\r\nVocê deverá ver um menu com novas opções.\r\n\r\nÉ possível aprimorar o seu Bunker de diferentes formas, como convertê-lo em defesas de IA, adicionar postos de disparo, ou fazer uso de uma variedade de outras ferramentas.\r\n\r\nPara entrar no modo de aprimoramento, com um Martelo em mãos, pressione ‘F’. Um ícone de ‘Martelo’ sobre uma estrutura indica qual delas você está aprimorando. Pressione ‘E’ para abrir o menu de aprimoramento.\r\n\r\nTrincheiras e Bunkers podem ser melhoradas com madeira reforçada, ou eventualmente com Concreto.\r\n\r\nPegue alguns materiais do depósito próximo. Adicione uma porta ao Bunker e aprimore suas trincheiras ao nível 2.",
    "EC0047B7405B350858FF23BD071C7028": "Equipado com uma arma antitanque de 68 mm, o Blinder é capaz de perfurar todas as ligas, exceto as mais temperadas.",
    "677F3D7F4F3EC78116002FA9DE6222C0": "Montado com esteiras para locomoção em terreno difícil, o Highlander traz mobilidade significante e tem bom desempenho em ambientes nevados e montanhosos. ",
    "D91215074858A485C1A09C8661C768B4": "Equipado com duplo lançadores de RPG, o T8 emprega ataques de relâmpagos contra estruturas e armas fixas inimigas.",
    "49E7314541C271CFD119489A5B71A408": "Marcar como construção em local inapropriado",
    "4CF0F3774AF5DF3CCFB4DEB69818599D": "Sinaliza esta estrutura como disruptiva. Se uma estrutura tiver sido sinalizada por um número suficiente de jogadores, ela se tornará vulnerável a danos de fogo amigo.",
    "91724B794E1BCFC2D0D172A32C020F56": "Munição de Incendiária",
    "6DF8B79A485E7315519C4BAC40ABA2D0": "Lança-chamas",
    "BFE4D2A646B0D62612233980A81359B6": "Lança-chamas",
    "30EF5CE9458DB363F55CCF87331C9C40": "Munição de lança-chamas",
    "35CB3AAF48032CC381F4D5B75DC9E300": "Munição de lança-chamas",
    "B777FC99442DB88B03A7ECB094119BF0": "Sinalizador",
    "D6EFB89F46759391A4051292C45BC925": "Munição Sinalizadora de Morteiro",
    "1792CEF147D68089B641D3BC8CAA1387": "Vagão Plataforma",
    "458F081C470EBD36BD654E8D14B86534": "BMS - Flatbed",
    "19160B414FA3540EB3F0E08526FB5D7A": "Siga-me",
    "0AF9B0C64ECCAB0D96434AB223799B95": "Para médicos Coloniais, esse uniforme que possui inúmeros bolsos projetados para carregamento e uso de equipamento de primeiros-socorros com facilidade.",
    "BBA10F004FF8DA0DEA069EBBA952B1F2": "Para propósitos didáticos, várias embarcações foram fornecidas a você para a prática de funcionalidades e controles básicos de navegação. \r\n\r\nO controle dos veículos é feito da mesma forma que a pé, usando as teclas \"WASD\". \r\n",
    "38AA2F854873950355FCCAB11415BB06": "Forja",
    "0E1D2D8B463556152517EAA9DCDB096E": "Fortificações",
    "8CB26A0E490845A47C32D1841BA47A8E": "Fortificado",
    "EDF80F4043F09B2A353609A04433D606": "Fundação (1x1)",
    "F45E2F3B4CA544FBFDA6FDA5C67CB547": "Fundação (1x2)",
    "E4FA32114D35A116E686A5A9A555FA7D": "Fundação (2x2)",
    "2FD7C3F44DCC2C64B9EA03BC9D89F25B": "Canto de Fundação (1x1)",
    "20C300D44111C0ADFAA707B524F40B27": "Elementos fundamentais necessários para construir cascos de navios de grande porte.",
    "2555CAA049962C34D8C25B8217AFE7E4": "Buraco",
    "3CA3BE5F40E4EB02AF87A9AC6626F775": "Combustível",
    "1F219F864DE728C7E1BDAF8D79552ACC": "Silo de combustível",
    "888A355449B487EA21C567B94E9C5A34": "Caminhão tanque",
    "3FBD45A24F877BDAF520A3B3EE3FCFF9": "Combustível pode ser adquirido de duas maneiras. \r\n\r\nPrimeiro, você pode refinar a sucata em diesel.\r\n\r\nSegundo, usar diesel para abastecer poços de petróleo crú, que produzirão barris de petróleo crú. Os barris podem então ser refinados em petróleo. \r\n\r\nO petróleo também pode ser usado para produzir barris com maior eficácia.",
    "D37AC5CC4FB8C9EA5FA5BF9D8AD5E33C": "Reabastecimento",
    "8194C7224AD3B4F2C11C23A8309947AE": "Reparo Completo",
    "F96CCD1E42EA9D965B0F3F9F4324E708": "Garagem",
    "0E35F8FE49AADCB93D10B785E7B3887B": "Guarnição",
    "147D88DF4F4DEB259D18809FEC926EEB": "Construção Guarnecida",
    "87E7FB0949BA2A3A803D6FA4D61AE2CC": "Construção Guarnecida",
    "A4D7E4EB45CC614B3CEDB292ED3D36FA": "Construção Guarnecida",
    "738B8E6D43F6D46F58DF308483807C54": "Estação de Guarnição",
    "05B6A7E843290D9F54FAD698DAAF8E63": "Casa Guarnecida",
    "07C088CF4658C899D59A4DA11B4C1185": "Casa Guarnecida",
    "0C9E7B9D4CAFC30F8AA3F296986D46D4": "Casa Guarnecida",
    "15624C00420C72099D88098D8BE07A96": "Casa Guarnecida",
    "1B8D4C8047EF5403E75A509C623A3AF2": "Casa Guarnecida",
    "1F28F2454C8D6ADA679D67A64F08DF41": "Casa Guarnecida",
    "300B0C3E43B337D2E5069B91EACEA441": "Casa Guarnecida",
    "33554B4D4A532E58A484D8BD5843DEE1": "Casa Guarnecida",
    "4A7D20EE4B1446612B17DA82F676532D": "Casa Guarnecida",
    "5116E7B64064AA9B4DBC4BB87BA3CEFD": "Casa Guarnecida",
    "570E66F64427D2FAAFC7C093CB49B636": "Casa Guarnecida",
    "5DFDF3F1403D4EA5228F99AA585EC21F": "Casa Guarnecida",
    "5FAAD2E2445137ECEB717B8FB5789913": "Casa Guarnecida",
    "6E530185404D69B28E538CBFC459325C": "Casa Guarnecida",
    "7894DAC2488EC4B1525D87973BF4EFDD": "Casa Guarnecida",
    "78C21E0247D30223F885D5B7C43D9A6A": "Casa Guarnecida",
    "7E370E254D2FC256783CD6B2F60B477F": "Casa Guarnecida",
    "8F5145264AD5949E39DE709D66407C8F": "Casa Guarnecida",
    "9C59052D48A56D4B209ABD9178D35165": "Casa Guarnecida",
    "A4B30AB7403E3D25F6426FA447C5488F": "Casa Guarnecida",
    "A85CC501406E34D03E89129A87589AC0": "Casa Guarnecida",
    "AF2561B3476AC14CA45ECFA477B1570D": "Casa Guarnecida",
    "BFBDFFE94555AB2AF6DBBB8B367FF86A": "Casa Guarnecida",
    "DEF08A374CD6CE786CF41D954BC4D9FD": "Casa Guarnecida",
    "E43E5D6A4A964118B53D5B947E7C3DAC": "Casa Guarnecida",
    "E485A5E840EE7026518453B0F8CFDED0": "Casa Guarnecida",
    "EA56E5E84110E0B8849C2A9CE2F20D55": "Casa Guarnecida",
    "FDE2A6044916483C475099B262B3383C": "Casa Guarnecida",
    "B06B92FF4C8F48F1B7A300856E9EC69E": "Granada de Gás",
    "CD94F99F497B1785DDBCA5A4CE172A0B": "Mascara de gás",
    "D95780024FE7408BBF477792618FC619": "Filtro de Máscara de Gás",
    "80762CBB45EF63A73AAB14B3CB2A1B65": "Portão (Nível 1)",
    "7A40C61448B3FABF060E369BB79F3A06": "Portão (Nível 2)",
    "4BAC9851464E59D977437285DF1586DC": "Portão (Nível 3)",
    "999C693D49CD6BA9C4054C97A3D31D84": "Cascalho",
    "4413D3A34597B7499BC5B2AC8CF05C1D": "Grenada de Green Ash",
    "8739433E4A662267B70B43875E0D8FE9": "Green Ash é uma toxina asfixiante. Inalá-lo sem proteção resultará em uma morte rápida. Certifique-se de usar uma máscara de gás com filtros ao manusear ou quando você for a um fronte onde o inimigo está recorrendo a Green Ash.",
    "A55A8CDB424662A986C45293EB9768C0": "Granada",
    "A32285A542723BFF482D4A8F4F0CF563": "Lançador de Granada",
    "E34F0CF34DEDCC557E9F2F82261903AA": "Lançador de Granada",
    "0C04CA104B06B55A857BA697672F62B6": "Torre Lançadora de Granadas",
    "6E061CC544132319F99222ADCE170C42": "Torre Lançadora de Granadas",
    "6F25C5494627639CBFC042B1DBA18F12": "Torre Lançadora de Granadas",
    "436B65CB4E3CC44771E7999EB0B34911": "Granadas",
    "4662E1F44473D9DADEE5FBBC41412A1C": "Granadas são equipadas a partir do seu inventário, assim como qualquer outra arma, no espaço de arma terciária. \r\n\r\nEquipe ao pressionar ‘3’.\r\n\r\nGranadas são arremesadas em arco, o que pode ser visualizado ao mirar com o botão direito do mouse. \r\n\r\nSegure o botão esquerdo do mouse para diminuir o tempo de explosão após o arremesso, então solte o botão para arremessar.",
    "D0FDDA8F49CC5A0ABFECB3887E62D100": "Uniforme Grenadier’s Baldric",
    "069C2F184DCB8877EC178EAF7B7600C2": "Alcance da arma",
    "63EB9B6A4C36454FF0FBAB996BF11549": "Canhoneira",
    "F9A269804162FA069E7C498D5426E537": "Canhoneira",
    "04E322B3454ACD0A015A5B8280E12436": "Atirador",
    "17A4191745D78A17F8D7D2B5F20B70B3": "Artilheiro",
    "18CCCD67460DC50D723CD6B803F448D0": "Atirador",
    "2163974847583327027B07B07C4ABCCB": "Artilheiro",
    "2170751A4AFCC2E6E5CA8AB281E7767E": "Atirador",
    "2ADB35E74AE7983E1B5088906153814B": "Atirador",
    "2C4C24874EFDD80AAFA1B68886086912": "Artilheiro",
    "2F49FFA546096D798AC247948AB3CF9B": "Artilheiro",
    "31E1BFFF4D531B5A837F9782A7BCF0F9": "Atirador",
    "334AD1E5415DEE4F90CC74AC8A5F3A98": "Atirador",
    "3825ADD34E26B099AAC100ACE066FCB3": "Artilheiro",
    "3B05BD29430E5752D02FAD8176CE935D": "Artilheiro",
    "4C92DE6A40DB640F3E4E729A61E10A53": "Atirador",
    "58965405402CF955256B5D882083CC8D": "Atirador",
    "63C5DCCB46706B3286BD3E9F5BB0041E": "Atirador",
    "6542FF2046B68CCE91FFC78F4C3C5C55": "Atirador",
    "693D63FB444BE0D03C7A9CA25A6A93DF": "Atirador",
    "6C4154E742C052BBCD6EC5892B665208": "Atirador",
    "7E2C51E94E4CAD46522A70903F36C33D": "Atirador",
    "80857B6048B21D9E48D3F9B22564CAA3": "Atirador",
    "8A9DF13D4C127B3F3D682E95FA7FE289": "Atirador",
    "9C5353B7423D2D4F160FB091CB3F8C3D": "Atirador",
    "9DD3C5D149636362F37B2B91B5B83395": "Atirador",
    "AFA79CF642CABF02048445B66613999F": "Atirador",
    "B214B2F74F78E8A67627E58878C61121": "Atirador",
    "B2D8D81F46C6AABB823ECBA220B0AE08": "Atirador",
    "BCE0E2F74366B0FBE3FFA38F8EC62A48": "Artilheiro",
    "C1BC8A9A48E8D2BEEAD23A8065CA54E4": "Atirador",
    "C75B5EF64B5D207C142A7EA962A837C6": "Atirador",
    "C9E214204CF62ED59440EAA55745641C": "Atirador",
    "CA3022A7402DD35AE04F78BB761F10D0": "Atirador",
    "CA71F11346288EAF1879E7BD7AAFEC9A": "Atirador",
    "CB4956624707DB8429314A861C23591C": "Atirador",
    "D4DB27214875F1A2C9D6B6B3C321C007": "Atirador",
    "D81BEA084F166632A786C9911CD2C893": "Atirador",
    "E439A8AA4862033B2E20D9B5C4855CE7": "Atirador",
    "ED50F32049DEDC3A83266B901A9D8C18": "Atirador",
    "F3CB25C540FE9AF9400999AECBC8C229": "Atirador",
    "F72C09CA469B61E3BF7E028B8717CABD": "Artilheiro",
    "00CD9B0242F5A4903A117FB4CEEDC514": "Armadura de atirador",
    "723CA04A4430A7F6E1C20298DA1CFA22": "Granada Explosiva",
    "8505355D496C4A6C1C869BB684947B6E": "Granada Explosiva",
    "2B7F04BD402638692572B284504F993E": "Veículo Meia-lagarta",
    "36DB40784E861D724CAFA8BED1BB69AA": "VBTP - ML",
    "426489BC4E90BAAFDAE138B53875FBF5": "Semilagarta",
    "4C56245747E9E3F8335B688FF9B8F0A5": "Veículo Meia-Lagarta",
    "5B73999D47BE22579B0761855721A5FF": "Semilagarta",
    "988B10484A3B004AE00E488E95B576A2": "Veículo Meia-lagarta",
    "9D0F590B4A1333C26A2283A0D451557D": "Veículo Meia-Lagarta",
    "BE6DA0764FD4E2162BC7A8947D5DAAED": "Veículo Meia-lagarta",
    "CDD85623466B9FE5030799B32B30AFCA": "Martelo",
    "E2006B7D4E0B3015E0EFC38BC74B205F": "Colheitadeira",
    "F8156AF3425DD053C3323784874A9FAA": "Detonador da Havoc Charge",
    "A046CD18495C23B23CD3A8863D6DD9E9": "Blindagem metálica que absorve calor e protege até os materiais mais voláteis dos elementos, evitando detonações indesejadas. ",
    "3801AADE494D7FFC440720A61F4DE336": "Materiais Altamente Explosivos",
    "E950F999416631A8104F52B22B02052E": "Canhão de Campo Pesado",
    "7B1E2CD54F1AD0EFE056B59A24ED7B0F": "Canhão de Campo Pesado",
    "1080BA904A042F251EA61B928680E5A1": "Transportador Pesado de Infantaria",
    "94DAEF7443BC44A8C0AEC289D9BE6AA8": "Dano cinético alto",
    "E24867C443961776A33E09AB756A87F1": "Dano cinético alto",
    "6C2143B442DC95C3B44CBA84529E8D6B": "Óleo pesado",
    "23B88C0A4A266AA2AFB1F58ED6CCF1D9": "Rifle Pesado",
    "7A0B292E487205F09A713FAB552004F2": "Rifle Pesado",
    "12B07EA44CEEAA75880070896ABC7F44": "Estação de montagem de Tanques Pesados",
    "95865B3E41469F28FE777F87287B69F7": "Uniforme Heavy Topcoat",
    "0049463D43EA65CABE6B5D932462DDF3": "Caminhão de serviço pesado",
    "ACC96D97471EC4ED459C9A992AB13C8C": "Me ajude a construir!",
    "E36F7DEC4480A32785A9F4ABBF7453E4": "Útil",
    "8634B6EF4ADD9D581723A78FBF14A597": "Esconde esse Estoque Privado de outros players.",
    "038892D84F27968BA112D1A00F5953BB": "Altamente Explosivo",
    "217A29504EBD8ACEF16E498C5BA3F9D5": "Explosivo de alta potência",
    "84D7BB05492FD5B7DBFE31B7E34CD0EE": "Explosivo de alta potência",
    "DE69DD724B8F89FAA24A3F9CA62E23BD": "Chance alta de desabilitar o subsistema de esteiras",
    "2C908B5A48AB40D82570EA903501DF60": "Alta chance de penetrar veículos blindados",
    "BF2C15C14740C3AB71FB03B3D9B9DC3C": "Alta probabilidade de penetrar veículos blindados",
    "DF6EEF584BFD5DA2CAF57E8AF4604A9D": "Alta probabilidade de penetrar veículos blindados",
    "A6A35D25419F581F05548BB8BB896C9F": "Alta probabilidade de penetrar veículos blindados.",
    "5DDD26B74D919F2F8E88F8B546717B0B": "Barras de aço de alta qualidade, fortificadas com óleo pesado, necessárias para fabricar veículos e equipamentos avançados.",
    "F6127E66469ECD53E180559ABE2465EA": "Tem maior chance de desabilitar subsistemas de veículos",
    "05113C3540257453624FCDA145453B61": "Revestimento externo altamente resistente usado para proteger embarcações navais contra danos e desgaste.",
    "25B252A547FDC2F0456CDCAED5F52CF2": "Segure essa posição",
    "384D311440713FB3E4E188B57DF2CEA0": "Segurar A Linha",
    "73AE8F2C486724FB3D149DAB8F627017": "Segure mais de 60% de todo o território em algum ponto da guerra",
    "D3C7AC92419EE873FCCB0C95987DDE26": "Conquiste mais de 75% de todo o território em algum ponto da guerra",
    "3F73A30F4289C459C814B38F7A18EFE6": "Casa",
    "9AB609E04DB475C2CC5FAE98AFD42EE3": "Casa",
    "7F3FB6F741260A09733E61A4B849B932": "Guarnição de contra artilharia",
    "11C5C7D9495531D19ED6F0BED7A73D71": "Huber Lariat 120 mm",
    "8462878046431C3E447044A39AC3F726": "Eu preciso de uma carona",
    "2C9571954AF0EC526149B38CB1F3C551": "No Foxhole, a maioria dos ítens, recursos, e equipamentos são compartilhados pelos milhares de jogadores na sua equipe.\r\n\r\nVia de regra, tudo é público. No entanto, para que grandes grupos possam se planejar, algumas estruturas, veículos e equipamentos específicos podem ser temporariamente reservados, o que restringe o acesso de terceiros.\r\n \r\nAtenção! Os bens reservados eventualmente se tornarão públicos novamente.",
    "90629C884E1BC4AD7B1B688D8879CA4F": "Nos seus últimos anos, O'Brien quase morreu em um ataque a um trem militar de passageiros enquanto viajava para Whedon's Row. Em resposta, ele colocou sua equipe para projetar não apenas um vagão de infantaria que oferecesse proteção a qualquer locomotiva, mas uma máquina que apenas a visão dela colocaria pavor em todos os atacantes, exceto os mais determinados. Ou seja, sua blindagem espessa e suas poderosas torretas idênticas. ",
    "6B04D2B44B0ECF5B46F531A9EBD45928": "Para fazer melhor uso de suas trincheiras, você precisará atualizá-las para trincheiras de nível 3 ou “concreto”. \r\n\r\nIsso requer uma betoneira, que primeiro deve ser construída no Pátio de Construção. \r\n\r\nPara melhorar o alcance de visão e velocidade de recarregamento do Bunker, você precisará de motores de produção de energia(não construa na mesma peça, motores de produção de energia reduzem muito a vida de uma peça).\r\n\r\nOs motores de produção de energia requerem bunkers de madeira. \r\n\r\nVocê então deve construir tubos para alimentar com energia estrutura desejada.",
    "00972195402DDCD3343067BE75BBBF22": "Em resposta para a Legião embarcando em ofensivas agressivas ao norte, a Fireband é projetada para conflagrar e erradicar suas guarnições com facilidade. Construída usando o corpo da Widow, a Firebrand é uma pura força da natureza quando junta com uma escolta secundária blindada.",
    "7362FAA74653E5863BF69AA53428206F": "Incendiário",
    "F8B8718A42B8DF489309BBBE75C21732": "Incendiário",
    "A2AD546C48E0C349FF50E190004959B4": "Maior chance de causar vazamentos.",
    "5CA555E84201DBA81236ACA6B2788426": "Dano aumentado contra estruturas",
    "8E9C45DD4A934CD02821ACA922532232": "Bonus de dano contra estruturas",
    "7D6CDD574431DF05CD67D7937C843885": "Tubulação industrial que permite o transporte automático de vários líquidos e combustíveis em uma rede de tubulações que se conectam a diversas estruturas de instalações industriais.",
    "012B35954F5CFCBD99DA58BE0B4DE6FA": "Tubulação industrial que permite o transporte automático de vários líquidos e combustíveis. Estas tubulações especializadas podem ser construídas por cima para se conectar a redes de tubos em áreas com alto tráfego.",
    "8E3D49684068C965DC3796B3488D5075": "Tubulação industrial que permite o transporte automático de vários líquidos e combustíveis. Estas tubulações especializadas podem ser construídas embaixo da terra para se conectar a redes de tubos em áreas com alto tráfego.",
    "0DF4235247A726CC903B14BC17F6C30B": "Indústria",
    "358F097842F9EBA78C231881FA23567B": "Traje de Batalha de Infantaria",
    "907A8F2C40C8D4B207F52AB96C810454": "Vagão de infantaria",
    "5D21D00045492674DCF49CBEFAB1D4C5": "Guarnição de Infantaria",
    "B87D2C6849DA008E12681A94DED93880": "Originalmente uma modificação do rifle Loughcaster em campo de batalha, o Hawthorne é conhecido por seu cano serrado e perfil mais curto do que seu antecessor. Apesar da perda na precisão, a estrutura leve dá ao Hawthorne da maior mobilidade em combate e pode ser carregada junto com uma arma primária mais pesada.",
    "9C4AD1BE4D93664EBFDF3780DFB1AFE1": "Inicialmente destinada a fornecer uma plataforma móvel para armas de campo pesadas, a bateria de foguetes T13 “Deioneus” é um tanquete leve equipado com um lançadores de foguetes de nove canos. Esta bateria exclusiva é configurada para que foguetes incendiários sejam lançados à distância, mantendo alta manobrabilidade entre ataques.",
    "409B904C4F973C80DE39AB9CAB0A923A": "Centro de inteligência",
    "65E7A40F4AFFB93B9A7BB5852FE98F53": "Centro de inteligência",
    "7D43D62949624B5D4E92E3A3A83890AF": "Porta de Tiro interior",
    "713F895344604DCFFC2599B0B08B4F30": "Ferro",
    "544383254C944A19EFE8AA98A6AF2657": "Liga de Ferro",
    "A5674AE743C58EE9F31A0286F4BFA673": "A Liga de Ferro pode ser usada para produzir protótipos de veículos no Centro de Engenharia.",
    "A8496B6F4577208DA9E8939EB017D387": "Ferro pode ser refinado em uma Liga de Ferro na refinaria, essa liga é usada no processo de produção de protótipos de veículos.",
    "018F3B91423A783B639B7FAEC003F268": "Da mesma forma que faz para saltar, aperte \"Espaço\" para escalar uma escada. \r\n\r\nAperte \"W\" ou \"S\" para subir ou descer, respectivamente.",
    "06CE98FD41666C3DB4F9B8B5E3341354": "Torreão",
    "626D70364203D4662E3933A3AE5B600B": "Fique de olho nas suas miras. Quando ela se juntam, a sua chance de acertar o alvo é muito maior. \r\n\r\nCada disparo irá reduzir a estabilidade.\r\n\r\nHá três formas de aumentar a estabilidade. \r\n\r\nPrimeira: não se movendo ao disparar.\r\n\r\nSegunda: agachando-se com ‘C’.\r\n\r\nTerceira: debruçando-se com ‘X’\r\n\r\nDebruçar-se concede a maior estabilidade, mas a sua mobilidade será mínima.\r\n",
    "4DDDB91A4021DCF5988EE6A930E366A5": "Cozinha",
    "CBFCB98C4279503AD9449899EDEECAD8": "Conhecido nas colônias como Rei dos Trilhos, este vagão fortemente blindado foi projetado para proteger e exercer domínio sobre as linhas ferroviárias contestadas, especialmente ao transportar suprimentos para os territórios contestados, bem como ao transportar infantaria com segurança. Esta fera blindada possui um canhão voltado para a frente, bem como canhões laterais pesados.",
    "76224C6D40DE8F1D52AC6AB1FAD7EBE7": "Escada",
    "1101872643C4610FEEA5D28FC5EA44D2": "Escadas",
    "0390DF8543C71F69CAD325A43B34555F": "Lâmpada",
    "4690646349F78B22181DDDB00749F8F1": "APC de Desembarque",
    "9E1DD4F34DCF42E1265060B5E076F9D3": "APC de Desembarque",
    "AD8A7686412CC5E89AA15FAEFCCF4A23": "APC de Desembarque",
    "DBF3935B44F68435BDB1DCBB8B794E56": "APC de Desembarque",
    "80CF1FBE4EC9A8B3F4001090CBA224A2": "Praia de Desembarque",
    "0AB28E3B44E885C1C9DAFC8F1CBFE04C": "Navio de Desembarque",
    "60A888024ADA81D343D7E785AADA93A1": "Estação de Montagem Grande",
    "02F8B69A49495A42BBFD8FBD9F93E3C0": "Guindaste Grande",
    "1BEA91F4468C042AEB44E6B841157B14": "Arma Grande de Campo",
    "E7FD55034602301A5FCCCEBE1FD5219A": "Arma de campo grande",
    "21EBE6CE42874FCD5A99A9B892E6259A": "Guarnição Ampla",
    "04AEECAD4ACEC99C5197C7B72285BA09": "Material Grande",
    "079B4A0D4DF554E5C70BA08E04978795": "Material Grande",
    "0823C51F47F12B89897430A0C241BDEE": "Material Grande",
    "08300A3A4C56ABC74209C5926A9C69C4": "Material Grande",
    "3184D8124074F742A2BFE9954310637D": "Material Grande",
    "584FE16345AEEE289C44119A605B1D79": "Material Grande",
    "5C312B6644ECBBA3F95E1B843DD47E4E": "Material Grande",
    "646A9B7D44D38378C45262B835067A19": "Material Grande",
    "93CC7D704A415162784BB1A275473C54": "Material Grande",
    "942E93CF476CF7108C347C85DE0B6278": "Material Grande",
    "B572A4B544F27B74048E1DB454D567C8": "Material Grande",
    "B9E50A2B4A9D4B03F532ABA0A35138B0": "Material Grande",
    "BA48EFA04D49D7C3A8D976B17EDFFFF6": "Material Grande",
    "CFADC00249B8F9167A1A4B9FB75BB0AE": "Material Grande",
    "D4E792724F704DDEF624C1B827C3A2E2": "Grande Rocha",
    "94882C3A447B8955381A79A240E1CF38": "Fábrica de Munições Grande",
    "8249657A46A3EE8E9CA9A4823F4AD7BA": "Último homem marchando",
    "1C8591114E417E5B060003BF083ABF14": "Latrina",
    "74EDDE43424848E1E23C17AB4EB64866": "Aprenda sobre visibilidade de aliados e inimigos",
    "9E46F1564DBB211AF78473851483F7AB": "Aprenda sobre visibilidade de aliados e inimigos",
    "FB9866074CC43BB3B2CD9E8E05AA91F0": "Leary Shellbore 68 mm",
    "D20EC1ED4E06085C2F0FF99DB9151CAC": "Deixar Regimento",
    "670A03504B08D046AD0E638F8ED6B724": "Deixar esse Regimento",
    "B40B556040FA4F4093FEBAA916E15829": "Engenheiro do lado esquerdo",
    "FFD4D9B642832CFABACDC391D68A34BD": "Os batedores da Legião são enviados para as mais perigosas missões. Seu equipamento é leve, resistente e bem-adaptado para operações estendidas em terreno difícil.",
    "0FB7E02B4E914C5BD561FAA4040C76CD": "Uniforme Legionary Fatigues",
    "651803D243D685B8B874B3A08B3A88EE": "Uniforme Legionary’s Oilcoat",
    "6A11A2CF453E9B42CB16A3A6D70CD5CE": "Liberte uma cidade de logística em território aliado inicial enquanto sua facção tem menos de 35% de todas as cidades",
    "5EDF69BD461F13ABE71564B80B110EA1": "Liberte 20 cidades únicas em território aliado inicial",
    "4DCE50B74EFD9007E0C63EA0F0B90DD8": "Libere 40 cidades únicas em território aliado inicial",
    "C33BD6644BAB32A6DD7B3FA6B2654163": "Liberação",
    "D377C25B4BAA7CC2063E208BD257EAA9": "Fragata Leve",
    "013AFA104C2289826AB5D48CF9187CC1": "Tanque de Infantaria Leve",
    "48EC82B9455992D945AD6FA1BCD07350": "Dano cinético baixo",
    "DEB3F7BF4AAEB54BBEAF81AADE011C24": "Metralhadora Leve",
    "04CC125A442391864552348644139DDC": "Tanque Leve",
    "0B8A430C4177ADCB030D988089650B1B": "Tanque Leve",
    "276EE0EB4F509FDFB7B2C280275641F6": "Tanque Leve",
    "2E06E5194C85864DBE6D4088CD60F9B4": "Tanque Leve",
    "4D91A6614EC93344D7E3E7A5962EC665": "Tanque Leve",
    "CB5ED66A430DE7B766771791DF9F5C85": "Tanque Leve",
    "F689EE6F4FC29F81ADAAADB13398E6E8": "Tanque Leve",
    "A871879F492DCA0E83D8D18C6B8F200A": "Veículo Utilitário Leve",
    "647FC4CD4205FD8BB6C92095D228B54A": "Recipiente de líquido",
    "19652C2E4011FD8284C74F8C1208BC18": "Estação de Transferência de Líquidos",
    "0E0BCD994DBE7FA08EB7F3A6E3D86FF6": "Kit de Escuta",
    "72BFCAE84FD18AE9A6734482B47ED091": "Kit de Escuta",
    "F09918C5426DF9ABAAC458A157554256": "Municiador",
    "29DB96F34F0DB4211E0BAA96C99A19A7": "Trancar para você",
    "EBF48BD949DDBE9AED1F86A38C54D484": "Armários",
    "3CBC2E1C4ACF2344C8E33ABF5261FC58": "Tranque este veículo para que outros jogadores não possam acessá-lo.",
    "C1D0A4E647117A03ECF77FBDD130B108": "Locomotiva",
    "5C66CB85462BCBEC0403D1961A5C3582": "Treinamento de logística",
    "B4BA894F45D24A2F0A6378830AB09308": "Treinamento de logística",
    "EE32052E4F4FDA3E5913AC83AC3CA50C": "Treinamento de logística",
    "39B535BB4CA17D4F0689DABC704ED948": "Treino de Logística - Aperte 'E' para ler os sinais.",
    "3FBA89B045E8BEF3C9BB17B12C69E0B8": "Rifle Longo",
    "BFF29363428BB97E41A98D8C14F2B33C": "Rifle Longo",
    "4DE529804B88FBF076B4AC8FD09149DF": "Vagão de Artilharia de Longo Alcance",
    "DD502CA34C3A8980D2B9ADAC816877AC": "Há muito temidos em alto mar, os navios de guerra da classe Titan são falados em voz baixa e com respeito. Equipado com um vasto arsenal de canhões e artilharia, não demorará muito para que os inimigos do Titã sejam mandados para as profundezas do oceano. A Republic Coastal Legion considera os Titans suas peças centrais e frotas inteiras se reúnem em sua posição. Inspirado na nau capitânia da famosa frota de Ambrose Leon, o Titã é um símbolo de vitória do povo Mesean.",
    "DAA7E763486A04D2A8CC8F8FE9BA0C0C": "Olhe Aqui",
    "402840774A2023C9CDDEBD970E90CF05": "Um protótipo do Wasp Nest foi inicialmente construído por Lyle Rycker como um teste para sua artilharia de foguetes e que, eventualmente, foi adaptada para carros blindados. Capaz de disparar doze foguetes compactos em rápida sucessão, o Wasp Nest imediamente tornou-se um favorito da infantaria Warden durante o período de testes, culminando em um pedido formal para a elaboração de um design oficial.",
    "6A1726BB461EEBB529A3E680FFCD56EC": "Metralhadora",
    "87BCFBA74D68323232ADF4B7558FB7B0": "Guarnição de Metralhadora",
    "5A3631E046C031B8D354ECB975C8A312": "Guarnição de Metralhadora (Nível 1)",
    "5CB174014ACA2C622B96D6B67F7925CC": "Guarnição de Metralhadora (Nível 2)",
    "6BEC07FF448FB9CF98BD24A6A3B1E75D": "Guarnição de Metralhadora (Nível 3)",
    "2ADF25464310AFAC96CECAB3329DA093": "Casamata de Metralhadora",
    "3BCD84BB47BD5DB19865AA8AF93908D2": "Caixa Mágica",
    "AB77783644E9E79C8BBFA98C20F0F7E8": "Controle de Lastro de Central",
    "0C1369294C9CECDCA9A2A9BFF55D8377": "Suprimentos de Manutenção",
    "BE3131BD41E6F6A39447329C32917188": "Túnel de Manutenção",
    "13FF02AA490A8D7FCF87BE88A651CBCA": "Grande Ofensiva",
    "21B75FDD49E8283C5AE14BBAEDBB9872": "Tornar Público",
    "0BAA828B4103D201AAF356891DB432D4": "Tornar Oculto o Estoque Privado",
    "418CBBF34A74487571404EBA8AB243AC": "Fazer estoque privado visível",
    "EBB6FF0340AB4B2D611ED0924892B700": "Certifique-se de estocar a base avançada com Suprimentos de Soldado. \r\n\r\nPara fins de treinamento, você pode encontrá-los nos baús ao lado. \r\n\r\nPode abri-los apertando ‘E’.\r\n\r\nBotão Esquerdo do mouse para pegar um único item, ‘SHIFT+Botão Esquerdo’ para pegar uma pilha.\r\n\r\nO Botão Direito do mouse abre o menu de contexto.\r\n\r\n‘CTRL’ + ‘Botão Esquedo do mouse’ para dividir uma pilha.\r\n\r\n‘ALT’ + ‘Botão Esquerdo do mouse’ para largar o item.\r\n\r\nEstes são os mesmos controles para colocar itens de sua mochila em outra estrutura ou contêiner, algo que deve ser feito com os Suprimentos de Soldado na Base Avançada a frente.",
    "ED64C5C24077B959A3D447A88C243906": "Fábrica de Produção em Massa",
    "68D6C1E748A103D0A695CC863AAD7070": "Palete",
    "82E83E844856E73FD44A93B16E956026": "Estação de Transferência de Materiais",
    "C776334E42EE0B3A70C7BCA08985DD60": "Fábrica de Materiais",
    "AA37CE1F49ACE3544BAE289BA4731877": "Mecha",
    "3C489B0749F6DF4A3056FB95246871B5": "Médico",
    "8AEBE5904E3ED7D827D57DB87FD31B79": "Uniforme Médico",
    "24F8AD7D4FDE265C6AF464A2D54D4711": "Médica",
    "848B7DCE4B91187BAC764B966CEBE50E": "Viga de Metal",
    "A1A86EF042657683CB7010B6656CE2E3": "Prensa de Metal",
    "AD66D050433091A7C8FDB2A1B361A353": "Vigas de metal necessárias para produzir estruturas básicas e veículos nas Instalações.",
    "C9D214BD494A1340BF6ACD90CE2DE718": "Tambores de metal para armazenar vários tipos de combustíveis que podem ser transferidos para dentro e para fora das instalações. Os estoques podem ser públicos ou reservados.",
    "3C412CD74E6A9264E9C0A684751CE311": "Fábrica Metalúrgica",
    "565BE555409EA9717AFF8CB2BE11C4E8": "Vigas de ligas metálicas meticulosamente projetadas, necessárias para montar veículos e equipamentos avançados.",
    "1561FE44404A7191D9DB8A9A975D758C": "Minas de mineração automatizada",
    "EAEB308E4F14046B1EB4B58AE7C44D63": "Monumento",
    "96A4E3A04F3A46900D259D98B7791334": "Parque dos Monumentos",
    "408A4C3846145221877C3E87DDE43CD7": "Morteiro",
    "6B93E3CE46F78BC0E497E5914B37E09A": "Munição de Morteiro",
    "1BAA4FC441A303A5879934A4F1E33F5B": "Uniforme mais comum da infantaria Warden, feito para combate geral na linha de frente, usando armas como rifles e metralhadoras.",
    "D21852374C0B433C37CDD39F6FBB7279": "Centro de modificação de veículos leves",
    "06274E914F174833CFD85E951FE0B9EA": "Lancha",
    "66757AE346443F370CBC3292858E142A": "Lancha",
    "D0643368477BCA32F57B718BC51137DB": "RPG Antitanque Montada",
    "83A1D52A4F7274E908B85686B3C5B5D3": "Rifle antitanque montável",
    "1C90DF354FAD1196EE79099BEE5437DC": "Bonesaw MK.3 Montada",
    "082A52A34CD537E02CA62B8467CC77A4": "Fissura gd.I Montada",
    "7C04A994408BD6FD9775599FC51FA245": "Lançador de Granadas Montado",
    "EF9D8CEA4BF99F4E49F819A4D55F8E45": "Arma de suporte de infantaria montável",
    "063843E94D1CD8E3BD848EA040BDFE32": "Metralhadora montada",
    "A807C2AF486FE054D91DB5A57F180B34": "Metralhadora montada",
    "692C46D74E3DDE237B60668B506FDCFA": "Lançador de RPG Montado",
    "42AABD3147EC975BB10C86A114F8E216": "Nomeado em homenagem às infelizes árvores danificadas no desenvolvimento desta arma altamente destrutiva, o Willow’s Bane utiliza munição inflamável e a dispara em um fluxo concentrado por meio de um potente lança-chamas. Esta chama líquida incendeia novas construções Coloniais enquanto reduz as que já foram tocadas a uma pilha de cinzas.",
    "3D5C5E1F41D2106BED8F53974091D76E": "Nomeada pela aparência não pintada de um protótipo inicial, a Fragata da Classe Blacksteele é uma embarcação altamente manobrável, embora de estatura pequena. A implementação dos Submarinos \"Trident\" pela Republic Coastal Legion levou o Comando Naval Caoivish a responder da mesma forma com o Blacksteele. Projetado como uma escolta caçadora de submarinos, o Blacksteele se destaca em impedir ataques de submarinos contra navios maiores. O principal construtor naval do projeto foi nada menos que o principal protegido de Conor O’Brien, Rory Boyd, que, em seus anos posteriores, tornou-se conhecido como um mestre construtor naval e amplamente reconhecido como o homem por trás da reputação de classe mundial do Comando Naval Caoivish.",
    "9FF93FAD4D5B505F5CA208B8F7FC0A53": "Segmentos Navais",
    "8327AFDA4620DBE34D0567BD323D4A2B": "Revestimento do casco do navio",
    "C7D6417747F4D15585A5A88A21F10EC2": "Componentes de turbinas navais",
    "41EF26954903230764250F868ADB85D0": "Fábrica Marítima",
    "AFE3EC3141AD90EADB4A609EA5ADDAD6": "Cais Naval",
    "831E469040F0CB2CBD98F7BB834AA50C": "Controle de Lastro de Proa",
    "47219DCA444620491F9F2E815C73C5DA": "Transporte Armado Motorizado \"Niska\" Mk. I",
    "AEA3035D40B36D003D17A9AFFD9FE831": "Ninguém para reviver...",
    "EADD53AC4D23AB75789765B76AED58AF": "No.1 “The Liar” submetralhadora",
    "E428C82742147B65A32BE383EDC73ED7": "Esse não é um local válido para escavar",
    "C43A8475409CC002327759AB0441BDC2": "Não é útil",
    "A1AE84AF44F3AA89CE991A934595AE15": "Para não ficar atrás dos seus homólogos, a 2a-1 “Ruptura” está equipado com um canhão de 75 mm. Projetada para ajudar a manter o terreno por períodos mais longos, a “Ruptura” é uma ferramenta forte e eficiente.",
    "D903D1344D34B8A7CA643A9718FDC26E": "Nada se compara com a eficiência e capacidade destrutiva da divisão blindada Colonial. Tripulações de tanques são supridas com macacões e cintas com bolsos para acesso fácil às ferramentas necessárias para manutenção e operação de tanques.",
    "11322B8A4F07DE6381AAE8B7AF73CE2F": "Bunker de Observação (Nivel 2)",
    "9165FDDA453ECB943EB77788C065E4F8": "Bunker de Observação (Nivel 3)",
    "E513F8D94DCFF5A1D572258D1216D2D5": "Bunkers de Observação",
    "F62892A14508665628B6A9BDE279D2BF": "Torre de Observação",
    "BE55BE3542BA5C1156371F94959D0996": "De tempos em tempos, você descobrirá materiais ao minerar recursos, como Ferro e Alumínio.\r\n\r\nEsses recursos podem ser refinados em Ligas, que podem ser enviadas ao Centro de Engenharia nas cidades logísticas para pesquisa de novas armas e veículos.",
    "BE8C7AA34D4A75F9A617118735A9BBF6": "Cidade Ocupada",
    "A492C59241101AFA893911ABE85CD3D4": "Uma das divisões mais ilustres da Legião. Os granadeiros são equipados com mochilas e bolsos especializados para maximizar sua capacidade de transportar explosivos.",
    "D7D101254ED7D335A4B9D29FE885745A": "Ofensiva",
    "EB05984D441EF97815BA78BCBF6886E9": "Uniforme Officer’s Regalia",
    "844B4C914A5CF5D0CE0D59A2DF32210A": "Uniforme Officialis’ Attire",
    "7DC9E23F44237A766B3DB79D7C2C63B8": "Plataforma marítima",
    "222115714A24BD2DB20DEBB15557F2C8": "Plataformas de mar aberto são instalações de extração em águas profundas usadas para extrair diversos materiais. É necessário um fornecimento constante de carvão processado para certas operações, uma vez que a extracção de materiais do fundo do oceano é um processo complexo.",
    "19640F8242B75CD52968AF91F2B06169": "Óleo crú",
    "663CE0194E91F6C0425769AB380A7DD3": "Campo de óleo crú",
    "EE4F6EC04863D4B293FFAB8C17A20AAE": "Refinaria de óleo",
    "2C355BC64C5D5D2FC051CC9C755B0B2F": "Poço de óleo crú",
    "CE9FA4504D244C1F45048597B5A976B0": "Óleo purificado e enriquecido para processos avançados de instalações industriais.",
    "EE12DA2B4EBF3A35C01EFD80EE885B8B": "Além de providenciar proteção, usar coberturas concede um aumento de estabilidade. \r\n\r\nFique de olho no escudo no canto inferior da tela. Quanto mais cobertura você tiver, maior o aumento de estabilidade.\r\n\r\nSe dispararem contra você, o estado Suprimido será alcançado após algum tempo, reduzindo o aumento de estabilidade até anulá-lo.\r\n\r\nSer suprimido sem cobertura irá impactar negativamente a sua estabilidade.\r\n\r\nTeste os diferentes níveis de cobertura na parede à sua frente.",
    "AACD73E5404D68218A243AB39778B5B7": "Quando houver uma Trincheira (ou Bunker) inicial posicionada, novas trincheiras e bunkers irão se posicionar automaticamente a diferentes seções da estruturas posicionada. \r\n\r\nTente posicionar novas trincheiras a diferentes lados da estrutura inicial. \r\n\r\nPara fazer uma trincheira em formato de “T”, rotacione o seu projeto no lado mais extenso da trincheira. \r\n\r\nConecte novos bunkers simplesmente ao posicionar novas seções.\r\n\r\nTrincheiras podem ser estendidas a partir de Bunkers também. \r\n\r\nSegure “Shift” para quebrar a posição automática.\r\n\r\nLinhas de trincheiras separadas podem ser conectadas utilizando um Conector de Trincheiras.",
    "4CCC4E0A4D10CE052A75A8BE15E975A5": "Uma das melhores características de Conor O’Brien foi sua capacidade de modernizar e ao mesmo tempo poder utilizar tecnologias mais antigas em seu projeto. O V.190 Knave é o exemplo perfeito desta capacidade. Equipado com uma antiga torreta modificada lançamento duplo de granadas, o Knave é uma combinação surpreendente de velocidade e subterfúgio que derrota rapidamente o inimigo, deixando-o confuso.",
    "F50DE88D4A5FB04A6031F5B2BB6DAA12": "Uma das locomotivas 0-6-2 de produção em massa mais famosas do mundo, projetada pela Bassett Motor Society, esta locomotiva industrial movida a carvão é confiável e incrivelmente durável. O legado da Black Bolt é incomparável, tendo ajudado a Bassett Motor Society no fornecimento de suprimentos em todo o mundo.",
    "E03783F243DC4FFB8F9D71AFB2F84CB5": "Abrir doca seca",
    "3ED75B5C446190B15FEF75816C5BE9CB": "Abre a doca seca.",
    "37ABEF14452D28933B416FA267B7065A": "Operador",
    "3627FCE942A0EC4348F4D0B0F2E360F8": "Originalmente projetado como um modelo experimental para plataformas futuras e mais sofisticadas, o Jester recebeu esse nome devido à montagem desleixada dos primeiros protótipos montados em chassis de King Spires desmontados. Este veículo incomum pode disparar foguetes especializados a longas distâncias. Seu chassi leve facilita o reposicionamento, mas o torna vulnerável a sabotagem.",
    "DE0F057C4EC283B2D701F0A0C673783C": "Originalmente projetado em resposta ao aumento de enxames de blindagens Meseanas, o Outlaw é um tanque médio excepcionalmente capaz armado com uma torre 40mm de longo alcance e inclui uma Storm Rifle integrada em posição de suporte.",
    "82DCBA4C4DA4BAEA6ABDE78DBFDF1A92": "Sem Plasma",
    "858246904EA9CB58D46AE1B303D3FE6C": "Uniforme Outrider’s Mantle",
    "B1009FD94E96F33A56106C8F696CAB9E": "Granada de fumaça PT-815",
    "A46EC4D2431C5B04200D19B3E5C87D5B": "Empacotar",
    "4694E54448F16D33A72F769C96940628": "Empacotar",
    "7336A0D849EE71D00D2444887982DC53": "Empacotar Equipamento da Área de Carga",
    "1AD811F8444E4C52150284A7A93E3755": "Empacota o transportável para que possa ser movido por certos veículos.",
    "03936AFA4F1D5152A03D6E81539B7A70": "Empacote o transportável para que o mesmo possa ser movido por certos veículos. Isso só é possível quando esta estrutura é acessada de um Guindaste que possua equipamento posicionado na área de carregamento.",
    "27A7676F4E6A3EBDDAED359E5E673784": "Empacota isso para transporte.",
    "E3AABA6F423A53A9336B29ABE7ECA304": "Unforme Padded Boiler Suit",
    "75EE3E7E457290010840959DB6403915": "Despensa de Alimentos",
    "41A1785D4CCADD24D847ABB5CE523DF2": "Passageiro",
    "90CBF9434D8C90F0DEC11B80AD7A99AD": "Passageiro",
    "5369E1A84F6B26908AA4A894CBD8E09A": "Motocicleta de patrulha",
    "01EFAF3D45DFE2603CAC7097851E6363": "Munição utilizada para artilharia pesada.",
    "B3E7F92F4F9B498D3E427685B143EBCC": "Munição utilizada para artilharia leve.",
    "EA9A9C904D8E35E69F1CCF8E2D27F2F0": "Operador de Periscópio",
    "0C739E1D4A83CEC5E85186A6C1AD7155": "Permite o acesso a este Bunker a partir do telhado.",
    "12478EAB4CE62A389910328226C940E2": "Planta petroquímica",
    "3D321D484BE5C1D46A7248B3F9546D6C": "Petróleo",
    "D2B4D0444D59F5D54F0AAF9A1FF441F8": "Usina elétrica movida a petróleo",
    "EB2352AE478EED61B230ACB7EEC07D06": "Médicos no exército Warden são incomparáveis e esse uniforme que possui inúmeros bolsos projetados para carregamento e uso de equipamento de primeiros-socorros com facilidade.",
    "3DF6455A4B74CC03B5EB3ABF3A7EA2BC": "Uniforme Médico Physician’s Jacket",
    "B36C1FF2420C91471FFE51992BB778AA": "Cano",
    "DC78D5364E0679EFE74112BA075B833A": "Bomba de Água Encanada",
    "3BE043F04A70D573ADCFAFA52E535D4B": "Canos",
    "C34C8BF84C3A03BC0F712DAD1A51FD7C": "Canos (estrutura alta)",
    "9C33490D44084C0CE861649F1A8B5E55": "Canos (subterrâneo)",
    "1E0788EE4A2F52EE7ED3EF8EF6DC9EF7": "Válvula de Canos",
    "45CC94BA4824B0C1EA8CA38819F0F8C1": "Canos",
    "60FC918C46B8F7409445CA8651E887D0": "Canos",
    "6C68927A481C931248CD8CA686610C7C": "Canos",
    "FFD26F834BF5B6DE894D908993CFF4F1": "Canos",
    "4C6E8FFF47D1AE69B6602EBC79E32955": "Pistola",
    "8D014C60464731904E7CD08ECDCC98E6": "Pistola",
    "D920E07C43955C026355E1960D6AD9EF": "Pistola",
    "254731D94200A388888EF6ACB0519A53": "Por favor, selecione todos os atores presentes na cena",
    "8D9EF6C54313E003A2525CA1B9B813E9": "Por favor selecione o spherereflectioncapture na cena",
    "BFB6CA2C407C9265D039A893D3B5CE1B": "Gás tóxico",
    "6AC6CB4645972A3EB08D62857CF7C4D4": "Linha de energia",
    "379622544742EF557AD1F0A96130CE84": "Poste de Eletricidade",
    "4D50B52B48B956C73491CF967D25CFA7": "Estação de Energia",
    "FC75427A4FF4A66AAC70D68BAA62202B": "Interruptor de energia",
    "80A8775D432A25ABB71DCEB4F685B149": "Energia, Tubulações e Concreto.",
    "4B255F8543C9C3F3EAA4B4822EEB75AE": "Alimentado pelo motor leve Grouper da Basset Motor Society, este simples barco de madeira é ideal para o transporte de pequenos grupos de infantaria.",
    "8510E6D94D838BE28E709BB15EE2D8CF": "Pressione 'E' para Ler.",
    "BD7656634952E8147D8D62AB4032FF47": "Pressione “B” enquanto segura o martelo para abrir o menu de construção. \r\n\r\nApós selecionar uma estrutura, um projeto aparecerá no cursor do mouse. \r\n\r\nMantenha pressionado o “botão direito do mouse” enquanto move o mouse para girar o projeto e então clique no “botão esquerdo do mouse” para posicionar o projeto. \r\n\r\nUma vez colocado, use o “botão esquerdo do mouse” e o martelo para colocar os materiais até que a estrutura esteja completa. \r\n\r\nTente construir uma torre de vigia no chão à sua frente. \r\n\r\nVários soldados (3) podem colaborar para construir qualquer projeto. \r\n\r\nAlgumas superfícies, como cascalho ou areia atrás de você, podem não ser adequadas para construção.",
    "666BA3394B49F1F45D0C8D99DEB50E60": "Aperte ‘Q’ para entrar em veículos. \r\n\r\nVocê precisa estar ao lado do assento que irá utilizar. \r\n\r\nDentro do veículo você pode mudar de assentos pressionando ‘ctrl’ + ‘1’ ‘2’ ‘3’ etc. A troca de assentos não funciona para todos os assentos em alguns veículos. ",
    "60427A5F4BC426CEE371C688D55522BB": "Segure ‘Shift’ para correr. \r\n\r\nSe você se perder, aperte ‘M’ para abrir o mapa. Com o mapa aberto, você pode dar zoom com a roda do mouse, clique e segure para mover o mapa.",
    "836DAAAF4B7BA5693722999E2AED16D5": "Aperte \"Espaço\" para saltar sobre obstáculos ou coberturas baixas, como sacos de areia ou cercas.",
    "9F5B16B3459DAF29AFAE5B91F6C242EB": "Evita a deterioração de estruturas próximas quando fornecido.",
    "77F811F14E7B168F64825D85B52CB85C": "Materiais de Construção Processados",
    "E3AAFF5E4CA5596CACB8C08647348BD4": "Processamento que refina carvão em óleo crú.",
    "B3F8474B4C8254DD9CA773BFDA513167": "Produz munições de grande calibre para uso com tanques e artilharia.",
    "41F71601424CF96B828D7A9D47E8E040": "Produz vários tipos munição para veículos e estruturas.",
    "2DCB8DDB48017DEAD95A5A937A75BE41": "Produz várias modalidades de armas para tripé.",
    "6E5DDF09409408E832AF3CBB62442397": "Protege contra gás venenoso",
    "3CAB8CCE4CE4EBDF9DE04588423DD05C": "Protótipo",
    "233714384EF32F65D260B4BB2B75F80E": "Partes de protótipo para produzir novos equipamentos.",
    "863E62E54DCD9AE449D147BE06F9B7BA": "Disponibiliza um ponto de agrupamento para forças aliadas. Permite que soldados nasçam diretamente nesta base a partir da Região Inicial.",
    "1F61B0004D61359DE18DEDA955506DEF": "Fornece cobertura contra inimigos que possam ter entrado neste Bunker",
    "5F8D8E0D4B9700A47014F98555B0438E": "Fornece cobertura contra inimigos que tenham entrado neste Bunker",
    "D55060854349797457E63CAC4B5266B3": "Fornece cobertura contra inimigos que tenham entrado neste Bunker",
    "9CFA53A04AAB8F7D59D78A9065DF03E9": "Fornece acesso fácil para dentro e fora desta trincheira.",
    "287E6E724D49CDDF62A27B893324AA9C": "Fornece acesso ao interior do Bunker.",
    "8B10170E4F33E86CBECDA687A7A67154": "Fornece acesso a este Bunker.",
    "F64922064BB5F5EE7E927C88240BBD0B": "Fornece acesso ao interior deste Bunker.",
    "0F5FC8624CF5095689907C94D93D30F4": "Fornece energia das salas de máquinas para aprimoramentos do Bunker.",
    "A201D9AE4EEE90021F37DE9410D12C54": "Fornece energia das salas de máquinas para aprimoramentos do Bunker.",
    "A66304F4432FEF55EB504DB62752CA1B": "Fornece energia das salas de máquinas para aprimoramentos do Bunker.",
    "E29FCE7848ADF3D460455B827EC3CDC2": "Fornece energia das salas de máquinas para aprimoramentos do Bunker.",
    "8F45600C4A6DE4B169381380331AB9A1": "Guarnição Provisória",
    "A0CF09784A6FDF3703E0238FA6E5941B": "Estrada Improvisada",
    "77A87BFB4656E13D28430D80699938EB": "Bombeia água por meio de canos. Deve ser construído em na água.",
    "682A410049D9A602187B0F9C45E31028": "Acostumados com o clima temperado do Sul, os Colonials vestem essa jaqueta impermeável, combinadas de um par de botas grossas para trabalhar com eficiência até mesmo nas piores tempestades.",
    "CEEA736D4F63F93274F9F4B5652026DF": "Ambulância R-12 - “Salus”",
    "1FBCBCA34E539F85603E14976D9E0576": "R-12b - “Salva” Caminhão de Bombeiros",
    "A17DBC954D8472EB87663DBD963001C9": "Granada Lançada por Foguete",
    "A02D90114437558DB0FFC2B1D0CD65C9": "RR-3 \"Stolon\" caminhão tanque.",
    "7882040A4E9DD011B5595396C7678DB9": "Rádio",
    "203F155C462839AE5CE288857F52D683": "Mochila de Rádio",
    "11B5651547E72A8A3D82DCAB82416054": "Estação de Rádio",
    "55525820404120F931A25FB3ED589AB7": "Estação de Rádio",
    "58AEFCE54F8E98F2E6AA65AB7604DF4C": "Linha Férrea",
    "35E8903B4FEE62FC2F42A8A286BE2253": "Linha Férrea (Curva)",
    "4413370E406D5CD49703D48F1A25C186": "Linha Férrea (Curva em S)",
    "90CE9F4447D926485D79C3B74325CC63": "Ferrovia (Fundação)",
    "CB9BFB744A8A0E2CCA37BF89725F19B4": "Ferrovia (Fundação)",
    "F86480E64BFE40A6C69628B0D1C4584C": "Tempestade",
    "B624938C40D0C8908A11598A62E21641": "Ligas Raras",
    "D09BE2244DF9D9BE4934C29DE427E2A6": "Metal Raro",
    "24E8024C42E83507ACBC9D966442C164": "Ler a placa",
    "61469E5549BF60D9BE0C0687A36E0B03": "Ler a placa",
    "89379DD942E913A7636BA3B45E7F1D2A": "Ler a placa",
    "B1367643468F5BD3334E01A278B08341": "Ler a placa",
    "8D0FCD114391BFE66FBBDE8CC22E34C7": "Rebelião",
    "48EDBB7147EB5FE9076D49988AAFA9EB": "Recebe atualizações de inteligência no mapa",
    "B53C95C64C4ACBD9FD9547AED07D8C8D": "Camuflagem de Reconhecimento",
    "B9290DB845F7BA537FFC7E85AFAF68F5": "Reciclador",
    "7B14805B4515430A6FC8B4B9CA1871A9": "Dano reduzido contra trincheiras",
    "9B9CF76243BAC0B3EC597EBC7EB330CF": "Dano reduzido contra trincheiras",
    "C0D4E8084AE9E5A1C4A490A4D7D4A42F": "O Carvão Refinado é necessário para vários processos de Instalações Industriais.",
    "964344C74C8342461DA2C8B341121701": "Materiais Refinados",
    "7C5055A34306F42B649CF29F6C0292A8": "Barras de metal refinadas necessárias para produzir estruturas e veículos avançados nas Instalações.",
    "BD756A6244CDA9F2EE9D38B4E428F2D8": "Refinaria",
    "D2170AA740CF4177019D7598C7BAE7B7": "Refinaria",
    "C5DD20C1472BECA1CABBAFBF2E87465B": "Reestruturador",
    "5EEE3A3B4EC1A7ED5D703F9FE5BAFAE3": "Renovar Reservas",
    "3B89366345C4FA458F38C59488BAAC90": "Reiniciar tempo até a perda dos estoques",
    "E2B48E9546C1B2B9D362A2B83DBC9B22": "Renova a reserva existente para esta estrutura. Também renova Bunkers e Instalações conectadas.\r\n\r\n<RichText.Regular12.Orange>Disponível para qualquer membro do Esquadrão para o qual este Bunker está reservado.</>",
    "8595AB4F4B9D205B7C8ECEBAC4DA4380": "Link do Regimento",
    "F00954E5483B0E6983A01A94535E1055": "Reforça os muros de fora da estrutura, prevenindo todo o dano até um limite a não ser que os suportes críticos da estrutura forem atingidos.",
    "BA34A1504540E1C723EB278332599B0A": "Liberar Estoque Privado",
    "9939E62745B383B1EAE8F88AE69B05CF": "Libera o seu equipamento para o estoque público.",
    "26AE3CA94C1D9C8B101C4DA0B27B9542": "Tanque de Assalto Relíquia",
    "3DFA137548BC3989A80FA1BE5C874960": "Base Relíquia",
    "BC080A664D772FF047FB29ABFC533C59": "Materiais Relíquia",
    "C6EB4A374C74BC8F9E47388F83F7BDBB": "Remover Reserva",
    "EF2885BD4BEA3FB4B63BB5A371B647F2": "Remove todos os membros e dissolve este Regimento permanentemente. AVISO: Esta operação não pode ser desfeita.",
    "A3E7A1B94A9A46FBF3AACFA70276323F": "Remove o armamento atual montado no tripé do veículo.",
    "538987FB41DB7DA27AE04A86EB001B65": "Consertar",
    "A00E5DE6442055A1DBEE2CB17FF2BBBC": "Informa sobre a movimentação de inimigos próximos aos jogadores com Rádios equipados",
    "0CA94AFC4D90B50CC3635F912B396CDB": "Caminhão Reaproveitado",
    "14734E1441AD3F2D3F5736B465F0B518": "Armadura reaproveitada de guerras antigas, essas placas de blindagem são altamente eficazes em absorver projéteis de armas pequenas. Esse aumento na proteção resulta no aumento do peso, o usuário estará bem pesado e com pouco inventário em seu uniforme. ",
    "564E30B04DD216CDF4637782A446A0E1": "Necessário para detonar Havoc Charges. A Havoc Charge deve ser armada antes que o detonador possa ser armado em cima.",
    "AF1B7A034F1EAD11DEEF83A57F596B1F": "Sistema de reserva",
    "9B77C6FB4FD38E4223DF3896281B11EE": "Reservar para o esquadrão vigente",
    "DF6832A44E1855CECD701B93FDFB5726": "Reservar para o esquadrão atual",
    "375D7CD84DBF0AF587ADD1A480E2F311": "Reservar para o esquadrão",
    "FA295505471D354F4C279F8C77046DE7": "Reservar para o esquadrão",
    "B15400FD4480235C31383C88F57298D9": "Reservar vários",
    "A9FA41214C4940AA99B96D8C4C6841B2": "Reinicia o tempo para a perda de todos os estoques aos quais você tem acesso.",
    "6D103E044CC5EA36B2862FAF0EBF6DBE": "Caixa de recursos",
    "645260194768CFE6B510E38EA6DEC620": "Contêiner de recursos",
    "5E22DF22438E32BA5D1B28A564E722F3": "Treinamento de recursos",
    "AA79F755487A6E61B35B1BA49AE433EF": "Treinamento de Recursos",
    "6147E0B3480979F73A3F85B922D685DD": "Estação de transferência de recursos",
    "0C4533A44DFA9CC271010CA96A95F9D1": "Recurso usado para a construção de ruas e fundações.",
    "D506B5FD47C0B9A3B5D9C5B8361DE488": "Recurso usado para construção de estruturas avançadas e produção de itens especiais.",
    "63DAF590439D5D73B0C4C9B1B4F8CF43": "Recurso usado para construção de estruturas básicas e produção de diversos itens.",
    "A504F8984C562CEC686E90B9263BB755": "Recurso utilizado na produção de armas altamente explosivas.",
    "C19CCA2F41FDEFFC10683A890F0115FA": "Recurso utilizado na produção de armas altamente explosivas.",
    "1A74322C4B604CD5CC9082A7A329AA10": "Recursos são usados para fabricar tudo, de munição até suplimentos médicos e tanques.\r\n\r\nEquipe seu Martelo e use ‘LMB’ em pilhas de sucata. Colheitadeiras podem também ser usadas para angariar recursos. Componentes e Enxofre precisam de uma Marreta para serem coletados, uma foi providenciada na Caixa de Armazenamento próxima.\r\n\r\nCada item requer diferente materiais para sua fabricação, mas antes devem ser refinados.\r\n\r\nTente coletar alguns materiais —quais podem ser encontrados logo a frente— e carregá-los em um dos caminhões providenciados, então traga-os para a refinaria ao seu lado.\r\n\r\nVocê encontrará também uma fábrica onde poderá utilizar de seus recém-adquiridos materiais refinados.",
    "ADEADD7841513BA9D876B987D8873E52": "Recursos também podem ser adquiridos por meio de mineração.\r\n\r\nMinas requerem combustível para operar e irão gerar recursos automaticamente ao longo do tempo. \r\n\r\nO tipo de combustível usado determina a eficiência da mina. \r\n\r\nPara propósitos didáticos, fornecemos combustível na Caixa de Armazenamento próxima. \r\n\r\nPara mais informações, clique no ícone ‘?’ no canto do menu da Mina. ",
    "9DD10CBE4FB59CF1842847B34A87F181": "Retorne o nível da água ao normal e pare de reparar.",
    "2234EB4E4BD90C64BCF4D4BD5CA1091D": "Revivendo...",
    "AF001371424A286E942DCC860760278C": "Guarnição de Rifle (Nível 1)",
    "075868EB4E94FD51FD380F8C381DBD37": "Guarnição de Rifle (Nível 2)",
    "42EEA7854D28A34A1AF60E82A560C939": "Guarnição de Rifle (Nível 3)",
    "D96BE66A4A0B3DCBD89C599748F59F5B": "Casamata de Rifle",
    "60EE65154F4BCE6F74E6D6B493A64D58": "Semiautomático",
    "57A3EEA141E63793C7F426B00A53BF42": "Engenheiro do lado direito",
    "B585C67849600DA80772ACB071952CFB": "Oficina de baterias de foguete",
    "C4080A27459B901F3D243EB3FA8099EE": "Marco Zero do Foguete",
    "861B180244AD7046A21D6DB790C5F8D3": "Fábrica de Foguetes",
    "8A45620B4F96D41204955FB73AA2C3FA": "Alvo do Foguete A0E-9",
    "08151D0642DC1E8836613682BB961F4F": "Casa Fortificada",
    "39EA8D5F433B7A38700E7BB3C46862A5": "Casa Fortificada",
    "3CEAF83648F676DB8CB431B02451461E": "Casa Fortificada",
    "404334B8403C9E3A2287C1B00F64170C": "Controle de Lastro de Popa",
    "988F4FAA476CA69FC27EFD9FB02DC6A7": "Sucata",
    "94EA0585470D4FC455D802A36F5B4DA4": "Campo de Sucata",
    "9A3374E243514176D6E8C89DE671639B": "Mina de Sucata",
    "FFF91C3540533ECCF2D46EA90D1100F6": "Sucata pode ser reciclada em outros recursos na Refinaria",
    "E6DCD38B491324D8D006BA970DC00C70": "Saco de Areia",
    "442E5D434410A70B0829D39B1B23BA32": "Cobertura de Saco de Areia",
    "3277B2694BA3B6C9005989849F22FAC6": "Parede de Saco de Areia",
    "1F8EF85844956D33889CD2A8CCA6F273": "Sacos de Areia",
    "48B66EE041A2F7B1E8D9E4911C544F41": "Sacos de Areia",
    "37B739C040326A295FBAD29A69980A24": "Caixa de Areia",
    "66B0E0E4463094D80CF8E18B6331D5B4": "Uniforme Sapper Gear",
    "085EFC314A5ED7E6AE5689B0618A8C76": "Dispersar",
    "0B3D2EA049369C0D3FD8F396D7B613F1": "Tanque de Reconhecimento",
    "F07C33B944902581150548A9AAF7F565": "Tanque de Reconhecimento",
    "FC650B6C4EF1535986D761B04AAF89FD": "Mina Naval",
    "68D59DCE485CB775AEE12EB44299E838": "Porto",
    "FF73F38B42484E3E1D06C496753F7A0E": "Operador de Sonar",
    "DFE2613E4B8ABE897743AEAC4ED2EA6F": "Servindo como linha de frente da Republic Coastal Legion, os Conquerors há muito fazem jus ao seu nome. Estes navios estão equipados com um arsenal completo para lidar com ameaças, tanto na superfície como em profundidade, incluindo uma estação sonar especializada e lançadores de cargas de profundidade. Uma jovem intrigante, Diana Geminus, foi a primeira a comandar um Conqueror depois de subir rapidamente na hierarquia graças às suas novas ideias de defesa contra as tentativas deploráveis de ataque ​​dos nortistas.",
    "06DBF90B4DD3240C1C40098DB1CFE015": "Marcando o seu ponto de renascimento",
    "4F3E821E4FDA318CF08B058FD386F55C": "Vigas de aço moldadas necessárias para os processos mais avançados nas instalações industriais.",
    "B73B1D4D43DA9CB8DB0136BC11344A66": "Prateleira para guardar rações, suprimentos e ferramentas do dia a dia.",
    "AC70734C44CA3C54CA0560A8605501EA": "Transportável",
    "02A51A4F4CB0A44DEB11619062590179": "Contêiner de Transporte",
    "D058A4D446C86625165A51A257F46A11": "Estaleiro",
    "9D09A3A146AC3E155096D1A43D1F9208": "Estande de Tiro",
    "2971556A4BEFC6D9106968A2C42A10EE": "Espingarda",
    "2DF761024848E3380A5A1186CE4EE625": "Pá",
    "A923DB774DBB0E5B5AA872A38AE17DD4": "Estilhaço",
    "82BF8D5B4E37F6DCABA5029156BC176F": "Projétil Estilhaçante de Morteiro",
    "A13110FE4D0F08DE3EE819A4ED437CE1": "Tanque de Cerco",
    "A197F0D64ADFF54553133EA38D4B2F89": "Tanque de Cerco",
    "5A701006423EBFF956AC69A033696A12": "Placa",
    "FE03995B40473603D6AAC885C356B6D3": "Pedra da alma assustadora",
    "75BDCECF46934EAD9C0FF688FBA4A48E": "Marreta",
    "01DACD804657A304B84552B0D7952670": "Desacelera infantaria inimiga tentando invadir esta Trincheira.",
    "E896C1614A3C0A02B95E33A55EE0E5DB": "Desacelera infantaria inimiga tentando invadir esta Trincheira.",
    "4FB16CB541D9FCA9974A1196EA097D00": "Estação de Montagem Pequena",
    "D72085A44C5EEA57347568B340632DAD": "Vagão contêiner pequeno",
    "53787B52481BBFEF3FDCD2BD7563602F": "Vagão Plataforma Pequeno",
    "4B3C13F94BE2C8B3746692A339A67DC2": "Guarnição Constante",
    "B0E0E1AA475B9C9CB80F739E843DF3AB": "Trilho de bitola estreita",
    "AB54351A4B0E35D06E641984B743B607": "Trilho de de bitola estreita (Arco duplo)",
    "0FF966ED4A82F7C75C3F3EAE4F88F3E7": "Trilho de trem de bitola estreita (Fundação)",
    "781A583A4DC82C26C74B0ABB7841568C": "Vagão de Contêiner Líquido Pequeno",
    "96AB0C5C45F9E3D456FDAEABD0AF8C1C": "Locomotiva de bitola estreita",
    "BEC08E1949B113CF432AFC95233EE8A4": "Fumaça",
    "F8B8865A4EFE412330226CB108B39DA0": "Granada de fumaça",
    "EFD138C94F4E6ACA0BAC20BABB58DDAA": "Encaixe de Trincheiras",
    "3CA9E44E45250E66DCB89899E144276A": "Rifle de precisão",
    "8F512E2141E3F183CF5C5A9BFE1AE20D": "Rifle de precisão",
    "08A2A0654E9646ADF476A3987B409B4A": "Nevasca",
    "355D8D104EF58C36507C4DB1BC7EE9C0": "Camisas",
    "793748BA4CC8F2C2CB1751837CB12EF0": "Camisas",
    "CC8548A448DFF546A96E309678841337": "Mochila do Soldado",
    "2B8B7F1148548A936E6B2F94A562E096": "Alguns veículos possuem armamentos que podem ser usados junto ao seu time para causar o caos entre seus oponentes.\r\n\r\nComo artilheiro você deve ter munição em seu inventário para recarregar com ‘R’. Tente usar um Carro Blindado com um parceiro para se familiarizar com a posição de artilheiro.\r\n\r\nCada veículo no Foxhole tem diferente funções. Se você não tem certeza como algo funciona, não tenha medo de perguntar.  ",
    "43C9867E4E3B5B3D6E3588AC743681DD": "Operações Especiais",
    "70003FDD4D67F7F978E61A9C5D8871AE": "Recursos Especiais",
    "7F9002FE42143E7E4F63B0828656DC2E": "Uniforme Specialist’s Overcoat",
    "8CFFFD224396FD43CB02DB8F031218C5": "Chapas metálicas especializadas forjadas com carvão, necessárias para montar veículos e equipamentos avançados.",
    "D56912E64A1A127922EAFDB69FD686BE": "Barras metálicas especializadas fortificadas com derivados de petróleo necessários para fabricar veículos e equipamentos avançados.",
    "17C2335C49DB89EA0BD85A810EFEA909": "Estabilidade",
    "2858B95D477BE3616909268BA1A0170D": "Carro de Oficial",
    "C34A2FB94857EC9D681AF892CC709B74": "Carro de Oficial",
    "4C1C4A0B4F1B09604DBDF8A0A404000A": "Escadas",
    "A4220DDE4849335CD5B4C7A5F1EA43DB": "Escadas",
    "051641854BE178DDD204AF91A4B95291": "Escadas que se conectam a passarelas elevadas, onde criam caminhos acima de Instalações complexas.",
    "9BBCA83C49AFD1EB1B2556AAF6B16DF6": "Posições",
    "54D2DAEE4700528786FFA19DF1B7A4C1": "Munição padrão para Metralhadoras de Campo.",
    "4A3D5405439242282D540AA77E2D234A": "Munição padrão para Espingardas.",
    "4AFE485746BDCB89EF2A16AE5CECF883": "Munição padrão para Storm Rifles e Carros Blindados.",
    "BD8270B74380C56E45276E9E7E8F9426": "Munição padrão para rifles antitanque.",
    "D31A1FF745293A203BE77DA22EEBB595": "Munição padrão para metralhadoras.",
    "2C5595CA46B3170887D872B2F2F54571": "Munição padrão para pistolas.",
    "A9DA31444CE32A93710583973166EF10": "Munição padrão para revólveres.",
    "3ABC7EBC4B512555E3DBA8AD24347CCF": "Munição padrão para rifles.",
    "A1C5E9754C9F75533D68528B2E243B88": "Munição padrão para rifles de precisão.",
    "7158D09B4ED91F7E9216D89DAB7C0269": "Munição padrão para submetralhadoras.",
    "D1548AD64E2FFE72656849ADCB43AFEB": "Foguete de calibre padrão com uma ogiva altamente explosiva. Chance de colocar em chamas construções próximos ao impacto.",
    "1DE572914DDA8E281BACD9915438413E": "Foguete de calibre padrão com uma explosão incendiária. Vai colocar em chamas objetos próximos ao impacto.",
    "AD9FC2BE4173A0DB094CFCBE92D33101": "Cartucho explosivo padrão usado por certos pequenos veículos e armas de infantaria.",
    "0CB0AF234F9F31685BA8ADAC7E4D0B24": "Uma pistola Warden de modelo padrão. Projetada por um armeiro de Nevish, o Ahti Model 2 é uma arma secundária confiável que qualquer soldado deve se sentir orgulhoso de carregar.",
    "9A6DA0AE460C590A50180B94CCA2E10D": "Uniforme de padrão para soldados da Legião Colonial, projetado para combate geral na linha de frente.",
    "B2358CD049AFFE980ED73C82A6BCE85F": "Munição padrão para Tanques de Batalha.",
    "9B3A3BC74C32D661B1C839BD38B1B105": "Munição padrão para canhões pequenos.",
    "F0DC8DD047EDA70763142A87D753AF81": "Munição padrão usada em Storm Cannons.",
    "CBF9459943B64C6C8E11D4AA292255D0": "Munição padrão para armas antitanque.",
    "F1CB945245AA1CEFC60420A168B3E5CE": "Rifle padrão Warden. Esta arma de ação de ferrolho é tão robusta e confiavel que tem sido usada no campo de batalha por mais de um século.",
    "533D7D4245ED3B754C6389B8AD37C383": "Guindaste Estacionário",
    "0B79039143E31337A3FE37B7C9CCB277": "Colhedora estacionária (Carvão)",
    "3193D7AD409492DA9D7E549048AC026A": "Colheitadeira Estacionária (Componentes)",
    "0866E2E4410561ACD0173EADA388F07C": "Colhedora estacionária (Sucata)",
    "49F6320A42E76498200CDA99A782CABD": "Colhedora estacionária (Enxofre)",
    "899CCE394D1CD3C5FA6F6CABEBD9B621": "Materiais de construção em aço",
    "8B527792437A4243830FC29706A49A8D": "Parar reabastecimento.",
    "D2BA20A445410CFFC9C78B9F85ED8A31": "Baú",
    "6DB4ABFC45B8FCD7F96B8BBEDA844760": "Depósito",
    "9900BC104072715445127597CB3B16B7": "Depósito",
    "0B894BCC45D5553B2373019737947734": "Deposito de munição (Nível 2)",
    "903CBC5C4DB8775BEA393C85D1047486": "Deposito de munição (Nível 3)",
    "D51F160B4175A8C18D3098A35D5F41EC": "Navio de transporte",
    "7AC7D1C84ECA532598277C84B7B969EE": "Fuzil de Assalto S",
    "8366FD1F48B499D05AEA7A980A5104BB": "Tanque relíquia modelo: Storm Tank",
    "57052C6B49A9A576E8768DA30903B338": "Mapa estratégico",
    "D88C1B644C2C0C27B896F980A1374438": "Caixa de Estrutura",
    "319613AA4E24F741FCCF55B58D253EAA": "Armazenamento da Estrutura",
    "4711DC3C4C3D4580A5178F821520E25C": "Submetralhadora",
    "5BC0657242005B5F40FA339C5A8E2A90": "Submetralhadora",
    "6BFED03041F24203C2028796FEE87FC1": "Submetralhadora",
    "6DDC1F844EEDA819493F1FBE83430404": "Submetralhadora",
    "0B4B70F64D4072C42D87F190721BFC7B": "Submarino",
    "CE7236AB46FB868883B90582D70DF74F": "Submarino",
    "BD9BF6F94FA2065AC528F6B9C859F0CA": "Entregar objeto grande",
    "2C5AFB1D4F92381ED13DD6ABC59E3BF4": "Depositar Equipamento da Área de Carga",
    "B07DBC4C4BE06930EA53C480A2EBC43E": "Enviar soldado gravemente ferido",
    "EA1D54C04DA274D8BD5C118DF3850282": "Depositar Kit Inicial",
    "0201D35240A1D38F7B6B889B754BB27F": "Enviar Itens para o Estoque",
    "D64EF3BC44CE2FABAA4ECBB8EAF5B822": "Depositar Veículo",
    "854D88434F54C8F105B699913FE7744A": "Submeta um Soldado Criticamente Ferido do inventário desta estrutura para este Hospital como um paciente. Pacientes só podem ser submetidos se uma houver uma cama disponível.",
    "C4EB8C984A19BD1DD490CCAF9220B5C6": "Deposita equipamento da área de carregamento desta estrutura para o estoque. Isso é apenas disponível quando esta estrutura é acessado de um Guindaste que tenha implantado equipamento na área de carregamento.",
    "0146D004490AC3150D0A4A9F23D6F35F": "Envia itens do inventário da estrutura para este Estoque.",
    "A97B377D4D65B419A582BEBD7D8EE8AA": "Deposita os itens que estão no inventário do jogador após renascer.",
    "68876C9049BF21CDAA575DA9766993FC": "Deposita o veículo que você está dirigindo no momento. O veículo não pode ter passageiros além do motorista e deve ter o inventário vazio.",
    "751850F4463C0223822544A4F3918231": "Deposita o item grande que está sendo carregado.",
    "F546B4DD4883E4AF4C7FF59D6533F5AD": "Enxofre",
    "7F451D4442D7EE1241C7E49D1CD718EA": "Campo de Enxofre",
    "820AE531463912B16EAE5F976C2FC0DA": "Mina de Enxofre",
    "80B758FE4E346EE2AC991085E2A8AE76": "Enxofre que pode ser refinado em Materiais Explosivos Pesados em uma Refinaria",
    "FDF2D3094624CFB09EED95B3A0AEB9CA": "Barras metálicas enriquecidas com enxofre, necessárias para a montagem de veículos e equipamentos avançados.",
    "86C830CF475A1F7961779CBE4F8D8022": "Reator Sulfúrico",
    "8E2344B74E1F94020521D28B189DF9A8": "Super Tanque",
    "E67DC6294A30B98591EF8A9E28C95864": "Super Tanque",
    "26BE69E14476BAC566418FAEF5981A0E": "Suprimentos para manter estruturas. Deposite em uma Base ou Túneis de Manutenção para prevenir a deterioração das estruturas próximas.",
    "6C5951884E249902F48F84BC579BFF8D": "Suprimentos para manter estruturas. Deposite em uma Base ou Túneis de Manutenção para prevenir a deterioração das estruturas próximas.",
    "821295C1473A530D7B78578A505EBE08": "Fogo de Supressão",
    "9B0706D84171E947C9329182248ED082": "Continue lutando por mais de 1 dias enquanto sua facção possui menos de 25% de todo o território",
    "1B17069946CA8573587B88BA39E29B1D": "Sobreviver por mais de 2 dias enquanto sua facção possui menos de 25% de todo o território",
    "564F2BAB42C15509140750B7041BF5F3": "Sobreviva por mais de 4 dias enquanto sua facção possui menos de 40% de todo o território",
    "308E98C54020C1B935B9A6951714C6D9": "Natação",
    "4F6C071844A8536D948E1585056A31CB": "T12 “Actaeon” Tanquete",
    "8F4F84214641CBC48D256AAD8E439F72": "Bateria de foguete “Deioneus” T13",
    "D393C239427216CFEE9B618853C651E4": "T14 “Vesta” Tanquete",
    "818B555748C17156BC71229A32F2E408": "T20 “Ixion” Tanquete 30 mm",
    "B06CAE044DC4163948A50E87ECD326D8": "Fábrica de Tanques",
    "1122285143C897768611A1B57A27BE56": "Armadilha de Tanque",
    "0EFFE2024D52CF05ECFBA3822DD4AD72": "Tanquete",
    "3FD16D2F41C76A05B19205A6976B4AFB": "Tanquete",
    "8BDBF35D46B0F9B1DF4F6FB0CD17586F": "Tanquete",
    "A56BC8D54A394F83C3F6D0B35CC01425": "Tanquete",
    "F1929C02492EE23B0E74E298A81B3B65": "Uniforme Tankman’s Coveralls",
    "59137A27421F416A8EB0B6B27FC1750B": "Curso de teste de direção",
    "9A7E36B74B8178096CDFB38CC56CC567": "O Acheron é um veículo anfíbio blindado projetado para o transporte de tropas, cruzando grandes extensões de água para ajudar em desembarques coordenados em praias e ataques a flanco. ",
    "B85728FD47AB02CB9CE5BD9F71F1092F": "A \"Battering Ram\" é uma arma de campo antitanque móvel que dispara projéteis perfurantes de 68 mm.",
    "F7DC4D4349BBEA58C3D503A2C46B621C": "O \"Talos\" é uma modificação Velian da série 85, equipada com um canhão superdimensionado de 75 mm. Sabendo que um canhão tão pesado provavelmente não seria adequado para o chassi da série 85, os engenheiros tentaram dispersar o peso de tal maneira que o chassi da série 85 pudesse suportá-lo.",
    "60AAF3CF47DB617613EA11B55CBEE9E3": "A canhoneira 74b-1 Ronan é especializada em navegar entre navios maiores em alta velocidade e perfurar seus cascos com facilidade. Está armada com dois suportes para armas de tripé com o objetivo de apoiar a torreta central que dispara munição de morteiro.",
    "EDC1300845D4F76D0D84589AA2DE48DE": "A ogiva A0E-9 é um explosivo devastador, capaz de destruir distritos urbanos ou até mesmo pequenas cidades inteiras. Ela arrasa a paisagem, dificultando a reconstrução do inimigo no curto prazo. ",
    "80F355904A74E81A1017958EFD7FEDEA": "O AC-b ou Classe \"Trident\" de submersíveis traz uma versatilidade muito necessária para a Republic Coastal Legion. Com um compartimento de munição de carregamento rápido, o \"Trident\" é capaz de reabastecer rapidamente e retornar à caçada. O Mestre de Combate Curia comissionou os engenheiros habilidosos de Dimiourg para desenvolver um submersível que ajudasse a contrapor a tecnologia naval rapidamente progressiva implantada pelos Wardens e pela Aliança Nevish. Grande parte do senado criticou Curia por essa decisão, alegando ser mais prudente investir recursos em inovações de guerra aérea. Depois de testemunhar o retorno e o redesdobramento de várias operações bem-sucedidas de teste do AC-b, não foi difícil convencer o Senado.",
    "B0971D2F4F52F5CEC1827B91476D630C": "O Ascension Flood versão V é uma variante que possui uma arma mais comprida que foi desenvolvida para combate de longo alcance. ",
    "0B79EDEA473AE6A3AB26E89639BA76D3": "O Guindaste automático móvel de classe 2 da Basset Motor Society é usado para levantar e reposicionar veículos e equipamentos muito pesados.",
    "F8699DEE463164BEABD1AC8A6A1BB549": "O navio de transporte da classe Ironship da Basset Motor Society é uma embarcação utilizada para transportar suprimentos ​​e veículos pesados.",
    "7CB2F5544301F83080E54BB7C53660EC": "O principal navio base da Bassett Motor Society, o BMS - Longhook, é uma embarcação robusta e confiável que fornece um excelente centro de operações para a construção e manutenção de barcos menores para transporte de pessoal e equipamentos. ",
    "0699A64A4BC0951810E4888500D73451": "A Blakerow é uma carabina com uma alta cadência de tiro em comparação com sua antecessora de ação por ferrolho. Essa maior cadência de tiro vem ao custo de um poder de parada inato; no entanto, sua versatilidade e estrutura leve mais do que compensam quaisquer deficiências percebidas.",
    "A2188A324C95D58E8E160FAE3162D0E4": "O navio de armazenamento Bluefin é um enorme deposito naval móvel para todos os fins, capaz de armazenar caixas de recursos, caixas de veículos e munições para viagens de longa distância e transporte de equipamentos. A Bassett Motor Society tem orgulho de fornecer um recurso naval versátil e de ponta para vários países em Raka, Katoma e na Alliant Union. ",
    "442486104B75F9025ECC9C8A5C4BD5D0": "A \"Bomastone\" é uma granada de fragmentação do estilo com bastão. Seu cabo foi projetado para ajudar no arremesso sobre moderadas distâncias.",
    "7A06F99C4E33063B047084890EF18C19": "O 'Booker' é um Storm Rifle de alto impacto com rajadas de três tiros para aqueles que gostam de atirar primeiro.",
    "1B2BFAB349D78169CCC6B6A25BA62399": "O Império Caoiviano construiu um império do frio, impiedoso norte, mas as grandes guerras desgastaram nossa orgulhosa nação. Esses selvagens do sul deixaram nossa casa destituída e quebrada.\r\n\r\nNão é apenas nossas que eles ameaçam, Mas também nossa história, nosso legado.\r\n\r\nRetome.",
    "6CFB3B86427F52AC29C9D68D64DBC191": "O Caravaner é um veículo de transporte utilizado para levar pessoal até a linha de frente.",
    "D38B33304A774C0437BB208CBD8CF035": "O tanque de assalto Chieftan é equipado com armamento para destruir estruturas. Possui um canhão de 250 mm e uma torreta com metralhadora de cano duplo de 12.7 mm para se defender de ataques de infantaria.",
    "1A9B737E4D83147FCF65518288F3C40B": "O Clancy Cinder é um clássico. Um rifle longo de alto calibre, projetado para combates a longa e média distância. Seu batismo de fogo foi feito com os Hands em uma operação de alto risco em Acrithia.",
    "F6524B1C4152DE0DFC39E1B586166694": "A Collins é uma arma de campo antitanque móvel que dispara projéteis perfurantes de 68 mm.",
    "01BEC28C47A801E21D57A085F66B4EFF": "Os Colonials",
    "1346466449D3A6EB2C65CCAAE033B776": "O \"Cometa T2-9\" possui um poder de fogo supreendente para uma arma secundária. Esse icônico Estrellan perdurou por diversas gerações por conta de sua fabricação e design de alta qualidade.",
    "438F3CD74363F0AAEF56CB98AB2DCEAC": "Este pátio de construção é usado para construir contêineres. \r\n\r\nContêineres podem ser cheios de itens e movidos por longas distâncias usando um veículo flatbed ou trem. \r\n\r\nPara mover os contêineres eles devem ser empacotados, e transportado por curtas distâncias com um guindaste.",
    "3E60ABC94798611BD07C9BAAEB91230B": "O lançador Cutler é capaz de disparar uma granada explosiva não guiada e propelida por foguete em curtas distâncias com eficiência surpreendente. Seu design simples permite fácil utilização e armazenamento.",
    "15972C7545B83E4A8EB741B5B2FAA94A": "O DAE 3b-2 dispara foguetes a longa distância desde a segurança de uma trincheira. Esta arma única recebeu o seu nome devido aos gritos que ocorreram na batalha onde este lançador de foguetes foi utilizado pela primeira vez, alguns se referem ao bombardeamento do DAE 3b-2 como \"o assobio da morte.\"",
    "4E1022FE4EF72440780364BDF95AF505": "A submetralhadora 'Fiddler' é amplamente usada em combate urbano. Sua alta cadência de tiro e seu formato compacto a torna ideal para combates em curta distância e noturnos.",
    "59DFACCF49AF5464C57237B93B8CC783": "O Foreman é um guindaste multifuncional, simples e fácil de montar. Perfeito para transportar cargas pesadas em instalações industriais onde o carregamento e descarregamento são comuns.",
    "90B06FA44793502825A9689C013556F0": "O Fuelrunner é uma versão reforçada do Dunne projetada para transportar e distribuir grandes quantidades de combustível.",
    "61DF2EDD494F2CC91D69C89AEDA640C7": "A Gast é uma letal mas pesada metralhadora Krauniana. É melhor utilizada para segurar e defender fortificações estabelecidas ou estruturas guarnecidas contra infantaria avançando.",
    "A9B9DA9741EE501731CA1D9D64935983": "O HC-Class “Ballista” é um tanque pesado projetado para obliterar as defesas do adversário com seu canhão de morteiro Hades de 250 mm.",
    "433C5B094AC1C494D76EDAB28F5F76BC": "O Hangman 757",
    "8779C9AA46D16F3160701EB9B5315BB5": "O Interceptor PA-12 é uma embarcação projetada para transportar tropas e veículos leves. ",
    "2423E72544842BCA2E0DBFB11E9291FD": "O tanque leve \"Ironhide\" é similar ao Mk. III, porém, é reforçado com placas de aço pesado ao custo de velocidade e manobrabilidade.",
    "FFA1F3254EF42A1EB01FFE8BD174C464": "O Juggernaut é uma variante fortemente blindada do Flood equipado com uma arma secundaria de lança-chamas no lugar da metralhadora. Suas esteiras em forma de pá reduzem a velocidade máxima em comparação com o Flood original, mas esta besta é bastante capaz em condições climáticas extremas.",
    "3C09623B4FA6DDC05E463ABFDE8D2BAC": "O Mineseeker é uma locomotiva miniaturizada da Bassett Motor Society. Esta pequena locomotiva 0-4-0 pode transportar toneladas de peso em distâncias curtas. Ideal para operações de mineração ou transporte de abastecimento de curto alcance. ",
    "E749786542A80E615EB016AD60BEABE8": "O Mulloy Landing Personnel Carrier é um veículo anfíbio blindado feito para carregar tropas através de longos corpos de água para ajudar em desembarques coordenados em praias e para ataques nos flancos.",
    "C19174CB40D6F3613874B7B1346F8545": "O Neville é incomparável em sua versatilidade como uma arma 20 mm portátil anti-blindagem.",
    "D7BA015D4482D3DD4E09E2AB3B642485": "O \"Ospreay\"",
    "D7D148314AAE5AE1F2DC71A2EB029626": "O Rampart é um poderoso canhão de campo antitanque capaz de infligir danos devastadores a todos os veículos blindados, exceto os mais pesados, ao mesmo tempo que fornece à sua tripulação proteção balística razoavel.",
    "850F3CFF42260CE5F0A038986A127D9C": "A Refinaria irá converter sucata e outros recursos brutos em materiais que podem ser usados na produção de itens, veículos e estruturas. \r\n\r\nPara uma explicação mais detalhada, clique no ícone “?” no canto superior direito do menu Refinaria.",
    "F2596A28473784B9B4EE0D87323D3527": "A Ambulância Responder é eficiente em transportar Soldados Gravemente Feridos e carregar suprimentos médicos.",
    "A4D3755B41A9F39ACA9074BAC74B3B5B": "O Scrap Hauler, projetado pela Bassett Motor Society é um maquinário de serviço pesado projetado para reduzir sucata e outros materiais em recursos utilizáveis. Scrap Haulers são frequentemente utilizados para extrair recursos de campos de batalha após conflitos.",
    "B82355164AD3C111D9BB5281DDA2D279": "O Shorerunner é uma embarcação que transporta tropas e veículos leves para atacar zonas costeiras distantes.",
    "3CAB58034B77E4113A601DA182C623FC": "O tanque de assalto Silverhand é equipado com armamento duplo devastador, além de blindagem frontal e traseira reforçadas. Seu canhão 68 mm é acompanhado por uma torreta leve 40 mm. ",
    "85D2FD8A406336C041573A8F3842271D": "O Snare Trap é uma adaptação de um canhão antiaéreo que agora é usado para fortificar posições estacionarias com metralhadoras duplas anti-infantaria.",
    "E72E497544109ADFC3642B85BDBFB596": "O Deposito é, como o próprio nome indica, uma estrutura de armazenamento de itens e veículos para uso posterior. \r\n\r\nVocê pode depositar caixas de itens, veículos ou contêineres. \r\n\r\nPara uma explicação mais detalhada, clique no ícone ‘?’ no canto superior direito do menu do Deposito.",
    "61C42C5947C2AFB915981DB8BFBD3815": "O Tinderbox é um vagão simples usado para transportar líquidos entre instalações.",
    "2C2BCDB4483B75B4E508C78B75B207A9": "O lançador RPG \"Venom\" dispara projéteis antitanque. Seu design simples o torna simples de ser utilizado, mesmo em operações de alto risco.",
    "75BFB22744B204E1D95020A42DE5259C": "O exército Warden depende da inteligência vital recebida por seus outriders. Seu equipamento é resistente e bem-adaptado para operações estendidas em terreno difícil e clima impiedoso.",
    "32CC66094EC863747269CBB41F09B000": "Os Wardens",
    "37EB16184665B74CFE1F8FADC68453A1": "A estrutura do A0E-9 comporta o combustível e a instrumentação necessários para guiar a esse foguete da morte por grandes distâncias.",
    "7A2EDF464686598F27A02389597E2DC6": "O sidecar desta Moto é equipado com uma LMG para respostas rápidas e ataques relâmpagos.",
    "6D1768DD43D82B3F03D0EEA78D76D72C": "As aletas de controle, tubos de combustível e motores necessários para o lançamento dessa arma de destruição em massa estão todos alojados no sistema de propulsão do A0E-9.",
    "3FE2286D465132CE9080E1A8636ED174": "O curso de condução é feito para você praticar os controles básicos de condução. Para propósitos didáticos, providenciamos uma seleção de veículos. \r\n\r\nO controle dos veículos é feito da mesma forma que a pé, usando as teclas \"WASD\".\r\n\r\nA barra de espaço é usada para o freio de mão.\r\n\r\nControle a sua velocidade com cuidado, acionando e soltando o acelerador ao fazer curvas. \r\n\r\nHá alvo espalhados ao redor do curso para a prática de disparos de dentro do sidecar da motocicleta ou do Carro Blindado. A mecânica de mira dentro de veículos é a mesma. \r\n\r\nNa posição de atirador/ou no sidecar, segure o botão direito do mouse para mirar e pressione o botão esquerdo para atirar. ",
    "815659DC48C8D296E4AB8B809187CB4E": "Além de ser o primeiro tanquete da classe T a utilizar uma carroceria mais robusta e lagartas mais versáteis, o Vesta também representa a primeira tentativa dos Velians na produção bélica incendiaria. O Vesta conta com uma torre leve lançadora de chamas e amplo espaço de armazenagem para munição incendiaria.",
    "7721733F48656E5E67F9319F10C8F1DB": "O código desse Estoque Privado será copiado para sua área de transferência para que possa ser colado em algum lugar.",
    "A6809E4A4CDC018329BB9D801439BE26": "A senha para esse Estoque Privado ficará visível por alguns segundos.",
    "37E8AA9A49160F5C0BB65F8182B46B2F": "O precursor do Storm Rifle, o Sampo Auto-Rifle, é uma obra-prima de sua época. Com modo de fogo automático ou semiautomático, este rifle versátil pode não atingir cadência de tiro de armas automáticas, mas mais que compensa por sua utilidade.",
    "93ABBB9F4AC1D651143243A65F44A2E8": "O orgulho do arsenal antitanque Warden, a Bonesaw MK.3 tem uma tarefa: Penetrar a blindagem pesada Colonial.",
    "17B0C0F54DEBC4AB8643AF8BAD16DD9B": "O rifle de infantaria padrão da Legião Colonial. Seu antecessor, o Volta Repeater, era uma arma robusta e confiável, mas tinha muitas limitações, principalmente, cadência. O Argenti corrige essa limitação além de ser mais compacto e leve.",
    "115CF636401D8116087368B4F058FD86": "A estrela do arsenal de equipamentos de construção militares da BMS, a Overseer Sky-Hauler faz com que muitas toneladas pareçam leves, possuindo um alto grau de mobilidade quando empregada ao lado de linhas férreas de cargas pesadas.",
    "9295B2ED4880B5F5FE72A3AAC076A630": "A estrela do arsenal de equipamentos de construção militares da BMS, a Overseer Sky-Hauler faz com que muitas toneladas pareçam leves, possuindo um alto grau de mobilidade quando empregada ao lado de linhas férreas de cargas pesadas.",
    "FFE8175A4A9B9AD53B3265AF06D3E1CC": "Uma terceira variante do Niska Motor Carriage foi equipada com duas metralhadoras montadas, mas sacrificou a proteção dos passageiros e o poder de fogo geral. Esta variante simples começou como ideia de um engenheiro de campo, mas rapidamente se tornou um veículo muito procurado entre os regimentos blindados nas linhas de frente do fronte Caoiva-Veli.",
    "4AF095F948FB27C90642DA81420D1E42": "A arma preferida de piratas e ladrões, sua reputação é merecida. Com um incrível poder de fogo e mecanismo único de revólver, o \"Hangman\" por vezes é o juiz, júri e executor.",
    "9AFF016F40CE0959551A75AE28C5C9AA": "O Chariot é um veículo de transporte usado para levar pessoal para a linha de frente.",
    "D78E1F4C4C2D5620465BA694A619F496": "O tanque de batalha “Halberd” é reforçado com sacos de areia e chapas de metal, aumentando a resistência geral a danos. ",
    "BE1BFA70437F1D8BF9FAAA9C3DCEE46D": "O H-8 Kranesca é uma versão melhorada do carro de combate leve H5 Hatchet. Os melhoramentos são no motor e em reforços no chassi do blindado, a melhoria no motor adiciona a capacidade de ativar o turbo apertando o botão shift esquerdo, o custo do turbo é um consumo exagerado de combustivel e perda de mobilidade lateral.",
    "BF2C21334B0DD34E51202CAADB695F6E": "O “Pelekys” classe-H é um tanque leve altamente modificado para caçar blindados inimigos. O teto foi aberto para comportar o devastador canhão de 68 mm anti-tanque de longo alcance.",
    "99CB4B3F4DACA8B158FCF49B87B63479": "A ambulância \"Salus\" é eficiente em transportar Soldados Gravemente Feridos e carregar suprimentos médicos.",
    "A13BAC034B2297951C46C8A5E6FC5AD0": "O tanque \"Scorpion\" Classe-HC é um veículo moderadamente blindado de suporte de infantaria com uma poderosa dupla metralhadora pesada e rádios para suporte de inteligência. Adicionalmente, acentos exteriores são disponíveis para a infantaria. ",
    "AF3964A2441E144027F8BD83C1F986D1": "O tanque de assalto \"Spatha\" tem uma única e destrutiva torreta de 40mm que atira projéteis de alta velocidade. Esta torreta mais especializada não é adequada para produção em massa por ser mais refinada que seu primo, o \"Falchion\"",
    "38267B8C45DB3CCD445ED19929A2F122": "O caminhão \"Stolon\" Tanque é uma plataforma R-series mais pesada projetada para transportar e distribuir grandes quantidades de combustível.",
    "E1D7657546240C5031F6E0BAC3D9B99F": "A arma colossal de campo Stygian Bolt está equipada com um monstruoso canhão de 94,5 mm protegido com uma pesada blindagem angular contra explosões. Inspirados pelos desfiladeiros estreitos em sua terra natal, a província de Lacrista, os engenheiros Mesean projetaram esta arma de campo para manter sua tripulação o mais protegida possivel enquanto mantem o avanço no campo de batalha.",
    "33A737734A491EB9964D31AF80D98C44": "Existem três categorias de suprimentos médicos.\r\n\r\nAplique bandagem no seu soldado para parar de sangrar. A bandagem é consumida após o uso.\r\n\r\n“Kits” de primeiro socorros curam feridas leves e precisam de bandagens.\r\n\r\n“Kits” de Trauma curam feridas críticas e requerem Plasma de Sangue.\r\n\r\nEquipe o suprimento médico e use-o clicando com o mouse esquerdo.\r\n\r\nKits de Trauma e Kits de Primeiros Socorros só podem ser usados em outros soldados.\r\n\r\nPara ajudar um companheiro ferido quando você não tiver suprimentos, pressione \"E\" no corpo ferido para levá-lo para um local seguro. Pressione \"V\" para soltá-lo na frente de um médico.\r\n\r\nSoldados gravemente feridos podem ser carregados pressionando \"E\" e colocados em uma ambulância, hospitais ou hospitais de campo.",
    "51D3CD60463C81D302122E9B7586BBA4": "Proteção Térmica",
    "1D683EAB4982225ACCBB0980C5FB277F": "Estes armários de armazenamento pessoal são simples e efetivos. ",
    "342DA28B4C4A3029FBB5F99D1C0C98CA": "Este veículo tem uma metralhadora leve montada que fornece capacidade ofensiva e velocidade. Perfeitamente adequado para apoiar infantaria ou dar suporte a blindados.",
    "C56715944D01D0E14051489137350ECD": "Este submarino Nevish é excelente em fazer furos nos cascos da frota Colonial. Armado com torpedos Moray e tecnologia de sonar de última geração, o Nakki é um assassino silencioso. Notoriamente, três Nakkis caçaram uma frota Colonial à noite e os separaram um por um, levando o prefeito Evander a convocar uma retirada. A “Legion” não estava preparada para ser atacada por um inimigo que se camufla nas profundezas do oceano.",
    "C59ADBAA4C4BEFD92701E991CA0A57EC": "Esse Veículo Utilitário Leve com RPG proveem uma plataforma de arma pesada com velocidade alta. Perfeito para atacar estruturas inimigas e veículos, ou para dar suporte a um ataque blindado.",
    "BD7CD69B45945AFF7AB118ABB7F2760E": "Este veículo leve utilitário anfíbio foi modificado para cruzar rios e lagos com facilidade. Porém, navegar em direção ao mar aberto não é recomendado.",
    "B400D533415C222C56574C9FA19153D2": "Essa granada de fragmentação anti-infantaria foi desenvolvida com um mecanismo de pino e um fusível de tempo para a segurança do usuário. Serrilhados no corpo da granada garantem maior efetividade de fragmentação.",
    "48932BD946AB6FDE083E5B92EC999903": "Isso designa esta estrutura como seu ponto de spawn. Você só pode designar uma Base Mãe e uma Base Avançada como pontos de spawn. É necessário que o estoque da base contenha Suprimentos de Soldados para que você possa spawnar.",
    "3D8515CF482C4AAD3A5D798766060897": "Essa submetralhadora clássica é robusta e indispensável como uma ferramenta geral em combate de curto alcance. A Pitch Gun herdou seu nome de marinheiros Meseanos que a empregaram com sucesso na defesa das docas de Geraston contra um ataque noturno. ",
    "ED86BD444DDBC5B1A9C9C1A39A083A53": "Esta arma de curto alcance é importada de Estrellan, originalmente projetada para caça de animais selvagens. A Brasa é usada principalmente em operações urbanas.",
    "62EB2C6E4A48A437C7C2BAB1AF591D9E": "Uma conversão completa do Carro Blindado T3 que foi reforçada com blindagem de tanque. Enquanto essa proteção extra diminua a velocidade e a manobrabilidade do T12, a adição de esteiras fornece desempenho melhor em terreno difícil.",
    "562007C64C8855278B7D439C1DD11117": "Este trajeto é projetado para testar você.\r\n\r\nEncontre um amigo e peça a ele que atire em você enquanto você se move de proteção em proteção. Atire de volta ao longo do caminho.\r\n\r\nVeja se você consegue acertar todos os alvos conforme avança no trajeto.",
    "5FF4998C41288C50E8A0319DDD57BF72": "Esse mortífero tanque torna predadores em presa. O caça-tanques Noble Widow se especializa em táticas de emboscada, esperando pelo seu adversário e o punindo com sua poderosa munição de alta-velocidade.",
    "704EA4B74AD642B5CDCE20A02A87F4E0": "Esta granada altamente explosiva e compactada foi projetada para danificar estruturas e veículos.",
    "32A37722413D285B62E5BE8741D607F5": "Esse canhão de curto-alcance é feito para confronto direto com fortificações inimigas. O \"Wolfhound\" possui uma proteção reforçada e um canhão de 40mm.",
    "CCA8B7024C61056D854896AFFACF1112": "Esta é a variante inicial do O'Brien, o V.101 Freeman é equipado com uma torreta com duas metralhadoras que podem girar 360 ​​graus.",
    "17889A604F86533E991EEAA1F68EF899": "Esta evolução do “Bardiche” é equipada com quatro lançadores de RPG alinhados com uma metralhadora de 12,7 mm de alta velocidade. O “Ranseur” é o simbolo do progresso tecnologico Krauniano. Os construtores Kraunianos continuam a atualizar equipamentos antigos para criar veiculos blindados mais mortais e mais modernos.",
    "E366B9564B3EF37C3D682CA2F6CDBA88": "Esta arma de campo é uma arma antitanque capaz, embora um tanto frágil, feita de materiais baratos, construção rudimentar e utiliza tecnologia desatualizada. O canhão de 20 mm pode parecer antigo para os padrões modernos, mas fique tranquilo, ele não tem problemas em perfurar veículos modernos.",
    "4014E36D487D4FBCE39BD7AC9A41D5D6": "Esta máquina colossal é resultado do trabalho de Gray Cullen. Antes considerado impossível, o Predator era a visão de Cullen sobre como um grande navio poderia operar em terra. Possui dois conjuntos de lançadores de granadas de 4 canos e um temível canhão frontal de 94,5 mm. Embora o terreno tenham colocado algumas restrições no âmbito do projecto, Cullen permaneceu implacável e fez os ajustes necessários para concretizar a seu sonho de construir uma embarcação terrestre ideal.",
    "5C98C2CE4BF49E1FB1FF05877CB5DE6F": "Uma casamata fortemente reforçada que permite a infantaria guarnecida com rifle antitanque dispare na aproximação de veículos inimigos de uma posição segura.",
    "13BC4C234178F376823DC6B83C56BF19": "Este canhão de artilharia pesada foi desenvolvido para destruir fortificações inimigas a partir de uma posição entrincheirada. O seu longo cano dá ao \"Thunderbolt\" um alcance incrível.",
    "3DE65FF44A5B93C779BE0ABB51397AA0": "Este pesado canhão de infantaria requer um tripé para estabilidade. A Daucus é projetada para dar a infantaria um ponto de apoio contra veículos inimigos e fortificações leves ou estabelecer guarnições fortificadas.",
    "88DE9A454C873522710799A27410DA32": "Essa metralhadora pesada é grande o suficiente para necessitar de uma superfície nivelada para manter estabilidade. As metralhadoras da série Malone são defensoras incomparáveis no campo de batalha.",
    "90D4AA2540DFD8CC95F799AF32C3B0D0": "Este dispositivo explosivo para serviço pesado foi projetado para causar danos significativos a estruturas fortificadas e veículos estacionados. ",
    "633F232149DF0FF7181D46834EC83E7F": "Este gigantesco caminhão de serviço pesado possui pneus reforçados, originalmente projetados para transportar grandes quantidades de recursos e armas ao longo dos penhascos de Sorovia.",
    "5920BD764CF99DB4CED8A1851C694B2E": "Esta plataforma de artilharia móvel muito poderosa está equipada com um conjunto de suportes mecânicos robustos que lhe permitem suportar a potência do fogo do canhão de 150 mm. A variante \"Sarissa\" é uma versão particularmente original e engenhosa do chassi do tanque de batalha Lance, que permite grande versatilidade durante ataques blindados e reduz consideravelmente o trabalho ligado ao transporte e implantação de baterias de artilharia estática. ",
    "13DA94084D18594CC80AB3A9C181D9F9": "Isso está disponível apenas para o Construtor original desta estrutura.\r\n\r\n<RichText.Regular12.Orange>Disponível para o Construtor original desta estrutura.</>",
    "F47FB4AA4949EA79B9FF5AA1A7A301E5": "Este “Hatchet” modificado apresenta uma célula de combustível reforçada fixada na parte traseira. Este tanque leve pode lançar litros de munição inflamável a uma distância razoável, enquanto sua tripulação permanece protegida por uma blindagem leve.",
    "3DF1B35D47B9CE4B59046D800F0D9889": "Esta arma anti-tanque de 20 mm montada possui precisão superior em relação às suas contrapartes que não necessitam ser montadas. O Typhon foi projetado especificamente com a absorção de choque em mente, permitindo disparos mais rápidos e consistentes.",
    "E0F1A98441E920DF8691F5A2A81CBFD4": "Este canhão de campo robusto não só permite que a infantaria dispare projéteis de 75 mm com facilidade, mas também fornece proteção de última geração contra explosões e proteção máxima contra fogo inimigo.",
    "B26890C24C95E023BB20F4B870E107F8": "Este canhão de curto alcance foi projetado para bombardear infantaria com fogo indireto.",
    "F25F8A7A4097A9BE49ADDA98C025BA82": "Este lançador pesado de ombro é o primeiro do seu tipo. Possui escudo protetor e consegue lançar munições antitanque à distâncias relativamente longas. ",
    "61093A12400E33498D91E3A332D234F3": "Essa placa é útil",
    "E19BBD174F48F50EE6D0CBB3F40D91DC": "Essa placa não foi útil",
    "9FF2ABDF4C581B9D7BDEB4A866238209": "Esta variante simples da ambulância “Salus” está equipada com uma mangueira de alta potência projetada para combater incêndios.",
    "A1CD91CF4A350FD680590FA848BFA652": "Esta arma de campo simples, de cano duplo e curto alcance é impressionante. Sua construção econômica permite uma montagem bastante básica ao custo da longevidade. Destinado ao suporte contra blindados, o Cestus é melhor utilizado em táticas de emboscada ou coordenado juntamente em linhas de blindados.",
    "0E64E9AE41E3064701D69F9F30B7E9DF": "Este simples e modificado Veículo Utilitário é equipado com uma escotilha reforçada, fornecendo melhor visibilidade à um de seus tripulantes para operações de reconhecimento intensas.",
    "CCE57F0A43666D639EA4D793746C078A": "Esse foguete de uso único pode ser atirado de uma distância curta. Feito para furar tanques, o Ignifist é a ferramenta perfeita para infantaria que antecipa resistência de veículos blindados. ",
    "049277874CA7CF1F1F546E86F5E560E6": "Este pequeno tanque foi recentemente reintroduzido ao arsenal dos Warden. Ele ostenta alta manobrabilidade e uma antena que permite comunicações de longo alcance durante operações de reconhecimento de alto risco.",
    "5B043B4442B6B6E25CAFA0B996F519E3": "Esse Caminhão padrão é equipado com uma Metralhadora Leve no lugar do assento do passageiro. É bem adequado como uma escolta para comboios ou operações de blindagens leves.",
    "49D1A20E444A51680987CDBBCF2AF826": "Este caminhão padrão está equipado com um compartimento de recursos no lugar do compartimento de carga padrão. Isso permite uma capacidade muito maior de recursos em detrimento do espaço para carga.",
    "CA9D64FC4F7A36C81344CAA19107CD67": "Este caminhão padrão está equipado com um compartimento de recursos no lugar do compartimento de carga padrão. Isso permite uma capacidade muito maior de recursos em detrimento do espaço para carga. ",
    "566BD0554C6E2781BCFE47AF86AA07DB": "Esse caminhão foi adaptado com esteiras off-road, permitindo um movimento muito mais eficaz em terreno irregular ao custo de velocidade máxima.",
    "2D47D4064DE790F771F759A9562F1853": "Esse veículo de utilidade leve foi modificado para prover assento extra para que uma pequena tripulação possa engajar em taticas de bater e correr.",
    "9D4DB74540030159144ED58C39288A18": "Este uniforme, embora não seja o ideal ao combate, denota o oficial ou comandante de um regimento. Oficiais unilizando este uniforme podem disciplinar livremente seus membros do regimento. Os antigos oficiais Meseanos eram fundamentais para a organização da Legião. Este traje moderno homenageia seu legado com uma espada.",
    "99BFB4DB4B93D2BF0AFB8FA91B6DCA60": "Esse rifle de assalto único possui um tambor de munição de alta capacidade projetado para fogo rápido contínuo.",
    "102C44154CF1D9B99D1C4D80F9C0175F": "Essa ferramenta única de demolição é um longo tubo de metal preenchido com explosivos. O \"Hydra's Whisper\" foi desenvolvido para destruir arames-farpados e detonar minas de uma distância segura.",
    "8D11C42F444FE99A9760A28D28A3C4EA": "Esse distinto lançador de RPG de dois canos pode disparar dois projéteis RPG em relativamente rápida sucessão. Esse aumento no poder de fogo o torna praticamente impossível de ser operado por um único soldado sem um suporte robusto.",
    "6F03A66044D0E60A6827568086CA30FB": "Esse rifle único atira três projeteis em rápida sucessão. A Fuscina é a primeira de sua espécie, feita para dar fogo de supressão durante assaltos em trincheiras inimigas.",
    "E8FF49EE4B17E8AFC3F8818B69550D65": "Esta arma secundária única atira em rajadas de três tiros. A Cascadier pode não ter o poder de parada de seus primos, mas ela mais que compensa com a sua armação leve, ocultabilidade e taxa de fogo.",
    "1F21E6DD4BFA703C3302BDAA1D3A24F6": "Esta submetralhadora única e resistente não é muito útil em movimento, mas com mira cuidadosa e cobertura adequada, torna-se uma navalha à noite.",
    "BC78409F4C0ECAC44A3231A6A42A9711": "Esta variante do 'Bonesaw MK.3' é especialmente projetada para uso com tripés. Promovendo uma maior estabilidade e maior potencial de alcance.",
    "3CE22F2F4F3A747CBCDCA884C44E4B2A": "Essa variação do R-5 Hauler padrão é montada com suspensão e sistema de eixo melhorados resultando em melhor manobrabilidade. Entretanto, essas melhorias podem não aguentar condições climáticas adversas.",
    "A0ADCD954C88D93A356468B1F6FC351A": "Essa ação removerá todo o líquido do tipo armazenado neste tubo da rede conectada, permitindo que novos líquidos fluam através dele.\r\n\r\n<RichText.Regular12.Orange>Apenas tubos reservados serão drenados.</>",
    "5C6C2EEA4A1AF55FC3A47A9C7248BA3A": "Esta variante “Javelin” é equipada com uma plataforma de morteiro de 360 ​​graus, projetada para apoiar a infantaria nas operações na linha de frente.",
    "399F6DCE4F5CBA8474C1508C4AB13293": "A variante \"Xiphos\" é equipada com um poderoso canhão antitanque no lugar da plataforma de metralhadora dupla.",
    "1B93331345BB6FF3A35BFB903534EABF": "Lave as mãos antes da refeição, lave suas roupas ou limpe seus pratos com a modificação de pia e lavanderia. A higiene é fundamental para evitar infecções e doenças na guerra.",
    "4DE251764E2E9CB98C51928771111482": "Para combater a engenhosidade dos Caoivish, os Meseans desenvolveram seu próprio sistema de disparo indireto de RPG. Os lançadores duplos são instalados numa grande plataforma para maximizar a cobertura numa posição estabelecida, em vez de serem relegados a uma ferramenta de guerra de guerrilha.",
    "E65DB2424DF830078402629E7B020C22": "Para abastecer um veículo, primeiro refine ou adquira diesel ou petróleo. Para fins didáticos, é possível encontrar um pouco de combustível na caixa de armazenamento perto da casa. \r\n\r\nPressione ‘Tab’ para abrir o seu inventário e então clique com o botão esquerdo do mouse no combustível para equipá-lo. \r\n\r\nDepois de equipado, feche o menu, aproxime-se de um veículo e segure o botão esquerdo do mouse até o combustível acabar.",
    "D4FB33DF4C4840AF16DF0DAB116A02D0": "Para girar a câmera, segure o 'Botão do Meio do Mouse' enquanto move o mouse para a esquerda e para a direita.",
    "CA00BF9B4DFD3ADD3A738A835C2E6EC5": "Para começar uma trincheira, primeiro é preciso uma pá. Encontre algumas em um dos contêineres de armazenamento próximos. \r\n\r\nCom uma pá equipada, pressione ‘B’ para abrir o menu de construção.\r\n\r\nSelecione e, ao iniciar uma nova trincheira, posicione o terreno como qualquer outra estrutura. \r\n\r\nApós posicionar um terreno, segure o botão esquerdo do mouse para cavar. \r\n\r\nO processo leva tempo, mas pode ser mais rápido com um grupo.",
    "893A70814DA3AA6879BF3BB21D9FA0B9": "Mudar para o modo secundário",
    "07A4AC4248DE975EB2BC38A5F04E1194": "Alternar Chat de Voz (Local)",
    "AEF4A4DC4A7D8B25993030B9CFEB88CC": "Alternar Chat de Voz (Esquadrão)",
    "102EE32A4E97880745819385B4913327": "Cidade",
    "61E0F27C4EE3E93AFE0E509D4A1D310B": "Base da Cidade",
    "99DFC1CE459067F35E36F2A2ACF9EFA9": "Base da Cidade",
    "EC5440CA43513ABE394C23BBCD530C82": "Base da Cidade",
    "1440F4934D50CF78270BE498F0AE0479": "Reboque",
    "14BE7BEF426146EF3128E78A44636C22": "Reboque",
    "ECC459C14F0CE48CD3022991CF7CC1CD": "Estação de montagem de trens",
    "44347BB848F32F07DF9580B5C674B41C": "Transferir Torpedo",
    "6111A794412124E77DB764BDC5E764B7": "Transferir Torpedo",
    "1D919EAF4CA41E718E1921A15807C122": "Ônibus de Transporte",
    "F21967B14A7EC84736BA428D37F5FA81": "Kit de Reanimação",
    "45AE3BE947CAC2B2C6723C9C57D1549C": "Granada Tremola GPb-1",
    "90B803D9436F08A222133CA646C4ED14": "Trincheira (Nível 1)",
    "74E989B744FF24AB38B10AAE0F9C5B02": "Trincheira (Nível 2)",
    "84A7B5704DB2E61F06E91F819C52C317": "Trincheira (Nível 3)",
    "37D5017B45C28CAEB3966B87673330F1": "O básico sobre trincheiras",
    "499F47EC45F69015EDF724A392D57999": "Conector de Trincheiras (Nível 1)",
    "4F3155ED443FDFA70F754CB199E4AAAF": "Conector de trincheira (nível 2)",
    "C3A55C1546C54FACCFF7CEA671BFB545": "Conector de Trincheira (Nível 3)",
    "2EAB70C34E3EBB05E07D58A1A6D6638B": "Local de Escavação de Conector de Trincheira",
    "A201A9224AF73E0339266C937179F807": "Local de Escavação de Trincheira",
    "AEE1E844448E5BDD0B82DEA9791C0CB3": "Trincheira para Armas Estacionárias (Nível 1)",
    "6510FCE04BBFE9D922B27A832E1D6971": "Trincheira para Armas Estacionárias (Nível 2)",
    "67668840461C54A7F1420F813820A754": "Trincheira para Armas Estacionárias (Nível 3)",
    "C76CD2F44CF8F03DE31A7C91D757D976": "Local de Escavação de Trincheira para Armas Estacionárias",
    "366CF5134202DE6C16973BAAA1FD4318": "Teto de Trincheira",
    "4644E1894D3140B8737D43A0CE835F1F": "Cobertura de trincheira",
    "9B3EF5104E40259744989DAC7045AAA9": "Treinamento de Trincheira",
    "A4C117564AE6190AB53CFC8710D3AEA7": "Treinamento de Trincheira",
    "A56BFFF74B9CA30EAB6B24ABAB803187": "Treinamento de Trincheira",
    "F2855D994844C80CA22211B006CFACC3": "Tripé",
    "542900CE4499CCF909016A876BBE29A6": "Fábrica de Tripé",
    "D70C348540A1FD5F04D53A9DB446A468": "Caminhão",
    "40FEEB8C494A469902EF7A87FCEB8813": "Ponto de Virada",
    "0DF5EE9B47D23BA89BD8BDBAFE42246C": "Torre",
    "1213DA5A4B0BDF537953448F4D2F8694": "Torre",
    "27BFB08849208F3358852D9667D6546F": "Torre de Tiro",
    "3B3A09084AB6A72C9508359B478D8EDE": "Torre",
    "3FEF6CF946193B406D9350945AEEA37B": "Torreta",
    "4B0724064D1EEDC7A9D5488E52AA09D2": "Torreta",
    "598E5B8340153EFCA7A6D3BB161131C8": "Torreta",
    "60E8089045422DA1B1A2E5A3E544A778": "Torreta",
    "8A81FBEC4F4AB329D4717BA0F51E2E4E": "Torre",
    "8C2159F0443676232F901EBB7B834510": "Torreta",
    "9E00642A4E6B8A6C389472A678A7D255": "Torreta",
    "A5FC1C564F1C3401609CBEA238365CD9": "Torreta",
    "B0FAEB69483CE85A6384A7BBA65EA685": "Torreta",
    "CAD26D5E4649E9F5D210FE939D6D929C": "Torreta",
    "D3F91CED4CCDE27002DA5DBFA845EFAD": "Torreta",
    "DD79EF02455A441AFFEB53A5810F988F": "Torreta",
    "F296A32340E52BB50A173DA89FCCC9AD": "Torreta",
    "675ED7F84DF98FD6BD2E9AAB03EA4BED": "Desacostumados com o frio, legionários devem sempre se adaptar. Este pesado sobretudo foi projetado para mitigar os efeitos do frio enquanto ainda permite mobilidade ótima e eficácia de combate.",
    "EE118DA84850EE1C3792A4A747CF7174": "Munição não detonada",
    "C042C76744695DF15DF744815E609F89": "Uniforme",
    "F01F202E419CB6695A4B519C5F6067F5": "Diferente da série-85, o \"Bardiche\" possui uma blindagem mais resistente, sendo equipado com uma metralhadora coaxial junto a uma poderosa torreta 68 mm de cano curto. A moderna engenharia Kraunian permite um recarregamento mais rápido, tornando-o a ferramenta ideal pra combater blindados inimigos.",
    "75AB8FE84A86F6D4277D48B7ACF8B6C4": "Destrancar",
    "7EB9C9D944A4229BC78D8DBADF5A6ED0": "Abre este veículo para que outros jogadores o possam acessar.",
    "390C066E4C2FA2F6C2E3D38BBB687C2E": "Desempacotar",
    "97D3273D4EEB0CD842F7EFAAF4A917E0": "Desempacotar Equipamento da Área de Carga",
    "A900FC5D41B661D32B0BF6B4AAD68C60": "Desempacota o transportável para poder ser usado de novo.",
    "C572EB50426026BC88591DB9307C44AD": "Desenpacota o transportável. Isso é apenas disponível quando esta estrutura é acessado de um Guindatse que tenha implantado equipamento na área de carregamento.",
    "EA7E8F024DB199250BE79BA08DC92610": "Substâncias instáveis",
    "D4B956C346CA1E5642177289D323532D": "Aprimorar e modificar trincheiras",
    "1A369228461BEFED3E331880C8F35514": "Use a roda do mouse para elevar o trilho",
    "A075E56945A48EB182E37B92490E117E": "Use a roda do mouse para elevar ou diminuir o trilho",
    "98D8E4BA4632C629A811DEAB3787192A": "Use a pedra para aceitar uma maldição maligna e se tornar hospedeiro do espírito amaldiçoado de um Avartach.",
    "8F545E0048426B7F3E9299B3EE48F5BF": "Use a pedra para aceitar uma maldição leve e se tornar o hospedeiro de um espírito há muito tempo morto.",
    "11F3C4D84BA7C71A4D3501AC9BB423B3": "Use a pedra para aceitar a maldição primordial e se tornar hospedeiro do espírito ruim de um Balor Spawn.",
    "8E82923E4335B05159E475AD5ADF4C61": "Utilize esse estande para experimentar com a Artilharia. Nas caixas próximas, você encontrará munição e binóculos. Leia as placas para mais informações.",
    "F17D729E4F340088340D20A5D33A4BA1": "Use esse estande para experimentar com a Artilharia. Nas caixas próximas, você encontrará munição e binóculos. Leia as placas para mais informações.",
    "5DD8ADCB4CB3A226F190A1AA1DB58A1F": "Usado por médicos para curar outros soldados.",
    "B34EDE9E464113E9D2727D8F515BE792": "Usado por médicos para reviver soldados feridos.",
    "9A407F074260034D38B3A3910AB1F582": "Usado para construir veículos avançados.",
    "6A8A96BF4BFA6BF5A1D36FAAF6D3F982": "Usado para conectar linhas de energia. Até 4 linhas de energia podem ser conectadas a um único poste.",
    "84E9996949F3F9A11ABCADA4EF3ECEB3": "Usado para construir defesas de arame farpado.",
    "FAF8B2D74AA8A6AB2CE540907D2E30FA": "Usado para construir defesas com vigas de metal.",
    "49B8A1CF43181E9825221AA0B060DE83": "Usado para construir defesas de sacos de areia.",
    "AFDBDBB445543513C7DD549D7E397910": "Utilizado para construir diversos tipos de dutos para transporte de líquidos.",
    "EC925A914580E90ADB6568904B743699": "Utilizado para impedir a movimentação de infantaria inimiga por uma região. O arame farpado é difícil de destruir com armamento convencional e deve ser desmontado com uma Chave Inglesa.",
    "292BF39646EB298A64B12AA92E865556": "Usado para dificultar a movimentação de infantaria inimiga. Pode ser desmantelado por uma Chave Inglesa.",
    "EBB791414DBF7EED5D7129B9D59B93F8": "Usada para estancar sangramentos.",
    "022C953248AF6ED5FEF83FA8F2E86696": "Usando uma mistura mortal de gases inflamáveis e compostos químicos, o \"Molten Wind\" é a arma de infantaria mais devastadora da Legião Colonial. Empregando técnicas antigas, os químicos de Mesean desenvolveram uma técnica para estabilizar e transformar em armas as chamas líquidas, que rapidamente transformam qualquer estrutura inflamável em um inferno furioso.",
    "A71DF305443FCA5170FED896D5AC982D": "Saltar",
    "17E4C14547F7A71AAA51BB86BEF12BB9": "Treinamento de Artilharia e Veículos",
    "20F447FC4BDF66099EC70097CA9F4369": "Treinamento de Artilharia e Veículos",
    "BE46601E4365581494C9AEA56425C932": "Combate de veículos",
    "459EEE8541430DE62B269381AE88F9E2": "Construção de Veículos",
    "72D954B54F5FEB3A119A8EBFD74B5EB8": "Caixote de Veículo",
    "B70E5E1546EA67EA21D02AAAB032BFCD": "Armazenamento do veículo",
    "0A06D02F4F1C6AA36F1E72983602B77C": "Treinamento de Veículo",
    "7A08F5DA42AB4991EB99F5B8A111E030": "Treinamento de Veículo",
    "60BCB3404D4EB0A4C301C79852BE1596": "Treinamento de Veículos - Aperte \"E\" para ler as placas.",
    "62CC261E4E964EC0D6C093B9FB735CDF": "Treinamento de Veículo - Aperte \"E\" para ler as placas.",
    "0A8A828945E1DA4C991466A5C1D6A104": "Treinamento de Artilharia e Veículos",
    "EBC7C18745F760E825037881F5F017B4": "Treinamento de Artilharia e Veículos",
    "AD7A3A644ABD866DB2F32C8FA46C5A28": "Partes de veículos para montar veículos Relíquias.",
    "B95F48F444B13FD8D00E719ED5AC27ED": "Veículos",
    "E3061F75450C77B4E60E299E6D59B962": "Uniforme Velian Flak Vest",
    "D38017A043AE35CFEB2F05BFFEE7CF5E": "Ver registro de ações",
    "2F4842DD437179837A5AEFBB97554DD7": "Ver a condição do motor",
    "303E6BAF46672F827D298F89D541090F": "Ver a condição do motor",
    "B3F3C92A465C4140F42E8CAA25C11785": "Ver a Senha",
    "039F9BB6447E1116D611818272C9FFC2": "Ver Registro de Eventos da Região",
    "18AFFBEC4AB3882672067FB09EE390B0": "Ver registro de ações no Estoque Reservado",
    "486DDFBE41947322EC68068E52A0A271": "Ver Registro do Estoque",
    "0E12E2E24E1CFB7B0A277BA2D4FD48B4": "Ver Árvore Tecnológica",
    "E8ED3E5E4457413CE9AB36AC83258442": "Ver o registro de atividade do estoque reservado selecionado.",
    "D7AC356C496F19916B50C0950DAC467A": "Ver o registro de atividade do estoque público",
    "929135D14764A4DE4D1D758BBEA86003": "Diário de ações desta estrutura.",
    "1F621C1648CD0F6F797ABA8BD26C451C": "Consulte o registro de eventos para ver informações sobre jogadores nesta região.",
    "00EABA4949026D59CBFC278A8C37F1E6": "Visibilidade",
    "EC98CEBB478918935CE7DDB5D34E879B": "Visibilidade é um fator importante ao percorrer o campo de batalha. \r\n\r\nTudo o que não puder ser visto pelo seu personagem ficará invisível na tela. \r\n\r\nSe esconder na grama, arbustos, ou atrás de paredes, são opções úteis para agir furtivamente. Mover-se escondido irá expor sua posição. Além do mais, se você e um soldado inimigo estiverem escondidos no mesmo arbusto, ou fumaça, vocês se verão. \r\n\r\nVeja os resultados com os outros soldados na grama logo adiante.",
    "918C049D42456C9C70DD2092396AC802": "Muro (Nível 1)",
    "DC034AAE488D643B6B1597A56C68D2CF": "Muro (Nível 1)",
    "2722AC8F406D98EB1286028B6A7AA2A1": "Muro (Nível 2)",
    "477869B14534F0ECCC356B81E835BC25": "Muro (Nível 2)",
    "235F30394CED001CF6916696D97B5DDC": "Muro (Nível 3)",
    "AD1A583646C7176663CD2E91E344D554": "Muro (Nível 3)",
    "C436707642C26FC615E3158ECFD09DF5": "Uniforme Blindado Warden",
    "00CA251B463F135BBF3EDDA4EAF8746F": "Os Carros Blindados Warden são plataformas rápidas e versáteis de assalto urbano. Estes veículos anti-infantaria são equipados com metralhadoras de cano duplo.",
    "EA2128214680435E3B4BBEA83D4E4C9E": "Uniforme de Engenheiro Warden",
    "4D0AC5244B13A47C8941009C85BCB6F5": "Uniforme Warden de Munição Pesada",
    "694BDF4449C49C96C5B048A3438DE700": "Região Inicial Warden",
    "424D68304F36C7F3F293E69FBDFE04BD": "Uniforme Médico Warden",
    "6D98174942355A95E6AD3BA2F8222859": "Uniforme de Oficial Warden",
    "833AD3274528861D543C7FB14E4720ED": "Uniforme de Reconhecimento Warden",
    "6F0900EA48A8B58CDB6E828B2AA8D91E": "Uniforme de Neve Warden",
    "AE2B8CB44BD34A19BB744581D8135EEE": "Uniforme padrão do Soldado Warden",
    "E6E31CA445C3C6B7EB325191EA4894C2": "Terra natal Warden",
    "B8FE7D614032796029CC4FBF1422EEEA": "Uniforme de Tanquista Warden",
    "F616DCD34EB02F5E46FD6BA918A8AC18": "Uniforme Warden",
    "05281AB24E21E26A705DBE9AAC46DBB8": "Os especialistas Warden precisam de um uniforme projetado para otimizar sua capacidade de transportar uma variedade de munições pesadas.",
    "1764606E426FEC81B69305B4734DE38A": "Estação de Lavagem",
    "BF346DD64665AECE25CA7A99F559900A": "Torre de Vigia",
    "824288EE43F33BA537D0A898D74027D6": "Água",
    "EDAE889D425FA8ACF647DD85537D91F6": "Balde de Água",
    "FF730C1E469AE4A99D457F886B7631C9": "Balde de Água",
    "9E06F53144AC52789E387B86072A8BC9": "Bomba de Água",
    "1035CEFF4BE551D6496A9E9C6D9F8094": "Treinamento de Veículo Anfíbio",
    "428EB85A4F85F55F5EB752BABEBBE174": "Treinamento de Veículo Anfíbio",
    "8433448C4D683BCAA53DFF8E67BE580D": "Água... numa lata!",
    "07C5D94D4BBEBF8187110AB4DBABB7BB": "Treinamento de Embarcações",
    "6D84A2D54B59F48498F7D99A884CFD10": "Treinamento de Embarcações",
    "B811505D48BE6582F67DB1AFB593784C": "Estante de armas",
    "371422D246DF0EFF137498AE1508E008": "Armas",
    "AC69DB27422EDABB3D96D39974DFD8FC": "Plataforma de armas",
    "FB726F6049EE79E99E8FC4A14DBA35AF": "Bem-vindo ao treinamento básico de logística. \r\n\r\nAqui você poderá interagir com diversas estruturas do jogo. \r\n\r\nPressione ‘E’ para interagir com todas as estruturas. Isso abrirá seu inventario exclusivo, bem como seu inventário. \r\n\r\nSe você estiver confuso sobre como usar uma estrutura, clique em ‘?’ no canto superior direito do painel do menu para obter mais informações. Não tenha medo de perguntar por aí!",
    "51FD8B2E4DFBBFDF4D56D9B36BC4C1F8": "Bem-vindo ao treinamento básico. \r\n\r\nAqui você pode praticar as várias ferramentas básicas necessárias para ter sucesso na linha de frente. \r\n\r\nSiga o curso à frente para começar. Sinais ao longo do caminho explicarão os controles básicos e a funcionalidade.\r\n\r\nSe você tiver dúvidas sobre qualquer coisa, não tenha medo de perguntar no chat.",
    "12FF44B542E14ECC02F8269D9734EEFD": "Bem-vindo ao estande de tiro",
    "E9B503F942ED2A2ADAC8F79B0D77053F": "Bem-vindo ao estande de tiro",
    "0B8DC5AA4943CB768A61BAAD3F1EABBA": "Bem-vindo ao Campo de Tiro \r\n\r\nAqui você pode praticar os princípios do combate.",
    "B401AA914B004B5937511A9BF775A69C": "Quando encaixado a uma máscara de gás, este filtro fornece proteção contra gás.",
    "22D8AB584B5470EB43C7FFB73C3C7BAA": "Quando a peça de Artilharia estiver em uso, você terá controle sobre a direção e distância.\r\n\r\nNOTA: O redirecionamento da peça requer o manuseamento de dois jogadores.\r\n\r\nPressione \"Q\" para manusear.\r\n\r\nNa posição da direta, Use \"Scroll\" para modificar a distância. Na posição da esquerda, \"A\" e \"D\" mudarão o azimute.\r\n\r\nNa posição da direita, quando seu alvo estiver confirmado, pressione \"Botão Esquerdo do Mouse\" para disparar.\r\n\r\nHá um porém! Você precisará de um terceiro jogador para observar utilizando binóculos. Os binóculos não possuem o mesmo alcance que as peças de Artilharia, então é fundamental que haja coordenação com o observador para que uma leitura precisa seja feita.\r\n\r\nPeça que seu observador vá à frente e comunique-se com ele para determinar se os alvos estão sendo, ou não, atingidos.\r\n\r\nBinóculos para treinamento encontram-se por perto na caixa de armazenamento.",
    "5A2593F2474A8350890231AB87E6E934": "Enquanto o caça tanques Noble Firebrand Mk. XVII é um tanque lança-chamas mortal, era necessário um meio mais barato e eficiente de empregar armas lança-chamas. Apresentamos o Wild Jack, nomeado em homenagem aos ídolos ardentes feitos por crianças para a Dead Harvest, o Wild Jack é uma variação do Highlander.",
    "8957B70144F68175D0FA9CAB7D1B1F21": "Amplamente considerada o primeiro fuzil de assalto, a Aalto é uma maravilha em engenharia Caoivish. Possuindo dois modos de tiro, esta maravilha pode ser usada como um fuzil automatico ou um rifle de médio alcance preciso.",
    "0027C25143C7C3CFA1A9B390BC088D5B": "Munição da Willow's Bane",
    "F8A3D28742D634ECEC6163ADACD70588": "Com todo esse equipamento, nadar é difícil e requer muita energia. \r\n\r\nVocê não chegará longe sem se afogar, então fique atento ao seu vigor; quando ele acabar, você morrerá. \r\n\r\nCom vigor cheio, tente nadar até as escadas do outro lado e pressione a barra de espaço para subir até as docas.",
    "9CAE023F4D6042AF4DACB4AC7370BC80": "Com sua metralhadora 12.7 mm montada, o \"Doru\" é o complemento perfeito para qualquer ataque costeiro. ",
    "54D8167245B1B50D9CE74B9F8C8E00A7": "Com mais armadura aos custos de menos mobilidade, o Hoplite é um reforço formidável no calor do combate.",
    "B8AEACB148375A119C80A3838F06BD14": "Estação de Trabalho",
    "AA602FB24C71152B3EE62896715959FD": "Mapa-múndi",
    "74F1E8D84EEC202C23F02F959E1E4183": "Jogador Ferido",
    "979F348E476AB09C06619CBF2E6995C2": "Destroços",
    "69F2D0974F432FDCE56A81BDE1DD86DF": "Chave inglesa",
    "2E4B840B4AED4B87E6D74CA93E5D98FA": "controles de condução",
    "3AE507584369FD2FC1DDB8A4B8737DE8": "controles de direção",
    "52A39AEC4BA7A075D47F82A76AF30FD7": "controles de direção",
    "8DC17D5049D5C53800E416A5849A23AE": "Controles de condução",
    "E46F446B4FB93483B329D6B781BE29AB": "dano incendiário",
    "D2FFEB7A4DDFF3E02982FFB82938DAD5": "aprenda sobre Munições",
    "E9C2441C44E9328C21405B9ECD8A5B4E": "aprenda sobre Munições",
    "E747912D4465E130809C94B5A1180DED": "aprenda sobre Pátios de Construção",
    "FE16BB5A4178EBDDC9BB86A2F3350916": "aprenda sobre Pátios de Construção",
    "0AE4C8F34A5F6212CCAE4A976607CBB6": "aprenda sobre Fábricas",
    "FEC11FD847A9C6DD31D197AD6D46AAB3": "aprenda sobre Fábricas",
    "30B855D14F4AEFBDE1676CBE54F4ACC6": "aprenda sobre controles básicos",
    "97E0A56A40BFC7F65568AFBAF40C5D42": "aprenda sobre controles básicos",
    "EC63965742494F58F11D309A1FCCE8A9": "aprenda sobre controles básicos",
    "C368E4ED4CA40114892452977F45DD4F": "Aprenda sobre logística básica",
    "E24061E84F11225974EB8DB0D111F6A2": "aprenda sobre logística básica",
    "7EE1C3A44047C1B57E37529CA65790BA": "Aprenda sobre o treinamento básico",
    "86CBA7F8444C4B7B43BE3DBFE39A9E50": "aprenda sobre o treinamento básico",
    "8EF9CA7642541BE5AB6FB99009B8745C": "aprenda sobre construir",
    "DB2FB8054A66961C6F0B7CB7C1D33F20": "aprenda sobre construção",
    "7AD262E44C3C77920290DD835E1B8883": "aprenda sobre controles de câmera",
    "8334DA784C51F1050F20668B66F70035": "aprenda sobre controles de câmera",
    "15CBAAAF444E8BB14B0225A8B9C2A8A3": "aprenda como construir um veículo",
    "B8F903D64635261730FDE9985CBE4555": "aprenda como construir um veículo",
    "0088363B4641F06AFB1B6D8434D8CC45": "aprenda sobre cobertura e supressão",
    "596A4C18475A884A349DA89C998F9125": "aprenda sobre cobertura e supressão",
    "1648D9CB40AD089B019BACB7367D558F": "aprenda sobre combustível",
    "3D0704E24CCF2CB9AA1235A8F65C5221": "aprenda sobre combustível",
    "4083E87C4DAC28C312D348ADCB9AAA2C": "Aprenda sobre combustíveis",
    "45C660634250266DDC004084FB427F4E": "aprenda sobre combustível",
    "7ECC25004268E3CA76406683EA80A357": "Aprenda sobre combustíveis",
    "A744CD30491C9AF5983FAF8851351001": "Aprenda sobre combustíveis",
    "C29878954260D69AF4656BABB040DB3B": "aprenda sobre combustível",
    "038D3B2148F31508E344E6A50EEF5FC5": "aprenda sobre granadas",
    "43E16D3848F8183807D6488C68464915": "aprenda sobre granadas",
    "3D0B5D1744B51D052CAB7E9AD792C289": "aprenda sobre escadas",
    "E68E55A5481559D0EA824D98657DDB89": "aprenda sobre escadas",
    "338AAFAE4F262FAE27EF109D9A92EBAD": "aprenda sobre medicina",
    "D698F1D7470753ED87798BBF8912B018": "aprenda sobre medicina",
    "A0C195214C9186376B85B8A0E07D22C1": "aprenda sobre minas",
    "C4ADEC65428F7683E98259ADCEB9AD1B": "aprenda sobre minas",
    "020540A545F5F426A471F79933DB5F7B": "aprenda sobre energia, canos e concreto",
    "44A907C8455E25A7FB9296ADA6F28752": "aprenda sobre energia, canos e concreto",
    "3BB992D54076D3702B06E4BEEE604E47": "Aprenda sobre recursos",
    "B2F15C704927A49523FB22837FE94AF0": "aprenda sobre recursos",
    "A403145C4DAD6312956840BC2F94429D": "aprenda a marcar seu ponto de renascimento",
    "D07A2DCF4E4FA1966CF19883A74152C1": "aprenda a marcar seu ponto de renascimento",
    "200F5D2948953AF1D5561B8CB45FF3EE": "aprenda sobre estabilidade",
    "8C7B95FD4724AE91E4DAC983B46270ED": "aprenda sobre estabilidade",
    "1D0CDFFA404E58CDEB32A4992CC9E736": "aprenda sobre posturas",
    "F0BD5D1A4908CF32CE87979297B8A204": "aprenda sobre posturas",
    "D506A6924D602B067A7AF2BFA3E1B355": "aprenda sobre natação",
    "EF97D9524BD64CBDA61469BDEEA094C2": "Aprenda sobre nadar no jogo",
    "2B32EA074E6A4EE1C11EC39FC4A4C81F": "aprenda sobre o percurso de teste",
    "BE91DB20459FAC26A3E71A9CA3E03203": "aprenda sobre o percurso de teste",
    "293C49F74943881F631C7A8C056B9A50": "aprenda sobre a Refinaria",
    "51A7B2794418A064FD3D1385BE4AA6F9": "aprenda sobre as Refinarias",
    "A142E4034F175C32125BDA9DFC2FD53B": "aprenda sobre a Refinaria",
    "E1F7024F4B3A52DC2F7768BB2049A147": "aprenda sobre a Refinaria",
    "760780A44F68536E8D769D8806B5D6D6": "aprenda sobre depósitos",
    "970418F24E274F2DF6140AA674E73BE4": "Aprenda sobre depósitos",
    "4E714FF343F9AFF20F76DE97DDF061E3": "aprenda sobre o alcançe das artilharias",
    "E2014FD546985D97B8AE4F8805CE855B": "Aprenda sobre o alcance da artilharia",
    "780E80A946C193372A5B86BDEEE9295B": "aprenda sobre o básico de trincheiras",
    "A5C5B02249EC3A683756709DA8330671": "aprenda sobre o básico de trincheiras",
    "641312794ECF05A52229039F2435C4D3": "aprenda sobre o encaixe de trincheiras",
    "EB61E5F2412949DE0C54FF9558134CC3": "aprenda sobre o encaixe de trincheiras",
    "03763D2E47A40D779BFE48ABBD891653": "aprenda como aprimorar e modificar trincheiras",
    "BEF99AB346278DA350703EAFACFE8CB7": "aprenda como melhorar e modificar trincheiras",
    "D9C68AA04C9DB47E51A7609C4C168ECA": "aprenda a saltar",
    "EB4565C64FAE40B37F19A2AB01A61057": "aprenda a saltar",
    "21C52C1445DDE46224F6D28133B8651A": "aprenda sobre armas",
    "47E331D448BD5876C983D48C5C614B76": "aprenda sobre armas",
    "7ABF21D94A081CBA5F8428A1C4C2F3B6": "Mostrar o mapa de pontos para ingresso na guerra",
    "AE6DA3D94266574B76FE289A4466D6B5": "aprenda sobre Munições",
    "FCC34A374DDE1BDF144E1E997F81B7C6": "Aprenda sobre o básico de munições de Artilharia",
    "08EC3C104782AC39BB860CBF5AAA8944": "Aprenda sobre o básico de Artilharia de Campo",
    "E9266B2B49708818A1A8DABB3CECCAEC": "Aprenda sobre controles básicos",
    "711202284F51E5F3F67B94A259957C3C": "leia sobre a Coleta de Recursos Básica",
    "82BD7AD141DF7DBCA3B8848E052BFC5C": "Aprenda sobre o treinamento básico",
    "94A7480045AF0BD426D06787C4151763": "Aprenda sobre construção",
    "6A1F48124732AF8FBC4EDE96CE1BBEF5": "Aprenda sobre os controles da câmera",
    "2448B8A2473A60B402825293DD660F91": "Leia sobre Pátios de Construção",
    "9CFE905D411686EEFBE935B8220D5129": "Aprenda sobre cobertura",
    "09E3A48C44768734DAB94DB43F236534": "Aprenda sobre Fábricas",
    "8F4E011C4B9907EF624E4D84180F54D0": "Aprenda sobre artilharia de campo",
    "9EC484BD418FBBAAA81B13B38C51768E": "Aprenda sobre combustíveis",
    "CC221D66405D5D937DDB2DBBD0013109": "aprenda sobre Granadas",
    "3DAFC1904E06A0330CD543AEE9AAC5C4": "aprenda sobre escadas",
    "03FF59AD481859B5D3F03AAA464ADEB6": "Aprenda sobre Medicina no jogo",
    "CCB9F7174B8EF9603CA88C9CFFD31F4F": "leia sobre Mineração",
    "B0FC1C6D436D73B8A215069514BCE298": "Aprenda sobre Energia, Tubulações e Concreto.",
    "A15E50C842D13938A888D394C57FC648": "Aprenda sobre Refinarias",
    "DBD70EAD498C06984D4D73A6412BACA8": "Aprenda sobre setar seu ponto de renascimento",
    "158EA3EE4EAFD6DE2ACE90BB0EAEBBF2": "leia sobre Encaixe de Trincheiras",
    "42C9953244A2E547E724F2A084B337F8": "Aprenda mais sobre suprimentos para soldados",
    "5152A8C6472718ADDFC3BB899B8870C4": "leia sobre os Recursos Especiais",
    "BAC568854E21F76ECC6090815A03DFF6": "aprenda sobre estabilidade",
    "5CDFA67D4CEF0F8585D92AA362482EC1": "leia sobre Posições",
    "5A0BE9F04E26D36AEFCFCEBA55A0EF20": "leia sobre instalações de armazenamento",
    "524C9CA04B1BEF52EFF8568BFC714EE1": "Aprenda sobre nadar no jogo",
    "7A792E304FA050FDE3A54EA1EE886F10": "Aprenda sobre o básico de trincheiras",
    "DE6588614A4C91A7B8394E9BC978C669": "aprenda como aprimorar e modificar trincheiras",
    "A0D11951442BED25FC916B8748F62176": "leia sobre saltar",
    "5B8CB6644F96A5432014D6BBA080C9FC": "Aprenda sobre visibilidade de aliados e inimigos",
    "0A3063974DD6BA50E078B592865444DC": "leia sobre Controle de Embarcações",
    "1F03C87A46C06A8A42506E82B683ED93": "aprendendo sobre suas armas",
    "48353CF944B23C3C2137BABC530388F6": "Aprenda sobre o vento",
    "F86E47C7459AA8988ACC359EDE768A70": "Aprenda sobre controles básicos de direção",
    "0280D14E4BEDB25E13AF72B8205F922E": "Aprenda sobre o treinamento básico de logística",
    "BE048D3844ECFB09ECA443ABC68D59F0": "Aprenda sobre reabastecimento",
    "527191D34969B0CE333D1F95180ADD22": "Aprenda sobre o alcance de fogo da sua arma",
    "DF72F2B3479ED64AC290BA86B06B7A0C": "leia sobre o Sistema de Reserva",
    "75E3D7774784307D86886AB075C41FCE": "Aprenda sobre o curso de teste",
    "97F028E942F5E6E8605FB08AF2CE03AF": "Aprenda sobre combate de veículos",
    "39DABAB1465FEE3E79767AABA724E8CC": "Aprenda sobre a contrução de veículos",
    "6450546E4CB6BC314CE09BB057DDA3E8": "Aprenda sobre os veículos",
    "51C18A614140C992A0A56AB2E32D7B2D": "veja o estado da guerra",
    "082F996F443450ADAA53759564EB09F6": "aprender sobre artilharia",
    "28A0B67A47D6A5005E69C69E81990A9C": "aprenda sobre artilharia",
    "B9116999448514474BF020A8533216B0": "aprenda sobre artilharia",
    "71E8568F4C38101A2F23159D46A04EBE": "Aprenda sobre o armamento dos veículos",
    "E0BA5C464F90932280B594B962D17DEA": "Aprender sobre os armamentos dos veículos",
    "011B5AEE44AE74D7485D56B68B3CB9AF": "aprenda sobre veículos",
    "11D5F20A432A71B07E745F8FC7D0DF1E": "aprenda sobre veículos",
    "887539864C80B1027E005581B6F575E3": "Aprenda sobre os veículos",
    "E8E840F348003C254669E98F8A4FF38F": "aprenda sobre veículos",
    "22136F9849FE26E3CB5B679431A1B0FB": "ver Monumento",
    "DC49F557408D54D58463F3B9A504E112": "Munição de Molten Wind v.II",
    "7E46E2A240D435B554270B8520F4BEEB": "\"Le Pitch Gun\" mc.V"
  },
  "STActions": {
    "ActionAim": "Mirar",
    "ActionAimToggle": "Mirar",
    "ActionAppendMapCoordinates": "Adicionar coordenadas do mapa",
    "ActionBuild": "Construir",
    "ActionCameraZoom": "Zoom da câmera",
    "ActionCenterMapOnPlayer": "Centralize o mapa no jogador",
    "ActionChangeChatTab": "Alterar guia de bate-papo",
    "ActionChangeGear": "Mudar de marcha",
    "ActionClimb": "Escalar",
    "ActionEmbarkContextMenu": "Menu de embarque",
    "ActionEmoteCheer": "Emote - Celebrar",
    "ActionEmoteGoForward": "Emote - Avançar",
    "ActionEmoteHalt": "Emote - Parar",
    "ActionEmoteRallyPoint": "Emote - Ponto de Encontro",
    "ActionEmoteSalute": "Emote - Saudar",
    "ActionEmoteSurrender": "Emote - Se Render",
    "ActionEmoteWave": "Emote - Acenar",
    "ActionEquipPrimary": "Equipar item primário",
    "ActionEquipSecondary": "Equipar item secundário",
    "ActionEquipTertiary": "Equipar item terciário",
    "ActionFire": "Disparar",
    "ActionForceDropLargeItem": "Soltar item grande",
    "ActionHandbrake": "Freio de Mão",
    "ActionInteractContextMenu": "Interaja com o menu",
    "ActionInventory": "Inventário",
    "ActionLockVehicle": "Trancar Veiculo",
    "ActionMount": "Montar",
    "ActionMoveBack": "Recue",
    "ActionMoveForward": "Avançar",
    "ActionMoveLeft": "Mova à esquerda",
    "ActionMoveRight": "Mova para a direita",
    "ActionPushToTalkSquad": "Falar com esquadrão",
    "ActionPushToTalkLocal": "Falar local",
    "ActionInteractLargeItem": "Pegar, Largar, ou Submeter um Objeto Grande",
    "ActionPlaceCallout": "Falar uma frase pronta",
    "ActionPlaceStructure": "Colocar Estrutura",
    "ActionPlayerInteractMode": "Mudar para modo de interação",
    "ActionRadioBackpackTransmit": "Transmissão de mochila de rádio",
    "ActionReload": "Recarregar",
    "ActionReply": "Responder",
    "ActionRotateCamera": "Girar câmera",
    "ActionRotateCameraLeft": "Girar câmera para a esquerda",
    "ActionRotateCameraRight": "Girar câmera para a direita",
    "ActionRotateStructure": "Girar Estrutura",
    "ActionSpectateNextPlayer": "Espectar o próximo jogador",
    "ActionSpectatePreviousPlayer": "Espectar o jogador anterior",
    "ActionSprint": "Correr",
    "ActionSwitchSeats": "Trocar de Assento",
    "ActionSwitchToSeat01": "Mudar para o assento 1",
    "ActionSwitchToSeat10": "Mudar para o assento 10",
    "ActionSwitchToSeat02": "Mudar para o assento 2",
    "ActionSwitchToSeat03": "Mudar para o assento 3",
    "ActionSwitchToSeat04": "Mudar para o assento 4",
    "ActionSwitchToSeat05": "Mudar para o assento 5",
    "ActionSwitchToSeat06": "Mudar para o assento 6",
    "ActionSwitchToSeat07": "Mudar para o assento 7",
    "ActionSwitchToSeat08": "Mudar para o assento 8",
    "ActionSwitchToSeat09": "Mudar para o assento 9",
    "ActionTakeScreenshot": "Faça uma captura de tela",
    "ActionTextChat": "Chat de texto",
    "ActionToggleAlerts": "Ativar Alertas",
    "ActionCalloutsMenu": "Ativar menu de texto explicativo",
    "ActionToggleCrouch": "Agachar",
    "ActionToggleInterface": "Alterar interface",
    "ActionMap": "Mostrar mapa",
    "ActionToggleMode": "Alterar modo",
    "ActionPlayerScreen": "Mudar a tela do jogador",
    "ActionToggleProne": "Deitar",
    "ActionSecureMap": "Alternar para modo de mapa seguro",
    "ActionToggleVoiceChat": "Ativar/Desativar Canal de Voz",
    "ActionUse": "Usar",
    "ActionViewRoofs": "Mostrar Telhados"
  },
  "STStructures": {
    "ImodStrategicMapDesc": "Um quadro ajustado com vários mapas da região e gráficos úteis. Planejamento cuidadoso e navegação são as chaves para qualquer operação bem-sucedida.",
    "ImodSandbagsDesc": "Uma barreira defensiva que dificulta o movimento inimigo e fornece cobertura durante o combate.",
    "ImodRadioStationDesc": "Um rádio de longo alcance projetado para enviar informações em um piscar de olhos. Às vezes, não há tempo para escrever e entregar uma mensagem pessoalmente.  ",
    "ImodLatrineDesc": "Um lugar seguro para a realização de negócios. Afinal, todo mundo precisa fazer.",
    "ImodKitchenDesc": "Um espaço limpo e seguro para preparar rações militares ou alimentos encontrados. ",
    "ImodChalkBoardDesc": "Um simples quadro para planejamento de operações.",
    "ImodWorkstationDesc": "Uma estação de trabalho com muitas funcionalidades. Escreva uma carta para entes queridos. Catalogue o inventário de mantimentos restantes. Todos podem usufruir de uma mesa robusta.",
    "ImodStairsBunkerDesc": "Permite acesso fácil ao telhado deste Bunker",
    "ImodFiringPortDesc": "Permite que armas da infantaria sejam disparadas da segurança de um Bunker.",
    "ImodBridgeDesc": "Permite veículos a atravessar essa trincheira.",
    "PipeModInsulationDesc": "Um material isolante que previne o cano de congelar em condições climatéricas adversas.",
    "ImodBarbedWire": "Arame Farpado",
    "ImodBunksDesc": "Camas postas uma em cima da outra. Pode não parecer tão confortável, porém, quando o assunto é descansar, a cama de um soldado é a sua casa.",
    "ImodBridge": "Ponte",
    "ImodBunks": "Beliches",
    "ImodChalkBoard": "Lousa",
    "ImodComputerModule": "Módulo de Computador",
    "ImodComputerModuleDesc": "Decifrar mensagens codificadas às vezes requer mais do que apenas mão de obra. Esses módulos de computador de última geração podem fazer o trabalho e roubar inteligência inimiga. ",
    "ImodDoorway": "Porta",
    "ImodFiringPort": "Embrasura",
    "PipeModInsulation": "Cano Isolado",
    "ImodInteriorFiringPort": "Embrasura Interna",
    "ImodKitchen": "Cozinha",
    "ImodLadder": "Escada",
    "ImodLatrine": "Latrina",
    "ImodLockers": "Armários",
    "ImodPantry": "Despensa de Alimentos",
    "ImodLadderDesc": "Permite o acesso a este Bunker a partir do telhado.",
    "ImodPipes": "Canos",
    "ImodInteriorFiringPortDesc": "Fornece cobertura contra inimigos que tenham entrado neste Bunker",
    "ImodTrenchRoofDesc": "Fornece cobertura contra inimigos que tenham entrado neste Bunker",
    "ImodStairsDesc": "Fornece acesso fácil para dentro e fora desta trincheira.",
    "ImodDoorwayDesc": "Fornece acesso ao interior deste Bunker.",
    "ImodPipesDesc": "Fornece energia das salas de máquinas para aprimoramentos do Bunker.",
    "ImodRadioStation": "Estação de Rádio",
    "ImodSandbags": "Sacos de Areia",
    "ImodPantryDesc": "Prateleira para guardar rações, suprimentos e ferramentas do dia a dia.",
    "ImodBarbedWireDesc": "Desacelera infantaria inimiga tentando invadir esta Trincheira.",
    "ImodStairs": "Escadas",
    "ImodStrategicMap": "Mapa estratégico",
    "ImodLockersDesc": "Estes armários de armazenamento pessoal são simples e efetivos. ",
    "ImodWashStationDesc": "Lave as mãos antes da refeição, lave suas roupas ou limpe seus pratos com a modificação de pia e lavanderia. A higiene é fundamental para evitar infecções e doenças na guerra.",
    "ImodTrenchRoof": "Teto de Trincheira",
    "ImodWashStation": "Estação de Lavagem",
    "ImodWorkstation": "Estação de Trabalho"
  },
  "STTutorial": {
    "TutorialActionHoldCamera": "(Segure)\r\nRodar a Câmera\r\n\r\n(Ctrl+Scroll)\r\nZoom Cinemático",
    "TutorialActionHoldRotateStructure": "(Segure)\r\nRotacionar Estrutura",
    "TutorialActionHoldAim": "(Segure) Mirar",
    "TutorialActionCycleWeapons": "Trocar de Arma",
    "TutorialActionEnterVehicle": "Entrar no Veículo",
    "TutorialActionLocalVoiceChat": "Canal de Voz Local",
    "TutorialActionMove": "Mover"
  },
  "War": {
    "LightUtilityVehicle": "Veículo Utilitário Leve",
    "Turret": "Torreta"
  }
}