#ifndef UE4SS_SDK_ABP_Battleship_HPP
#define UE4SS_SDK_ABP_Battleship_HPP

class UABP_Battleship_C : public ULargeShipAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_D2C8894246676500A87A668555EE0760; // 0x0378 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_50FEB76A4D9997A7CFBDCA9F21224616; // 0x0438 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_E7C837DB43D8DDC854814D9803192557; // 0x04F8 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_0784E7884933A197BA2BAC973A96A470; // 0x05B8 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_AC64929C49D8F7DBD01072AD3CFFE914; // 0x0678 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1AAADDBE4FA65EB795993FB7BD9B3D92; // 0x0738 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_C609B67D4454087F1FE3BCB58708DF82; // 0x07F8 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_B0A59643420DC234FCEC4A9C1BC983EA; // 0x08B8 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6A0566114FD896ADF6BE04AD715ED179; // 0x0978 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_73BDF9564EADCFAEB82108841606F78D; // 0x0A58 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_EE4B72B24A526A2FED073CAA4B0A8CC9; // 0x0B38 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_B8E16BD046E08BAC65ABA4A394066972; // 0x0C18 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F50B3202450707569A22B5A4AFFDF469; // 0x0CF8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_871AACEA47939FC82F38449D5E918718; // 0x0DD8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_44BE57EC4CAF760B9DE512865FD7D55A; // 0x0EB8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1B0E24CD4BDE279EE80C7EA606EFA6A5; // 0x0F98 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_BE7524734208EF12FA28F297136BD5CE; // 0x1078 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_81B197E3451C3E7E802A66BBB1B372E9; // 0x1158 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_FCAB0A5343474D9C62E5ED9B6F0F919D; // 0x1238 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_CC2818024DB2A96171FD63A3CE4D3714; // 0x1318 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_08C0BEEE424D80A0AA33ABB258D83F4B; // 0x13F8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_CFB826DB4C89CC828F08B5AD2C3577BD; // 0x14D8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_ACF1A6BD4AE222836D3AB29F7EA47401; // 0x15B8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_A900757840AE6D6590B172BDDE5AD4D9; // 0x1698 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2D81754D455DF013ECAF7098D3BB2BCB; // 0x1778 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4CF9C211415474C824D4CDAF55DAC5A2; // 0x1858 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9AB563D246144650BD80E891A2907982; // 0x1938 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27A88B354B194EA349A06199C2C763C6; // 0x19F8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_D1FBE0E24854413CC0D0E3ACB73327AE; // 0x1AD8 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4A2A7FBF47745190601E92894C75F79F; // 0x1BB8 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8A73034941EA9B3710010EB809A1A3B0; // 0x1C78 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_96C417E442E1991FB846BF93DB5BFBB7; // 0x1D38 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15A708A54258AAA7D7170189788B254B; // 0x1DF8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5716485348526D7AFAE93CA527EE163A; // 0x1ED8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6D80496A4143295EF489B79E38569F5D; // 0x1FB8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_78B440A64FBA2277D7572B8C51D51ECA; // 0x2098 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B97DCC7741A71B34EA89AFB7236F6D41; // 0x2178 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5365CD4F40864637403F81AAE80E744B; // 0x21F0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_A6F286364ACEDBF4041B91AE94F3BE38; // 0x22D0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8D0001314F550E849807628213D77AC6; // 0x23B0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_B744CD704CFDEC07A9F3E980BD116960; // 0x2490 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_795A3E1F461F44DF0C5186A42D82F320; // 0x2570 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8FEE491F423A1FCBF21E4D9EC5199B64; // 0x2630 (size: 0xC0)
    FAnimNode_Root AnimGraphNode_Root_205D01DC453729A20EFE68952B403002;               // 0x26F0 (size: 0x30)

    void AnimGraph(FPoseLink& AnimGraph);
    void ExecuteUbergraph_ABP_Battleship(int32 EntryPoint);
}; // Size: 0x2720

#endif
