#ifndef UE4SS_SDK_ABP_BattleTankCol_HPP
#define UE4SS_SDK_ABP_BattleTankCol_HPP

class UABP_BattleTankCol_C : public USimVehicleGunnerSupportAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0300 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_94D0607D4041F4ED53432F96A0262139;               // 0x0308 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5A25D4E741D9075927440A96B46DA792; // 0x0338 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74B8116C4F74EC7F4C5D488EDC1C3757; // 0x0418 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_127F6AF740A6E8E23CFF6F8A6A4161E8; // 0x0490 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_854963AA4C2AC699B4CA1E8125B45272; // 0x0550 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_072FA0DA47AF98D8A41C519B0FEDF462; // 0x0610 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_BFBD551F4AFC89B105EEDFA6AC8A9B45; // 0x06D0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_A1EBFBA243FAF870E76B5DA87E27DAA6; // 0x07B0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3EC1FA264B612FA1A0AFD3BDAABBE937; // 0x0890 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_88F541DA41D0564E437E18A6A6B5A4DF; // 0x0970 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1DEDB90E4CE66C7D5E157C858C99A2CB; // 0x0A10 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2AF08E3E47C75450E85999916FD75503; // 0x0A88 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3FF6EC6948B15A505A1216B3DC522287; // 0x0B00 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_477DC08345A62CB06A9EC3A20118FF44; // 0x0B78 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_46974F4B4D8AB7A23D55989E15A5F0FB; // 0x0BF0 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1BC74CAA40ACEEB115F2FD85B86F6C81; // 0x0CB0 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_B8B5B07F486F580E5B9AD9AE8AB2E661; // 0x0D28 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_ED1D4AAF48F05A1B1164CB8B65CBFAFB; // 0x0DC8 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94501CB74BDEAE5E1BB6F7ADC7751708; // 0x0E80 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6DEA12C64FFEDFE4ECBF169C560CC18E; // 0x0EA8 (size: 0x28)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6270D888465EE685C8D384A8E0500F0D; // 0x0ED0 (size: 0x188)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_AE9DF3314D4DA71622D1C883001867A5; // 0x1058 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_53A235A647ED44206B319DA116274023; // 0x10D0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F39B7A884B3FDF3D3C78A4963CA73149; // 0x1170 (size: 0x78)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4A579843406B1EDE5D8A41BD7967F194; // 0x11E8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_36ACC9F9472D0D9CA556F187B5650D10; // 0x12B0 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59CCFEB946C561761398079922C43CCE; // 0x1370 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4EDE1BB6475C68A23A61E98E474B82FD; // 0x1398 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1A5CA18B46F2D6C60C5476A21B86E6CD; // 0x13C0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_F71DA6ED4D8FF3FC97E7819E9730E15E; // 0x1438 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_4ABB34044A47FD6CC35641955AAC9769; // 0x1468 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_D476053646DEAED87D51C1B0773EE7FB; // 0x1498 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_E30ABC9E45E9D9F268425E86C4171F4C; // 0x1548 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3D71976D475AC4997E30B89230A7B055; // 0x15E8 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_04FAE6F74CB83FABCDBB8E829CC695C2; // 0x1660 (size: 0x78)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A3001EA54E958471A1FF0DB3651EA498; // 0x16D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F442E4664C38BE8E590D329DD75CB571; // 0x1700 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CCA600BF4A37493801A0439EA3EB510A; // 0x1728 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_C92ED52E4DE609B78411AE843D2CF96C; // 0x17A0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_51E2215440B489DCC1C744951CEDFE76; // 0x17D0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_AEF4CA1F4016BBFD9D4DD7B86A0321C7; // 0x1800 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_365E9F004550E35859737D9A31D988BD; // 0x18B0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_018EE75E4EE57A7ABE98F6A9437DE638; // 0x1950 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D820FADA41ED1F47E1DCE897261F3229; // 0x19C8 (size: 0x78)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E2B7896246ADA25A42A5418823B820F2; // 0x1A40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9962D20C4BBF28F32988178337677D1A; // 0x1A68 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_715A1D144FF6E934C13780A7114A18B7; // 0x1A90 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_35B198BB4CDF514BFACA5B9C7682B803; // 0x1B08 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4E735FB04244244E67739B86C52F0B2D; // 0x1B38 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_43654F5040235541D9E553ADC2665593; // 0x1BB0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_40935D8F426E774BB2044F920DF6C7DC; // 0x1BE0 (size: 0xB0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_D44F2E504C308DD1FA37EDA3AE02B7F9; // 0x1C90 (size: 0x188)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7F608C6D44932A2D740C38BF3BB61A29; // 0x1E18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DF9FBE954C148517AAE8B9888D58983B; // 0x1E40 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F909841B4832D8013305F9823C358EA2; // 0x1E68 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_653D4D0C4E9DA8577BDC8EBF1AAFFE7D; // 0x1EE0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D3E7DBA44E6051561B6F1BAB4521B542; // 0x1F10 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_9471DADD4A6EF376C33552ADBAAEB9B6; // 0x1F88 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_E8A2394149484D12AFF2618025A7D2A1; // 0x1FB8 (size: 0xB0)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankCol_AnimGraphNode_BlendListByBool_B8B5B07F486F580E5B9AD9AE8AB2E661();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankCol_AnimGraphNode_SequencePlayer_1BC74CAA40ACEEB115F2FD85B86F6C81();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankCol_AnimGraphNode_TransitionResult_59CCFEB946C561761398079922C43CCE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankCol_AnimGraphNode_TransitionResult_E2B7896246ADA25A42A5418823B820F2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankCol_AnimGraphNode_TransitionResult_7F608C6D44932A2D740C38BF3BB61A29();
    void ExecuteUbergraph_ABP_BattleTankCol(int32 EntryPoint);
}; // Size: 0x2068

#endif
