#ifndef UE4SS_SDK_ABP_BattleTankWar_HPP
#define UE4SS_SDK_ABP_BattleTankWar_HPP

class UABP_BattleTankWar_C : public USimVehicleGunnerSupportAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0300 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_32743E174FED3B556264C99BBBD86530;               // 0x0308 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8EACD5B848CE09AA988AD0931CD298EB; // 0x0338 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0AE89E1C4B9F3F1D30AA71B66E9B7625; // 0x03F8 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_46ADA0C347F1FD8995732BB89D4F91B7; // 0x0470 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_FD9A6D374B5B6D84670512A3F3BC97B5; // 0x0550 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_AA8D4108465C87AAC5B03D86A1D97296; // 0x0630 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_89436AC94BE0A0045CB03CB76E1DC435; // 0x06F0 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_DC4BC9D246F37F403F07CCBBAF628F76; // 0x07B0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_EE63F2094CB28036811CB2A143F7DD2B; // 0x0890 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3B11C0DA4D1C289197F59E86B9D280F7; // 0x0970 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52943AE046C90C11FB141B83500B2156; // 0x0A10 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D5E6287B4FB7AEF088730C8CFAA36F33; // 0x0A88 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_AF70E3EB45CEF463EACBA583331DBD56; // 0x0B00 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CEB267B94CB59895C465AA9FE61670FA; // 0x0BA0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0F5F6AFA45918AD4264B268C729ACB31; // 0x0C18 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2DAD114E4C36E2255E53E38C3CD3BC73; // 0x0C90 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9344315C4F2366CA8642FEA112D62537; // 0x0D08 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_0888E51B49E6F619FEA34EBD12FA6F43; // 0x0D80 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_078E0E85442BDCF586F56FB19D1087DE; // 0x0E40 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71B006334D9010A5672A95B37F2F4369; // 0x0EF8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6EB44445488918A8446CE6AF805DE749; // 0x0F20 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_E7F67BEF451AB695ED9B3581A83843B8; // 0x0F48 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E1B6F5DB4E199E80619A219B1D2755E9; // 0x0FE8 (size: 0x78)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8279877545E15A3A4DDB7EA930462821; // 0x1060 (size: 0x188)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9C137CDC4498AC15B8845A9663333A3A; // 0x11E8 (size: 0x78)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_B88AB04349B63C0C2985E686456905DB; // 0x1260 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3DF228EA4B0C381268D2778FA00C2D29; // 0x1328 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DA6A7A764EB5A369C5D8BE9B9E0B10AB; // 0x1350 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56353221441ECD7C70C010B42FA42FF1; // 0x1378 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_668A28104822CAD5B2B45887C36543CF; // 0x13F0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_A658169144B53AD08AF4878C098265A4; // 0x1420 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_0CF4D87F4C44AE782F9349849077E66D; // 0x1450 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24AEAEF04BF191FA1DED22843E61AF81; // 0x1500 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_0E534C5945A057DE5A8234A0A26AAE91; // 0x15C0 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1BD034A743A0650D482BE9BD33AE0D95; // 0x16A0 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_C9B5A45F4CC07A1B55DE73B17A18D655; // 0x1718 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119E2865422223854BC3F78B0C1C6C07; // 0x17B8 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2241C34E46325091CBF8B9AFBE0B8889; // 0x1830 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47868194424D428815F0A69C290519A0; // 0x18A8 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_A7F04362424E4AC2B4051592F93209D9; // 0x1920 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29AF5CBE48BD29ECF3F7CAB9175F2FE3; // 0x19E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CAD6512A40B725865490DBA1BC43B3C7; // 0x1A08 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5BEAC1B94E77070349314091E6B9E9E8; // 0x1A30 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_6B0389DC4A0CF72ACA0508B9133C89A3; // 0x1AA8 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_83D041D5448319043DDAD0AB2EF5E007; // 0x1AD8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_DB5B5F1C4D4781038741CAA3AE247531; // 0x1B08 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8DEF482E4B03029D8F0EA8B10A6B96FD; // 0x1BB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1F5E3DED49921E359EED409B8F09B2F9; // 0x1BE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_FEB45330471F88B4315079951FF18F6C; // 0x1C08 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_320B797349D2C1CE4FBC74AE37F6B267; // 0x1C80 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_9B75843045EB9F4ACDC0828A760BDD77; // 0x1CB0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_365CF28E4414502D9137CDAA902E10DE; // 0x1CE0 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86DE3948435A57CC56E901821EE5B47B; // 0x1D90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78F4FFD64EE8E05202CA4893F3EEF65F; // 0x1DB8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5D7FBB7B47FCAEBC50D4809DF7DEE201; // 0x1DE0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_538846024BCE7DDF333946B63732743A; // 0x1E58 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_32A32F364362B63AED5C1EBCD653082E; // 0x1E88 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_525C75D54B1C9B4765A6D685E3A3BCC8; // 0x1EB8 (size: 0xB0)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankWar_AnimGraphNode_TransitionResult_29AF5CBE48BD29ECF3F7CAB9175F2FE3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankWar_AnimGraphNode_TransitionResult_3DF228EA4B0C381268D2778FA00C2D29();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankWar_AnimGraphNode_SequencePlayer_CEB267B94CB59895C465AA9FE61670FA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankWar_AnimGraphNode_BlendListByBool_AF70E3EB45CEF463EACBA583331DBD56();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleTankWar_AnimGraphNode_TransitionResult_86DE3948435A57CC56E901821EE5B47B();
    void ExecuteUbergraph_ABP_BattleTankWar(int32 EntryPoint);
}; // Size: 0x1F68

#endif
