#ifndef UE4SS_SDK_ABP_TrainCombatW_HPP
#define UE4SS_SDK_ABP_TrainCombatW_HPP

class UABP_TrainCombatW_C : public UInfantryRailVehicleAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02F0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_853420E7484F7B1FD5FE56B98130BAA2;               // 0x02F8 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_EC5072764A807C5C859EB0BEB933315A; // 0x0328 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2401248446002172280CE29F0E27D4CB; // 0x03E8 (size: 0xA0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_E91547C94819EFF8477E26B9E7498EA5; // 0x0488 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_284387F942C981FD6ED0BBAC729C4338; // 0x0550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8EE9E10F49870F1CB1A614BCED065FEC; // 0x0578 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E92FD6C447731A7EDD7CCAA466B06CBD; // 0x05A0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_EB4063064A3541957C607B939C242963; // 0x0618 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_FB7510E44A33AB74A24E41B6382B3EC9; // 0x0648 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_34A10AAA4E09DCB294D106BE39D348C8; // 0x0678 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9D181BA048BD9CB4B9E50C95D4B26A29; // 0x0728 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D6CC79A8439C1F16C6ECACA3A9DD7085; // 0x07E8 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DA27285646FEB95C62E3CEB423C0ED98; // 0x0860 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_B06F837B485BE84ED3B518939DABA70E; // 0x08D8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_0125A8754C5E2907745702B61D291B48; // 0x09B8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_958A3A34477056728DCC29AA0F4775C1; // 0x0A98 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F9BED02B49265470A04C3D95CF5E3F4B; // 0x0B78 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3A35CC1A486E1326F26112A24A842F73; // 0x0C58 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_46CB02A24ED11AA647E98482E0F18363; // 0x0D38 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6E2A65E74AF705B11174BB9A110594E9; // 0x0E18 (size: 0xA0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C96E12F249D664329119FC841673385C; // 0x0EB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5E74B3DF4293B26BEF2195A38BAD9359; // 0x0EE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C359156E43B8DE15C5CDBC90CCD3A66D; // 0x0F08 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_096D3A9E4486CEC90A8F309F0566E508; // 0x0F80 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_1E0ACC834DF6B3B0F7C5C8957605E834; // 0x0FB0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_47FA8ADF43B5A8F5DB6AA9B864730A9C; // 0x0FE0 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8319C1A744361C580C133598D502B09D; // 0x1090 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_471056754EA1099351FEA3A095779E8F; // 0x1150 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57AF9B90485112EAEA4C1B9CA15DFEB5; // 0x11C8 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_FBA2D47F416DA8F1AF99F59B9BAAD72C; // 0x1240 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A2EA1E8847C1EC71FA5D5CB23DAE0CFE; // 0x12B8 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15B5406147F062A473C5918054CEAE4D; // 0x1330 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26E78A464D01D77ECE86C8AB6E1AAB5D; // 0x1410 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_666CD60E4A41C2DB8092C7986063F2AC; // 0x14F0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_89A3E0694BC67C44F8FD4396663E1BCE; // 0x15D0 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_E6CD8AB345ED65FFB4817AB16B19EC88; // 0x16B0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E10F0C364D09C2AC8AADA0B492CD2027; // 0x1750 (size: 0x78)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainCombatW_AnimGraphNode_TransitionResult_284387F942C981FD6ED0BBAC729C4338();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainCombatW_AnimGraphNode_TransitionResult_C96E12F249D664329119FC841673385C();
    void ExecuteUbergraph_ABP_TrainCombatW(int32 EntryPoint);
}; // Size: 0x17C8

#endif
