#ifndef UE4SS_SDK_ABP_BattleshipC_HPP
#define UE4SS_SDK_ABP_BattleshipC_HPP

class UABP_BattleshipC_C : public ULargeShipAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_D8A0516C4A2B932EDA9321BBCC0A028A; // 0x0378 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47082C35476640EE4BA1809E4CDBF58C; // 0x0458 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4D17E10844514C39540EB3AE2F2786ED; // 0x04D0 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F4C5DCD34A2604B4202FFA9B17548412; // 0x0590 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5EBACD994F623D1A09BB9AA3CA3DF1E5; // 0x0670 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_445FF9AE47A740C0EDB42DAA4BA88E19; // 0x0730 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4B2C3DA94A693B6F13A626BAC29E7545; // 0x0810 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_DB1DF36044B4AEAF986886925338FE00; // 0x08F0 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_EA3F1C61467979FA3A83E2B5D5701A47; // 0x09D0 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_D0DC8F814222AF4C33FC55ABF396041C; // 0x0A90 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_363E125446065003A5DF9382131987E2; // 0x0B70 (size: 0xE0)
    FAnimNode_Root AnimGraphNode_Root_7B93144C40B9BAB180A64A8033C10F08;               // 0x0C50 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_F68542F746153A348EDDD4875ACD2CC9; // 0x0C80 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27DFF900486C4849278416A7A55166A2; // 0x0D40 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_D9442380486DA472E242A7823BF9AA8F; // 0x0E20 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_D0D87BF847D9F39E5BC01180E571971F; // 0x0F00 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_DCFCD80A40AA17E93C0FC09F441BBE02; // 0x0FC0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6DD7B21F44221521A9FD6983AC391D50; // 0x10A0 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_AD449DBD43AD55C98D945C98EBC544D2; // 0x1180 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_E48DAA5949156DB008378E9B99A3BA90; // 0x1240 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_EDD5ABB341EF3F121EE3789A1CE0EE79; // 0x1320 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_552DCCE54AF499966E34EEB7651D67BE; // 0x1400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14D1AA2A4024F1EFD4C40598CEBC7C47; // 0x1428 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9854D0194EE0F525470255AD10F14F23; // 0x1450 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_F44D96E94FB105C59E035F973033AD2A; // 0x14C8 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_5C383FEF4B513A515057E0945C4BC153; // 0x14F8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_EEA95E9C4A64D9BFC6E371A40FC5FA39; // 0x1528 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_66955FD24BAA90D240BDFF97D2048C45; // 0x15D8 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C376C0DC4A8D265C89B17FBF3748FB47; // 0x1698 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_869E75794D1299882E5DF4A57D780C5D; // 0x1778 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BF5D8AFB4693590CCCF4FA9025CC9A52; // 0x1858 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_417B3E5D4C7B294AE1355697FB26D663; // 0x1880 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DE334B2F4922687350100D92BC76E1EA; // 0x18A8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_6375DD534DDD429B10CB4993733D6AB8; // 0x1920 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_A5239D4249E2714B3B86A789BBEDC7C0; // 0x1950 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9FEBA7124C590C8D2A136F8C7C73FB84; // 0x1980 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_F80BC69B4A4E6220983CA79AF699159F; // 0x1A30 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_DC2EB1C044207A5A3E795ABF25717F11; // 0x1AF0 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_AF6A1F314E9DECDC39411ABAA92F0BB3; // 0x1BD0 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3DD531014083E3F58520DE818DE22CEB; // 0x1C48 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_320DF58E4B417EE271F1DB8585E4E007; // 0x1D28 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_49C452814A7BF560400A98A22314BE26; // 0x1E08 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_06CD14C444F632E35FB9088B46769D48; // 0x1EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B56872D940F75F7939C9489462542942; // 0x1EF0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65388ED645762ED916ED5AAF317F3590; // 0x1F18 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_BFD341104226B7F01F29AB994E9FF86F; // 0x1F90 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_1E023E9E443D0B6502FDC6AAC136A0DA; // 0x1FC0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_CC908E8B418474BBED2B9981DF8F2729; // 0x1FF0 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3800596941F65F07EB8C20B7B01428A0; // 0x20A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48979A664ADD58333583F58271DA5435; // 0x20C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A08E06D349ABB91F5248B3839119153D; // 0x20F0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_45DFE2D5457EE8BEF046DCB079F9A877; // 0x2168 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_F75BF9714CFAEB5EC3164BB5CFE57071; // 0x2198 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_48581D004F2188874711F79DF80F640F; // 0x21C8 (size: 0xB0)
    bool isRadarOn;                                                                   // 0x2278 (size: 0x1)
    bool isAltGunner05Firing;                                                         // 0x2279 (size: 0x1)
    bool isAltGunner06Firing;                                                         // 0x227A (size: 0x1)
    bool isAltGunner07Firing;                                                         // 0x227B (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleshipC_AnimGraphNode_TransitionResult_552DCCE54AF499966E34EEB7651D67BE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleshipC_AnimGraphNode_TransitionResult_BF5D8AFB4693590CCCF4FA9025CC9A52();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_BattleshipC_AnimGraphNode_SequencePlayer_AF6A1F314E9DECDC39411ABAA92F0BB3();
    void ExecuteUbergraph_ABP_BattleshipC(int32 EntryPoint);
}; // Size: 0x227C

#endif
