#ifndef UE4SS_SDK_ABP_SubmarineC_HPP
#define UE4SS_SDK_ABP_SubmarineC_HPP

class UABP_SubmarineC_C : public USubmarineAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_2727C04845C7A4730D1EC8B55C7F0FB1;               // 0x0398 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7D038F3C465AF3C40F084EB4D5604725; // 0x03C8 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9B0B76DA4D830E3F62CDA69FFBBC6A68; // 0x0440 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33EE30494D063F3DE5C423B526046F03; // 0x0500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8280CE8B4C3493E573F3F5BDC794F1EE; // 0x0528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2D3B47BC4688F3AE3F333BA8F91BD415; // 0x0550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_07E3728C412C10BEAD34CCBA5ACA000E; // 0x0578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EEA90E5C42B01F16F3748C8B6B249AD3; // 0x05A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EA064C42425DB4907ED94FB612CE3043; // 0x05C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4084E65F4ECD4AC9AF899887AFEF9F67; // 0x05F0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_388AB7B448890096AE9DAFA8D149645D; // 0x0668 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E4E2102F419ED8778640EDA4C69C9882; // 0x0698 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_C7BC936441389530DD0748A4DC746350; // 0x0710 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6D1FDD99493C068399CDA38C90E1392E; // 0x0740 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_10C7F32046B724C9051438B9B699E8AB; // 0x07B8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8DCBDE9A4201B093D980648156790D68; // 0x07E8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_51CEF53D419D58296AB51CA5EEB7166B; // 0x0860 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9FABC11D46059457D97638B0087E26F5; // 0x0890 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_05DEC4004DD995BC4BD98F8A64CD24E3; // 0x0940 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0074377B45A2EC8FC2EDEB84B784650B; // 0x0968 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_266F30F74178B060D849D6BF0306116D; // 0x0990 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F436CB5E413CA3622B3AD99744ED532F; // 0x09B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B6779C3D4548B59F24D405A9722774D2; // 0x09E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7A72C5AA44ACF0C6902A748E023D9986; // 0x0A08 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_874E29CC43E1B3F6FA9F819373FBF6AF; // 0x0A30 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3F0317E2442C5075E33FA1B33086D214; // 0x0AA8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31EE162340D1473F81056E8E9786A49E; // 0x0AD8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_90D080614277B91862F3A5B8C3D2A4A4; // 0x0B50 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6D13AB7E4331CD331B88F180B53CEEF6; // 0x0B80 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_EA2332814293FC91B9BE59B82A3B97F2; // 0x0BF8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BBD4F9174B56BC0A2AD07D9F87C455D5; // 0x0C28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6C697C054E7977AEB19F259FBABB3FD3; // 0x0C50 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D4150089414B92508D4A92BA1D79A878; // 0x0C78 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_63547E1D4EB06CDA4C35C68471CDF037; // 0x0CF0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_389C826346A9EEE45D95839F5D591437; // 0x0D20 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_839A2AB24D0F3DC9AF5B55B58D748537; // 0x0D50 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_58B88DC149842DECFBECE0997B7E3C60; // 0x0E00 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7B5F85A548D0E889B4727AAD1F3D9878; // 0x0EC0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_70AA66B04ABBD181CB3001BCBEA6EA61; // 0x0FA0 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_64141697413675C46591CE8E250AFBCF; // 0x1080 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_497EBB154C941D9D12DC158F38C06310; // 0x10B0 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_82E7B3A145F40950C12B569EB0237401; // 0x1160 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36C69254481E5C286305A78237B8B80A; // 0x1240 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6A06E5074E23EA883F2F3F878A87C1B3; // 0x1268 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EE6876224DDBF140ED3D1C950A43B21D; // 0x1290 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A85E5936497D9D88ABA877843C39C507; // 0x12B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EEF745BD4815B9C9D19330896C6BDECB; // 0x12E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_644753EA4B4414D4C641ACBB8CCBCBB4; // 0x1308 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9B3039A2440589F0B72E20AA8ED49B78; // 0x1330 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_629161C5483F389C4BFC25A2DC69DE1B; // 0x13A8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34487C7649C92E92D20C04A4974D5DCA; // 0x13D8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_57B4634B47E17088B90015B286E3AB7E; // 0x1450 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F45E6C0147AC3C98C1005D89EC9ABBBA; // 0x1480 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_9FE3DFE14FA15A4094A501A44C60DB0D; // 0x14F8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_FE7EB40044051EAA1C71D8ACF0D02400; // 0x1528 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_525A619640FA8FF492E99E97710EB081; // 0x15A0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9742BA7546E5F983B4A314807CF71E68; // 0x15D0 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_319747A24873CCA64E50F08F50CD8A62; // 0x1680 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C7FCD4FD42F090D204B5FBB16B877BE1; // 0x16A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FD76EE0C427C1116E6D9AEA510B39617; // 0x16D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A55C233B4FDEE1012226CD8D6412AD52; // 0x16F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52309E814092BE46605A368A6C2C53B7; // 0x1720 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31B0ADAC4B86302391FDEEB7E03DA982; // 0x1748 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_925D708D4F3C61791A900A9DB3405EA2; // 0x1770 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_332D72A34E94B571B76638A92C058345; // 0x17E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E2141E6F40F5A3B4A4B75694AB0B8649; // 0x1818 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_89A637344982C9F0C447F5BD1E141EAE; // 0x1890 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DAB9BEE34C6E90DC5CAEB196B72C2D6E; // 0x18C0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_B8D16D29407D2003A88483AB56F3BB24; // 0x1938 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7121E50D4284265B9A51DC8D23722B6F; // 0x1968 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_07D616294216FE531BC3B1AE8E58F7EC; // 0x19E0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_C356E77D4911E37EACF15B9D8D97C216; // 0x1A10 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BE93D5CE41B4844D234BFFB227FEB254; // 0x1AC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B3A6FEA94660FF9ABAB2E095119E0143; // 0x1AE8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F90E3C904AD7F49631C481866EEFD6AA; // 0x1B10 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_54A68EF545E383BDAED6238060138F8E; // 0x1B88 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_46331B3A49AC657B41DA9F951D680860; // 0x1BB8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_F6B5734849F2D4868467389FA20366D9; // 0x1BE8 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31EF50D74731ABFB65F228AC2AD3D240; // 0x1C98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4A4A1429486165872655E69761EB100A; // 0x1CC0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D1BBB695428482F992E772A0B7DAFE0D; // 0x1CE8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_424D780B4BF61EA143B40E9A500B2C92; // 0x1D60 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_60760FEE4289CB0A33E43EA5A8F4F577; // 0x1D90 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4D72223A4B86DE4B5E2F2A8DA2A14A6A; // 0x1DC0 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_01CC569A473FBAE3AF7916B626778D20; // 0x1E70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1255D17749B73C669E22D0AB270F540B; // 0x1E98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9F0264C6414E6A71ADD5DDAF3C218E4B; // 0x1EC0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_1D1889964A64B42CCD979A91F5D3A9A1; // 0x1F38 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_938F156147FF1CB3A2A598A32DA9C602; // 0x1F68 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_E62DE3D64F90DF32B30073ABDB4ED086; // 0x1F98 (size: 0xB0)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_BBD4F9174B56BC0A2AD07D9F87C455D5();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_F436CB5E413CA3622B3AD99744ED532F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_B6779C3D4548B59F24D405A9722774D2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_266F30F74178B060D849D6BF0306116D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_36C69254481E5C286305A78237B8B80A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_6A06E5074E23EA883F2F3F878A87C1B3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_EE6876224DDBF140ED3D1C950A43B21D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_A85E5936497D9D88ABA877843C39C507();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_0074377B45A2EC8FC2EDEB84B784650B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_EEF745BD4815B9C9D19330896C6BDECB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_644753EA4B4414D4C641ACBB8CCBCBB4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_05DEC4004DD995BC4BD98F8A64CD24E3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_319747A24873CCA64E50F08F50CD8A62();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_C7FCD4FD42F090D204B5FBB16B877BE1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_FD76EE0C427C1116E6D9AEA510B39617();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_A55C233B4FDEE1012226CD8D6412AD52();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_52309E814092BE46605A368A6C2C53B7();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_31B0ADAC4B86302391FDEEB7E03DA982();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_EA064C42425DB4907ED94FB612CE3043();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_EEA90E5C42B01F16F3748C8B6B249AD3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_BE93D5CE41B4844D234BFFB227FEB254();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_B3A6FEA94660FF9ABAB2E095119E0143();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_07E3728C412C10BEAD34CCBA5ACA000E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_31EF50D74731ABFB65F228AC2AD3D240();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_4A4A1429486165872655E69761EB100A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_2D3B47BC4688F3AE3F333BA8F91BD415();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_01CC569A473FBAE3AF7916B626778D20();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_1255D17749B73C669E22D0AB270F540B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_8280CE8B4C3493E573F3F5BDC794F1EE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_33EE30494D063F3DE5C423B526046F03();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SubmarineC_AnimGraphNode_TransitionResult_7A72C5AA44ACF0C6902A748E023D9986();
    void ExecuteUbergraph_ABP_SubmarineC(int32 EntryPoint);
}; // Size: 0x2048

#endif
