#ifndef UE4SS_SDK_ABP_Submarine_HPP
#define UE4SS_SDK_ABP_Submarine_HPP

class UABP_Submarine_C : public USubmarineAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0390 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_E9FDE16A4C17292E7986B7813E8501A3;               // 0x0398 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_90162977413FE3E6313D3AB4740C5EEA; // 0x03C8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9A59795C48BE9708E8D66D890CDF7E48; // 0x04A8 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_02493D7F46289FB7F97D4DB1B7782C9F; // 0x0588 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_768D23D94687C81B30AA98989C8E2843; // 0x0648 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3715613F4FACE05CB14928878F422317; // 0x0670 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98E290EE42F04292F55FA392A503D31B; // 0x0698 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_A8B303E4443F21448E6819858267E7F6; // 0x0710 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_FF90BCBE46D185C62CD7408FBB3E9D37; // 0x0740 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_235F56E3433D0408C0EDF486943901DC; // 0x0770 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_CCCB0B9D47063E6430FA44BE678488AD; // 0x0820 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E640764C428B036FB1F9FD93E3FD8780; // 0x08E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_07AC9E5844B978424E198A8A66B55DBC; // 0x0908 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E3CAC12C450349717095A1B70EA50A61; // 0x0930 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6625CE69480AB33B0AD00A952B4984D4; // 0x0958 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BD8DB35244E3FB77BF125587286AE1DF; // 0x0980 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C55C5F254D103324172634B787606FB0; // 0x09A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D94069814B5AACDE94F1BFBC5FD34902; // 0x09D0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_DFE0FE654630B417FFD83FA454EAD5B2; // 0x0A48 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8F48FDF947B04F4EF5D74595B85C482E; // 0x0A78 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_CC9DCEC9404F7EF6E9312E860315FB28; // 0x0AF0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_AD8551F04C6C60DD94B838BFFA5C26D0; // 0x0B20 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_7A4F5A7245AF2D7DC65A788E18867391; // 0x0B98 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2FC9F0EA42C5E85F586B94B1CEE62B23; // 0x0BC8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_FB01799B498DF292BAE213B7425E0D12; // 0x0C40 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_CE81EA984559BF4D47DDDD8B38A8AF46; // 0x0C70 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8E6B511B47B8A513040F07A5B92D4D6C; // 0x0D20 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22B26F674C39C196E5637B8C983D0CC6; // 0x0D98 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8D7AEE4A41814559CAB06D88CD81C41F; // 0x0E78 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C313569740F1D35E8F88B280663E9C0E; // 0x0F58 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_0E2127B64BF1EAFDECD793A2FD8966F6; // 0x1038 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9FCBA3704F0F02A43C63EBBE20852CAB; // 0x1118 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C8A8EEF745C62F47C1A054BCE5674C4D; // 0x11F8 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D1DB8AE44F7E24FC669F59AD9530AF81; // 0x12D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61427C0C423F95F6D9AF6D8B5702DFA8; // 0x1300 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8E7F83B84D1D141831F3E181B0E4D558; // 0x1328 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8EA34DF64E7D759394734C98B33B1D83; // 0x1350 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FE5E7924451C1AFF42D220A1CBB984D9; // 0x1378 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E8FA49494DD6FB9AB143F8865C7DEBBB; // 0x13A0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_FF7C5CF54D740A7193A0EEB03C84BE4A; // 0x13C8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_BC1B159547304390855A1E91486CB237; // 0x1440 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0677B33D43C2B64D38B5AD82D588F256; // 0x1470 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_FFBA045E4A964534D1B3F88659DB0D03; // 0x14E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F8E9207E43D1D8B875E5E19C00C7AC85; // 0x1518 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_5F5F1E864B1F990D387EC488C012775C; // 0x1590 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_093854A945E465985F54E9AC299253FC; // 0x15C0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_F7411E624DCEB2A03CF0C394E563605F; // 0x1638 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_C989FADA4CB79F45CDF911A38CA10B63; // 0x1668 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F4A0933C46ADE7EF049B398BF114F054; // 0x1718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BB3F8BEA4E248973CF35D085287BC8C7; // 0x1740 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AEB920F34561686D122D73BC806CAE0A; // 0x1768 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60CD37B5483AB5392DFA0AA084C537E4; // 0x1790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_232C81BB4C47950D7A3D31BF2A4CDCDC; // 0x17B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8877EABE4885C42420B0F6818D3DFE3D; // 0x17E0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C27CDD0F408935719BE0198DC7CC2D8A; // 0x1808 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_55194A8644988CEBFA433EA18295E758; // 0x1880 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3D5BFE494B9AA51896CC7BA98320272F; // 0x18B0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_959C4C2E48C63CAE5BAC16B2AD90FEE5; // 0x1928 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6933D4204749285CA98404996CE77AF2; // 0x1958 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_38BEC14A42E6D3BD4152D99E14D43E82; // 0x19D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_AF2D25C34A461535BC4277B1549B5766; // 0x1A00 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_EAB5BF96460E11731F7EE3A54235FC42; // 0x1A78 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_BE68DBEA498ED0C55B5C98BB0214BB34; // 0x1AA8 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6CB224D84B50E618172028B633142570; // 0x1B58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6370D1BE459CD03B3D99D3BDDCD97FA1; // 0x1B80 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88CD0ABD453F160DCADABEA48161AE44; // 0x1BA8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_9B7B646646EEB00B331C7ABBA836D778; // 0x1C20 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_3594A6B54B978B0C4AD9149A89B07CA5; // 0x1C50 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_843701F045D677160B8EAA805A7EDCEB; // 0x1C80 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8D7737584D852970ADC69199180F6AD4; // 0x1D30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_741A1CC449DCB13E73C373B80A0A9902; // 0x1D58 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ED7C69CE44D159095A338C965FE3A2CF; // 0x1D80 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_F91862594F0C25F16A5CE089A26EA2BA; // 0x1DF8 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_7F39A9AD4BC8A4203B931292053911C4; // 0x1E28 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_A1736D194721AAA51D605DA67BC615A7; // 0x1E58 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12ED9A5343A16B961A2EBB8D372C27B9; // 0x1F08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E71C0464447EF0014912019D025221FE; // 0x1F30 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6DAF7F9B49D08D3008954BA1AA5772DF; // 0x1F58 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_BCDE640C4EE377F7B90033BE18306809; // 0x1FD0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_90A84A92471620DEC5D483873F406D3A; // 0x2000 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_A81296C148FA3845067053A54B838B64; // 0x2030 (size: 0xB0)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_E8FA49494DD6FB9AB143F8865C7DEBBB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_61427C0C423F95F6D9AF6D8B5702DFA8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_D1DB8AE44F7E24FC669F59AD9530AF81();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_F4A0933C46ADE7EF049B398BF114F054();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_BB3F8BEA4E248973CF35D085287BC8C7();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_AEB920F34561686D122D73BC806CAE0A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_60CD37B5483AB5392DFA0AA084C537E4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_232C81BB4C47950D7A3D31BF2A4CDCDC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_8877EABE4885C42420B0F6818D3DFE3D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_C55C5F254D103324172634B787606FB0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_6CB224D84B50E618172028B633142570();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_6370D1BE459CD03B3D99D3BDDCD97FA1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_BD8DB35244E3FB77BF125587286AE1DF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_8D7737584D852970ADC69199180F6AD4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_6625CE69480AB33B0AD00A952B4984D4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_741A1CC449DCB13E73C373B80A0A9902();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_E3CAC12C450349717095A1B70EA50A61();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_12ED9A5343A16B961A2EBB8D372C27B9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_E71C0464447EF0014912019D025221FE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_07AC9E5844B978424E198A8A66B55DBC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_FE5E7924451C1AFF42D220A1CBB984D9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_E640764C428B036FB1F9FD93E3FD8780();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_8EA34DF64E7D759394734C98B33B1D83();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_768D23D94687C81B30AA98989C8E2843();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Submarine_AnimGraphNode_TransitionResult_8E7F83B84D1D141831F3E181B0E4D558();
    void ExecuteUbergraph_ABP_Submarine(int32 EntryPoint);
}; // Size: 0x20E0

#endif
