#ifndef UE4SS_SDK_ABP_MediumTankWar_HPP
#define UE4SS_SDK_ABP_MediumTankWar_HPP

class UABP_MediumTankWar_C : public USimVehicleGunnerSupportAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0300 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_43CF2516482D4B0456DED29602B8F41B;               // 0x0308 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99ADB04B45306D4C1BB70AA1800342E1; // 0x0338 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_FA8914F549A94155BBADD3B3C4FBE6FA; // 0x03B0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7FD53B674479D3FF5628E6888E517F0C; // 0x0450 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C418739D42ABC80453A866814DCDE37B; // 0x04C8 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E0B7BB74492646C3C7B28A9567977C23; // 0x0540 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_699807924EF27FAEA24A1C8A7FFC2A82; // 0x05B8 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3BA9BB6D4A61ACC82F944F84DDD12242; // 0x0678 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_CD21DFE444110EA3636E8FB204D828A3; // 0x0758 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13230142423F52DA51A10F80357D80E6; // 0x0818 (size: 0xC0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_1C120B6F44D27D939DCF1888AFFBFB80; // 0x08D8 (size: 0x188)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_943C436B4621826BAFA1BCB0AD2CEC95; // 0x0A60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FF9E01B643624F11AA80808F28EA98E9; // 0x0A88 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_890FC7E34020AF4F26088382B4794767; // 0x0AB0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_34029B2B43E23199F050FC95E6DA3E30; // 0x0B28 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_62DF8D85488D045E7BFF73B71B3A2A8B; // 0x0B58 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_F6B7CC0643E93FADFEB35CBF3AFA8891; // 0x0B88 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FA4C093E47408AC8F32A69AD98F2D32F; // 0x0C38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_129D2D444ACF67A02EF160AABD147140; // 0x0C60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F7D477FE42FC8A0B8B819EB7710692DA; // 0x0C88 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3E38667F4333908AFADD008D5603F01A; // 0x0D00 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_22EFC82746DB16774A088A944304C905; // 0x0D30 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_0B4F1A3C409AF301711D519BF845B3FB; // 0x0D60 (size: 0xB0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_025A1F74430F800ACA1BDEB030B01C84; // 0x0E10 (size: 0x188)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_556377D44EBB2F5F34B31A9191FB0417; // 0x0F98 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_952ADD8847692036A9A006A1C6141C57; // 0x1010 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67A773BB4A9859411BF2F2918E1CBF40; // 0x1088 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9F06891A4908396A3D5CC4BFFC6A72E3; // 0x1100 (size: 0xA0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6AA8690B4A075A9B74233B9E485C6722; // 0x11A0 (size: 0xC8)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8C51D980470B1F052E931E94BDFACDDB; // 0x1268 (size: 0x188)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5F486CA743861225C227758AFC097F71; // 0x13F0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3556B884445BA3A3DDDB969CE5BF5870; // 0x14D0 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_F23EB8A3429AC3FC8025F3B3D5212286; // 0x15B0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98F8A7C8403D790DEABD0281B81D3702; // 0x1650 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_917FF3B2443D22C2E8CBE3B0D4D559C4; // 0x16C8 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_642CCE494945E2CFC311F3A8950EBD0B; // 0x1740 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_CB58122C40FC67D054C7D7851CC700D0; // 0x1820 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5EC3C3C14CE36123B0A111A627856D8E; // 0x1900 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0876B654451DBD92CB864FA8B68F4812; // 0x19C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50BCAF9642508A6A383555956DAB6FDE; // 0x19E8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E682EF08471C23884D45B1B73280ECC2; // 0x1A10 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_50320E3F4AB2F12E05F1C985AAFF93D5; // 0x1A88 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_81EAE3724B982AB697828A9D0F3C1ED7; // 0x1AB8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7CDFD30D47185F16EC5D67AE4679DAF5; // 0x1AE8 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32EB69124BC95AD5371047962701781B; // 0x1B98 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_68E993784AF3EA419CAB7FB5A588FA54; // 0x1C78 (size: 0xE0)
    float Test;                                                                       // 0x1D58 (size: 0x4)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MediumTankWar_AnimGraphNode_TransitionResult_FA4C093E47408AC8F32A69AD98F2D32F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MediumTankWar_AnimGraphNode_TransitionResult_0876B654451DBD92CB864FA8B68F4812();
    void ExecuteUbergraph_ABP_MediumTankWar(int32 EntryPoint);
}; // Size: 0x1D5C

#endif
