#ifndef UE4SS_SDK_ABP_DestroyerC_HPP
#define UE4SS_SDK_ABP_DestroyerC_HPP

class UABP_DestroyerC_C : public ULargeShipAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_564A2548419EAA2DE60FC296B8C46102;               // 0x0378 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_E17BCF6D4C954D6B7E4AE393F8AF2F1D; // 0x03A8 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0EAD77DC4671E8ED1123D18CB05E9D6C; // 0x0468 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FF513C0D422DA360846120B88083FAE3; // 0x0490 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8BD5C71C49F7BC05A7BA1F97F4DF71FF; // 0x04B8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_CFB4AD21451E99B6800CDE81B6F1E0BA; // 0x0530 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_DD9D8BA446E6176FC5C2E68ED0DF8CCA; // 0x0560 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_F6A4DBF64936ECBF2DEE3D868B84D983; // 0x0590 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CC0DF3F14CF955A64E074FB9CA95AAD8; // 0x0640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3348FDE842912D379A6BC588A45BFD90; // 0x0668 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E14D218C4393CCA2666D02A03852250A; // 0x0690 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_8F293B5048760D7511AE6080C7E54462; // 0x0708 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_F60DF76147E5E6A98CE619B3836F050C; // 0x0738 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_53A597214D10BE7D2C12D497B56CFB35; // 0x0768 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A261A3124B5E46995FE3C1B686969539; // 0x0818 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D9EC98C54D1B1BFF47967AADA04D7C16; // 0x0840 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A456A9984E144CDC2B6A98B37374EAB7; // 0x0868 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_1483E283441BC43A0192BE8CA5E7C4C7; // 0x08E0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_F56EA31042B862F92BB71F8263771F0D; // 0x0910 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4239A0BD4ACA2371132ACB8BCBB8D20A; // 0x0940 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_DA0EEE99408F1568C2A20A902AA85670; // 0x09F0 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_B1CD8ADE47C143CABB238DA1114E6236; // 0x0AB0 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_BFD0820D4907A9C5D277E4A77C5F3573; // 0x0B70 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_FE49D3914DED055417DA9C81A8B8F16F; // 0x0C30 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1A21DC81444B1D9D5C530ABB89E794AD; // 0x0D10 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_FC291B6E405B1BB34649409DEF0DB7D6; // 0x0DF0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24AF39CF4C9756376144AEBEF4632630; // 0x0ED0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_92342489413355513F282082FFCF6557; // 0x0FB0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_ED340FF643C92EF630214B9482E94E89; // 0x1090 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6820F40C4C0E6F7EF65BCF945AEC97A1; // 0x1170 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_B4DBDB2A4B13EF71AAAF03A3CDD90ADD; // 0x1250 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C6F190C8477F422310267B8B0D25745E; // 0x1330 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F2920E5A43A0A1BE2BEFFF821D4D91AE; // 0x1410 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_65E23FFE4BDDBBA56668C1933C40868D; // 0x14F0 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_0DEBB166485EE615BDECE8A3FFDE4D16; // 0x15B0 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2960ED4F40D5DC106644C2AEB89810CA; // 0x1670 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_70FF0C804CF214ACBEF028B0B3BF390A; // 0x16E8 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C7EC4E014429EB37CC66598348898B3C; // 0x17C8 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ED540B42488EC543B52EEBB486D157F2; // 0x18A8 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2276052145F38D59026CB192612665A2; // 0x1920 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7FFF24754A2C21A709F90BB777C1EEF3; // 0x1A00 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_907D32D747D00B28F3BA80965C26778C; // 0x1AE0 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6680558347F69A0C2DF842AD6D08A338; // 0x1BA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CF1D55CF47817CDC5EDE78BA14CD97BE; // 0x1BC8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F942498241767AD8F3601AAFC8CB5120; // 0x1BF0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_59AE09144DEC114FED144983E78B0F39; // 0x1C68 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_36BA2CE74005533104B555828EC98DCB; // 0x1C98 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_0F77CFDB40EDC5E340EE71943D100047; // 0x1CC8 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35B783774110C020E5B86B95426220D4; // 0x1D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6C6B219D4C94017364E4C189C002A9EE; // 0x1DA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5F589AD3466EA0291007CF91A9E48066; // 0x1DC8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_7DC90E264BCC88143BC84AB361FB8AD0; // 0x1E40 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_6C9E61DD4660638AAB7B97979DD92E6A; // 0x1E70 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7FEDAEEC41CDD724652BEBAD270334D3; // 0x1EA0 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_C6CF84C5402B7F7886F22F9202D845E4; // 0x1F50 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56B22E6E4F66EE8F2159EAAB620930D5; // 0x2010 (size: 0x78)
    bool is Radar On;                                                                 // 0x2088 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DestroyerC_AnimGraphNode_TransitionResult_CC0DF3F14CF955A64E074FB9CA95AAD8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DestroyerC_AnimGraphNode_TransitionResult_0EAD77DC4671E8ED1123D18CB05E9D6C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DestroyerC_AnimGraphNode_TransitionResult_A261A3124B5E46995FE3C1B686969539();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DestroyerC_AnimGraphNode_SequencePlayer_ED540B42488EC543B52EEBB486D157F2();
    void ExecuteUbergraph_ABP_DestroyerC(int32 EntryPoint);
}; // Size: 0x2089

#endif
