#ifndef UE4SS_SDK_ABP_LargeFieldGun_HPP
#define UE4SS_SDK_ABP_LargeFieldGun_HPP

class UABP_LargeFieldGun_C : public USimVehicleGunnerSupportAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0300 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_BEFD9CA94FE9D71A42733BACA379DDB6;               // 0x0308 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10F509E94229F406845699A66CB79986; // 0x0338 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AEDACAA7418C32637853F28D486EDD60; // 0x0360 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C6ED22A049E2A34B0C9B59BFBC0C616A; // 0x0388 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24F2A18044773AB9D3E5CAB16386F687; // 0x03B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4944CC67454BABBBA8E28B95DA8BCCC6; // 0x03D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AEE053214C78639E827F30B21CD89D21; // 0x0400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_08C01F75419E3452733C58A933332842; // 0x0428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9A059F4A40D72993C5CB8EBF55FE941B; // 0x0450 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38D118124025C6950CAC799924E1EFEC; // 0x0478 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_9C11AFA043214FBF244B21BEEC6D75CC; // 0x04F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F873FFEB40F681AC4071C6A973C3EA90; // 0x0520 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_6C841DC24726403E2E2B43B29409C956; // 0x0598 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_B950E2CD440CD4EFD38691B60EB004F2; // 0x05C8 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_FC92DCC343FA26E461564A859928EB88; // 0x0678 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B173B1194ADFAEF63A3E8281890855C7; // 0x0758 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C4A71D3F47FF6C82E69AA1BE52B6B0C2; // 0x07D0 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_D8B9B3474A7209D9442E63B24D5C4B49; // 0x0848 (size: 0xC0)
    FAnimNode_StateResult AnimGraphNode_StateResult_5A86988E4802B5E103405BBE1EBCC6F0; // 0x0908 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_216E8D524E306DA8D28DA399ED4A1E24; // 0x0938 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A8E02B7A46BFB13E339BDF8E9DB7AEF5; // 0x0960 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6116C7AC4F55F6AC0E2AEB8C55BE8310; // 0x0988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38B1A99F40B5AAA93BA3BEBA6B1F0F32; // 0x09B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D8ED80AD4F8B46028B3693BC0A97ED3D; // 0x09D8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_BFE936874C3E4BA7CFD120B2908998FA; // 0x0A50 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_493B9B8342B3B4D2F78C138F254DA75B; // 0x0A80 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_E008E08F40BD427AF6DE778B67AF79EA; // 0x0AF8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CA3A22A6442C6F536201ACA627DCC66C; // 0x0B28 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_8536FDED4BA42D0B9995EC8ED9EDB216; // 0x0BA0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_AEFAEAAB45F4569AC41CF0BAA2E6FE1A; // 0x0BD0 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3FEC5A3E44897E24458923958EDBC229; // 0x0C80 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7F26F5FA4EB8FF16D6D4F88668231EAD; // 0x0D40 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_B226BBF44FACE3DA8159908858677446; // 0x0DB8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E0F0A01742B7967230A402952AFDA5B1; // 0x0DE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86D22A9245B90A0CD0AF018ED5782A24; // 0x0E10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C68688224C503DB4A49F0BA274558487; // 0x0E38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DED81ADA45B2F57F635A1590D3ACEBA8; // 0x0E60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1AC2880E46BECC32A436F5AC4748432A; // 0x0E88 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_5C46295B46E35E19338061A441F14FA4; // 0x0F00 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5F66876D4A4F2EF39058AA8981ECEF53; // 0x0F30 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_E9B0507D4ACE7407DD9CA6B5DBF776EA; // 0x0FA8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0FB881B748087814F99BF19C651B9893; // 0x0FD8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_BD8D66244347E3DA6AC51398EE777847; // 0x1050 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_71F3EB45428DD0693C7CBBA6205742A1; // 0x1080 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_51EC42DA43FAF915927AAAB6FEF41B9D; // 0x1130 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_137C4A68452ACBE253E7CFA125491126; // 0x11F0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_C4706810417DE1532DFE688623624CF2; // 0x1268 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_718E74DF4EA23E8EBB420689EEF56A12; // 0x1298 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71E2E4D34054F8A83935B3B2EF383118; // 0x12C0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77A7E13347D6A8D656DC9EA17E76FB97; // 0x12E8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_A929609D4BDDABD34B95ADAA23019FC4; // 0x1360 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_492A1C1C459575F52AC443A3DEE39238; // 0x1390 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_82078FC54B434A5E19E5FDAAF3CE3C97; // 0x1408 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_C719E4B145B329FA40D3CE8C3F9A135D; // 0x1438 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_CDC339984121495601639FBA31B98F21; // 0x14E8 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55F3BCF1474795BAE13C828C9F8DF7ED; // 0x15C8 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5A06E31643001C9542C710AD585C5312; // 0x1640 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_171FD9434F3F5D489024EDA250498FA8; // 0x16B8 (size: 0xC0)
    FAnimNode_StateResult AnimGraphNode_StateResult_B27CFB6F4B5CD9BFCF0D9E8FA82D0A7A; // 0x1778 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5664EE7E4FC9E5503A96B1AA660F4F25; // 0x17A8 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6F2005AB43579EF615C70199A22A4714; // 0x1858 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8FE0124944CAA4CD28F7BFB1DBD4636C; // 0x18F8 (size: 0x78)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_63E10A7C404D5F22492E379D5752F542; // 0x1970 (size: 0x188)
    int32 WheelRotationSpeedFactor;                                                   // 0x1AF8 (size: 0x4)
    float Reload Play Rate;                                                           // 0x1AFC (size: 0x4)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_SequencePlayer_B173B1194ADFAEF63A3E8281890855C7();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_TransitionResult_AEE053214C78639E827F30B21CD89D21();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_SequencePlayer_C4A71D3F47FF6C82E69AA1BE52B6B0C2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_TransitionResult_4944CC67454BABBBA8E28B95DA8BCCC6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_TransitionResult_24F2A18044773AB9D3E5CAB16386F687();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_TransitionResult_C6ED22A049E2A34B0C9B59BFBC0C616A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_BlendSpacePlayer_CDC339984121495601639FBA31B98F21();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_SequencePlayer_55F3BCF1474795BAE13C828C9F8DF7ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_SequencePlayer_5A06E31643001C9542C710AD585C5312();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_TransitionResult_AEDACAA7418C32637853F28D486EDD60();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeFieldGun_AnimGraphNode_TransitionResult_10F509E94229F406845699A66CB79986();
    void ExecuteUbergraph_ABP_LargeFieldGun(int32 EntryPoint);
}; // Size: 0x1B00

#endif
