#ifndef UE4SS_SDK_ABP_ATRifle_HPP
#define UE4SS_SDK_ABP_ATRifle_HPP

class UABP_ATRifle_C : public UWeaponAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0280 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_04051CE84917E9D3AF2D86AE635BB6C2;               // 0x0288 (size: 0x30)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_63CEF9A7471D61021234E188A181B77E; // 0x02B8 (size: 0xB0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_70DE23FF4D0E7FFAD6B9088848320CC6; // 0x0368 (size: 0xB0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4967CD42411824D7EA65B98BA959A5A6; // 0x0418 (size: 0xB0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_104701204B52AD046CE2EA87FAA184F0; // 0x04C8 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39D4ADC5483B2D8087CA4B99FCAA5507; // 0x0578 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9684906745DE4D688785DC8B293FF123; // 0x05A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DC82AEE142B9A6311DFBC4953280A6A1; // 0x05C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_783513B44C30D4E57DA666BA02FAFA99; // 0x05F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EFE21E2E44CE113AEF7DB386B6025755; // 0x0618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9F9662E543F0377DFC9616A955872F00; // 0x0640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75EE0BA8447D3A6AA34DD89D18649BDC; // 0x0668 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_4A6AB4FA40CE99B7A4BBA0BBBE563DAF; // 0x0690 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_814EC75C43ACF1DFC0D9C89C4B8CECD9; // 0x06C0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_B17A81F54D945F22E115F3B3D7F423F1; // 0x0738 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C82B478044283FC652800D9B64E9EE9E; // 0x0768 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_9BBA55074D862DCC5C595A8B8B579B4D; // 0x07E0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADCC525840E7115AF1B79AB5D7F02B1A; // 0x0810 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_8A515FF7487227DEB2C16CA2F5A427A6; // 0x0888 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1939F849490F031830E7FFA15A02D4FD; // 0x08B8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_4CA1BBF0432DB40BD91567B43A96EF87; // 0x0930 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_E03481B64172A036910DB38021549020; // 0x0960 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_351DF6B944507BCE5FD0DEADB60EF068; // 0x0A10 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_E3D3C0B847F39ABBBBAFD1912858F714; // 0x0A88 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6BDE65DC440077DE2E9C99B7FDA023EF; // 0x0AB8 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_774F551849C6D447203A39B05CC2716F; // 0x0B68 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_664158D948A29F3EFC7FDB853BBAFF3B; // 0x0BE0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1454389543E045F8418E248CDC0944FE; // 0x0C10 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C60D2F5A414F72DB6DE00F916F79CA2A; // 0x0CC0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_18C7F0FC4CC84CFA251B0C9B55451933; // 0x0D38 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6BE260A24BEBBF53566F3AA8D24F41BC; // 0x0D68 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CA29D77044353FD8122E518C65AD1F07; // 0x0E18 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_77733714401E833DC0A28D8A50418A52; // 0x0E90 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_691C96D1449FB187714215B1EDE2635B; // 0x0EC0 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B41E8BF94BF897D89A63DBB26CC04379; // 0x0F70 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_55EEA1794E08DE672B4E05BB619F1F97; // 0x0FE8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_DEE5B8C84ABAA61D3A79E49930EF42F4; // 0x1018 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A795BE424179744E0D4B399520FF272C; // 0x10C8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_8A2F7A8F41AA63AAA085A4B0F32A64AE; // 0x1140 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_011B6BF745FC347C51145BBAD728C020; // 0x1170 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1C6179D74BE8A3E44C84F891D3C76A36; // 0x1220 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_1C26D7684DA13805DE6C518B6FF9D46F; // 0x1298 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6C00AFE747D61546917109B3F6862697; // 0x12C8 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_05C48B934FB3312D72F6B893647A2CEC; // 0x1378 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_2E864273401BEB667A37C4AD3DFD28F4; // 0x13F0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_A2161344407A87ADE3C74F988A527677; // 0x1420 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E9B12EB64A9D4004790CF3B37CDA177B; // 0x14D0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_F97CDDA7426762A1814313A77C999222; // 0x1548 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7133207346CFFF67ADF8FD845E852042; // 0x1578 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1147B2A5400B3047952C9488BC6A1011; // 0x1628 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_C363D5E04297858B8BF46B8EE2946EBA; // 0x16A0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4CA30D67479D11477926F5BC9E74C9C1; // 0x16D0 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6A78D832483915A2E44C8483CFFDDB60; // 0x1780 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_703DCA6445A7B162D56C2EA1B33BA37F; // 0x17F8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_25B4007B42C316ACB994F8946410482A; // 0x1828 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_E6A27D194BA59FA49EF6F48AD885DB18; // 0x18D8 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E9F1EA3247937053471ECC97A0613F1B; // 0x1998 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_9C904CE542BB222CAE3F90844348E253; // 0x1A10 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_14B09BEC4216C1120068B781FAE758FF; // 0x1A40 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2800925A401325DAC5E5458AC0D31BCB; // 0x1AF0 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_08A01CEB4AF2473BAEB44D80B15A8472; // 0x1BB0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1A9A88FF49F1A0C1A015E2BB1DD6DB95; // 0x1C28 (size: 0x78)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BEBC63EA481E8B652BB07EA228F961BD; // 0x1CA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_067D23504E1B3256FB7E0BA90323F2D4; // 0x1CC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3CD27B374C493D05FA6E9D9A07C0A8F3; // 0x1CF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9AB6084B4F7EA613C70F5EBC345FE7A0; // 0x1D18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_166FEBCD41D30A6FA7F03789E6DAF401; // 0x1D40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1D949E2B49D4AB7F34BFB98CC9CF108A; // 0x1D68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7C3C2CDE405F291AE7C6DBB561175B45; // 0x1D90 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_4105D90A405CA256E2BBB5BFFEF7F16D; // 0x1DB8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_822B8B464D65C1B3246B89BAA499C953; // 0x1DE8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_5A5EF7A14D4A52C0D5D87DAD7305A0FC; // 0x1E60 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_696120AA412DA64C78FC9799B488F2BC; // 0x1E90 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_69B6BAF5458EA624D804288EF3EF2F9B; // 0x1F08 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5D14885C47409823867223BB50DF86C8; // 0x1F38 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_080D9F404D7953E057DC6C80CF26ABCE; // 0x1FB0 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6075102C48B4D7231BF33BA455C1EDF8; // 0x1FE0 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_966AF80344992BDE64936B91CFA3FF0D; // 0x20C0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2CD20A444CC24EE06B39D4B3FC303677; // 0x20F0 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A10F662F42DCF579CAF7578482983AD6; // 0x21A0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_698BFE4A478FEFC5837311AD449D7343; // 0x2218 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1F5AC3BB4D447EF486273C9CB80E918C; // 0x2248 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_85827ED14254F4EC88E675814AF58AD5; // 0x22F8 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7B27502543ED62454D9C9DAC58C59CC8; // 0x23B8 (size: 0x78)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ATRifle_AnimGraphNode_TransitionResult_067D23504E1B3256FB7E0BA90323F2D4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ATRifle_AnimGraphNode_TransitionResult_BEBC63EA481E8B652BB07EA228F961BD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ATRifle_AnimGraphNode_TransitionResult_9684906745DE4D688785DC8B293FF123();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ATRifle_AnimGraphNode_TransitionResult_39D4ADC5483B2D8087CA4B99FCAA5507();
    void ExecuteUbergraph_ABP_ATRifle(int32 EntryPoint);
}; // Size: 0x2430

#endif
