#ifndef UE4SS_SDK_ABP_TrainHospital_HPP
#define UE4SS_SDK_ABP_TrainHospital_HPP

class UABP_TrainHospital_C : public URailVehicleHospitalAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02D0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_ACD74D884D9B4E8E5341A9AA6E323B17;               // 0x02D8 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5219ED83450711D2D1EF59B238134FC7; // 0x0308 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33960B2C4106C28E31C890B45745EBDF; // 0x03C8 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_89E44EFB44B7A96B4DEBAA9E8AE276AD; // 0x0440 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_42FDBFF146C6C69475100AB53A38C665; // 0x0520 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1C43768C48D24852041275B6D91EB7CB; // 0x0600 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_ECF9C78441A7DA3483C46D9FB1F25152; // 0x06E0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_AF8301804DA0491803F3BC8E1D552A57; // 0x07C0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F434C78A47F4A68B6F7808AC93D1FE5E; // 0x08A0 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_236CECF54A3911D329100E92905D58FD; // 0x0980 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12BB654143904EC650F6A4A4035B8631; // 0x0A40 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C9F477144CD2D068A3CE7F8AC6F62CAB; // 0x0B20 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F250D8C6492DF989F00A6FA9A195C2BF; // 0x0C00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4AA313B341223E7EA0EAE39F77918A7D; // 0x0C28 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20E6BEE2411663018A48CEBB6430AF38; // 0x0C50 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_F3EB1EC64D54B4F4E223D3937570F84E; // 0x0CC8 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_C610EE904B0C842951AA22B2A3640586; // 0x0CF8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_15FF9DA84C6EE88C3560C285436DB2D9; // 0x0D28 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9329F7A149C981C957B151B4A0BDC91A; // 0x0DD8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D6242ECF4BE15F534F44AAA47B113F69; // 0x0E78 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E450987A404C137A51ED91B89F2D1D1E; // 0x0EF0 (size: 0x78)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39B306904D409C71CEFB8A817BFBB12F; // 0x0F68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CEE09FE14D82AE15DD9C02A917484C1C; // 0x0F90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1914C46146BCDD4C57785FA3D2E21D5C; // 0x0FB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4A408B884990F2C78127D0A208636547; // 0x0FE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25344E9246A86223C0C497B3A51EC507; // 0x1008 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9F771181409DD6FB68A2A78F989DD47C; // 0x1030 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E79E7B3A45009F736A14A6A9E4CE88F9; // 0x1058 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_F38A8FA64E8E73551DCC6984DAF0BBCA; // 0x10D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_548F632C46F3F1A05CBFE795B562E10D; // 0x1100 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3E2DDF2A4D48763D713439BB0C8A393C; // 0x1178 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_06E6B6834587FD8E994778ACD2B9F206; // 0x11A8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3D5C0C6549ED6C50C4AB48804C1759AF; // 0x1220 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_F1AD8A934E762EE7F159B79A064E2FF1; // 0x1250 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_2D8B2CA64AE503CC2049FC8FF04F1E1D; // 0x12C8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9AED3ABA4A6A2C71E22FD5876659A57F; // 0x12F8 (size: 0xB0)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainHospital_AnimGraphNode_TransitionResult_1914C46146BCDD4C57785FA3D2E21D5C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainHospital_AnimGraphNode_TransitionResult_CEE09FE14D82AE15DD9C02A917484C1C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainHospital_AnimGraphNode_TransitionResult_39B306904D409C71CEFB8A817BFBB12F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainHospital_AnimGraphNode_TransitionResult_4A408B884990F2C78127D0A208636547();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainHospital_AnimGraphNode_TransitionResult_9F771181409DD6FB68A2A78F989DD47C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TrainHospital_AnimGraphNode_TransitionResult_25344E9246A86223C0C497B3A51EC507();
    void ExecuteUbergraph_ABP_TrainHospital(int32 EntryPoint);
}; // Size: 0x13A8

#endif
