#ifndef UE4SS_SDK_ABP_LargeShipStorageShip_HPP
#define UE4SS_SDK_ABP_LargeShipStorageShip_HPP

class UABP_LargeShipStorageShip_C : public ULargeShipAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0370 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root_976BFB624F4EC33B95427798E0436A0D;               // 0x0378 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_0B23FED941FEB3B0C01219B230CC34CD; // 0x03A8 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_966D81C84ABABE45FD7E33A5AF003107; // 0x0468 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C968E6BD41BDC5AF0E5CA58D935AF559; // 0x0528 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A7A4EE45446054C8C1BA189DDB64D144; // 0x0608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FE3466E1448903853C9BF19EA83A9ECF; // 0x0630 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CB3448474E545FE01A8340BEBBCB286E; // 0x0658 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_6865A55741E93F2E8ADEC1BCE28378C9; // 0x06D0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_BD64FF2E4A9BA790944EF2A6F21C43AE; // 0x0700 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_D7745F4A417F78160CEDC3A399A2CDA8; // 0x0730 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_C9192D7D4E5353FFA8C4FA85F17BF0A4; // 0x07E0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_52A554194C08A9981DBC599258EA8EEE; // 0x08C0 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_D19C8198434BD0645DE0A6B48D1B0A0E; // 0x09A0 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_B1547541428AE9417A812C9140743FCF; // 0x0A60 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_E0CC6BFB44C6BB8A5623E2A60D2AA3FC; // 0x0B40 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7B51120A4C901FACAF5C36BE7FF6C9E9; // 0x0C20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_985445E248C272A03EAC47AD50AC8295; // 0x0C48 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_FDE28ACA45A14B79A0B4F09DD300C081; // 0x0C70 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_32FBB80A49AF22BC5531919333E03D2B; // 0x0CE8 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_D8B9CDD549584443B9DE40B6FB215A41; // 0x0D18 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6D2B05284F9D987B310A5B9F3C2A3E1B; // 0x0D48 (size: 0xB0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6312AD024A2BBFBF80BC80B04427349F; // 0x0DF8 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_DEFD44F14D2D2AC1909042A8D3016DCD; // 0x0EB8 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_E35F126D4AA1413B8EA124AE9CC435D1; // 0x0F78 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5C7A76FF4B391EFD26F3169E3F9121E3; // 0x1038 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14CA556B45B797ACDE4F8A8B366F1678; // 0x1118 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B31295394A0405F01CBFA3873B52EDEC; // 0x1140 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0DD8537A4FD1694FAFCBF893CEBD60E0; // 0x1168 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_7E576CA044C01CFCA73A57BB9F5D719A; // 0x11E0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_69D58D844F449B3666791B84E3961D26; // 0x1210 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_75EA82734B0F7D52B87144AA9D9578E4; // 0x1240 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_DCCE37E84F33F5A07341278E3414F17A; // 0x12F0 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3073A786426F89D2B3F5CA866E7508C7; // 0x13D0 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E8547EAE4337506B162F1BA6783E2B6F; // 0x14B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6C792B4F4A1C48D855C497A1C14FB236; // 0x14D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FF0B326D4A0CC8BAF8C50CB2E2AE7718; // 0x1500 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6829DA0748D1E6ACF12E6DB9B81C5BDD; // 0x1528 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E4FAE1F74C5ADBEC7B10399C5C0B20A8; // 0x1550 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9ECC780C4D0F39F20CBF4C8DE863AE3B; // 0x1578 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17ADA5FC4C3571C9DE28C08F54BEDC94; // 0x15A0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_C5A5AE494A7DA19D6D2AA8A91D103644; // 0x1618 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_200270DD430501FC9C82A7AE20373BE1; // 0x1648 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_79F1BE6E46351DF198E35E8AF2A68B73; // 0x1708 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F23CD1FC493FD3F3ACCC918B292B9693; // 0x17E8 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_27832DA04EE60A43B4F646884ECBFC1D; // 0x18C8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3622D61E4F538D9D168720A1465B1BB5; // 0x18F8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_8D7E11D843EEC8F2D8F128B42C4C8276; // 0x1970 (size: 0x30)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3F1E747B4BA66B4234BB888AC47F64CA; // 0x19A0 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_88A762554B190A187DF06F80E4229735; // 0x1A60 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_F0C57DB848873A056CCD978827E35681; // 0x1B40 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_CB2C09D746E9C53D4A559395C5D9CE19; // 0x1C20 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_B3A924BE4B3CBD441C2B73A23B0BBD26; // 0x1C50 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75C978914A969C0FD7D639BFCD0C9D46; // 0x1D00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8916BF0041E79F8FB974C1AF030C3976; // 0x1D28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24F2BA094C7823DBC9E83D81D2B8700A; // 0x1D50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0744B0344DABB9D963D3C3898F7BCCD5; // 0x1D78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63F35BA94099047576CDAF86D6611FAB; // 0x1DA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FCF503174347A1EAE94BBAA6BB5608B1; // 0x1DC8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_E0CFB6F44DE983B7598B1D8CFD20C3D6; // 0x1DF0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_DC5D56B346020CFD4263C98B41AB76E3; // 0x1E68 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21D7ADDC4FB22977C86227B389D73293; // 0x1E98 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_E4DEB3674091683D140B2AA5918564B2; // 0x1F10 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7C4E06F141388CF5AB9A38A8E2CEAB43; // 0x1F40 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_D7296674448EB2C4909160A23DAFDB12; // 0x1FB8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1EF08FB1438A6B8B7D0EE3966B26DF42; // 0x1FE8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_CBF41CFF4CF75DF0C3128785989FF491; // 0x2060 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8903CEDA4CBDF267C9ED17A65B47A285; // 0x2090 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_592746A04A7D0C365A26E8A2AB020D51; // 0x2140 (size: 0x78)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_70A1C81B42613BB03964B7872C63AA1B; // 0x21B8 (size: 0xE0)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_6C792B4F4A1C48D855C497A1C14FB236();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_75C978914A969C0FD7D639BFCD0C9D46();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_8916BF0041E79F8FB974C1AF030C3976();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_24F2BA094C7823DBC9E83D81D2B8700A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_0744B0344DABB9D963D3C3898F7BCCD5();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_E8547EAE4337506B162F1BA6783E2B6F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_63F35BA94099047576CDAF86D6611FAB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_FCF503174347A1EAE94BBAA6BB5608B1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_14CA556B45B797ACDE4F8A8B366F1678();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_FF0B326D4A0CC8BAF8C50CB2E2AE7718();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_7B51120A4C901FACAF5C36BE7FF6C9E9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_6829DA0748D1E6ACF12E6DB9B81C5BDD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_A7A4EE45446054C8C1BA189DDB64D144();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_E4FAE1F74C5ADBEC7B10399C5C0B20A8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LargeShipStorageShip_AnimGraphNode_TransitionResult_9ECC780C4D0F39F20CBF4C8DE863AE3B();
    void ExecuteUbergraph_ABP_LargeShipStorageShip(int32 EntryPoint);
}; // Size: 0x2298

#endif
