#ifndef UE4SS_SDK_BPArtilleryAIT3_HPP
#define UE4SS_SDK_BPArtilleryAIT3_HPP

class ABPArtilleryAIT3_C : public AFortStaticArtillery
{
    class UTemplateComponent* FortCommonT3BreachedWalls;                              // 0x0920 (size: 0x8)
    class UBoxComponent* BlockBuildSiteMovement;                                      // 0x0928 (size: 0x8)
    class UTemplateComponent* FortCommonT3Mods;                                       // 0x0930 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0938 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT3;                                       // 0x0940 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0948 (size: 0x8)
    class UTemplateComponent* FortCommonAIT3;                                         // 0x0950 (size: 0x8)
    class UTemplateComponent* FortCommonMods;                                         // 0x0958 (size: 0x8)

}; // Size: 0x960

#endif
