#ifndef UE4SS_SDK_BPATGunAIT3_HPP
#define UE4SS_SDK_BPATGunAIT3_HPP

class ABPATGunAIT3_C : public AFortTurretAT
{
    class UPowerConsumerComponent* PowerConsumer;                                     // 0x08F0 (size: 0x8)
    class UTemplateComponent* FortCommonT3BreachedWalls;                              // 0x08F8 (size: 0x8)
    class UBoxComponent* BlockBuildSiteMovement;                                      // 0x0900 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0908 (size: 0x8)
    class UTemplateComponent* FortCommonT3Mods;                                       // 0x0910 (size: 0x8)
    class UTemplateComponent* FortSpotLight;                                          // 0x0918 (size: 0x8)
    class UTemplateComponent* FortCommonAIT3;                                         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0928 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT3;                                       // 0x0930 (size: 0x8)
    class UTemplateComponent* FortCommonMods;                                         // 0x0938 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0940 (size: 0x8)

}; // Size: 0x948

#endif
