#ifndef UE4SS_SDK_BPATGunAIT2Destroyed_HPP
#define UE4SS_SDK_BPATGunAIT2Destroyed_HPP

class ABPATGunAIT2Destroyed_C : public ADestroyedFort
{
    class UStaticMeshComponent* insidefloor;                                          // 0x0820 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0828 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01FrontLeft;                           // 0x0830 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01BackRight;                           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01BackLeft;                            // 0x0840 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01FrontRight;                          // 0x0848 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Left;                                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Front;                               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Back;                                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Right;                               // 0x0868 (size: 0x8)
    class UTemplateComponent* FortCommonDirt;                                         // 0x0870 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0880 (size: 0x8)

}; // Size: 0x888

#endif
