#ifndef UE4SS_SDK_BPATGunAIT1Destroyed_HPP
#define UE4SS_SDK_BPATGunAIT1Destroyed_HPP

class ABPATGunAIT1Destroyed_C : public ADestroyedFort
{
    class UStaticMeshComponent* insidefloor;                                          // 0x0850 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0858 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01FrontLeft;                           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01BackRight;                           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01BackLeft;                            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01FrontRight;                          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Left;                                // 0x0880 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Front;                               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Back;                                // 0x0890 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Right;                               // 0x0898 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT1T2;                                     // 0x08A0 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08B0 (size: 0x8)

}; // Size: 0x8B8

#endif
