#ifndef UE4SS_SDK_BPConstructionYardBuildSite_HPP
#define UE4SS_SDK_BPConstructionYardBuildSite_HPP

class ABPConstructionYardBuildSite_C : public AConstructionSiteBuildSite
{
    class UStaticMeshComponent* StaticMesh22;                                         // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0800 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0810 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0818 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0820 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0828 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
