#ifndef UE4SS_SDK_BPConcreteBridge_HPP
#define UE4SS_SDK_BPConcreteBridge_HPP

class ABPConcreteBridge_C : public ABridge
{
    class UDecalComponent* Decal8;                                                    // 0x0800 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0808 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0810 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0818 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0820 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0828 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0830 (size: 0x8)
    class UDecalComponent* W;                                                         // 0x0838 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0840 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0848 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0850 (size: 0x8)
    class UStaticMeshComponent* BridgeMesh;                                           // 0x0858 (size: 0x8)

}; // Size: 0x860

#endif
