#ifndef UE4SS_SDK_BPConstructionEquipment_HPP
#define UE4SS_SDK_BPConstructionEquipment_HPP

class ABPConstructionEquipment_C : public AConstructionEquipment
{
    class UMultiplexedSkeletalMeshComponent* MultiplexedSkeletalMesh;                 // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Node012;                                              // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Node011;                                              // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Node010;                                              // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Node09;                                               // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Node08;                                               // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Node07;                                               // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* Node06;                                               // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* Node05;                                               // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* Node04;                                               // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Node03;                                               // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* Node02;                                               // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Node01;                                               // 0x0A00 (size: 0x8)
    class UBPResourceGroupRenderComponent_C* BPResourceGroupRenderComponent;          // 0x0A08 (size: 0x8)

}; // Size: 0xA10

#endif
