#ifndef UE4SS_SDK_BPCraterLarge_HPP
#define UE4SS_SDK_BPCraterLarge_HPP

class ABPCraterLarge_C : public ACrater
{
    class UBPFoliageCullStaticMeshComponent_C* BPFoliageCullStaticMeshComponent;      // 0x0820 (size: 0x8)
    class UBPLandscapeCullStaticMeshComponent_C* BPLandscapeCullStaticMeshComponent;  // 0x0828 (size: 0x8)
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x0830 (size: 0x8)
    class UBPTrenchBlockerCapsule_C* BPTrenchBlockerCapsule;                          // 0x0838 (size: 0x8)
    class UStaticMeshComponent* CraterLarge01;                                        // 0x0840 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0850 (size: 0x8)
    class UBoxComponent* Hole;                                                        // 0x0858 (size: 0x8)

}; // Size: 0x860

class UPLACEHOLDER-CLASS__BPFoliageCullStaticMeshComponent_C_2147482214
{
}; // Size: 0x0

class UPLACEHOLDER-CLASS__BPLandscapeCullStaticMeshComponent_C_2147482213
{
}; // Size: 0x0

class UPLACEHOLDER-CLASS__BPStructurePuddleMesh_C_2147482212
{
}; // Size: 0x0

class UPLACEHOLDER-CLASS__BPTrenchBlockerCapsule_C_2147482211
{
}; // Size: 0x0

#endif
