#ifndef UE4SS_SDK_BPDestroyedBarn_HPP
#define UE4SS_SDK_BPDestroyedBarn_HPP

class ABPDestroyedBarn_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* w1;                                                   // 0x0618 (size: 0x8)
    class URuinedMeshComponent* W;                                                    // 0x0620 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x0628 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x0630 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0638 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0640 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0650 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0658 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0660 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0678 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0680 (size: 0x8)

}; // Size: 0x688

#endif
