#ifndef UE4SS_SDK_BPDestroyedFortForwardBaseT2_HPP
#define UE4SS_SDK_BPDestroyedFortForwardBaseT2_HPP

class ABPDestroyedFortForwardBaseT2_C : public ADestroyedFortForwardBase
{
    class UTemplateComponent* FortBaseCommon;                                         // 0x0630 (size: 0x8)
    class UTemplateComponent* FortBaseCommonDirtT1T2;                                 // 0x0638 (size: 0x8)
    class UBPWaterStencilComponent_C* WaterStencil1;                                  // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Ramp;                                                 // 0x0648 (size: 0x8)
    class UBoxComponent* BlockBuildSiteMovement;                                      // 0x0650 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0658 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* FloorDoor;                                            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* SideFrontStatic;                                      // 0x0670 (size: 0x8)
    class UStaticMeshComponent* SideLeftStatic;                                       // 0x0678 (size: 0x8)
    class UStaticMeshComponent* SideBackStatic;                                       // 0x0680 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0688 (size: 0x8)
    class UStaticMeshComponent* SideBack;                                             // 0x0690 (size: 0x8)
    class UStaticMeshComponent* SideLeft;                                             // 0x0698 (size: 0x8)
    class UStaticMeshComponent* SideFront;                                            // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x06B8 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x06C0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x06C8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x06D8 (size: 0x8)
    class UBuildSocketComponent* BackWallSocket;                                      // 0x06E0 (size: 0x8)
    class UBuildSocketComponent* FrontWallSocket;                                     // 0x06E8 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x06F0 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x06F8 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0700 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0708 (size: 0x8)
    class UBoatHullComponent* BoatHull;                                               // 0x0710 (size: 0x8)
    class UBoxComponent* NoBuildZone;                                                 // 0x0718 (size: 0x8)

}; // Size: 0x720

#endif
