#ifndef UE4SS_SDK_BPDestroyedKeep_HPP
#define UE4SS_SDK_BPDestroyedKeep_HPP

class ABPDestroyedKeep_C : public ADestroyedKeep
{
    class UStaticMeshComponent* StaticMesh11;                                         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0650 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Keep Mesh;                                            // 0x0660 (size: 0x8)

}; // Size: 0x668

#endif
