#ifndef UE4SS_SDK_BPDestroyedTownBase3_HPP
#define UE4SS_SDK_BPDestroyedTownBase3_HPP

class ABPDestroyedTownBase3_C : public ADestroyedTownHall
{
    class UStaticMeshComponent* Bollard11;                                            // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Bollard18;                                            // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Bollard17;                                            // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Bollard16;                                            // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Bollard15;                                            // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Bollard14;                                            // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Bollard13;                                            // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Bollard5;                                             // 0x0688 (size: 0x8)
    class UStaticMeshComponent* Bollard19;                                            // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Bollard4;                                             // 0x0698 (size: 0x8)
    class UStaticMeshComponent* Bollard10;                                            // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* Bollard9;                                             // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Bollard8;                                             // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Bollard7;                                             // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* Bollard6;                                             // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* Bollard12;                                            // 0x06C8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x06D0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x06D8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x06E0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x06E8 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x06F0 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x06F8 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0700 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0708 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0710 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0718 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0720 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerIn03;                                 // 0x0728 (size: 0x8)
    class UStaticMeshComponent* TownRubbleStraight02;                                 // 0x0730 (size: 0x8)
    class UStaticMeshComponent* TownRubbleFloor04;                                    // 0x0738 (size: 0x8)
    class UStaticMeshComponent* TownRubbleWall04;                                     // 0x0740 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerIn02;                                 // 0x0748 (size: 0x8)
    class UStaticMeshComponent* TownCenterRoof_destroyed;                             // 0x0750 (size: 0x8)
    class UStaticMeshComponent* TownCenter_destroyed;                                 // 0x0758 (size: 0x8)
    class UBoxComponent* NoBuildVolume;                                               // 0x0760 (size: 0x8)

}; // Size: 0x768

#endif
