#ifndef UE4SS_SDK_BPDestroyedGarrisonOutHouse_HPP
#define UE4SS_SDK_BPDestroyedGarrisonOutHouse_HPP

class ABPDestroyedGarrisonOutHouse_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh;                                           // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0620 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0628 (size: 0x8)

}; // Size: 0x630

#endif
