#ifndef UE4SS_SDK_BPDestroyedRefinery_HPP
#define UE4SS_SDK_BPDestroyedRefinery_HPP

class ABPDestroyedRefinery_C : public ADestroyedRefinery
{
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0688 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* Barrel_01;                                            // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* Explosivepile;                                        // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* CivicMaterial;                                        // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* RefinedMaterialPickup;                                // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* RefineryBuildingDestroyed;                            // 0x06E0 (size: 0x8)

}; // Size: 0x6E8

#endif
