#ifndef UE4SS_SDK_BPDestroyedTrainBridgeC_HPP
#define UE4SS_SDK_BPDestroyedTrainBridgeC_HPP

class ABPDestroyedTrainBridgeC_C : public ADestroyedDrawbridge
{
    class UBoxComponent* BelowBlockingMiddle;                                         // 0x0610 (size: 0x8)
    class UBoxComponent* SuspendedBuildSurfaceB;                                      // 0x0618 (size: 0x8)
    class UStaticMeshComponent* SideB2;                                               // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SideA2;                                               // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SideB1;                                               // 0x0630 (size: 0x8)
    class UStaticMeshComponent* SideA1;                                               // 0x0638 (size: 0x8)
    class UBoxComponent* SuspendedBuildSurfaceA;                                      // 0x0640 (size: 0x8)
    class UBoxComponent* BelowBlockingB;                                              // 0x0648 (size: 0x8)
    class UBoxComponent* BelowBlockingA;                                              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* SideB;                                                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SideA;                                                // 0x0660 (size: 0x8)

}; // Size: 0x668

#endif
