#ifndef UE4SS_SDK_BPDestroyedTownBase1_HPP
#define UE4SS_SDK_BPDestroyedTownBase1_HPP

class ABPDestroyedTownBase1_C : public ADestroyedTownHall
{
    class UStaticMeshComponent* Bollard3;                                             // 0x0618 (size: 0x8)
    class UStaticMeshComponent* Bollard1;                                             // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Bollard2;                                             // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Bollard7;                                             // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Bollard6;                                             // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Bollard5;                                             // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Bollard4;                                             // 0x0648 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0650 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0658 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x0660 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0668 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0670 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0678 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0680 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0688 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0690 (size: 0x8)
    class UStaticMeshComponent* TownRubbleWall01;                                     // 0x0698 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerOut01;                                // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* TownRubbleStraight02;                                 // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* TownRubbleStraight01;                                 // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* TownRubbleFlat02;                                     // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* TownHallPostOffice_destroyed;                         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* TownHallPostOfficeRoof_destroyed;                     // 0x06C8 (size: 0x8)
    class UBoxComponent* NoBuildVolume;                                               // 0x06D0 (size: 0x8)

}; // Size: 0x6D8

#endif
