#ifndef UE4SS_SDK_BPDestroyedDrawbridgeA_HPP
#define UE4SS_SDK_BPDestroyedDrawbridgeA_HPP

class ABPDestroyedDrawbridgeA_C : public ADestroyedDrawbridge
{
    class UBoxComponent* Box3;                                                        // 0x0630 (size: 0x8)
    class UBoxComponent* Box2;                                                        // 0x0638 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0640 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0648 (size: 0x8)
    class UBoxComponent* SuspendedBuildSurfaceB;                                      // 0x0650 (size: 0x8)
    class UBoxComponent* SuspendedBuildSurfaceA;                                      // 0x0658 (size: 0x8)
    class UStaticMeshComponent* SideB;                                                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* SideA;                                                // 0x0668 (size: 0x8)

}; // Size: 0x670

#endif
