#ifndef UE4SS_SDK_BPDestroyedFactory_HPP
#define UE4SS_SDK_BPDestroyedFactory_HPP

class ABPDestroyedFactory_C : public ADestroyedSpecializedFactory
{
    class UStaticMeshComponent* FactoryBasicFacility;                                 // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0638 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0640 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0648 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0650 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0658 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0660 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0668 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0678 (size: 0x8)

}; // Size: 0x680

#endif
