#ifndef UE4SS_SDK_BPDestroyedHospital_HPP
#define UE4SS_SDK_BPDestroyedHospital_HPP

class ABPDestroyedHospital_C : public ADestroyedHospital
{
    class UStaticMeshComponent* Bed7;                                                 // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Bed6;                                                 // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Bed5;                                                 // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Bed4;                                                 // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Bed3;                                                 // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Bed2;                                                 // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Bed1;                                                 // 0x0668 (size: 0x8)
    class UStaticMeshComponent* HospitalRoof;                                         // 0x0670 (size: 0x8)
    class UVisibilityToggleAreaComponent* VisibilityToggleArea;                       // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Hospital;                                             // 0x0680 (size: 0x8)

}; // Size: 0x688

#endif
