#ifndef UE4SS_SDK_BPDestroyedGarrisonOutHouse_HPP
#define UE4SS_SDK_BPDestroyedGarrisonOutHouse_HPP

class ABPDestroyedGarrisonOutHouse_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0670 (size: 0x8)

}; // Size: 0x678

#endif
