#ifndef UE4SS_SDK_BPDestroyedDrawbridgeA_HPP
#define UE4SS_SDK_BPDestroyedDrawbridgeA_HPP

class ABPDestroyedDrawbridgeA_C : public ADestroyedDrawbridge
{
    class UBoxComponent* Box3;                                                        // 0x05F8 (size: 0x8)
    class UBoxComponent* Box2;                                                        // 0x0600 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0608 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0610 (size: 0x8)
    class UBoxComponent* SuspendedBuildSurfaceB;                                      // 0x0618 (size: 0x8)
    class UBoxComponent* SuspendedBuildSurfaceA;                                      // 0x0620 (size: 0x8)
    class UStaticMeshComponent* SideB;                                                // 0x0628 (size: 0x8)
    class UStaticMeshComponent* SideA;                                                // 0x0630 (size: 0x8)

}; // Size: 0x638

#endif
