#ifndef UE4SS_SDK_BPDestroyedConstructionYard_HPP
#define UE4SS_SDK_BPDestroyedConstructionYard_HPP

class ABPDestroyedConstructionYard_C : public ADestroyedConstructionSite
{
    class UStaticMeshComponent* StaticMesh19;                                         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0668 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0678 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0680 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0688 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0690 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0698 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x06A0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x06C0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* ConstructionYardDestroyed;                            // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x06D8 (size: 0x8)

}; // Size: 0x6E0

#endif
