#ifndef UE4SS_SDK_BPDestroyedStorageFacility_HPP
#define UE4SS_SDK_BPDestroyedStorageFacility_HPP

class ABPDestroyedStorageFacility_C : public ADestroyedStorageFacility
{
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0620 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0650 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StorageFaciltyDestoryed;                              // 0x0678 (size: 0x8)

}; // Size: 0x680

#endif
