#ifndef UE4SS_SDK_BPDestroyedBarn2_HPP
#define UE4SS_SDK_BPDestroyedBarn2_HPP

class ABPDestroyedBarn2_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh4;                                          // 0x0600 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x0608 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x0610 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0618 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0620 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0628 (size: 0x8)
    class UBoxComponent* ShootThroughCollision;                                       // 0x0630 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0638 (size: 0x8)

}; // Size: 0x640

#endif
