#ifndef UE4SS_SDK_BPDestroyedSeaport_HPP
#define UE4SS_SDK_BPDestroyedSeaport_HPP

class ABPDestroyedSeaport_C : public ADestroyedSeaport
{
    class UStaticMeshComponent* Box16;                                                // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Box15;                                                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* Box14;                                                // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Box13;                                                // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Box12;                                                // 0x0658 (size: 0x8)
    class UStaticMeshComponent* Box11;                                                // 0x0660 (size: 0x8)
    class UStaticMeshComponent* Box10;                                                // 0x0668 (size: 0x8)
    class UStaticMeshComponent* Box9;                                                 // 0x0670 (size: 0x8)
    class UStaticMeshComponent* Box8;                                                 // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Box7;                                                 // 0x0680 (size: 0x8)
    class UStaticMeshComponent* Box6;                                                 // 0x0688 (size: 0x8)
    class UStaticMeshComponent* Box5;                                                 // 0x0690 (size: 0x8)
    class UStaticMeshComponent* Box4;                                                 // 0x0698 (size: 0x8)
    class UStaticMeshComponent* Box3;                                                 // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* Box2;                                                 // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Box1;                                                 // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Box;                                                  // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* TransferAreaMesh2;                                    // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* TransferAreaMesh1;                                    // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* GarrisonWindow;                                       // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* Handrail1;                                            // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging030;                               // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging029;                               // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging028;                               // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging027;                               // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging026;                               // 0x0700 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging025;                               // 0x0708 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging024;                               // 0x0710 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging023;                               // 0x0718 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging022;                               // 0x0720 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging021;                               // 0x0728 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging020;                               // 0x0730 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging019;                               // 0x0738 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging018;                               // 0x0740 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging017;                               // 0x0748 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging016;                               // 0x0750 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging013;                               // 0x0758 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging011;                               // 0x0760 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging015;                               // 0x0768 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging014;                               // 0x0770 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging04;                                // 0x0778 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging010;                               // 0x0780 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging08;                                // 0x0788 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging09;                                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging07;                                // 0x0798 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging06;                                // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging05;                                // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging012;                               // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* SeaportSideway;                                       // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* Handrail;                                             // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* Seaport;                                              // 0x07C8 (size: 0x8)

}; // Size: 0x7D0

#endif
