#ifndef UE4SS_SDK_BPEngineRoomT2_HPP
#define UE4SS_SDK_BPEngineRoomT2_HPP

class ABPEngineRoomT2_C : public AEngineRoom
{
    class UTemplateComponent* FortCommonT2Corners;                                    // 0x0AA0 (size: 0x8)
    class UTemplateComponent* FortCommonT2BreachedWalls;                              // 0x0AA8 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT2;                                       // 0x0AB0 (size: 0x8)
    class UTemplateComponent* FortCommonT2T3ModsMinimal;                              // 0x0AB8 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x0AC0 (size: 0x8)
    class UTemplateComponent* FortEngineRoomMods;                                     // 0x0AC8 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* RoofDirt;                                             // 0x0AD8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0AE0 (size: 0x8)
    class UParticleSystemComponent* Light;                                            // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0AF8 (size: 0x8)

}; // Size: 0xB00

#endif
