#ifndef UE4SS_SDK_BPEngineRoomT3_HPP
#define UE4SS_SDK_BPEngineRoomT3_HPP

class ABPEngineRoomT3_C : public AEngineRoom
{
    class UTemplateComponent* FortCommonT3BreachWalls;                                // 0x0A80 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT3;                                       // 0x0A88 (size: 0x8)
    class UTemplateComponent* FortCommonT2T3ModsMinimal;                              // 0x0A90 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x0A98 (size: 0x8)
    class UTemplateComponent* FortEngineRoomMods;                                     // 0x0AA0 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0AA8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0AB0 (size: 0x8)
    class UParticleSystemComponent* Light;                                            // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0AE8 (size: 0x8)

}; // Size: 0xAF0

#endif
