#ifndef UE4SS_SDK_BPFacilityRefinery2Engineering_HPP
#define UE4SS_SDK_BPFacilityRefinery2Engineering_HPP

class ABPFacilityRefinery2Engineering_C : public AModificationTemplate
{
    class UParticleSystemComponent* ProducingSmoke;                                   // 0x0218 (size: 0x8)
    class UStaticMeshComponent* PipeInputMesh1;                                       // 0x0220 (size: 0x8)
    class UDecalComponent* InputDecal1;                                               // 0x0228 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput1;                                    // 0x0230 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0238 (size: 0x8)
    class UDecalComponent* InputDecal0;                                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* PipeInputMesh0;                                       // 0x0248 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput0;                                    // 0x0250 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
