#ifndef UE4SS_SDK_BPFacilityFactoryAmmo_HPP
#define UE4SS_SDK_BPFacilityFactoryAmmo_HPP

class ABPFacilityFactoryAmmo_C : public AFacilityRefinery
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent3;             // 0x0A60 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent2;             // 0x0A68 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0A70 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x0A80 (size: 0x8)
    class UWarAudioComponent* ProducingSFX;                                           // 0x0A88 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x0A90 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x0A98 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0AA0 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0AA8 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x0AB8 (size: 0x8)

}; // Size: 0xAC0

#endif
