#ifndef UE4SS_SDK_BPFacilityVehicleFactory1WeaponsAssemblyStation01_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1WeaponsAssemblyStation01_HPP

class ABPFacilityVehicleFactory1WeaponsAssemblyStation01_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFSmalllCrate06;                                     // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate05;                                     // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate04;                                     // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FVFWeponeShield1;                                     // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate03;                                     // 0x0238 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFSmallTurret;                                       // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate01;                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate02;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFLargeHowitzer;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x0278 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0280 (size: 0x8)

}; // Size: 0x288

#endif
