#ifndef UE4SS_SDK_BPFacilityRefinery2_HPP
#define UE4SS_SDK_BPFacilityRefinery2_HPP

class ABPFacilityRefinery2_C : public AFacilityRefinery
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent3;             // 0x0A90 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent2;             // 0x0A98 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0AA0 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0AA8 (size: 0x8)
    class UWarAudioComponent* ProducingSFX;                                           // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x0AB8 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0AC0 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x0AD0 (size: 0x8)

}; // Size: 0xAD8

#endif
