#ifndef UE4SS_SDK_BPFacilityFactorySmallArms_HPP
#define UE4SS_SDK_BPFacilityFactorySmallArms_HPP

class ABPFacilityFactorySmallArms_C : public AFacilityRefinery
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent7;             // 0x0A60 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent6;             // 0x0A68 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent5;             // 0x0A70 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent2;             // 0x0A78 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent4;             // 0x0A80 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent3;             // 0x0A88 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0A90 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke1;                                       // 0x0A98 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke;                                        // 0x0AA0 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0AA8 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0AB0 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x0AC0 (size: 0x8)
    class UWarAudioComponent* ProducingSFX;                                           // 0x0AC8 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x0AD0 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x0AD8 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0AE0 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0AE8 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x0AF8 (size: 0x8)

}; // Size: 0xB00

#endif
