#ifndef UE4SS_SDK_BPFacilityVehicleFactory1TankAssemblyStation01_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1TankAssemblyStation01_HPP

class ABPFacilityVehicleFactory1TankAssemblyStation01_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFCrate;                                             // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel07;                                          // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel06;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel05;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel04;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FVFMediumTallCrate1;                                  // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFSmallTrap;                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFSmallTankTrack03;                                  // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFSmallTankTrack01;                                  // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFSmallTankTrack02;                                  // 0x0260 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFLargeStorageContainer;                             // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFSmallStorageContainer;                             // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFFan;                                               // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFMediumTallCrate;                                   // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FVFEngineBlock;                                       // 0x0290 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x0298 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x02A8 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02B0 (size: 0x8)

}; // Size: 0x2B8

#endif
