#ifndef UE4SS_SDK_BPFacilityVehicleFactory1ShipAssembly_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1ShipAssembly_HPP

class ABPFacilityVehicleFactory1ShipAssembly_C : public AModificationTemplate
{
    class UDecalComponent* Decal2;                                                    // 0x0218 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FacilityMetalBeamStack05;                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FacilityMetalBeamStack04;                             // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FacilityMetalBeamStack03;                             // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FacilityMetalBeamStack02;                             // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate05;                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate04;                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate03;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate02;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FacilitySmallShipAnchor;                              // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FacilityMetalBeamStack01;                             // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox9;                                   // 0x0278 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox4;                                   // 0x0288 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0290 (size: 0x8)

}; // Size: 0x298

#endif
