#ifndef UE4SS_SDK_BPFacilityRefinery1_HPP
#define UE4SS_SDK_BPFacilityRefinery1_HPP

class ABPFacilityRefinery1_C : public AFacilityRefinery
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0A70 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x0A80 (size: 0x8)
    class UWarAudioComponent* ProducingSFX;                                           // 0x0A88 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0A90 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0A98 (size: 0x8)
    class UParticleSystemComponent* Smoke;                                            // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x0AA8 (size: 0x8)

}; // Size: 0xAB0

#endif
