#ifndef UE4SS_SDK_BPFacilityRefineryOil_HPP
#define UE4SS_SDK_BPFacilityRefineryOil_HPP

class ABPFacilityRefineryOil_C : public AFacilityRefinery
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0A30 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x0A40 (size: 0x8)
    class UWarAudioComponent* ProducingSFX;                                           // 0x0A48 (size: 0x8)
    class UDecalComponent* OutputDecal0;                                              // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* OutputMesh0;                                          // 0x0A58 (size: 0x8)
    class UBPStructurePipelineOutput_C* PipeOutput0;                                  // 0x0A60 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0A68 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0A70 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0A78 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0A80 (size: 0x8)
    class UParticleSystemComponent* ProducingFX1;                                     // 0x0A88 (size: 0x8)
    class UParticleSystemComponent* ProducingFX;                                      // 0x0A90 (size: 0x8)
    class UDecalComponent* InputDecal0;                                               // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* InputMesh0;                                           // 0x0AA0 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput0;                                    // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x0AB0 (size: 0x8)

}; // Size: 0xAB8

#endif
