#ifndef UE4SS_SDK_BPFacilityVehicleFactory1RocketAssembly_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1RocketAssembly_HPP

class ABPFacilityVehicleFactory1RocketAssembly_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFCrate2;                                            // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FVFRocketParts;                                       // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FVFLargeStorageContainer3;                            // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FVFLargeStorageContainer2;                            // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FVFLargeStorageContainer1;                            // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FVFCrate1;                                            // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel07;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel06;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel05;                                          // 0x0258 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFLargeStorageContainer;                             // 0x0268 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
