#ifndef UE4SS_SDK_BPFacilityRefinery1Destroyed_HPP
#define UE4SS_SDK_BPFacilityRefinery1Destroyed_HPP

class ABPFacilityRefinery1Destroyed_C : public ADestroyedFacilityRefinery
{
    class UDecalComponent* Decal5;                                                    // 0x0660 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0668 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0670 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0678 (size: 0x8)
    class UStaticMeshComponent* TownRubbleFlat04;                                     // 0x0680 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0688 (size: 0x8)
    class UStaticMeshComponent* TownRubbleFlat03;                                     // 0x0690 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0698 (size: 0x8)
    class UStaticMeshComponent* TownRubbleFlat02;                                     // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x06A8 (size: 0x8)

}; // Size: 0x6B0

#endif
