#ifndef UE4SS_SDK_BPFacilityVehicleFactory2HeavyTankAssembly_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory2HeavyTankAssembly_HPP

class ABPFacilityVehicleFactory2HeavyTankAssembly_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFLargeTankTrack9;                                   // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack7;                                   // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTrap;                                         // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate01;                                     // 0x0230 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0238 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0240 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0248 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0250 (size: 0x8)
    class UDecalComponent* Decal0;                                                    // 0x0258 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack8;                                   // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack6;                                   // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack5;                                   // 0x0278 (size: 0x8)
    class UStaticMeshComponent* PlatformMesh;                                         // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack4;                                   // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack3;                                   // 0x0290 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack2;                                   // 0x0298 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack1;                                   // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FVFAirTank01;                                         // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* FVFAirTank02;                                         // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTankTrack;                                    // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrelstack;                                       // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* FVFLargeStorageContainer;                             // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x02E0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02E8 (size: 0x8)

}; // Size: 0x2F0

#endif
