#ifndef UE4SS_SDK_BPFacilityModificationCenter_HPP
#define UE4SS_SDK_BPFacilityModificationCenter_HPP

class ABPFacilityModificationCenter_C : public AAssemblyStation
{
    class UWarAudioComponent* WarAudio;                                               // 0x0990 (size: 0x8)
    class UStaticMeshComponent* FVFAirTank01;                                         // 0x0998 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate01;                                     // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate02;                                     // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate03;                                     // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate04;                                     // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* FVFAirTank02;                                         // 0x09D0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x09D8 (size: 0x8)
    class UParkingSpotComponent* ParkingSpot;                                         // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x09E8 (size: 0x8)
    class UTemperatureModifierBoxComponent* TemperatureModifierBox;                   // 0x09F0 (size: 0x8)
    class USkeletalMeshComponent* BaseMesh;                                           // 0x09F8 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0A00 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0A08 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0A10 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* FVFLight;                                             // 0x0A20 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* FVFLight1;                                            // 0x0A30 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* FVFLight3;                                            // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* FVFLight2;                                            // 0x0A48 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* FVFLight5;                                            // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* FVFLight4;                                            // 0x0A60 (size: 0x8)
    class UParticleSystemComponent* Dust;                                             // 0x0A68 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0A70 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0A80 (size: 0x8)

}; // Size: 0xA88

#endif
