#ifndef UE4SS_SDK_BPFacilityRefinery1Metal_HPP
#define UE4SS_SDK_BPFacilityRefinery1Metal_HPP

class ABPFacilityRefinery1Metal_C : public AModificationTemplate
{
    class UWarAudioComponent* ModProducingSFX;                                        // 0x0218 (size: 0x8)
    class UParticleSystemComponent* ProducingSteam;                                   // 0x0220 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0228 (size: 0x8)
    class USkeletalMeshComponent* ModMesh;                                            // 0x0230 (size: 0x8)
    class UDecalComponent* InputDecal0;                                               // 0x0238 (size: 0x8)
    class UStaticMeshComponent* PipeInputMesh0;                                       // 0x0240 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput0;                                    // 0x0248 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0250 (size: 0x8)

}; // Size: 0x258

#endif
