#ifndef UE4SS_SDK_BPFacilityFactoryAmmoBase_HPP
#define UE4SS_SDK_BPFacilityFactoryAmmoBase_HPP

class ABPFacilityFactoryAmmoBase_C : public AModificationTemplate
{
    class UBoxComponent* Box4;                                                        // 0x0218 (size: 0x8)
    class UBoxComponent* Box6;                                                        // 0x0220 (size: 0x8)
    class UBoxComponent* Box5;                                                        // 0x0228 (size: 0x8)
    class UBoxComponent* Box3;                                                        // 0x0230 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel06;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate012;                                    // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate011;                                    // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel07;                                          // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel05;                                          // 0x0260 (size: 0x8)
    class UParticleSystemComponent* ProducingFX01;                                    // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate010;                                    // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate09;                                     // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate07;                                     // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate06;                                     // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate05;                                     // 0x0290 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate04;                                     // 0x0298 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTrap;                                         // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate03;                                     // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* FVFLargeTrap1;                                        // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel04;                                          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* FVFHowitzerAmmoBox4;                                  // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* FVFHowitzerAmmoBox3;                                  // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* FVFHowitzerAmmoBox2;                                  // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* FVFHowitzerAmmoBox1;                                  // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate02;                                     // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* FacilityAmmoFactoryBaseRoof;                          // 0x0300 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0308 (size: 0x8)

}; // Size: 0x310

#endif
