#ifndef UE4SS_SDK_BPFacilityFactorySmallArmsAmmunition_HPP
#define UE4SS_SDK_BPFacilityFactorySmallArmsAmmunition_HPP

class ABPFacilityFactorySmallArmsAmmunition_C : public AModificationTemplate
{
    class UBoxComponent* Box10;                                                       // 0x0218 (size: 0x8)
    class UBoxComponent* Box9;                                                        // 0x0220 (size: 0x8)
    class UBoxComponent* Box8;                                                        // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FacilityCrateTarp;                                    // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate08;                                     // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate06;                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate05;                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate04;                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate03;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* front11;                                              // 0x0260 (size: 0x8)
    class UStaticMeshComponent* front10;                                              // 0x0268 (size: 0x8)
    class UStaticMeshComponent* front9;                                               // 0x0270 (size: 0x8)
    class UStaticMeshComponent* front7;                                               // 0x0278 (size: 0x8)
    class UStaticMeshComponent* front38;                                              // 0x0280 (size: 0x8)
    class UStaticMeshComponent* front37;                                              // 0x0288 (size: 0x8)
    class UStaticMeshComponent* front36;                                              // 0x0290 (size: 0x8)
    class UStaticMeshComponent* front35;                                              // 0x0298 (size: 0x8)
    class UStaticMeshComponent* front34;                                              // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* front33;                                              // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* front20;                                              // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* front18;                                              // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* front14;                                              // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* front6;                                               // 0x02C8 (size: 0x8)
    class UBoxComponent* Box7;                                                        // 0x02D0 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* FacilityAmmoFactoryBaseRoof;                          // 0x02E0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02E8 (size: 0x8)

}; // Size: 0x2F0

#endif
