#ifndef UE4SS_SDK_BPFacilityRefineryCoalLiquefier_HPP
#define UE4SS_SDK_BPFacilityRefineryCoalLiquefier_HPP

class ABPFacilityRefineryCoalLiquefier_C : public AModificationTemplate
{
    class UParticleSystemComponent* ProducingFX2;                                     // 0x0218 (size: 0x8)
    class UParticleSystemComponent* ProducingFX1;                                     // 0x0220 (size: 0x8)
    class UDecalComponent* OutputDecal0;                                              // 0x0228 (size: 0x8)
    class UStaticMeshComponent* OutputMesh0;                                          // 0x0230 (size: 0x8)
    class UBPStructurePipelineOutput_C* PipeOutput0;                                  // 0x0238 (size: 0x8)
    class UDecalComponent* InputDecal0;                                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* ModMesh;                                              // 0x0248 (size: 0x8)
    class UStaticMeshComponent* InputMesh0;                                           // 0x0250 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput0;                                    // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
