#ifndef UE4SS_SDK_BPFacilityPowerOilBase_HPP
#define UE4SS_SDK_BPFacilityPowerOilBase_HPP

class ABPFacilityPowerOilBase_C : public AModificationTemplate
{
    class UParticleSystemComponent* BaseSmoke2;                                       // 0x0218 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x0220 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0228 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0230 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke1;                                       // 0x0238 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke;                                        // 0x0240 (size: 0x8)
    class UStaticMeshComponent* BaseMesh;                                             // 0x0248 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0250 (size: 0x8)

}; // Size: 0x258

#endif
