#ifndef UE4SS_SDK_BPFacilityVehicleFactory1ArtilleryFactory_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1ArtilleryFactory_HPP

class ABPFacilityVehicleFactory1ArtilleryFactory_C : public AModificationTemplate
{
    class UDecalComponent* Decal;                                                     // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketTub3;                                   // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketTub2;                                   // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketTub1;                                   // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox8;                                   // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox7;                                   // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox6;                                   // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox5;                                   // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox4;                                   // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketPod3;                                   // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketPod2;                                   // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketPod1;                                   // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox3;                                   // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox2;                                   // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox1;                                   // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketTub;                                    // 0x0290 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketPod;                                    // 0x0298 (size: 0x8)
    class UStaticMeshComponent* FacilityRocketBox;                                    // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x02B0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02B8 (size: 0x8)

}; // Size: 0x2C0

#endif
