#ifndef UE4SS_SDK_BPFacilityFactorySmallArmsDestroyed_HPP
#define UE4SS_SDK_BPFacilityFactorySmallArmsDestroyed_HPP

class ABPFacilityFactorySmallArmsDestroyed_C : public ADestroyedFacilityRefinery
{
    class UStaticMeshComponent* Rubble1;                                              // 0x0650 (size: 0x8)
    class UStaticMeshComponent* Rubble;                                               // 0x0658 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0660 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0668 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0670 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0678 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0680 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x0688 (size: 0x8)

}; // Size: 0x690

#endif
