#ifndef UE4SS_SDK_BPFacilityMineOilFracker_HPP
#define UE4SS_SDK_BPFacilityMineOilFracker_HPP

class ABPFacilityMineOilFracker_C : public AModificationTemplate
{
    class UStaticMeshComponent* PipeInputMesh0;                                       // 0x0218 (size: 0x8)
    class UDecalComponent* InputDecal0;                                               // 0x0220 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput0;                                    // 0x0228 (size: 0x8)
    class UDecalComponent* OutputDecal1;                                              // 0x0230 (size: 0x8)
    class UStaticMeshComponent* PipeOutputMesh0;                                      // 0x0238 (size: 0x8)
    class UStaticMeshComponent* ModMesh;                                              // 0x0240 (size: 0x8)
    class UBPStructurePipelineOutput_C* PipeOutput0;                                  // 0x0248 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0250 (size: 0x8)

}; // Size: 0x258

#endif
