#ifndef UE4SS_SDK_BPFacilityVehicleFactory1FieldAssemblyStation01_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1FieldAssemblyStation01_HPP

class ABPFacilityVehicleFactory1FieldAssemblyStation01_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFWireWheel2;                                        // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBoxsmall1;                                     // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBox3;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBoxLong2;                                      // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBoxsmall;                                      // 0x0238 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBoxLong1;                                      // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBox2;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBox1;                                          // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate01;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBox;                                           // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBoxLong;                                       // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFWireWheel1;                                        // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFWireWheel;                                         // 0x0280 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0288 (size: 0x8)

}; // Size: 0x290

#endif
