#ifndef UE4SS_SDK_BPFacilityFactorySmallArmsDestroyed_HPP
#define UE4SS_SDK_BPFacilityFactorySmallArmsDestroyed_HPP

class ABPFacilityFactorySmallArmsDestroyed_C : public ADestroyedFacilityRefinery
{
    class UStaticMeshComponent* Rubble1;                                              // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* Rubble;                                               // 0x06A8 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x06B0 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x06B8 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x06C0 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x06C8 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x06D8 (size: 0x8)

}; // Size: 0x6E0

#endif
