#ifndef UE4SS_SDK_BPFacilityRefinery2Recycler_HPP
#define UE4SS_SDK_BPFacilityRefinery2Recycler_HPP

class ABPFacilityRefinery2Recycler_C : public AModificationTemplate
{
    class UDecalComponent* InputDecal0;                                               // 0x0218 (size: 0x8)
    class UStaticMeshComponent* PipeInputMesh0;                                       // 0x0220 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput0;                                    // 0x0228 (size: 0x8)
    class UParticleSystemComponent* ProducingSmoke2;                                  // 0x0230 (size: 0x8)
    class UParticleSystemComponent* ProducingSmoke1;                                  // 0x0238 (size: 0x8)
    class UParticleSystemComponent* ProducingSmoke;                                   // 0x0240 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0248 (size: 0x8)
    class USkeletalMeshComponent* FacilityRefinery2UpgradeMesh2;                      // 0x0250 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0258 (size: 0x8)

}; // Size: 0x260

#endif
