#ifndef UE4SS_SDK_BPFacilityVehicleFactory1LightVehicleAssembly_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1LightVehicleAssembly_HPP

class ABPFacilityVehicleFactory1LightVehicleAssembly_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FVFMediumTallCrate2;                                  // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FVFMediumTallCrate1;                                  // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FVFMediumTallCrate;                                   // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FVFCarParts03;                                        // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate02;                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFCarParts02;                                        // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFCarParts;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel11;                                      // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel10;                                      // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel9;                                       // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel8;                                       // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel7;                                       // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel6;                                       // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel5;                                       // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel4;                                       // 0x0290 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel3;                                       // 0x0298 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel2;                                       // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel1;                                       // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel;                                        // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* FVFSmallTrap;                                         // 0x02B8 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* FVFBoxWithTools;                                      // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* FVFLargeWoodCreateOpen;                               // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBox1;                                          // 0x02E8 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02F0 (size: 0x8)

}; // Size: 0x2F8

#endif
