#ifndef UE4SS_SDK_BPFacilityCatwalkPlatform_HPP
#define UE4SS_SDK_BPFacilityCatwalkPlatform_HPP

class ABPFacilityCatwalkPlatform_C : public ACatWalk
{
    class UStaticMeshComponent* BackLeftCorner;                                       // 0x0820 (size: 0x8)
    class UStaticMeshComponent* BackRightCorner;                                      // 0x0828 (size: 0x8)
    class UStaticMeshComponent* FrontRightCorner;                                     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* FrontLeftCorner;                                      // 0x0838 (size: 0x8)
    class UStaticMeshComponent* RightRailing;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* BackRailing;                                          // 0x0848 (size: 0x8)
    class UStaticMeshComponent* LeftRailing;                                          // 0x0850 (size: 0x8)
    class UStaticMeshComponent* FrontRailing;                                         // 0x0858 (size: 0x8)
    class UBuildSocketComponent* RightSocket;                                         // 0x0860 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x0868 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0870 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* FacilityCatwalkRamp;                                  // 0x0880 (size: 0x8)

}; // Size: 0x888

#endif
