#ifndef UE4SS_SDK_BPFacilityFactoryAmmoTripod_HPP
#define UE4SS_SDK_BPFacilityFactoryAmmoTripod_HPP

class ABPFacilityFactoryAmmoTripod_C : public AModificationTemplate
{
    class UBoxComponent* Box2;                                                        // 0x0218 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0220 (size: 0x8)
    class UParticleSystemComponent* ProducingFX2;                                     // 0x0228 (size: 0x8)
    class UParticleSystemComponent* ProducingFX3;                                     // 0x0230 (size: 0x8)
    class UParticleSystemComponent* ProducingFX1;                                     // 0x0238 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0240 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x0248 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0250 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FacilityFactoryAmmoTripodBoxs02;                      // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FacilityFactoryAmmoTripodBoxs01;                      // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FacilityFactoryAmmoTripodBoxs03;                      // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FacilityAmmoFactoryRocketRoof;                        // 0x0278 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0280 (size: 0x8)

}; // Size: 0x288

#endif
