#ifndef UE4SS_SDK_BPFacilityVehicleFactory1MotorPool_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory1MotorPool_HPP

class ABPFacilityVehicleFactory1MotorPool_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFSmalllCrate02;                                     // 0x0218 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel08;                                          // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel07;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel06;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel05;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel04;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FVFLargeWoodCreateTrap;                               // 0x0248 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFAirTankholder;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFAirTank02;                                         // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFMediumWoodCrate;                                   // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFSmallWheel;                                        // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFAirTank01;                                         // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFLargeWoodCreateClose;                              // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x0290 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x0298 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

#endif
