#ifndef UE4SS_SDK_BPFacilityPowerOilReactor_HPP
#define UE4SS_SDK_BPFacilityPowerOilReactor_HPP

class ABPFacilityPowerOilReactor_C : public AModificationTemplate
{
    class UParticleSystemComponent* BaseSmoke4;                                       // 0x0218 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke3;                                       // 0x0220 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0228 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0230 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0238 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke2;                                       // 0x0240 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke;                                        // 0x0248 (size: 0x8)
    class UParticleSystemComponent* BaseSmoke1;                                       // 0x0250 (size: 0x8)
    class UStaticMeshComponent* ModMesh;                                              // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
