#ifndef UE4SS_SDK_BPFacilityRefinery1Base_HPP
#define UE4SS_SDK_BPFacilityRefinery1Base_HPP

class ABPFacilityRefinery1Base_C : public AModificationTemplate
{
    class UStaticMeshComponent* Crate;                                                // 0x0218 (size: 0x8)
    class UStaticMeshComponent* Crate5;                                               // 0x0220 (size: 0x8)
    class UStaticMeshComponent* Crate4;                                               // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Crate2;                                               // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Crate6;                                               // 0x0238 (size: 0x8)
    class UParticleSystemComponent* Producing Smoke1;                                 // 0x0240 (size: 0x8)
    class UParticleSystemComponent* Producing Smoke;                                  // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FacilityRefinery1Forge;                               // 0x0250 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0258 (size: 0x8)

}; // Size: 0x260

#endif
