#ifndef UE4SS_SDK_BPFacilityTransferResource_HPP
#define UE4SS_SDK_BPFacilityTransferResource_HPP

class ABPFacilityTransferResource_C : public AResourceTransferStation
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0820 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBox;                                      // 0x0828 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0830 (size: 0x8)
    class UStaticMeshComponent* Node42;                                               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* Node41;                                               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Node40;                                               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Node39;                                               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Node38;                                               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* Node37;                                               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* Node36;                                               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* Node35;                                               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Node34;                                               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Node33;                                               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Node32;                                               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* Node31;                                               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Node30;                                               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Node29;                                               // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* Node28;                                               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Node27;                                               // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Node26;                                               // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* Node25;                                               // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* Node24;                                               // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* Node23;                                               // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* Node22;                                               // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* Node21;                                               // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* Node20;                                               // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* Node19;                                               // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* Node18;                                               // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* Node17;                                               // 0x0900 (size: 0x8)
    class UStaticMeshComponent* Node16;                                               // 0x0908 (size: 0x8)
    class UStaticMeshComponent* Node15;                                               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* Node14;                                               // 0x0918 (size: 0x8)
    class UStaticMeshComponent* Node13;                                               // 0x0920 (size: 0x8)
    class UStaticMeshComponent* Node12;                                               // 0x0928 (size: 0x8)
    class UStaticMeshComponent* Node11;                                               // 0x0930 (size: 0x8)
    class UStaticMeshComponent* Node10;                                               // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Node09;                                               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Node08;                                               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Node07;                                               // 0x0950 (size: 0x8)
    class UStaticMeshComponent* Node06;                                               // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Node05;                                               // 0x0960 (size: 0x8)
    class UStaticMeshComponent* Node04;                                               // 0x0968 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0970 (size: 0x8)
    class UStaticMeshComponent* FacilityResourceTransferStation;                      // 0x0978 (size: 0x8)
    class UStaticMeshComponent* Node03;                                               // 0x0980 (size: 0x8)
    class UStaticMeshComponent* Node02;                                               // 0x0988 (size: 0x8)
    class UStaticMeshComponent* Node01;                                               // 0x0990 (size: 0x8)
    class UStaticMeshComponent* Node00;                                               // 0x0998 (size: 0x8)
    class UBPResourceGroupRenderComponent_C* BPResourceGroupRenderComponent;          // 0x09A0 (size: 0x8)

}; // Size: 0x9A8

#endif
