#ifndef UE4SS_SDK_BPFacilityFactoryAmmoLargeShellFactory_HPP
#define UE4SS_SDK_BPFacilityFactoryAmmoLargeShellFactory_HPP

class ABPFacilityFactoryAmmoLargeShellFactory_C : public AModificationTemplate
{
    class UBoxComponent* Box2;                                                        // 0x0218 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x0220 (size: 0x8)
    class UStaticMeshComponent* Facilitycart;                                         // 0x0228 (size: 0x8)
    class UParticleSystemComponent* ProducingFX;                                      // 0x0230 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh;                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FacilityCrateTarp;                                    // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FacilityPlateShell2;                                  // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FacilityPlateShell1;                                  // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FacilityPlateShell;                                   // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FacilityCartWithShells;                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FacilityAmmoFactoryLargeShellFactoryMod;              // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate010;                                    // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate04;                                     // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate03;                                     // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFSmalllCrate02;                                     // 0x0288 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0290 (size: 0x8)

}; // Size: 0x298

#endif
