#ifndef UE4SS_SDK_BPFacilityRefinery1Forge_HPP
#define UE4SS_SDK_BPFacilityRefinery1Forge_HPP

class ABPFacilityRefinery1Forge_C : public AModificationTemplate
{
    class UStaticMeshComponent* PipeInputMesh0;                                       // 0x0218 (size: 0x8)
    class UDecalComponent* InputDecal0;                                               // 0x0220 (size: 0x8)
    class UBPStructurePipelineInput_C* PipeInput0;                                    // 0x0228 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0230 (size: 0x8)
    class UPointLightComponent* PointLight11;                                         // 0x0238 (size: 0x8)
    class UPointLightComponent* PointLight10;                                         // 0x0240 (size: 0x8)
    class UPointLightComponent* PointLight9;                                          // 0x0248 (size: 0x8)
    class UPointLightComponent* PointLight8;                                          // 0x0250 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0258 (size: 0x8)
    class UPointLightComponent* PointLight6;                                          // 0x0260 (size: 0x8)
    class UPointLightComponent* PointLight5;                                          // 0x0268 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x0270 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0278 (size: 0x8)
    class UPointLightComponent* PointLight7;                                          // 0x0280 (size: 0x8)
    class UParticleSystemComponent* Producing Smoke3;                                 // 0x0288 (size: 0x8)
    class UParticleSystemComponent* Producing Smoke2;                                 // 0x0290 (size: 0x8)
    class UParticleSystemComponent* Producing Smoke1;                                 // 0x0298 (size: 0x8)
    class UParticleSystemComponent* Producing Smoke;                                  // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FacilityRefinery1Forge;                               // 0x02A8 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02B0 (size: 0x8)

}; // Size: 0x2B8

#endif
