#ifndef UE4SS_SDK_BPFacilityVehicleFactory2BaseMod_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory2BaseMod_HPP

class ABPFacilityVehicleFactory2BaseMod_C : public AModificationTemplate
{
    class UDecalComponent* Decal5;                                                    // 0x0218 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0220 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0228 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0230 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0238 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* PlatformMesh;                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBox;                                           // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFLargeWoodCreateClose1;                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFLargeWoodCreateClose;                              // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFAmmoBoxLong;                                       // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFPalletSmallHowitzer;                               // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFMediumTallCrate;                                   // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel03;                                          // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x0290 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0298 (size: 0x8)

}; // Size: 0x2A0

#endif
