#ifndef UE4SS_SDK_BPFacilityRefinery1_HPP
#define UE4SS_SDK_BPFacilityRefinery1_HPP

class ABPFacilityRefinery1_C : public AFacilityRefinery
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0A20 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x0A30 (size: 0x8)
    class UWarAudioComponent* ProducingSFX;                                           // 0x0A38 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0A40 (size: 0x8)
    class UDecalComponent* FoundationDecal;                                           // 0x0A48 (size: 0x8)
    class UParticleSystemComponent* Smoke;                                            // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* MainMesh;                                             // 0x0A58 (size: 0x8)

}; // Size: 0xA60

#endif
