#ifndef UE4SS_SDK_BPFacilityVehicleFactory3_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory3_HPP

class ABPFacilityVehicleFactory3_C : public AAssemblyStation
{
    class ULadderComponent* LadderComponent2;                                         // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* LadderMesh2;                                          // 0x09F8 (size: 0x8)
    class ULadderComponent* LadderComponent1;                                         // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* LadderMesh1;                                          // 0x0A08 (size: 0x8)
    class UBPIceBlockerBoxComponent_C* BPIceBlockerBoxComponent1;                     // 0x0A10 (size: 0x8)
    class UBPIceBlockerBoxComponent_C* BPIceBlockerBoxComponent;                      // 0x0A18 (size: 0x8)
    class UWarAudioComponent* GeneralAnimationSFX;                                    // 0x0A20 (size: 0x8)
    class UWarAudioComponent* GateStopSFX;                                            // 0x0A28 (size: 0x8)
    class UDecalComponent* TealPaintLine3;                                            // 0x0A30 (size: 0x8)
    class UDecalComponent* TealPaintLine2;                                            // 0x0A38 (size: 0x8)
    class UDecalComponent* TealPaintLine1;                                            // 0x0A40 (size: 0x8)
    class UDecalComponent* TealPaintLine;                                             // 0x0A48 (size: 0x8)
    class UWarAudioComponent* WarAudio1;                                              // 0x0A50 (size: 0x8)
    class UWarAudioComponent* WarAudio;                                               // 0x0A58 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x0A60 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0A68 (size: 0x8)
    class UWarAudioComponent* GateMovingSFX;                                          // 0x0A70 (size: 0x8)
    class UWarAudioComponent* WaterLowerSFX;                                          // 0x0A78 (size: 0x8)
    class UWarAudioComponent* WaterRaiseSFX;                                          // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* DrydockBuildArmProps01;                               // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* DrydockBuildArmProps02;                               // 0x0A90 (size: 0x8)
    class UParticleSystemComponent* WaterRaiseVFX3;                                   // 0x0A98 (size: 0x8)
    class UParticleSystemComponent* WaterRaiseVFX2;                                   // 0x0AA0 (size: 0x8)
    class UParticleSystemComponent* WaterRaiseVFX1;                                   // 0x0AA8 (size: 0x8)
    class UParticleSystemComponent* WaterRaiseVFX0;                                   // 0x0AB0 (size: 0x8)
    class UParticleSystemComponent* WaterLowerVFX3;                                   // 0x0AB8 (size: 0x8)
    class UParticleSystemComponent* WaterLowerVFX2;                                   // 0x0AC0 (size: 0x8)
    class UParticleSystemComponent* WaterLowerVFX1;                                   // 0x0AC8 (size: 0x8)
    class UParticleSystemComponent* WaterLowerVFX0;                                   // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* WaterMesh;                                            // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* Rope02;                                               // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* Rope01;                                               // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom05;                                  // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom02;                                  // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* WarTableMap;                                          // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom04;                                  // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom03;                                  // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* FVFBoxWithTools;                                      // 0x0B18 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent5;             // 0x0B20 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent4;             // 0x0B28 (size: 0x8)
    class UBPFacilityVehicleFactory3Arm_C* BPFacilityVehicleFactory3Arm1;             // 0x0B30 (size: 0x8)
    class UBPFacilityVehicleFactory3Arm_C* BPFacilityVehicleFactory3Arm;              // 0x0B38 (size: 0x8)
    class UBoatHullComponent* BoatHull;                                               // 0x0B40 (size: 0x8)
    class UBoxComponent* DoorBox5;                                                    // 0x0B48 (size: 0x8)
    class UBoxComponent* DoorBox4;                                                    // 0x0B50 (size: 0x8)
    class UBoxComponent* DoorBox3;                                                    // 0x0B58 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent3;             // 0x0B60 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent2;             // 0x0B68 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0B70 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0B78 (size: 0x8)
    class UBoxComponent* DoorBox2;                                                    // 0x0B80 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBox1;                                     // 0x0B88 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBox;                                      // 0x0B90 (size: 0x8)
    class USkeletalMeshComponent* MainMesh;                                           // 0x0B98 (size: 0x8)
    class UBoxComponent* DoorBox1;                                                    // 0x0BA0 (size: 0x8)
    class UBoxComponent* DoorBox0;                                                    // 0x0BA8 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponent;                        // 0x0BB0 (size: 0x8)
    class UAssemblyAreaComponent* AssemblyArea;                                       // 0x0BB8 (size: 0x8)
    class UStaticMeshComponent* PowerLineConnector;                                   // 0x0BC0 (size: 0x8)

}; // Size: 0xBC8

#endif
