#ifndef UE4SS_SDK_BPFacilityVehicleFactory2TrainAssembly_HPP
#define UE4SS_SDK_BPFacilityVehicleFactory2TrainAssembly_HPP

class ABPFacilityVehicleFactory2TrainAssembly_C : public AModificationTemplate
{
    class UStaticMeshComponent* FVFClippboard02;                                      // 0x0218 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0220 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0228 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0230 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0238 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0240 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0248 (size: 0x8)
    class UStaticMeshComponent* PlatformMesh;                                         // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel013;                                     // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel011;                                     // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel010;                                     // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel04;                                      // 0x0270 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel03;                                      // 0x0278 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel09;                                      // 0x0280 (size: 0x8)
    class UStaticMeshComponent* FVFSmallStorageContainer;                             // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FVFMediumWoodCrate1;                                  // 0x0290 (size: 0x8)
    class UStaticMeshComponent* FVFMediumWoodCrate;                                   // 0x0298 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel08;                                      // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel07;                                      // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel06;                                      // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel05;                                      // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* FVFTrainWheel02;                                      // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel01;                                          // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* FVFBarrel02;                                          // 0x02D0 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
