#ifndef UE4SS_SDK_BPFirePitT2_HPP
#define UE4SS_SDK_BPFirePitT2_HPP

class ABPFirePitT2_C : public AFirePit
{
    class UDecalComponent* Decal;                                                     // 0x0820 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0828 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck4;                                     // 0x0830 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck3;                                     // 0x0838 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck2;                                     // 0x0840 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck1;                                     // 0x0848 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck;                                      // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0858 (size: 0x8)

}; // Size: 0x860

#endif
