#ifndef UE4SS_SDK_BPFirePitT2_HPP
#define UE4SS_SDK_BPFirePitT2_HPP

class ABPFirePitT2_C : public AFirePit
{
    class UDecalComponent* Decal;                                                     // 0x0850 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0858 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck4;                                     // 0x0860 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck3;                                     // 0x0868 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck2;                                     // 0x0870 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck1;                                     // 0x0878 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck;                                      // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
