#ifndef UE4SS_SDK_BPFieldHospital_HPP
#define UE4SS_SDK_BPFieldHospital_HPP

class ABPFieldHospital_C : public AHospital
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0880 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0888 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 5;                                   // 0x0890 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 4;                                   // 0x0898 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 3;                                   // 0x08A0 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 2;                                   // 0x08A8 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 1;                                   // 0x08B0 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 0;                                   // 0x08B8 (size: 0x8)
    class USpawnPointComponent* Spawn4;                                               // 0x08C0 (size: 0x8)
    class USpawnPointComponent* Spawn3;                                               // 0x08C8 (size: 0x8)
    class USpawnPointComponent* Spawn2;                                               // 0x08D0 (size: 0x8)
    class USpawnPointComponent* Spawn1;                                               // 0x08D8 (size: 0x8)
    class UBPNoBuildBoxComponent_C* BPNoBuildBoxComponent;                            // 0x08E0 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMesh;                                       // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x08F0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0918 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0920 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0928 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0930 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0938 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0940 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0948 (size: 0x8)
    class UStaticMeshComponent* FieldHospital;                                        // 0x0950 (size: 0x8)

}; // Size: 0x958

#endif
