#ifndef UE4SS_SDK_BPForwardBase1BuildSite_HPP
#define UE4SS_SDK_BPForwardBase1BuildSite_HPP

class ABPForwardBase1BuildSite_C : public ABaseBuildSite
{
    class USpawnPointComponent* SpawnPoint9;                                          // 0x0860 (size: 0x8)
    class USpawnPointComponent* SpawnPoint11;                                         // 0x0868 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0870 (size: 0x8)
    class USpawnPointComponent* SpawnPoint14;                                         // 0x0878 (size: 0x8)
    class USpawnPointComponent* SpawnPoint13;                                         // 0x0880 (size: 0x8)
    class USpawnPointComponent* SpawnPoint12;                                         // 0x0888 (size: 0x8)
    class USpawnPointComponent* SpawnPoint15;                                         // 0x0890 (size: 0x8)
    class USpawnPointComponent* SpawnPoint10;                                         // 0x0898 (size: 0x8)
    class UCameraComponent* ViewTargetCamera;                                         // 0x08A0 (size: 0x8)
    class UBoxComponent* NoBuildZone;                                                 // 0x08A8 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
