#ifndef UE4SS_SDK_BPForwardBase1_HPP
#define UE4SS_SDK_BPForwardBase1_HPP

class ABPForwardBase1_C : public AForwardBase
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x08C0 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x08C8 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 1;                                   // 0x08D0 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 0;                                   // 0x08D8 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 3;                                   // 0x08E0 (size: 0x8)
    class UBuildSocketComponent* Landscape Check 2;                                   // 0x08E8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint15;                                         // 0x08F0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint14;                                         // 0x08F8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint13;                                         // 0x0900 (size: 0x8)
    class USpawnPointComponent* SpawnPoint12;                                         // 0x0908 (size: 0x8)
    class USpawnPointComponent* SpawnPoint11;                                         // 0x0910 (size: 0x8)
    class USpawnPointComponent* SpawnPoint10;                                         // 0x0918 (size: 0x8)
    class USpawnPointComponent* SpawnPoint9;                                          // 0x0920 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0928 (size: 0x8)
    class UCameraComponent* ViewTargetCamera;                                         // 0x0930 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0938 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0940 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0948 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0950 (size: 0x8)
    class UBoxComponent* NoBuildZone;                                                 // 0x0958 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0960 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0968 (size: 0x8)

}; // Size: 0x970

#endif
