#ifndef UE4SS_SDK_BPFortT1_HPP
#define UE4SS_SDK_BPFortT1_HPP

class ABPFortT1_C : public AFort
{
    class UTemplateComponent* FortCommonT1BreachedWalls;                              // 0x0850 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT1T2;                                     // 0x0858 (size: 0x8)
    class UTemplateComponent* FortCommonMods;                                         // 0x0860 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0868 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0878 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x0888 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0898 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
