#ifndef UE4SS_SDK_BPFoundation011x2T1_HPP
#define UE4SS_SDK_BPFoundation011x2T1_HPP

class ABPFoundation011x2T1_C : public ABPFoundationBase_C
{
    class UBPFoliageCullStaticMeshComponent_C* BPFoliageCullStaticMeshComponent;      // 0x0848 (size: 0x8)
    class UStaticMeshComponent* LeftBorder2;                                          // 0x0850 (size: 0x8)
    class UStaticMeshComponent* RightBorder2;                                         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* RightBorder1;                                         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* LeftBorder1;                                          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* FrontRightPillar;                                     // 0x0870 (size: 0x8)
    class UStaticMeshComponent* FrontBorder;                                          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* BackLeftPillar;                                       // 0x0880 (size: 0x8)
    class UStaticMeshComponent* BackRightPillar;                                      // 0x0888 (size: 0x8)
    class UStaticMeshComponent* FrontLeftPillar;                                      // 0x0890 (size: 0x8)
    class UStaticMeshComponent* BackBorder;                                           // 0x0898 (size: 0x8)
    class UBuildSocketComponent* LeftSocket1;                                         // 0x08A0 (size: 0x8)
    class UBuildSocketComponent* LeftSocket0;                                         // 0x08A8 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x08B0 (size: 0x8)
    class UBuildSocketComponent* RightSocket1;                                        // 0x08B8 (size: 0x8)
    class UBuildSocketComponent* RightSocket0;                                        // 0x08C0 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x08C8 (size: 0x8)

}; // Size: 0x8D0

#endif
