#ifndef UE4SS_SDK_BPFortDestroyedT3_HPP
#define UE4SS_SDK_BPFortDestroyedT3_HPP

class ABPFortDestroyedT3_C : public ADestroyedFort
{
    class UStaticMeshComponent* FortGSFloorFront;                                     // 0x0850 (size: 0x8)
    class UStaticMeshComponent* FortGSFloorLeft;                                      // 0x0858 (size: 0x8)
    class UStaticMeshComponent* FortGSFloorBack;                                      // 0x0860 (size: 0x8)
    class UStaticMeshComponent* FortGSFloorRight;                                     // 0x0868 (size: 0x8)
    class UConnectionRulesComponent* ConnectionRules;                                 // 0x0870 (size: 0x8)
    class UTemplateComponent* FortCommonDestroyedDirtT3;                              // 0x0878 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0880 (size: 0x8)
    class UTemplateComponent* FortBreachedCommon;                                     // 0x0888 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0890 (size: 0x8)

}; // Size: 0x898

#endif
