#ifndef UE4SS_SDK_BPFortBaseCommonDirtT1T2_HPP
#define UE4SS_SDK_BPFortBaseCommonDirtT1T2_HPP

class ABPFortBaseCommonDirtT1T2_C : public ATemplate
{
    class UStaticMeshComponent* DirtCornerBackLeft;                                   // 0x0220 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackRight;                                  // 0x0230 (size: 0x8)
    class UStaticMeshComponent* DirtCornerFrontRight;                                 // 0x0238 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0240 (size: 0x8)
    class UStaticMeshComponent* DirtCornerFrontLeft;                                  // 0x0248 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0250 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0258 (size: 0x8)

}; // Size: 0x260

#endif
