#ifndef UE4SS_SDK_BPFortDestroyedT1Meshes_HPP
#define UE4SS_SDK_BPFortDestroyedT1Meshes_HPP

class ABPFortDestroyedT1Meshes_C : public ATemplate
{
    class UStaticMeshComponent* FortT1Destroyed01Back;                                // 0x0220 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01FrontLeft;                           // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01BackRight;                           // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01BackLeft;                            // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01FrontRight;                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Left;                                // 0x0248 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Right;                               // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FortT1Destroyed01Front;                               // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
