#ifndef UE4SS_SDK_BPFortFirePitT2_HPP
#define UE4SS_SDK_BPFortFirePitT2_HPP

class ABPFortFirePitT2_C : public AFortFirePit
{
    class UTemplateComponent* FortCommonT2Corners;                                    // 0x0840 (size: 0x8)
    class UTemplateComponent* FortCommonThreeWallsMods;                               // 0x0848 (size: 0x8)
    class UTemplateComponent* FortCommonT2BreachedWalls;                              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* RearWall;                                             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* SideLeft;                                             // 0x0860 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMeshFloor;            // 0x0868 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0870 (size: 0x8)
    class UStaticMeshComponent* RoofDirt;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0880 (size: 0x8)
    class UTemplateComponent* FortCommonT2T3ModsMinimal;                              // 0x0888 (size: 0x8)
    class UTemplateComponent* FortFirePitCommonFire;                                  // 0x0890 (size: 0x8)
    class UStaticMeshComponent* FirePitMesh;                                          // 0x0898 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT2;                                       // 0x08A0 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x08A8 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
