#ifndef UE4SS_SDK_BPFortT2_HPP
#define UE4SS_SDK_BPFortT2_HPP

class ABPFortT2_C : public AFort
{
    class UTemplateComponent* FortCommonT2Corners;                                    // 0x0830 (size: 0x8)
    class UTemplateComponent* FortCommonT2BreachedWalls;                              // 0x0838 (size: 0x8)
    class UTemplateComponent* FortCommonT2T3Mods;                                     // 0x0840 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0848 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT2;                                       // 0x0850 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x0858 (size: 0x8)
    class UTemplateComponent* FortCommonMods;                                         // 0x0860 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0868 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMeshFloor;            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0878 (size: 0x8)

}; // Size: 0x880

#endif
