#ifndef UE4SS_SDK_BPFortCornerDestroyedT2_HPP
#define UE4SS_SDK_BPFortCornerDestroyedT2_HPP

class ABPFortCornerDestroyedT2_C : public ADestroyedFort
{
    class UTemplateComponent* FortCornerBreachCommonSockets;                          // 0x0820 (size: 0x8)
    class UTemplateComponent* FortCornerCommonDirtT1;                                 // 0x0828 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0830 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedBackLeft;                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedAngle;                            // 0x0840 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedLeft;                             // 0x0848 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedBack;                             // 0x0850 (size: 0x8)
    class UTemplateComponent* FortCornerBreachCommon;                                 // 0x0858 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0860 (size: 0x8)

}; // Size: 0x868

#endif
