#ifndef UE4SS_SDK_BPFortRampT2_HPP
#define UE4SS_SDK_BPFortRampT2_HPP

class ABPFortRampT2_C : public AFort
{
    class UTemplateComponent* FortCommonT2Corners;                                    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* BreachedLeft;                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* BreachedRight;                                        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* BreachedBack;                                         // 0x0848 (size: 0x8)
    class UBPTrenchBlockerBox_C* BPTrenchBlockerBox;                                  // 0x0850 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT2;                                       // 0x0858 (size: 0x8)
    class UTemplateComponent* FortRampCommonT2T3Mods;                                 // 0x0860 (size: 0x8)
    class UTemplateComponent* FortRampCommonDefenseMods;                              // 0x0868 (size: 0x8)
    class UTemplateComponent* FortRampCommon;                                         // 0x0870 (size: 0x8)
    class UTemplateComponent* FortRampCommonMods;                                     // 0x0878 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0880 (size: 0x8)
    class UStaticMeshComponent* RampFront;                                            // 0x0888 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMeshFloor;            // 0x0890 (size: 0x8)
    class UStaticMeshComponent* RoofDirt;                                             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08A8 (size: 0x8)

}; // Size: 0x8B0

#endif
