#ifndef UE4SS_SDK_BPFortCornerDestroyedT3_HPP
#define UE4SS_SDK_BPFortCornerDestroyedT3_HPP

class ABPFortCornerDestroyedT3_C : public AConcreteFort
{
    class UStaticMeshComponent* FortT3AngleDestroyedAngle;                            // 0x0800 (size: 0x8)
    class UStaticMeshComponent* FortT3AngleDestroyedLeft;                             // 0x0808 (size: 0x8)
    class UStaticMeshComponent* FortT3AngleDestroyedBack;                             // 0x0810 (size: 0x8)
    class UTemplateComponent* FortCornerCommon;                                       // 0x0818 (size: 0x8)
    class UStaticMeshComponent* DirtLeftConnected;                                    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* DirtRightConnected;                                   // 0x0828 (size: 0x8)
    class UStaticMeshComponent* DirtTriangle;                                         // 0x0830 (size: 0x8)
    class UStaticMeshComponent* DirtAngle;                                            // 0x0838 (size: 0x8)
    class UStaticMeshComponent* FortT3Destroyed01;                                    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x0848 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0850 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0860 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x0868 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0870 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0878 (size: 0x8)

}; // Size: 0x880

#endif
