#ifndef UE4SS_SDK_BPFortCornerT1_HPP
#define UE4SS_SDK_BPFortCornerT1_HPP

class ABPFortCornerT1_C : public AFortCorner
{
    class UTemplateComponent* FortCornerCommonMods;                                   // 0x0810 (size: 0x8)
    class UTemplateComponent* FortCornerCommon;                                       // 0x0818 (size: 0x8)
    class UStaticMeshComponent* DirtLeftConnected;                                    // 0x0820 (size: 0x8)
    class UStaticMeshComponent* DirtRightConnected;                                   // 0x0828 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0830 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft1;                                     // 0x0838 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight1;                                     // 0x0840 (size: 0x8)
    class UStaticMeshComponent* DirtTriangle;                                         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* DirtAngle;                                            // 0x0850 (size: 0x8)
    class UStaticMeshComponent* WallAngle2;                                           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* WallAngle1;                                           // 0x0860 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackRight;                                  // 0x0868 (size: 0x8)
    class UStaticMeshComponent* DirtCornerFrontLeft;                                  // 0x0870 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackLeft;                                   // 0x0878 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x0880 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x08C0 (size: 0x8)

}; // Size: 0x8C8

#endif
