#ifndef UE4SS_SDK_BPFortCornerT2_HPP
#define UE4SS_SDK_BPFortCornerT2_HPP

class ABPFortCornerT2_C : public AFortCorner
{
    class UStaticMeshComponent* BreachedBack;                                         // 0x0830 (size: 0x8)
    class UStaticMeshComponent* BreachedAngle;                                        // 0x0838 (size: 0x8)
    class UStaticMeshComponent* BreachedLeft;                                         // 0x0840 (size: 0x8)
    class USceneComponent* BreachedMeshes;                                            // 0x0848 (size: 0x8)
    class UTemplateComponent* FortCornerCommonDirtT2;                                 // 0x0850 (size: 0x8)
    class UTemplateComponent* FortCornerCommonDefenseMods;                            // 0x0858 (size: 0x8)
    class UTemplateComponent* FortCornerCommonT2T3Mods;                               // 0x0860 (size: 0x8)
    class UTemplateComponent* FortCornerCommonMods;                                   // 0x0868 (size: 0x8)
    class UTemplateComponent* FortCornerCommon;                                       // 0x0870 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0878 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMeshFloor;            // 0x0880 (size: 0x8)
    class UStaticMeshComponent* FortT2RoofAngleDirt02;                                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft1;                                     // 0x0890 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight1;                                     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* WallAngle2;                                           // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* WallAngle1;                                           // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x08D0 (size: 0x8)

}; // Size: 0x8D8

#endif
