#ifndef UE4SS_SDK_BPFoxhole_HPP
#define UE4SS_SDK_BPFoxhole_HPP

class ABPFoxhole_C : public AFoxhole
{
    class UBPLandscapeCullStaticMeshComponent_C* BPLandscapeCullStaticMeshComponent;  // 0x0800 (size: 0x8)
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x0808 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket7;                               // 0x0810 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket6;                               // 0x0818 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket5;                               // 0x0820 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket4;                               // 0x0828 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket3;                               // 0x0830 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket2;                               // 0x0838 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket1;                               // 0x0840 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket;                                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* pvpFoxhole01;                                         // 0x0850 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0858 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0860 (size: 0x8)
    class UBoxComponent* Hole;                                                        // 0x0868 (size: 0x8)

}; // Size: 0x870

#endif
