#ifndef UE4SS_SDK_BPFoundation02T1_HPP
#define UE4SS_SDK_BPFoundation02T1_HPP

class ABPFoundation02T1_C : public ABPFoundationBase_C
{
    class UStaticMeshComponent* CenterBorder;                                         // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* FrontBorder;                                          // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* RightBorder;                                          // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* BackLeftPillar;                                       // 0x0800 (size: 0x8)
    class UStaticMeshComponent* LeftBorder;                                           // 0x0808 (size: 0x8)
    class UStaticMeshComponent* BackBorder;                                           // 0x0810 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0818 (size: 0x8)
    class UBuildSocketComponent* CenterSocket;                                        // 0x0820 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x0828 (size: 0x8)

}; // Size: 0x830

#endif
