#ifndef UE4SS_SDK_BPFortBuildGhost_HPP
#define UE4SS_SDK_BPFortBuildGhost_HPP

class ABPFortBuildGhost_C : public ABuildGhost
{
    class UStaticMeshComponent* TrenchBuildsite02SideRope02;                          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope01;                          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side02;                              // 0x0590 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side01;                              // 0x0598 (size: 0x8)
    class UBuildSocketComponent* FrontFortSocket;                                     // 0x05A0 (size: 0x8)
    class UBuildSocketComponent* RightFortSocket;                                     // 0x05A8 (size: 0x8)
    class UBuildSocketComponent* BackFortSocket;                                      // 0x05B0 (size: 0x8)
    class UBuildSocketComponent* LeftFortSocket;                                      // 0x05B8 (size: 0x8)

}; // Size: 0x5C0

#endif
