#ifndef UE4SS_SDK_BPFortDestroyedT2_HPP
#define UE4SS_SDK_BPFortDestroyedT2_HPP

class ABPFortDestroyedT2_C : public AFort
{
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* FortT2Destroyed01Front;                               // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* FortT2Destroyed01Right;                               // 0x0800 (size: 0x8)
    class UStaticMeshComponent* FortT2Destroyed01Left;                                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* FortT2Destroyed01Back;                                // 0x0810 (size: 0x8)
    class UTemplateComponent* FortCommonDirt;                                         // 0x0818 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0828 (size: 0x8)

}; // Size: 0x830

#endif
