#ifndef UE4SS_SDK_BPFortCornerDestroyedT2_HPP
#define UE4SS_SDK_BPFortCornerDestroyedT2_HPP

class ABPFortCornerDestroyedT2_C : public ADestroyedFort
{
    class UStaticMeshComponent* FortT2AngleDestroyedRightShortWall;                   // 0x0850 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedFrontShortWall;                   // 0x0858 (size: 0x8)
    class UTemplateComponent* FortCornerBreachCommonSockets;                          // 0x0860 (size: 0x8)
    class UTemplateComponent* FortCornerCommonDirtT1;                                 // 0x0868 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0870 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedBackLeft;                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedAngle;                            // 0x0880 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedLeft;                             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedBack;                             // 0x0890 (size: 0x8)
    class UTemplateComponent* FortCornerBreachCommon;                                 // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
