#ifndef UE4SS_SDK_BPFortCornerCommonDirtT3_HPP
#define UE4SS_SDK_BPFortCornerCommonDirtT3_HPP

class ABPFortCornerCommonDirtT3_C : public ATemplate
{
    class UStaticMeshComponent* DirtCornerFrontLeft;                                  // 0x0218 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackRight;                                  // 0x0220 (size: 0x8)
    class UStaticMeshComponent* DirtCornerFrontLeftTrench;                            // 0x0228 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackRightTrench;                            // 0x0230 (size: 0x8)
    class UStaticMeshComponent* DirtTriangle;                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackRightFort;                              // 0x0240 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackLeft;                                   // 0x0248 (size: 0x8)
    class UStaticMeshComponent* DirtCornerFrontLeftFort;                              // 0x0250 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0260 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
