#ifndef UE4SS_SDK_BPFortArtilleryShelterT1_HPP
#define UE4SS_SDK_BPFortArtilleryShelterT1_HPP

class ABPFortArtilleryShelterT1_C : public AFortArtilleryShelter
{
    class UTemplateComponent* FortCommonT1BreachedWalls;                              // 0x0820 (size: 0x8)
    class UTemplateComponent* FortCommonModsMinimal;                                  // 0x0828 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x0830 (size: 0x8)
    class UStaticMeshComponent* ArtilleryShelterRoof;                                 // 0x0838 (size: 0x8)
    class UStaticMeshComponent* ArtilleryShelter;                                     // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0848 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x0850 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0858 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0860 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x0868 (size: 0x8)
    class UTemplateComponent* FortCommonDirt;                                         // 0x0870 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0878 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
