#ifndef UE4SS_SDK_BPFortCornerBuildSite_HPP
#define UE4SS_SDK_BPFortCornerBuildSite_HPP

class ABPFortCornerBuildSite_C : public AFortCornerBuildSite
{
    class UTemplateComponent* FortCornerCommonSockets;                                // 0x0800 (size: 0x8)
    class UTemplateComponent* FortCornerCommonDirtT1;                                 // 0x0808 (size: 0x8)
    class UBoxComponent* WorkBoxAngle;                                                // 0x0810 (size: 0x8)
    class UBoxComponent* WorkBoxLeft;                                                 // 0x0818 (size: 0x8)
    class UBoxComponent* WorkBoxBack;                                                 // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SideRope03;                                           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Side03;                                               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* Side02;                                               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* SideRope01;                                           // 0x0840 (size: 0x8)
    class UDecalComponent* BSDecal;                                                   // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Side01;                                               // 0x0850 (size: 0x8)

}; // Size: 0x858

#endif
