#ifndef UE4SS_SDK_BPFoundation02T1_HPP
#define UE4SS_SDK_BPFoundation02T1_HPP

class ABPFoundation02T1_C : public ABPFoundationBase_C
{
    class UStaticMeshComponent* CenterBorder;                                         // 0x0818 (size: 0x8)
    class UStaticMeshComponent* FrontBorder;                                          // 0x0820 (size: 0x8)
    class UStaticMeshComponent* RightBorder;                                          // 0x0828 (size: 0x8)
    class UStaticMeshComponent* BackLeftPillar;                                       // 0x0830 (size: 0x8)
    class UStaticMeshComponent* LeftBorder;                                           // 0x0838 (size: 0x8)
    class UStaticMeshComponent* BackBorder;                                           // 0x0840 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0848 (size: 0x8)
    class UBuildSocketComponent* CenterSocket;                                        // 0x0850 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x0858 (size: 0x8)

}; // Size: 0x860

#endif
