#ifndef UE4SS_SDK_BPFoxhole_HPP
#define UE4SS_SDK_BPFoxhole_HPP

class ABPFoxhole_C : public AFoxhole
{
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x07D0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket7;                               // 0x07D8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket6;                               // 0x07E0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket5;                               // 0x07E8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket4;                               // 0x07F0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket3;                               // 0x07F8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket2;                               // 0x0800 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket1;                               // 0x0808 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheckSocket;                                // 0x0810 (size: 0x8)
    class UStaticMeshComponent* pvpFoxhole01;                                         // 0x0818 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0828 (size: 0x8)
    class UBoxComponent* Hole;                                                        // 0x0830 (size: 0x8)

}; // Size: 0x838

#endif
