#ifndef UE4SS_SDK_BPFortCornerDestroyedT2_HPP
#define UE4SS_SDK_BPFortCornerDestroyedT2_HPP

class ABPFortCornerDestroyedT2_C : public AFort
{
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0800 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedBackLeft;                         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedAngle;                            // 0x0810 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedLeft;                             // 0x0818 (size: 0x8)
    class UStaticMeshComponent* FortT2AngleDestroyedBack;                             // 0x0820 (size: 0x8)
    class UTemplateComponent* FortCornerCommon;                                       // 0x0828 (size: 0x8)
    class UStaticMeshComponent* DirtLeftConnected;                                    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* DirtRightConnected;                                   // 0x0838 (size: 0x8)
    class UStaticMeshComponent* DirtTriangle;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* DirtAngle;                                            // 0x0850 (size: 0x8)
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0880 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
