#ifndef UE4SS_SDK_BPFortGarrisonStation_HPP
#define UE4SS_SDK_BPFortGarrisonStation_HPP

class ABPFortGarrisonStation_C : public AFortGarrisonStation
{
    class UPointLightComponent* PointLight42;                                         // 0x0870 (size: 0x8)
    class UPointLightComponent* PointLight41;                                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* LadderRight;                                          // 0x0880 (size: 0x8)
    class UStaticMeshComponent* LadderLeft;                                           // 0x0888 (size: 0x8)
    class USpotLightComponent* SpotLight13;                                           // 0x0890 (size: 0x8)
    class UPointLightComponent* PointLight40;                                         // 0x0898 (size: 0x8)
    class UStaticMeshComponent* FactoryLight1;                                        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* FactoryLight;                                         // 0x08A8 (size: 0x8)
    class UPointLightComponent* PointLight39;                                         // 0x08B0 (size: 0x8)
    class USpawnPointComponent* SpawnPointRoof1;                                      // 0x08B8 (size: 0x8)
    class USpawnPointComponent* SpawnPointRoof0;                                      // 0x08C0 (size: 0x8)
    class USpawnPointComponent* SpawnPointRoof6;                                      // 0x08C8 (size: 0x8)
    class USpawnPointComponent* SpawnPointRoof5;                                      // 0x08D0 (size: 0x8)
    class USpawnPointComponent* SpawnPointRoof4;                                      // 0x08D8 (size: 0x8)
    class USpawnPointComponent* SpawnPointRoof3;                                      // 0x08E0 (size: 0x8)
    class USpawnPointComponent* SpawnPointRoof2;                                      // 0x08E8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint14;                                         // 0x08F0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint0;                                          // 0x08F8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint12;                                         // 0x0900 (size: 0x8)
    class USpawnPointComponent* SpawnPoint11;                                         // 0x0908 (size: 0x8)
    class USpawnPointComponent* SpawnPoint10;                                         // 0x0910 (size: 0x8)
    class USpawnPointComponent* SpawnPoint9;                                          // 0x0918 (size: 0x8)
    class USpawnPointComponent* SpawnPoint8;                                          // 0x0920 (size: 0x8)
    class USpawnPointComponent* SpawnPoint13;                                         // 0x0928 (size: 0x8)
    class USpawnPointComponent* SpawnPoint6;                                          // 0x0930 (size: 0x8)
    class USpawnPointComponent* SpawnPoint5;                                          // 0x0938 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x0940 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x0948 (size: 0x8)
    class USpawnPointComponent* SpawnPoint2;                                          // 0x0950 (size: 0x8)
    class USpawnPointComponent* SpawnPoint1;                                          // 0x0958 (size: 0x8)
    class USpawnPointComponent* SpawnPoint7;                                          // 0x0960 (size: 0x8)
    class UStaticMeshComponent* RoofRightDamaged;                                     // 0x0968 (size: 0x8)
    class UStaticMeshComponent* RoofLeftDamaged;                                      // 0x0970 (size: 0x8)
    class UStaticMeshComponent* RoofRight;                                            // 0x0978 (size: 0x8)
    class UStaticMeshComponent* RoofLeft;                                             // 0x0980 (size: 0x8)
    class ULadderComponent* Ladder1;                                                  // 0x0988 (size: 0x8)
    class ULadderComponent* Ladder0;                                                  // 0x0990 (size: 0x8)
    class UTemplateComponent* FortGarrisonStationCommon;                              // 0x0998 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponent;                        // 0x09A0 (size: 0x8)

}; // Size: 0x9A8

#endif
