#ifndef UE4SS_SDK_BPFortArtilleryShelterT2_HPP
#define UE4SS_SDK_BPFortArtilleryShelterT2_HPP

class ABPFortArtilleryShelterT2_C : public AFortArtilleryShelter
{
    class UTemplateComponent* FortCommonT2Corners;                                    // 0x0850 (size: 0x8)
    class UTemplateComponent* FortCommonT2T3ModsMinimal;                              // 0x0858 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x0860 (size: 0x8)
    class UTemplateComponent* FortCommonMods;                                         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* ArtilleryShelterRoof;                                 // 0x0870 (size: 0x8)
    class UStaticMeshComponent* RoofDirt;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* ArtilleryShelter;                                     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0888 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT2;                                       // 0x0890 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
