#ifndef UE4SS_SDK_BPFortCornerDestroyedT3_HPP
#define UE4SS_SDK_BPFortCornerDestroyedT3_HPP

class ABPFortCornerDestroyedT3_C : public ADestroyedFort
{
    class UTemplateComponent* FortCornerBreachCommonSockets;                          // 0x0830 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0838 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackRight;                                  // 0x0840 (size: 0x8)
    class UStaticMeshComponent* DirtCornerFrontLeftTrench;                            // 0x0848 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackRightTrench;                            // 0x0850 (size: 0x8)
    class UStaticMeshComponent* DirtTriangle;                                         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* DirtCornerBackLeft;                                   // 0x0860 (size: 0x8)
    class UStaticMeshComponent* DirtCornerFrontLeft;                                  // 0x0868 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0870 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* FortT3AngleDestroyedAngle;                            // 0x0880 (size: 0x8)
    class UStaticMeshComponent* FortT3AngleDestroyedLeft;                             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* FortT3AngleDestroyedBack;                             // 0x0890 (size: 0x8)
    class UTemplateComponent* FortCornerBreachCommon;                                 // 0x0898 (size: 0x8)
    class UStaticMeshComponent* FortT3Destroyed01;                                    // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
