#ifndef UE4SS_SDK_BPFortBuildSite_HPP
#define UE4SS_SDK_BPFortBuildSite_HPP

class ABPFortBuildSite_C : public AFortBuildSite
{
    class UTemplateComponent* FortCommonDirtT1T2;                                     // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* Side02;                                               // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SideRope02;                                           // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* SideRope01;                                           // 0x07F8 (size: 0x8)
    class UDecalComponent* BSDecal;                                                   // 0x0800 (size: 0x8)
    class UStaticMeshComponent* Side01;                                               // 0x0808 (size: 0x8)
    class UBuildSocketComponent* FrontFortSocket;                                     // 0x0810 (size: 0x8)
    class UBuildSocketComponent* RightFortSocket;                                     // 0x0818 (size: 0x8)
    class UBuildSocketComponent* BackFortSocket;                                      // 0x0820 (size: 0x8)
    class UBuildSocketComponent* LeftFortSocket;                                      // 0x0828 (size: 0x8)
    class UBoxComponent* WorkBox;                                                     // 0x0830 (size: 0x8)

}; // Size: 0x838

#endif
