#ifndef UE4SS_SDK_BPFoundation012x2T1_HPP
#define UE4SS_SDK_BPFoundation012x2T1_HPP

class ABPFoundation012x2T1_C : public ABPFoundationBase_C
{
    class UStaticMeshComponent* RightBorder1;                                         // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* LeftBorder0;                                          // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* FrontLeftPillar;                                      // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* BackBorder0;                                          // 0x0800 (size: 0x8)
    class UStaticMeshComponent* FrontBorder0;                                         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* FrontBorder1;                                         // 0x0810 (size: 0x8)
    class UStaticMeshComponent* BackBorder1;                                          // 0x0818 (size: 0x8)
    class UStaticMeshComponent* BackLeftPillar;                                       // 0x0820 (size: 0x8)
    class UStaticMeshComponent* LeftBorder1;                                          // 0x0828 (size: 0x8)
    class UStaticMeshComponent* BackRightPillar;                                      // 0x0830 (size: 0x8)
    class UStaticMeshComponent* FrontRightPillar;                                     // 0x0838 (size: 0x8)
    class UStaticMeshComponent* RightBorder0;                                         // 0x0840 (size: 0x8)
    class UBuildSocketComponent* LeftSocket1;                                         // 0x0848 (size: 0x8)
    class UBuildSocketComponent* LeftSocket0;                                         // 0x0850 (size: 0x8)
    class UBuildSocketComponent* BackSocket1;                                         // 0x0858 (size: 0x8)
    class UBuildSocketComponent* BackSocket0;                                         // 0x0860 (size: 0x8)
    class UBuildSocketComponent* RightSocket1;                                        // 0x0868 (size: 0x8)
    class UBuildSocketComponent* RightSocket0;                                        // 0x0870 (size: 0x8)
    class UBuildSocketComponent* FrontSocket1;                                        // 0x0878 (size: 0x8)
    class UBuildSocketComponent* FrontSocket0;                                        // 0x0880 (size: 0x8)

}; // Size: 0x888

#endif
