#ifndef UE4SS_SDK_BPFortFlameT2_HPP
#define UE4SS_SDK_BPFortFlameT2_HPP

class ABPFortFlameT2_C : public AFortFireSuppression
{
    class UTemplateComponent* FortCommonT2Corners;                                    // 0x0860 (size: 0x8)
    class UTemplateComponent* FortCommonThreeWallsMods;                               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* SideRight;                                            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* RoofDirt;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0880 (size: 0x8)
    class USkeletalMeshComponent* FortFlame;                                          // 0x0888 (size: 0x8)
    class UDecalComponent* InputDecal0;                                               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* InputMesh0;                                           // 0x0898 (size: 0x8)
    class UBuildSocketComponent* PipeInput0;                                          // 0x08A0 (size: 0x8)
    class UTemplateComponent* FortFlameT2BreachedWalls;                               // 0x08A8 (size: 0x8)
    class UTemplateComponent* FortFlameT2T3Mods;                                      // 0x08B0 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x08B8 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT2;                                       // 0x08C0 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x08C8 (size: 0x8)
    class UTemplateComponent* FortFlameCommon;                                        // 0x08D0 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMeshFloor;            // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08E0 (size: 0x8)

}; // Size: 0x8E8

#endif
