#ifndef UE4SS_SDK_BPFortCornerBuildSite_HPP
#define UE4SS_SDK_BPFortCornerBuildSite_HPP

class ABPFortCornerBuildSite_C : public AFortBuildSite
{
    class UBoxComponent* WorkBoxAngle;                                                // 0x07D0 (size: 0x8)
    class UBoxComponent* WorkBoxLeft;                                                 // 0x07D8 (size: 0x8)
    class UBoxComponent* WorkBoxBack;                                                 // 0x07E0 (size: 0x8)
    class UBuildSocketComponent* AngleFortSocket;                                     // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* SideRope03;                                           // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* Side03;                                               // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Side02;                                               // 0x0800 (size: 0x8)
    class UStaticMeshComponent* SideRope01;                                           // 0x0808 (size: 0x8)
    class UDecalComponent* BSDecal;                                                   // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Side01;                                               // 0x0818 (size: 0x8)
    class UBuildSocketComponent* BackFortSocket;                                      // 0x0820 (size: 0x8)
    class UBuildSocketComponent* LeftFortSocket;                                      // 0x0828 (size: 0x8)

}; // Size: 0x830

#endif
