#ifndef UE4SS_SDK_BPFoundation01T1_HPP
#define UE4SS_SDK_BPFoundation01T1_HPP

class ABPFoundation01T1_C : public ABPFoundationBase_C
{
    class UStaticMeshComponent* BackLeftPillar;                                       // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* BackRightPillar;                                      // 0x0800 (size: 0x8)
    class UStaticMeshComponent* FrontRightPillar;                                     // 0x0808 (size: 0x8)
    class UStaticMeshComponent* FrontLeftPillar;                                      // 0x0810 (size: 0x8)
    class UStaticMeshComponent* RightBorder;                                          // 0x0818 (size: 0x8)
    class UStaticMeshComponent* LeftBorder;                                           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* FrontBorder;                                          // 0x0828 (size: 0x8)
    class UStaticMeshComponent* BackBorder;                                           // 0x0830 (size: 0x8)
    class UBuildSocketComponent* RightSocket;                                         // 0x0838 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0840 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x0848 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x0850 (size: 0x8)

}; // Size: 0x858

#endif
