#ifndef UE4SS_SDK_BPFortBaseT2_HPP
#define UE4SS_SDK_BPFortBaseT2_HPP

class ABPFortBaseT2_C : public AFortForwardBase
{
    class UTemplateComponent* FortBaseCommon;                                         // 0x08E0 (size: 0x8)
    class UTemplateComponent* FortBaseCommonDirtT1T2;                                 // 0x08E8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint12;                                         // 0x08F0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint9;                                          // 0x08F8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint17;                                         // 0x0900 (size: 0x8)
    class USpawnPointComponent* SpawnPoint16;                                         // 0x0908 (size: 0x8)
    class USpawnPointComponent* SpawnPoint15;                                         // 0x0910 (size: 0x8)
    class USpawnPointComponent* SpawnPoint11;                                         // 0x0918 (size: 0x8)
    class USpawnPointComponent* SpawnPoint10;                                         // 0x0920 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0928 (size: 0x8)
    class UBPWaterStencilComponent_C* WaterStencil;                                   // 0x0930 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0938 (size: 0x8)
    class UBoxComponent* BlockBuildSiteMovement;                                      // 0x0940 (size: 0x8)
    class UStaticMeshComponent* RoofDirt;                                             // 0x0948 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0950 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0958 (size: 0x8)
    class UStaticMeshComponent* FloorDoor;                                            // 0x0960 (size: 0x8)
    class UStaticMeshComponent* SideFrontStatic;                                      // 0x0968 (size: 0x8)
    class UStaticMeshComponent* SideLeftStatic;                                       // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SideBackStatic;                                       // 0x0978 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0980 (size: 0x8)
    class UStaticMeshComponent* SideBack;                                             // 0x0988 (size: 0x8)
    class UStaticMeshComponent* SideLeft;                                             // 0x0990 (size: 0x8)
    class UStaticMeshComponent* SideFront;                                            // 0x0998 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x09B0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x09B8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x09C0 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x09D0 (size: 0x8)
    class UBuildSocketComponent* BackWallSocket;                                      // 0x09D8 (size: 0x8)
    class UBuildSocketComponent* FrontWallSocket;                                     // 0x09E0 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x09E8 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x09F0 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0A00 (size: 0x8)
    class UBoatHullComponent* BoatHull;                                               // 0x0A08 (size: 0x8)
    class UCameraComponent* ViewTargetCamera;                                         // 0x0A10 (size: 0x8)

}; // Size: 0xA18

#endif
