#ifndef UE4SS_SDK_BPFortFlameT3_HPP
#define UE4SS_SDK_BPFortFlameT3_HPP

class ABPFortFlameT3_C : public AFortFireSuppression
{
    class UTemplateComponent* FortFlameCommonThreeWallsMods;                          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* SideLeft;                                             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* InputMesh1;                                           // 0x08A0 (size: 0x8)
    class UDecalComponent* InputDecal1;                                               // 0x08A8 (size: 0x8)
    class UBuildSocketComponent* PipeInput1;                                          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x08B8 (size: 0x8)
    class USkeletalMeshComponent* FortFlame;                                          // 0x08C0 (size: 0x8)
    class UTemplateComponent* FortFlameT3BreachedWalls;                               // 0x08C8 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT3;                                       // 0x08D0 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x08D8 (size: 0x8)
    class UTemplateComponent* FortFlameCommon;                                        // 0x08E0 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0900 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0908 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0910 (size: 0x8)

}; // Size: 0x918

#endif
