#ifndef UE4SS_SDK_BPFortFirePitT1_HPP
#define UE4SS_SDK_BPFortFirePitT1_HPP

class ABPFortFirePitT1_C : public AFortFirePit
{
    class UTemplateComponent* FortCommonThreeWallsMods;                               // 0x0860 (size: 0x8)
    class UTemplateComponent* FortCommonT1BreachedWalls;                              // 0x0868 (size: 0x8)
    class UStaticMeshComponent* RearWall;                                             // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0878 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x0880 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0888 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0890 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* FirePitMesh;                                          // 0x08A0 (size: 0x8)
    class UTemplateComponent* FortFirePitCommonFire;                                  // 0x08A8 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT1T2;                                     // 0x08B0 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x08B8 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08C8 (size: 0x8)

}; // Size: 0x8D0

#endif
