#ifndef UE4SS_SDK_BPFortCornerBuildGhost_HPP
#define UE4SS_SDK_BPFortCornerBuildGhost_HPP

class ABPFortCornerBuildGhost_C : public ABuildGhost
{
    class UBuildSocketComponent* SlopeDetectionSocket;                                // 0x0580 (size: 0x8)
    class UBuildSocketComponent* AngleFortSocket;                                     // 0x0588 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope04;                          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side05;                              // 0x0598 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side04;                              // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope03;                          // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side03;                              // 0x05B0 (size: 0x8)
    class UBuildSocketComponent* BackFortSocket;                                      // 0x05B8 (size: 0x8)
    class UBuildSocketComponent* LeftFortSocket;                                      // 0x05C0 (size: 0x8)

}; // Size: 0x5C8

#endif
