#ifndef UE4SS_SDK_BPGarrisonHouseFishHut2_HPP
#define UE4SS_SDK_BPGarrisonHouseFishHut2_HPP

class ABPGarrisonHouseFishHut2_C : public AGarrisonHouse
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0880 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0888 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x08A0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x08A8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x08B0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x08B8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x08C8 (size: 0x8)

}; // Size: 0x8D0

#endif
