#ifndef UE4SS_SDK_BPGarrisonHouseFishHut2_HPP
#define UE4SS_SDK_BPGarrisonHouseFishHut2_HPP

class ABPGarrisonHouseFishHut2_C : public AGarrisonHouse
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0830 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0838 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0840 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0848 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0850 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x0858 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x0860 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0868 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0878 (size: 0x8)

}; // Size: 0x880

#endif
