#ifndef UE4SS_SDK_BPGarrisonFishHut01_HPP
#define UE4SS_SDK_BPGarrisonFishHut01_HPP

class ABPGarrisonFishHut01_C : public AGarrisonHouse
{
    class UBoxComponent* CollisonProps03;                                             // 0x0840 (size: 0x8)
    class UBoxComponent* CollisonProps02;                                             // 0x0848 (size: 0x8)
    class UBoxComponent* CollisonProps01;                                             // 0x0850 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0858 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* SM_Tire_03;                                           // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Rope02;                                               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom;                                    // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* WoodBarrel_01;                                        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x08B0 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x08B8 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x08C0 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x08D8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x08E0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x08E8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x08F0 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x08F8 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0900 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x0908 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0910 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0918 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0920 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0928 (size: 0x8)

}; // Size: 0x930

#endif
