#ifndef UE4SS_SDK_BPKeepBuildSite_HPP
#define UE4SS_SDK_BPKeepBuildSite_HPP

class ABPKeepBuildSite_C : public AKeepBuildSite
{
    class USpawnPointComponent* SpawnPoint7;                                          // 0x07F0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint6;                                          // 0x07F8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint5;                                          // 0x0800 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x0808 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x0810 (size: 0x8)
    class USpawnPointComponent* SpawnPoint2;                                          // 0x0818 (size: 0x8)
    class USpawnPointComponent* SpawnPoint1;                                          // 0x0820 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0828 (size: 0x8)
    class UArrowComponent* Arrow;                                                     // 0x0830 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0840 (size: 0x8)
    class UStaticMeshComponent* KeepMesh;                                             // 0x0848 (size: 0x8)

}; // Size: 0x850

#endif
