#ifndef UE4SS_SDK_BPLargeShipBattleshipW_HPP
#define UE4SS_SDK_BPLargeShipBattleshipW_HPP

class ABPLargeShipBattleshipW_C : public ALargeShip
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1690 (size: 0x8)
    class USkeletalMeshComponent* EngineWWheel;                                       // 0x1698 (size: 0x8)
    class USkeletalMeshComponent* EngineW1Wheel;                                      // 0x16A0 (size: 0x8)
    class USpotLightComponent* SpotLightRearNavalTurret;                              // 0x16A8 (size: 0x8)
    class UStaticMeshComponent* LightRearNavalTurret;                                 // 0x16B0 (size: 0x8)
    class UStaticMeshComponent* LightFrontNavalTurret;                                // 0x16B8 (size: 0x8)
    class USpotLightComponent* SpotLightFrontNavalTurret;                             // 0x16C0 (size: 0x8)
    class UStaticMeshComponent* LightMastRear1;                                       // 0x16C8 (size: 0x8)
    class USpotLightComponent* SpotLightMastRear1;                                    // 0x16D0 (size: 0x8)
    class UStaticMeshComponent* LightMastRear;                                        // 0x16D8 (size: 0x8)
    class USpotLightComponent* SpotLightMastRear;                                     // 0x16E0 (size: 0x8)
    class USpotLightComponent* SpotLightRearTurretR3;                                 // 0x16E8 (size: 0x8)
    class UStaticMeshComponent* LightRearTurretR3;                                    // 0x16F0 (size: 0x8)
    class USpotLightComponent* SpotLightMidTurretR2;                                  // 0x16F8 (size: 0x8)
    class UStaticMeshComponent* LightMidTurretR2;                                     // 0x1700 (size: 0x8)
    class UStaticMeshComponent* LightForeTurretR1;                                    // 0x1708 (size: 0x8)
    class USpotLightComponent* SpotLightForeTurretR1;                                 // 0x1710 (size: 0x8)
    class UStaticMeshComponent* LightForeR;                                           // 0x1718 (size: 0x8)
    class USpotLightComponent* SpotLightForeR;                                        // 0x1720 (size: 0x8)
    class USceneComponent* Exterior;                                                  // 0x1728 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentPort1;                 // 0x1730 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentStbd1;                 // 0x1738 (size: 0x8)
    class USkeletalMeshComponent* EngineW1;                                           // 0x1740 (size: 0x8)
    class USkeletalMeshComponent* EngineW;                                            // 0x1748 (size: 0x8)
    class USceneComponent* ShipEngineComponent;                                       // 0x1750 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea4;                       // 0x1758 (size: 0x8)
    class UAudioComponent* WaterLapping;                                              // 0x1760 (size: 0x8)
    class UBPLargeShipBattleshipWLadder_C* AmmoRoomLadderL;                           // 0x1768 (size: 0x8)
    class UBPLargeShipBattleshipWLadder_C* AmmoRoomLadderR;                           // 0x1770 (size: 0x8)
    class UBPLargeShipBattleshipWLadder_C* EngineRoomLadderL;                         // 0x1778 (size: 0x8)
    class UBPLargeShipBattleshipWLadder_C* EngineRoomLadderR;                         // 0x1780 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x1788 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x1790 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x1798 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x17A0 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x17A8 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x17B0 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x17B8 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x17C0 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x17C8 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x17D0 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x17D8 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x17E0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x17E8 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x17F0 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x17F8 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x1800 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x1808 (size: 0x8)
    class UDecalComponent* d3;                                                        // 0x1810 (size: 0x8)
    class UDecalComponent* d2;                                                        // 0x1818 (size: 0x8)
    class UDecalComponent* d1;                                                        // 0x1820 (size: 0x8)
    class UDecalComponent* D;                                                         // 0x1828 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x1830 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x1838 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x1840 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x1848 (size: 0x8)
    class UDecalComponent* DecalAnchorL;                                              // 0x1850 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x1858 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x1860 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x1868 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x1870 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x1878 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x1880 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMeshAI1;                                    // 0x1888 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMeshAI0;                                    // 0x1890 (size: 0x8)
    class UParticleSystemComponent* ExhaustFore;                                      // 0x1898 (size: 0x8)
    class UParticleSystemComponent* ExhaustAft;                                       // 0x18A0 (size: 0x8)
    class UParticleSystemComponent* WakeAft;                                          // 0x18A8 (size: 0x8)
    class UParticleSystemComponent* SideLeft;                                         // 0x18B0 (size: 0x8)
    class UParticleSystemComponent* WakeFore;                                         // 0x18B8 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeLeft;                                // 0x18C0 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeRight;                               // 0x18C8 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftRight;                                // 0x18D0 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftLeft;                                 // 0x18D8 (size: 0x8)
    class UParticleSystemComponent* SideRight;                                        // 0x18E0 (size: 0x8)
    class UAudioComponent* IdleLoop;                                                  // 0x18E8 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x18F0 (size: 0x8)
    class UPointLightComponent* PointLight27;                                         // 0x18F8 (size: 0x8)
    class UPointLightComponent* PointLight26;                                         // 0x1900 (size: 0x8)
    class UPointLightComponent* PointLight25;                                         // 0x1908 (size: 0x8)
    class USpotLightComponent* SpotLight13;                                           // 0x1910 (size: 0x8)
    class USpotLightComponent* SpotLight12;                                           // 0x1918 (size: 0x8)
    class USpotLightComponent* SpotLight11;                                           // 0x1920 (size: 0x8)
    class USpotLightComponent* SpotLight10;                                           // 0x1928 (size: 0x8)
    class USpotLightComponent* SpotLight9;                                            // 0x1930 (size: 0x8)
    class USpotLightComponent* SpotLight8;                                            // 0x1938 (size: 0x8)
    class USpotLightComponent* SpotLight7;                                            // 0x1940 (size: 0x8)
    class USpotLightComponent* SpotLight6;                                            // 0x1948 (size: 0x8)
    class USpotLightComponent* SpotLight5;                                            // 0x1950 (size: 0x8)
    class USpotLightComponent* SpotLight4;                                            // 0x1958 (size: 0x8)
    class UPointLightComponent* PointLight24;                                         // 0x1960 (size: 0x8)
    class UPointLightComponent* PointLight23;                                         // 0x1968 (size: 0x8)
    class UPointLightComponent* PointLight22;                                         // 0x1970 (size: 0x8)
    class UPointLightComponent* PointLight21;                                         // 0x1978 (size: 0x8)
    class UPointLightComponent* PointLight20;                                         // 0x1980 (size: 0x8)
    class UPointLightComponent* PointLight19;                                         // 0x1988 (size: 0x8)
    class UPointLightComponent* PointLight18;                                         // 0x1990 (size: 0x8)
    class UPointLightComponent* PointLight17;                                         // 0x1998 (size: 0x8)
    class UPointLightComponent* PointLight16;                                         // 0x19A0 (size: 0x8)
    class UPointLightComponent* PointLight15;                                         // 0x19A8 (size: 0x8)
    class UPointLightComponent* PointLight14;                                         // 0x19B0 (size: 0x8)
    class UPointLightComponent* PointLight13;                                         // 0x19B8 (size: 0x8)
    class UPointLightComponent* PointLight12;                                         // 0x19C0 (size: 0x8)
    class UPointLightComponent* PointLight11;                                         // 0x19C8 (size: 0x8)
    class UPointLightComponent* PointLight10;                                         // 0x19D0 (size: 0x8)
    class UPointLightComponent* PointLight9;                                          // 0x19D8 (size: 0x8)
    class UPointLightComponent* PointLight8;                                          // 0x19E0 (size: 0x8)
    class UPointLightComponent* PointLight7;                                          // 0x19E8 (size: 0x8)
    class UPointLightComponent* PointLight6;                                          // 0x19F0 (size: 0x8)
    class UPointLightComponent* PointLight5;                                          // 0x19F8 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x1A00 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x1A08 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x1A10 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x1A18 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x1A20 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x1A28 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x1A30 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x1A38 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x1A40 (size: 0x8)
    class UHatchComponent* RightLadderHatchExit;                                      // 0x1A48 (size: 0x8)
    class UHatchComponent* LeftLadderHatchExit;                                       // 0x1A50 (size: 0x8)
    class UHatchComponent* RightLadderHatchEntrance;                                  // 0x1A58 (size: 0x8)
    class UHatchComponent* LeftLadderHatchEntrance;                                   // 0x1A60 (size: 0x8)
    class UAITurretsControllerComponent* AITurretsController;                         // 0x1A68 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentStbd;                  // 0x1A70 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentPort;                  // 0x1A78 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat12;                                        // 0x1A80 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat11;                                        // 0x1A88 (size: 0x8)
    class USeatExitComponent* Gunner12Exit;                                           // 0x1A90 (size: 0x8)
    class USeatExitComponent* Gunner11Exit;                                           // 0x1A98 (size: 0x8)
    class USeatTriggerComponent* Gunner12Trigger;                                     // 0x1AA0 (size: 0x8)
    class USeatTriggerComponent* Gunner11Trigger;                                     // 0x1AA8 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox12;                                // 0x1AB0 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox11;                                // 0x1AB8 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat9;                                         // 0x1AC0 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat10;                                        // 0x1AC8 (size: 0x8)
    class USeatExitComponent* Gunner10Exit;                                           // 0x1AD0 (size: 0x8)
    class USeatExitComponent* Gunner9Exit;                                            // 0x1AD8 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox10;                                // 0x1AE0 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox9;                                 // 0x1AE8 (size: 0x8)
    class USeatTriggerComponent* Gunner10Trigger;                                     // 0x1AF0 (size: 0x8)
    class USeatTriggerComponent* Gunner9Trigger;                                      // 0x1AF8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint8;                                          // 0x1B00 (size: 0x8)
    class USpawnPointComponent* SpawnPoint7;                                          // 0x1B08 (size: 0x8)
    class USpawnPointComponent* SpawnPoint2;                                          // 0x1B10 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x1B18 (size: 0x8)
    class UBPLargeShipAIArtilleryGunTurretComponent_C* BPLargeShipAIArtilleryGunTurretComponent1; // 0x1B20 (size: 0x8)
    class UBPLargeShipAIArtilleryGunTurretComponent_C* BPLargeShipAIArtilleryGunTurretComponent0; // 0x1B28 (size: 0x8)
    class UItemGroupRenderComponent* ItemGroupRender2;                                // 0x1B30 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh3;                        // 0x1B38 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh2;                        // 0x1B40 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh1;                        // 0x1B48 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh0;                        // 0x1B50 (size: 0x8)
    class UItemGroupRenderComponent* ItemGroupRender1;                                // 0x1B58 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh5;                        // 0x1B60 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh4;                        // 0x1B68 (size: 0x8)
    class UBPAnchorDropped_C* AnchorDropped;                                          // 0x1B70 (size: 0x8)
    class UBPAnchorRaised_C* AnchorRaised;                                            // 0x1B78 (size: 0x8)
    class UBPAnchorComponent_C* BPAnchorComponent;                                    // 0x1B80 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x1B88 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x1B90 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox13;                                // 0x1B98 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor5;                                               // 0x1BA0 (size: 0x8)
    class UBoxComponent* DoorObstruction5;                                            // 0x1BA8 (size: 0x8)
    class UBoxComponent* DoorObstruction4;                                            // 0x1BB0 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor4;                                               // 0x1BB8 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomRegion0;                                      // 0x1BC0 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomWater0;                                       // 0x1BC8 (size: 0x8)
    class URoomComponent* AmmoRoom0;                                                  // 0x1BD0 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp3;                                           // 0x1BD8 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp2;                                           // 0x1BE0 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp1;                                           // 0x1BE8 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp0;                                           // 0x1BF0 (size: 0x8)
    class USeatExitComponent* GunnerExit5;                                            // 0x1BF8 (size: 0x8)
    class USeatExitComponent* GunnerExit4;                                            // 0x1C00 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger5;                                      // 0x1C08 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger4;                                      // 0x1C10 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox5;                                 // 0x1C18 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox4;                                 // 0x1C20 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat5;                                         // 0x1C28 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat4;                                         // 0x1C30 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox6;                                 // 0x1C38 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor;                                                // 0x1C40 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor3;                                               // 0x1C48 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor2;                                               // 0x1C50 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor1;                                               // 0x1C58 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMesh1;                                      // 0x1C60 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox8;                                 // 0x1C68 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox7;                                 // 0x1C70 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox3;                                 // 0x1C78 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox2;                                 // 0x1C80 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox1;                                 // 0x1C88 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox0;                                 // 0x1C90 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat8;                                         // 0x1C98 (size: 0x8)
    class USeatExitComponent* Gunner8Exit;                                            // 0x1CA0 (size: 0x8)
    class USeatExitComponent* Gunner7Exit;                                            // 0x1CA8 (size: 0x8)
    class USeatTriggerComponent* Gunner8Trigger;                                      // 0x1CB0 (size: 0x8)
    class USeatTriggerComponent* Gunner7Trigger;                                      // 0x1CB8 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat7;                                         // 0x1CC0 (size: 0x8)
    class UVehicleSeatComponent* SpotterSeat6;                                        // 0x1CC8 (size: 0x8)
    class USeatExitComponent* SpotterExit6;                                           // 0x1CD0 (size: 0x8)
    class USeatTriggerComponent* SpotterTrigger6;                                     // 0x1CD8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint6;                                          // 0x1CE0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint5;                                          // 0x1CE8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint1;                                          // 0x1CF0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x1CF8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x1D00 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponent2;                       // 0x1D08 (size: 0x8)
    class UBoatHullMeshComponent* BoatHullMesh;                                       // 0x1D10 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat3;                                         // 0x1D18 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat2;                                         // 0x1D20 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat1;                                         // 0x1D28 (size: 0x8)
    class USeatExitComponent* GunnerExit3;                                            // 0x1D30 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger3;                                      // 0x1D38 (size: 0x8)
    class USeatExitComponent* GunnerExit2;                                            // 0x1D40 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger2;                                      // 0x1D48 (size: 0x8)
    class USeatExitComponent* GunnerExit1;                                            // 0x1D50 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger1;                                      // 0x1D58 (size: 0x8)
    class USkeletalMeshComponent* Deck;                                               // 0x1D60 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x1D68 (size: 0x8)
    class UBoxComponent* DoorObstruction3;                                            // 0x1D70 (size: 0x8)
    class UBoxComponent* DoorObstruction2;                                            // 0x1D78 (size: 0x8)
    class UBoxComponent* DoorObstruction1;                                            // 0x1D80 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomWater1;                                       // 0x1D88 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomRegion1;                                      // 0x1D90 (size: 0x8)
    class URoomComponent* AmmoRoom1;                                                  // 0x1D98 (size: 0x8)
    class UStaticMeshComponent* BarracksRoomWater;                                    // 0x1DA0 (size: 0x8)
    class UStaticMeshComponent* BarracksRoomRegion;                                   // 0x1DA8 (size: 0x8)
    class UStaticMeshComponent* EngineRoomWater;                                      // 0x1DB0 (size: 0x8)
    class UStaticMeshComponent* EngineRoomRegion;                                     // 0x1DB8 (size: 0x8)
    class UBoxComponent* DoorObstruction;                                             // 0x1DC0 (size: 0x8)
    class USeatTriggerComponent* DriverTrigger;                                       // 0x1DC8 (size: 0x8)
    class USeatExitComponent* DriverExit;                                             // 0x1DD0 (size: 0x8)
    class UCameraComponent* Camera;                                                   // 0x1DD8 (size: 0x8)
    class UVehicleSeatComponent* DriverSeat0;                                         // 0x1DE0 (size: 0x8)
    class URoomComponent* BarracksRoom;                                               // 0x1DE8 (size: 0x8)
    class URoomComponent* EngineRoom;                                                 // 0x1DF0 (size: 0x8)
    class UFloodableComponent* Floodable;                                             // 0x1DF8 (size: 0x8)

    void BPOnClientBeginPlay();
    void ExecuteUbergraph_BPLargeShipBattleshipW(int32 EntryPoint);
}; // Size: 0x1E00

#endif
