#ifndef UE4SS_SDK_BPLargeShipResourceShip_HPP
#define UE4SS_SDK_BPLargeShipResourceShip_HPP

class ABPLargeShipResourceShip_C : public ALargeShip
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1690 (size: 0x8)
    class USkeletalMeshComponent* NeutralEngineWheel;                                 // 0x1698 (size: 0x8)
    class USkeletalMeshComponent* NeutralEngine;                                      // 0x16A0 (size: 0x8)
    class UPointLightComponent* PointLight37;                                         // 0x16A8 (size: 0x8)
    class UPointLightComponent* PointLight33;                                         // 0x16B0 (size: 0x8)
    class UInstancedStaticMeshComponent* Light2;                                      // 0x16B8 (size: 0x8)
    class UBPResourceGroupRenderComponent_C* BPResourceGroupRenderComponent1;         // 0x16C0 (size: 0x8)
    class UStaticMeshComponent* Node75;                                               // 0x16C8 (size: 0x8)
    class UStaticMeshComponent* Node74;                                               // 0x16D0 (size: 0x8)
    class UStaticMeshComponent* Node73;                                               // 0x16D8 (size: 0x8)
    class UStaticMeshComponent* Node72;                                               // 0x16E0 (size: 0x8)
    class UStaticMeshComponent* Node71;                                               // 0x16E8 (size: 0x8)
    class UStaticMeshComponent* Node70;                                               // 0x16F0 (size: 0x8)
    class UStaticMeshComponent* Node69;                                               // 0x16F8 (size: 0x8)
    class UStaticMeshComponent* Node68;                                               // 0x1700 (size: 0x8)
    class UStaticMeshComponent* Node67;                                               // 0x1708 (size: 0x8)
    class UStaticMeshComponent* Node66;                                               // 0x1710 (size: 0x8)
    class UStaticMeshComponent* Node65;                                               // 0x1718 (size: 0x8)
    class UStaticMeshComponent* Node64;                                               // 0x1720 (size: 0x8)
    class UStaticMeshComponent* Node63;                                               // 0x1728 (size: 0x8)
    class UStaticMeshComponent* Node62;                                               // 0x1730 (size: 0x8)
    class UStaticMeshComponent* Node61;                                               // 0x1738 (size: 0x8)
    class UStaticMeshComponent* Node60;                                               // 0x1740 (size: 0x8)
    class UStaticMeshComponent* Node59;                                               // 0x1748 (size: 0x8)
    class UStaticMeshComponent* Node58;                                               // 0x1750 (size: 0x8)
    class UStaticMeshComponent* Node57;                                               // 0x1758 (size: 0x8)
    class UStaticMeshComponent* Node56;                                               // 0x1760 (size: 0x8)
    class UStaticMeshComponent* Node55;                                               // 0x1768 (size: 0x8)
    class UStaticMeshComponent* Node54;                                               // 0x1770 (size: 0x8)
    class UStaticMeshComponent* Node53;                                               // 0x1778 (size: 0x8)
    class UStaticMeshComponent* Node52;                                               // 0x1780 (size: 0x8)
    class UStaticMeshComponent* Node51;                                               // 0x1788 (size: 0x8)
    class UStaticMeshComponent* Node50;                                               // 0x1790 (size: 0x8)
    class UStaticMeshComponent* Node49;                                               // 0x1798 (size: 0x8)
    class UStaticMeshComponent* Node48;                                               // 0x17A0 (size: 0x8)
    class UStaticMeshComponent* Node47;                                               // 0x17A8 (size: 0x8)
    class UStaticMeshComponent* Node46;                                               // 0x17B0 (size: 0x8)
    class UStaticMeshComponent* Node45;                                               // 0x17B8 (size: 0x8)
    class UStaticMeshComponent* Node44;                                               // 0x17C0 (size: 0x8)
    class UStaticMeshComponent* Node43;                                               // 0x17C8 (size: 0x8)
    class UStaticMeshComponent* Node019;                                              // 0x17D0 (size: 0x8)
    class UStaticMeshComponent* Node018;                                              // 0x17D8 (size: 0x8)
    class UStaticMeshComponent* Node017;                                              // 0x17E0 (size: 0x8)
    class UStaticMeshComponent* Node016;                                              // 0x17E8 (size: 0x8)
    class UStaticMeshComponent* Node015;                                              // 0x17F0 (size: 0x8)
    class UStaticMeshComponent* Node014;                                              // 0x17F8 (size: 0x8)
    class UStaticMeshComponent* Node013;                                              // 0x1800 (size: 0x8)
    class UStaticMeshComponent* Node012;                                              // 0x1808 (size: 0x8)
    class UStaticMeshComponent* Node011;                                              // 0x1810 (size: 0x8)
    class UStaticMeshComponent* Node010;                                              // 0x1818 (size: 0x8)
    class UBPResourceGroupRenderComponent_C* BPResourceGroupRenderComponent0;         // 0x1820 (size: 0x8)
    class UStaticMeshComponent* Node42;                                               // 0x1828 (size: 0x8)
    class UStaticMeshComponent* Node41;                                               // 0x1830 (size: 0x8)
    class UStaticMeshComponent* Node40;                                               // 0x1838 (size: 0x8)
    class UStaticMeshComponent* Node39;                                               // 0x1840 (size: 0x8)
    class UStaticMeshComponent* Node38;                                               // 0x1848 (size: 0x8)
    class UStaticMeshComponent* Node37;                                               // 0x1850 (size: 0x8)
    class UStaticMeshComponent* Node36;                                               // 0x1858 (size: 0x8)
    class UStaticMeshComponent* Node35;                                               // 0x1860 (size: 0x8)
    class UStaticMeshComponent* Node34;                                               // 0x1868 (size: 0x8)
    class UStaticMeshComponent* Node33;                                               // 0x1870 (size: 0x8)
    class UStaticMeshComponent* Node32;                                               // 0x1878 (size: 0x8)
    class UStaticMeshComponent* Node31;                                               // 0x1880 (size: 0x8)
    class UStaticMeshComponent* Node30;                                               // 0x1888 (size: 0x8)
    class UStaticMeshComponent* Node29;                                               // 0x1890 (size: 0x8)
    class UStaticMeshComponent* Node28;                                               // 0x1898 (size: 0x8)
    class UStaticMeshComponent* Node27;                                               // 0x18A0 (size: 0x8)
    class UStaticMeshComponent* Node26;                                               // 0x18A8 (size: 0x8)
    class UStaticMeshComponent* Node25;                                               // 0x18B0 (size: 0x8)
    class UStaticMeshComponent* Node24;                                               // 0x18B8 (size: 0x8)
    class UStaticMeshComponent* Node23;                                               // 0x18C0 (size: 0x8)
    class UStaticMeshComponent* Node22;                                               // 0x18C8 (size: 0x8)
    class UStaticMeshComponent* Node21;                                               // 0x18D0 (size: 0x8)
    class UStaticMeshComponent* Node20;                                               // 0x18D8 (size: 0x8)
    class UStaticMeshComponent* Node19;                                               // 0x18E0 (size: 0x8)
    class UStaticMeshComponent* Node18;                                               // 0x18E8 (size: 0x8)
    class UStaticMeshComponent* Node17;                                               // 0x18F0 (size: 0x8)
    class UStaticMeshComponent* Node16;                                               // 0x18F8 (size: 0x8)
    class UStaticMeshComponent* Node15;                                               // 0x1900 (size: 0x8)
    class UStaticMeshComponent* Node14;                                               // 0x1908 (size: 0x8)
    class UStaticMeshComponent* Node13;                                               // 0x1910 (size: 0x8)
    class UStaticMeshComponent* Node12;                                               // 0x1918 (size: 0x8)
    class UStaticMeshComponent* Node11;                                               // 0x1920 (size: 0x8)
    class UStaticMeshComponent* Node10;                                               // 0x1928 (size: 0x8)
    class UStaticMeshComponent* Node09;                                               // 0x1930 (size: 0x8)
    class UStaticMeshComponent* Node08;                                               // 0x1938 (size: 0x8)
    class UStaticMeshComponent* Node07;                                               // 0x1940 (size: 0x8)
    class UStaticMeshComponent* Node06;                                               // 0x1948 (size: 0x8)
    class UStaticMeshComponent* Node05;                                               // 0x1950 (size: 0x8)
    class UStaticMeshComponent* Node04;                                               // 0x1958 (size: 0x8)
    class UStaticMeshComponent* Node00;                                               // 0x1960 (size: 0x8)
    class UStaticMeshComponent* Node03;                                               // 0x1968 (size: 0x8)
    class UStaticMeshComponent* Node02;                                               // 0x1970 (size: 0x8)
    class UStaticMeshComponent* Node01;                                               // 0x1978 (size: 0x8)
    class USpotLightComponent* SpotLight4;                                            // 0x1980 (size: 0x8)
    class UStaticMeshComponent* LightMesh3;                                           // 0x1988 (size: 0x8)
    class UStaticMeshComponent* LightMesh2;                                           // 0x1990 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x1998 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor0;                                               // 0x19A0 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox2;                                 // 0x19A8 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox1;                                 // 0x19B0 (size: 0x8)
    class UDecalComponent* SpotterDecal;                                              // 0x19B8 (size: 0x8)
    class UDecalComponent* DoorDecalL3;                                               // 0x19C0 (size: 0x8)
    class USpotLightComponent* SpotLight13;                                           // 0x19C8 (size: 0x8)
    class USpotLightComponent* SpotLight12;                                           // 0x19D0 (size: 0x8)
    class UPointLightComponent* PointLight40;                                         // 0x19D8 (size: 0x8)
    class USpotLightComponent* SpotLight11;                                           // 0x19E0 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBox;                                      // 0x19E8 (size: 0x8)
    class UTransferLocationComponent* ShippableTransferLocation;                      // 0x19F0 (size: 0x8)
    class UBoxComponent* NoWalkArea;                                                  // 0x19F8 (size: 0x8)
    class UParticleSystemComponent* ExhaustStern2;                                    // 0x1A00 (size: 0x8)
    class UBPLargeShipResourceShipLadder_C* BPLargeShipResourceShipLadder1;           // 0x1A08 (size: 0x8)
    class UBPLargeShipResourceShipLadder_C* BPLargeShipResourceShipLadder0;           // 0x1A10 (size: 0x8)
    class USeatExitComponent* SpotterExit;                                            // 0x1A18 (size: 0x8)
    class USeatTriggerComponent* SpotterTrigger;                                      // 0x1A20 (size: 0x8)
    class UVehicleSeatComponent* SpotterSeat1;                                        // 0x1A28 (size: 0x8)
    class UBoxComponent* DoorObstruction0;                                            // 0x1A30 (size: 0x8)
    class UDecalComponent* GangwayRampDecalRearL;                                     // 0x1A38 (size: 0x8)
    class UDecalComponent* GangwayRampDecalFrontL;                                    // 0x1A40 (size: 0x8)
    class UDecalComponent* GangwayRampDecalRearR;                                     // 0x1A48 (size: 0x8)
    class UDecalComponent* GangwayRampDecalFrontR;                                    // 0x1A50 (size: 0x8)
    class UDecalComponent* EngineDecalR2;                                             // 0x1A58 (size: 0x8)
    class UDecalComponent* EngineDecalR1;                                             // 0x1A60 (size: 0x8)
    class UDecalComponent* EngineDecalL1;                                             // 0x1A68 (size: 0x8)
    class UDecalComponent* EngineDecalL2;                                             // 0x1A70 (size: 0x8)
    class UDecalComponent* DoorDecalL1;                                               // 0x1A78 (size: 0x8)
    class UDecalComponent* DoorDecalR2;                                               // 0x1A80 (size: 0x8)
    class UDecalComponent* DoorDecalR1;                                               // 0x1A88 (size: 0x8)
    class UAudioComponent* WaterLapping;                                              // 0x1A90 (size: 0x8)
    class UDecalComponent* AnchorDecal;                                               // 0x1A98 (size: 0x8)
    class UDecalComponent* DriverDecal;                                               // 0x1AA0 (size: 0x8)
    class USpotLightComponent* SpotLight10;                                           // 0x1AA8 (size: 0x8)
    class USpotLightComponent* SpotLight9;                                            // 0x1AB0 (size: 0x8)
    class UParticleSystemComponent* Dustmotes4;                                       // 0x1AB8 (size: 0x8)
    class UParticleSystemComponent* Dustmotes3;                                       // 0x1AC0 (size: 0x8)
    class UParticleSystemComponent* Dustmotes2;                                       // 0x1AC8 (size: 0x8)
    class UPointLightComponent* PointLight36;                                         // 0x1AD0 (size: 0x8)
    class UPointLightComponent* PointLight35;                                         // 0x1AD8 (size: 0x8)
    class UPointLightComponent* PointLight34;                                         // 0x1AE0 (size: 0x8)
    class UPointLightComponent* PointLight32;                                         // 0x1AE8 (size: 0x8)
    class UPointLightComponent* PointLight31;                                         // 0x1AF0 (size: 0x8)
    class UPointLightComponent* PointLight26;                                         // 0x1AF8 (size: 0x8)
    class UPointLightComponent* PointLight23;                                         // 0x1B00 (size: 0x8)
    class UPointLightComponent* PointLight25;                                         // 0x1B08 (size: 0x8)
    class UPointLightComponent* PointLight24;                                         // 0x1B10 (size: 0x8)
    class UPointLightComponent* PointLight22;                                         // 0x1B18 (size: 0x8)
    class UPointLightComponent* PointLight21;                                         // 0x1B20 (size: 0x8)
    class UInstancedStaticMeshComponent* Light;                                       // 0x1B28 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x1B30 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftRight;                                // 0x1B38 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftLeft;                                 // 0x1B40 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeRight;                               // 0x1B48 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeLeft;                                // 0x1B50 (size: 0x8)
    class UParticleSystemComponent* WakeFore;                                         // 0x1B58 (size: 0x8)
    class UParticleSystemComponent* SideLeft;                                         // 0x1B60 (size: 0x8)
    class UParticleSystemComponent* WakeAft;                                          // 0x1B68 (size: 0x8)
    class UParticleSystemComponent* ExhaustStern0;                                    // 0x1B70 (size: 0x8)
    class UParticleSystemComponent* SideRight;                                        // 0x1B78 (size: 0x8)
    class UAudioComponent* Idle;                                                      // 0x1B80 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentStbd;                  // 0x1B88 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentPort;                  // 0x1B90 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMesh1;                                      // 0x1B98 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMeshAI;                                     // 0x1BA0 (size: 0x8)
    class UBPLargeShipAIArtilleryGunTurretComponent_C* BPLargeShipAIArtilleryGunTurretComponent; // 0x1BA8 (size: 0x8)
    class UBPAnchorDropped_C* AnchorDropped;                                          // 0x1BB0 (size: 0x8)
    class UBPAnchorRaised_C* AnchorRaised;                                            // 0x1BB8 (size: 0x8)
    class UBPAnchorComponent_C* BPAnchorComponent;                                    // 0x1BC0 (size: 0x8)
    class UHatchComponent* LeftLadderHatchEntrance;                                   // 0x1BC8 (size: 0x8)
    class UHatchComponent* LeftLadderHatchExit;                                       // 0x1BD0 (size: 0x8)
    class UHatchComponent* RightLadderHatchExit;                                      // 0x1BD8 (size: 0x8)
    class UHatchComponent* RightLadderHatchEntrance;                                  // 0x1BE0 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox0;                                 // 0x1BE8 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp4;                                           // 0x1BF0 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp3;                                           // 0x1BF8 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp2;                                           // 0x1C00 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp1;                                           // 0x1C08 (size: 0x8)
    class UAITurretsControllerComponent* AITurretsController;                         // 0x1C10 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x1C18 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor;                                                // 0x1C20 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor1;                                               // 0x1C28 (size: 0x8)
    class USceneComponent* DoorsSceneComponent;                                       // 0x1C30 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponentHull;                    // 0x1C38 (size: 0x8)
    class UBoatHullMeshComponent* BoatHullMesh;                                       // 0x1C40 (size: 0x8)
    class USkeletalMeshComponent* Deck;                                               // 0x1C48 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x1C50 (size: 0x8)
    class UBoxComponent* DoorObstruction1;                                            // 0x1C58 (size: 0x8)
    class UStaticMeshComponent* HallwayRoomWater;                                     // 0x1C60 (size: 0x8)
    class UStaticMeshComponent* HallwayRoomRegion;                                    // 0x1C68 (size: 0x8)
    class UStaticMeshComponent* EngineRoomWater;                                      // 0x1C70 (size: 0x8)
    class UStaticMeshComponent* EngineRoomRegion;                                     // 0x1C78 (size: 0x8)
    class UBoxComponent* DoorObstruction;                                             // 0x1C80 (size: 0x8)
    class USeatTriggerComponent* DriverTrigger;                                       // 0x1C88 (size: 0x8)
    class USeatExitComponent* DriverExit;                                             // 0x1C90 (size: 0x8)
    class UCameraComponent* Camera;                                                   // 0x1C98 (size: 0x8)
    class UVehicleSeatComponent* DriverSeat0;                                         // 0x1CA0 (size: 0x8)
    class URoomComponent* HallwayRoom;                                                // 0x1CA8 (size: 0x8)
    class URoomComponent* EngineRoom;                                                 // 0x1CB0 (size: 0x8)
    class UFloodableComponent* Floodable;                                             // 0x1CB8 (size: 0x8)

    void BPOnClientBeginPlay();
    void ExecuteUbergraph_BPLargeShipResourceShip(int32 EntryPoint);
}; // Size: 0x1CC0

#endif
