#ifndef UE4SS_SDK_BPLargeShipBaseShip_HPP
#define UE4SS_SDK_BPLargeShipBaseShip_HPP

class ABPLargeShipBaseShip_C : public ALargeShip
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1690 (size: 0x8)
    class UParticleSystemComponent* ExhaustBow1;                                      // 0x1698 (size: 0x8)
    class USpotLightComponent* SpotLightForeL;                                        // 0x16A0 (size: 0x8)
    class UStaticMeshComponent* LightForeR;                                           // 0x16A8 (size: 0x8)
    class UStaticMeshComponent* LightForeL;                                           // 0x16B0 (size: 0x8)
    class USpotLightComponent* SpotLightForeR;                                        // 0x16B8 (size: 0x8)
    class USkeletalMeshComponent* NeutralEngine2Wheel;                                // 0x16C0 (size: 0x8)
    class USkeletalMeshComponent* NeutralEngine0;                                     // 0x16C8 (size: 0x8)
    class USceneComponent* ShipEngineComponent;                                       // 0x16D0 (size: 0x8)
    class UDecalComponent* GangwayRampDecalRearL;                                     // 0x16D8 (size: 0x8)
    class UDecalComponent* GangwayRampDecalFrontL;                                    // 0x16E0 (size: 0x8)
    class UDecalComponent* GangwayRampDecalRearR;                                     // 0x16E8 (size: 0x8)
    class UDecalComponent* GangwayRampDecalFrontR;                                    // 0x16F0 (size: 0x8)
    class UDecalComponent* EngineDecalR2;                                             // 0x16F8 (size: 0x8)
    class UDecalComponent* EngineDecalR1;                                             // 0x1700 (size: 0x8)
    class UDecalComponent* EngineDecalL1;                                             // 0x1708 (size: 0x8)
    class UDecalComponent* DoorDecalL2;                                               // 0x1710 (size: 0x8)
    class UDecalComponent* EngineDecalL2;                                             // 0x1718 (size: 0x8)
    class UDecalComponent* DoorDecalL1;                                               // 0x1720 (size: 0x8)
    class UDecalComponent* DoorDecalR2;                                               // 0x1728 (size: 0x8)
    class UDecalComponent* DoorDecalR1;                                               // 0x1730 (size: 0x8)
    class UAudioComponent* WaterLapping;                                              // 0x1738 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponentOpeningFore;             // 0x1740 (size: 0x8)
    class UDecalComponent* AnchorDecal;                                               // 0x1748 (size: 0x8)
    class UDecalComponent* DriverDecal;                                               // 0x1750 (size: 0x8)
    class UDecalComponent* Puddle;                                                    // 0x1758 (size: 0x8)
    class USpotLightComponent* SpotLight10;                                           // 0x1760 (size: 0x8)
    class USpotLightComponent* SpotLight9;                                            // 0x1768 (size: 0x8)
    class UPointLightComponent* PointLight40;                                         // 0x1770 (size: 0x8)
    class UParticleSystemComponent* Dustmotes5;                                       // 0x1778 (size: 0x8)
    class UParticleSystemComponent* Dustmotes4;                                       // 0x1780 (size: 0x8)
    class UParticleSystemComponent* Dustmotes3;                                       // 0x1788 (size: 0x8)
    class UParticleSystemComponent* Dustmotes2;                                       // 0x1790 (size: 0x8)
    class UStaticMeshComponent* SpotlightMesh1;                                       // 0x1798 (size: 0x8)
    class UStaticMeshComponent* SpotlightMesh;                                        // 0x17A0 (size: 0x8)
    class USpotLightComponent* SpotLight4;                                            // 0x17A8 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x17B0 (size: 0x8)
    class UStaticMeshComponent* LightMesh2;                                           // 0x17B8 (size: 0x8)
    class UStaticMeshComponent* SpotLight1;                                           // 0x17C0 (size: 0x8)
    class UStaticMeshComponent* SpotlightBase1;                                       // 0x17C8 (size: 0x8)
    class UStaticMeshComponent* LightMesh;                                            // 0x17D0 (size: 0x8)
    class UStaticMeshComponent* SpotLight;                                            // 0x17D8 (size: 0x8)
    class UStaticMeshComponent* SpotlightBase;                                        // 0x17E0 (size: 0x8)
    class USceneComponent* DeckLights;                                                // 0x17E8 (size: 0x8)
    class UPointLightComponent* PointLight39;                                         // 0x17F0 (size: 0x8)
    class UPointLightComponent* PointLight38;                                         // 0x17F8 (size: 0x8)
    class UPointLightComponent* PointLight37;                                         // 0x1800 (size: 0x8)
    class UPointLightComponent* PointLight36;                                         // 0x1808 (size: 0x8)
    class UPointLightComponent* PointLight35;                                         // 0x1810 (size: 0x8)
    class UPointLightComponent* PointLight34;                                         // 0x1818 (size: 0x8)
    class UPointLightComponent* PointLight33;                                         // 0x1820 (size: 0x8)
    class UPointLightComponent* PointLight32;                                         // 0x1828 (size: 0x8)
    class UPointLightComponent* PointLight31;                                         // 0x1830 (size: 0x8)
    class UPointLightComponent* PointLight30;                                         // 0x1838 (size: 0x8)
    class UPointLightComponent* PointLight29;                                         // 0x1840 (size: 0x8)
    class UPointLightComponent* PointLight28;                                         // 0x1848 (size: 0x8)
    class UPointLightComponent* PointLight27;                                         // 0x1850 (size: 0x8)
    class UPointLightComponent* PointLight26;                                         // 0x1858 (size: 0x8)
    class UPointLightComponent* PointLight23;                                         // 0x1860 (size: 0x8)
    class UPointLightComponent* PointLight25;                                         // 0x1868 (size: 0x8)
    class UPointLightComponent* PointLight24;                                         // 0x1870 (size: 0x8)
    class UPointLightComponent* PointLight22;                                         // 0x1878 (size: 0x8)
    class UPointLightComponent* PointLight21;                                         // 0x1880 (size: 0x8)
    class UInstancedStaticMeshComponent* Light2;                                      // 0x1888 (size: 0x8)
    class UInstancedStaticMeshComponent* Light;                                       // 0x1890 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x1898 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftRight;                                // 0x18A0 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftLeft;                                 // 0x18A8 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeRight;                               // 0x18B0 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeLeft;                                // 0x18B8 (size: 0x8)
    class UParticleSystemComponent* WakeFore;                                         // 0x18C0 (size: 0x8)
    class UParticleSystemComponent* SideLeft;                                         // 0x18C8 (size: 0x8)
    class UParticleSystemComponent* WakeAft;                                          // 0x18D0 (size: 0x8)
    class UParticleSystemComponent* ExhaustBow0;                                      // 0x18D8 (size: 0x8)
    class UParticleSystemComponent* SideRight;                                        // 0x18E0 (size: 0x8)
    class UAudioComponent* idle;                                                      // 0x18E8 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentStbd;                  // 0x18F0 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentPort;                  // 0x18F8 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMesh1;                                      // 0x1900 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMeshAI;                                     // 0x1908 (size: 0x8)
    class UBPLargeShipAIArtilleryGunTurretComponent_C* BPLargeShipAIArtilleryGunTurretComponent; // 0x1910 (size: 0x8)
    class USpawnPointComponent* SpawnPoint11;                                         // 0x1918 (size: 0x8)
    class USpawnPointComponent* SpawnPoint10;                                         // 0x1920 (size: 0x8)
    class USpawnPointComponent* SpawnPoint9;                                          // 0x1928 (size: 0x8)
    class USpawnPointComponent* SpawnPoint8;                                          // 0x1930 (size: 0x8)
    class USpawnPointComponent* SpawnPoint7;                                          // 0x1938 (size: 0x8)
    class USpawnPointComponent* SpawnPoint6;                                          // 0x1940 (size: 0x8)
    class USpawnPointComponent* SpawnPoint5;                                          // 0x1948 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x1950 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x1958 (size: 0x8)
    class USpawnPointComponent* SpawnPoint2;                                          // 0x1960 (size: 0x8)
    class USpawnPointComponent* SpawnPoint1;                                          // 0x1968 (size: 0x8)
    class USpawnPointComponent* SpawnPoint0;                                          // 0x1970 (size: 0x8)
    class UMapIntelligenceSourceComponent* MapIntelligenceSource;                     // 0x1978 (size: 0x8)
    class UBPAnchorDropped_C* AnchorDropped;                                          // 0x1980 (size: 0x8)
    class UBPAnchorRaised_C* AnchorRaised;                                            // 0x1988 (size: 0x8)
    class UBPAnchorComponent_C* BPAnchorComponent;                                    // 0x1990 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponentOpenings;                // 0x1998 (size: 0x8)
    class UHatchComponent* LeftLadderHatchEntrance;                                   // 0x19A0 (size: 0x8)
    class UHatchComponent* LeftLadderHatchExit;                                       // 0x19A8 (size: 0x8)
    class UHatchComponent* RightLadderHatchExit;                                      // 0x19B0 (size: 0x8)
    class UHatchComponent* RightLadderHatchEntrance;                                  // 0x19B8 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox2;                                 // 0x19C0 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox1;                                 // 0x19C8 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox0;                                 // 0x19D0 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat2;                                         // 0x19D8 (size: 0x8)
    class USeatExitComponent* Gunner2Exit;                                            // 0x19E0 (size: 0x8)
    class USeatExitComponent* Gunner1Exit;                                            // 0x19E8 (size: 0x8)
    class USeatTriggerComponent* Gunner2Trigger;                                      // 0x19F0 (size: 0x8)
    class USeatTriggerComponent* Gunner1Trigger;                                      // 0x19F8 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat1;                                         // 0x1A00 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp4;                                           // 0x1A08 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp3;                                           // 0x1A10 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp2;                                           // 0x1A18 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp1;                                           // 0x1A20 (size: 0x8)
    class UAITurretsControllerComponent* AITurretsController;                         // 0x1A28 (size: 0x8)
    class UBoxComponent* RearLeftVehicleBuildFootprint;                               // 0x1A30 (size: 0x8)
    class UVehicleBuildTriggerComponent* RearLeftVehicleBuildTrigger;                 // 0x1A38 (size: 0x8)
    class UBoxComponent* FrontLeftVehicleBuildFootprint;                              // 0x1A40 (size: 0x8)
    class UVehicleBuildTriggerComponent* FrontLeftVehicleBuildTrigger;                // 0x1A48 (size: 0x8)
    class UBoxComponent* RearRightVehicleBuildFootprint;                              // 0x1A50 (size: 0x8)
    class UVehicleBuildTriggerComponent* RearRightVehicleBuildTrigger;                // 0x1A58 (size: 0x8)
    class UBoxComponent* FrontRightVehicleBuildFootprint;                             // 0x1A60 (size: 0x8)
    class UVehicleBuildTriggerComponent* FrontRightVehicleBuildTrigger;               // 0x1A68 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x1A70 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x1A78 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x1A80 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor;                                                // 0x1A88 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor1;                                               // 0x1A90 (size: 0x8)
    class USceneComponent* DoorsSceneComponent;                                       // 0x1A98 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponentHull;                    // 0x1AA0 (size: 0x8)
    class UBoatHullMeshComponent* BoatHullMesh;                                       // 0x1AA8 (size: 0x8)
    class USkeletalMeshComponent* Deck;                                               // 0x1AB0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x1AB8 (size: 0x8)
    class UBoxComponent* DoorObstruction1;                                            // 0x1AC0 (size: 0x8)
    class UStaticMeshComponent* BarracksRoomWater;                                    // 0x1AC8 (size: 0x8)
    class UStaticMeshComponent* BarracksRoomRegion;                                   // 0x1AD0 (size: 0x8)
    class UStaticMeshComponent* EngineRoomWater;                                      // 0x1AD8 (size: 0x8)
    class UStaticMeshComponent* EngineRoomRegion;                                     // 0x1AE0 (size: 0x8)
    class UBoxComponent* DoorObstruction;                                             // 0x1AE8 (size: 0x8)
    class USeatTriggerComponent* DriverTrigger;                                       // 0x1AF0 (size: 0x8)
    class USeatExitComponent* DriverExit;                                             // 0x1AF8 (size: 0x8)
    class UCameraComponent* Camera;                                                   // 0x1B00 (size: 0x8)
    class UVehicleSeatComponent* DriverSeat0;                                         // 0x1B08 (size: 0x8)
    class URoomComponent* BarracksRoom;                                               // 0x1B10 (size: 0x8)
    class URoomComponent* EngineRoom;                                                 // 0x1B18 (size: 0x8)
    class UFloodableComponent* Floodable;                                             // 0x1B20 (size: 0x8)

    void BPOnClientBeginPlay();
    void ExecuteUbergraph_BPLargeShipBaseShip(int32 EntryPoint);
}; // Size: 0x1B28

#endif
