#ifndef UE4SS_SDK_BPLargeShipDestroyerW_HPP
#define UE4SS_SDK_BPLargeShipDestroyerW_HPP

class ABPLargeShipDestroyerW_C : public ALargeShip
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1690 (size: 0x8)
    class UStaticMeshComponent* LightTurretRear;                                      // 0x1698 (size: 0x8)
    class USpotLightComponent* SpotLightTurretRear;                                   // 0x16A0 (size: 0x8)
    class UStaticMeshComponent* LightTurretMid;                                       // 0x16A8 (size: 0x8)
    class USpotLightComponent* SpotLightTurretMid;                                    // 0x16B0 (size: 0x8)
    class UStaticMeshComponent* LightFore;                                            // 0x16B8 (size: 0x8)
    class USpotLightComponent* SpotLightFore;                                         // 0x16C0 (size: 0x8)
    class USkeletalMeshComponent* EngineWWheel;                                       // 0x16C8 (size: 0x8)
    class USkeletalMeshComponent* EngineW;                                            // 0x16D0 (size: 0x8)
    class USceneComponent* EngineComponent;                                           // 0x16D8 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponent1;                       // 0x16E0 (size: 0x8)
    class USpotLightComponent* SpotLight7;                                            // 0x16E8 (size: 0x8)
    class USpotLightComponent* SpotLight6;                                            // 0x16F0 (size: 0x8)
    class USpotLightComponent* SpotLight5;                                            // 0x16F8 (size: 0x8)
    class USpotLightComponent* SpotLight4;                                            // 0x1700 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x1708 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x1710 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x1718 (size: 0x8)
    class USpotLightComponent* SpotLight0;                                            // 0x1720 (size: 0x8)
    class UPointLightComponent* PointLight8;                                          // 0x1728 (size: 0x8)
    class UPointLightComponent* PointLight7;                                          // 0x1730 (size: 0x8)
    class UPointLightComponent* PointLight6;                                          // 0x1738 (size: 0x8)
    class UPointLightComponent* PointLight5;                                          // 0x1740 (size: 0x8)
    class UPointLightComponent* PointLight9;                                          // 0x1748 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x1750 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x1758 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x1760 (size: 0x8)
    class UPointLightComponent* PointLight0;                                          // 0x1768 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x1770 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x1778 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x1780 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh2;                        // 0x1788 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x1790 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x1798 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x17A0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea4;                       // 0x17A8 (size: 0x8)
    class UBPLargeShipDestroyerWLadder_C* BPLargeShipDestroyerWLadderAft;             // 0x17B0 (size: 0x8)
    class UBPLargeShipDestroyerWLadder_C* LargeShipDestroyerWLadderMidShip;           // 0x17B8 (size: 0x8)
    class USeatExitComponent* SonarExit9;                                             // 0x17C0 (size: 0x8)
    class USeatExitComponent* Gunner7Exit;                                            // 0x17C8 (size: 0x8)
    class USeatExitComponent* Gunner6Exit;                                            // 0x17D0 (size: 0x8)
    class USeatExitComponent* Gunner5Exit;                                            // 0x17D8 (size: 0x8)
    class USeatExitComponent* Gunner4Exit;                                            // 0x17E0 (size: 0x8)
    class USeatExitComponent* GunnerExit3;                                            // 0x17E8 (size: 0x8)
    class USeatExitComponent* GunnerExit2;                                            // 0x17F0 (size: 0x8)
    class USeatExitComponent* GunnerExit1;                                            // 0x17F8 (size: 0x8)
    class USeatExitComponent* SpotterExit8;                                           // 0x1800 (size: 0x8)
    class USeatExitComponent* DriverExit;                                             // 0x1808 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x1810 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x1818 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x1820 (size: 0x8)
    class UAudioComponent* WaterLapping;                                              // 0x1828 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x1830 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x1838 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x1840 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x1848 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x1850 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x1858 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x1860 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x1868 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x1870 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x1878 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x1880 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x1888 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x1890 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x1898 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x18A0 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x18A8 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x18B0 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x18B8 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x18C0 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x18C8 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x18D0 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x18D8 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x18E0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x18E8 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftLeft;                                 // 0x18F0 (size: 0x8)
    class UParticleSystemComponent* WakeFore;                                         // 0x18F8 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftRight;                                // 0x1900 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeLeft;                                // 0x1908 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeRight;                               // 0x1910 (size: 0x8)
    class UParticleSystemComponent* SideRight;                                        // 0x1918 (size: 0x8)
    class UParticleSystemComponent* SideLeft;                                         // 0x1920 (size: 0x8)
    class UParticleSystemComponent* WakeAft;                                          // 0x1928 (size: 0x8)
    class UParticleSystemComponent* ExhaustFore;                                      // 0x1930 (size: 0x8)
    class UAudioComponent* idle;                                                      // 0x1938 (size: 0x8)
    class USeatTriggerComponent* SonarTrigger9;                                       // 0x1940 (size: 0x8)
    class UVehicleSeatComponent* SonarSeat8;                                          // 0x1948 (size: 0x8)
    class UHatchComponent* LeftLadderHatchExit;                                       // 0x1950 (size: 0x8)
    class UHatchComponent* RightLadderHatchExit;                                      // 0x1958 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentStbd;                  // 0x1960 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentPort;                  // 0x1968 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox6;                                 // 0x1970 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox7;                                 // 0x1978 (size: 0x8)
    class USeatTriggerComponent* Gunner7Trigger;                                      // 0x1980 (size: 0x8)
    class USeatTriggerComponent* Gunner6Trigger;                                      // 0x1988 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat7;                                         // 0x1990 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat6;                                         // 0x1998 (size: 0x8)
    class UBPAnchorDropped_C* AnchorDropped;                                          // 0x19A0 (size: 0x8)
    class UBPAnchorRaised_C* AnchorRaised;                                            // 0x19A8 (size: 0x8)
    class UBPAnchorComponent_C* BPAnchorComponent;                                    // 0x19B0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint11;                                         // 0x19B8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint10;                                         // 0x19C0 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh1;                        // 0x19C8 (size: 0x8)
    class UInstancedStaticMeshComponent* InstancedStaticMesh;                         // 0x19D0 (size: 0x8)
    class UItemGroupRenderComponent* ItemGroupRender;                                 // 0x19D8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x19E0 (size: 0x8)
    class UHatchComponent* LeftLadderHatchEntrance;                                   // 0x19E8 (size: 0x8)
    class UHatchComponent* RightLadderHatchEntrance;                                  // 0x19F0 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp4;                                           // 0x19F8 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp3;                                           // 0x1A00 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp2;                                           // 0x1A08 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp1;                                           // 0x1A10 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox8;                                 // 0x1A18 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor3;                                               // 0x1A20 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor2;                                               // 0x1A28 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor1;                                               // 0x1A30 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor0;                                               // 0x1A38 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMesh1;                                      // 0x1A40 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox5;                                 // 0x1A48 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox4;                                 // 0x1A50 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox3;                                 // 0x1A58 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox2;                                 // 0x1A60 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox1;                                 // 0x1A68 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox0;                                 // 0x1A70 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat5;                                         // 0x1A78 (size: 0x8)
    class USeatTriggerComponent* Gunner5Trigger;                                      // 0x1A80 (size: 0x8)
    class USeatTriggerComponent* Gunner4Trigger;                                      // 0x1A88 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat4;                                         // 0x1A90 (size: 0x8)
    class UVehicleSeatComponent* SpotterSeat8;                                        // 0x1A98 (size: 0x8)
    class USeatTriggerComponent* SpotterTrigger8;                                     // 0x1AA0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x1AA8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint2;                                          // 0x1AB0 (size: 0x8)
    class USpawnPointComponent* SpawnPoint1;                                          // 0x1AB8 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x1AC0 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponent2;                       // 0x1AC8 (size: 0x8)
    class UBoatHullMeshComponent* BoatHullMesh;                                       // 0x1AD0 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat3;                                         // 0x1AD8 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat2;                                         // 0x1AE0 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat1;                                         // 0x1AE8 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger3;                                      // 0x1AF0 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger2;                                      // 0x1AF8 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger1;                                      // 0x1B00 (size: 0x8)
    class USkeletalMeshComponent* Deck;                                               // 0x1B08 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x1B10 (size: 0x8)
    class UBoxComponent* DoorObstruction2;                                            // 0x1B18 (size: 0x8)
    class UBoxComponent* DoorObstruction1;                                            // 0x1B20 (size: 0x8)
    class UBoxComponent* DoorObstruction0;                                            // 0x1B28 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomWater;                                        // 0x1B30 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomRegion;                                       // 0x1B38 (size: 0x8)
    class URoomComponent* AmmoRoom;                                                   // 0x1B40 (size: 0x8)
    class UStaticMeshComponent* BarracksRoomWater;                                    // 0x1B48 (size: 0x8)
    class UStaticMeshComponent* BarracksRoomRegion;                                   // 0x1B50 (size: 0x8)
    class UStaticMeshComponent* EngineRoomWater;                                      // 0x1B58 (size: 0x8)
    class UStaticMeshComponent* EngineRoomRegion;                                     // 0x1B60 (size: 0x8)
    class UBoxComponent* DoorObstruction3;                                            // 0x1B68 (size: 0x8)
    class USeatTriggerComponent* DriverTrigger;                                       // 0x1B70 (size: 0x8)
    class UCameraComponent* Camera;                                                   // 0x1B78 (size: 0x8)
    class UVehicleSeatComponent* DriverSeat0;                                         // 0x1B80 (size: 0x8)
    class URoomComponent* BarracksRoom;                                               // 0x1B88 (size: 0x8)
    class URoomComponent* EngineRoom;                                                 // 0x1B90 (size: 0x8)
    class UFloodableComponent* Floodable;                                             // 0x1B98 (size: 0x8)

    void BPOnClientBeginPlay();
    void ExecuteUbergraph_BPLargeShipDestroyerW(int32 EntryPoint);
}; // Size: 0x1BA0

#endif
