#ifndef UE4SS_SDK_BPLargeShipSubmarineW_HPP
#define UE4SS_SDK_BPLargeShipSubmarineW_HPP

class ABPLargeShipSubmarineW_C : public ASubmarineVehicle
{
    class USkeletalMeshComponent* EngineWheel1W1;                                     // 0x1850 (size: 0x8)
    class USkeletalMeshComponent* EngineWheel1W;                                      // 0x1858 (size: 0x8)
    class USceneComponent* EngineComponent;                                           // 0x1860 (size: 0x8)
    class USeatExitComponent* NegativeBallastExit;                                    // 0x1868 (size: 0x8)
    class USeatExitComponent* SafetyBallastExit;                                      // 0x1870 (size: 0x8)
    class USeatExitComponent* MainBallastExit;                                        // 0x1878 (size: 0x8)
    class UBPSubmarineTubeUseComponent_C* BPSubmarineTubeUseComponentRight;           // 0x1880 (size: 0x8)
    class UBPSubmarineTubeUseComponent_C* BPSubmarineTubeUseComponentLeft;            // 0x1888 (size: 0x8)
    class UInstancedStaticMeshComponent* RightTorepdos;                               // 0x1890 (size: 0x8)
    class UItemGroupRenderComponent* RightTorpedoItemGroupRender;                     // 0x1898 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox3;                                 // 0x18A0 (size: 0x8)
    class USeatTriggerComponent* RightTorpedoGunnerTrigger;                           // 0x18A8 (size: 0x8)
    class USeatExitComponent* RightTorpedoGunnerExit;                                 // 0x18B0 (size: 0x8)
    class UVehicleSeatComponent* RightTorpedoGunnerSeat9;                             // 0x18B8 (size: 0x8)
    class UInstancedStaticMeshComponent* LeftTorepdos;                                // 0x18C0 (size: 0x8)
    class UItemGroupRenderComponent* LeftTorpedoItemGroupRender;                      // 0x18C8 (size: 0x8)
    class UAudioComponent* UnderwaterAmbience;                                        // 0x18D0 (size: 0x8)
    class UBPSubmarineStencilComponent_C* HatchStencil;                               // 0x18D8 (size: 0x8)
    class UBoatHullMeshComponent* BoatHullMesh;                                       // 0x18E0 (size: 0x8)
    class UDecalComponent* DecalGangwayLine6;                                         // 0x18E8 (size: 0x8)
    class UDecalComponent* DecalGangwayLine5;                                         // 0x18F0 (size: 0x8)
    class UDecalComponent* DecalGangwayLine4;                                         // 0x18F8 (size: 0x8)
    class UDecalComponent* Decal40;                                                   // 0x1900 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x1908 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x1910 (size: 0x8)
    class UDecalComponent* W;                                                         // 0x1918 (size: 0x8)
    class UDecalComponent* Decal39;                                                   // 0x1920 (size: 0x8)
    class UDecalComponent* Decal38;                                                   // 0x1928 (size: 0x8)
    class UDecalComponent* Decal37;                                                   // 0x1930 (size: 0x8)
    class UDecalComponent* Decal36;                                                   // 0x1938 (size: 0x8)
    class UDecalComponent* Decal35;                                                   // 0x1940 (size: 0x8)
    class UDecalComponent* Decal34;                                                   // 0x1948 (size: 0x8)
    class UDecalComponent* Decal33;                                                   // 0x1950 (size: 0x8)
    class UDecalComponent* Decal32;                                                   // 0x1958 (size: 0x8)
    class UDecalComponent* Decal31;                                                   // 0x1960 (size: 0x8)
    class UDecalComponent* Decal30;                                                   // 0x1968 (size: 0x8)
    class UDecalComponent* Decal29;                                                   // 0x1970 (size: 0x8)
    class UDecalComponent* Decal28;                                                   // 0x1978 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x1980 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x1988 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x1990 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x1998 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x19A0 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x19A8 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x19B0 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x19B8 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x19C0 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x19C8 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x19D0 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x19D8 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x19E0 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x19E8 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x19F0 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x19F8 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x1A00 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x1A08 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x1A10 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x1A18 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x1A20 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x1A28 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x1A30 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x1A38 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x1A40 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x1A48 (size: 0x8)
    class UDecalComponent* DecalGangwayLine3;                                         // 0x1A50 (size: 0x8)
    class UDecalComponent* DecalGangwayLine2;                                         // 0x1A58 (size: 0x8)
    class UDecalComponent* DecalGangwayLine1;                                         // 0x1A60 (size: 0x8)
    class UDecalComponent* DecalGangwayLine;                                          // 0x1A68 (size: 0x8)
    class UParticleSystemComponent* RudderBubblesR;                                   // 0x1A70 (size: 0x8)
    class UParticleSystemComponent* RudderBubblesL;                                   // 0x1A78 (size: 0x8)
    class UParticleSystemComponent* Bubbles;                                          // 0x1A80 (size: 0x8)
    class UParticleSystemComponent* NegativeBallastRightAir;                          // 0x1A88 (size: 0x8)
    class UParticleSystemComponent* NegativeBallastLeftAir;                           // 0x1A90 (size: 0x8)
    class UParticleSystemComponent* MainBallastRightAir;                              // 0x1A98 (size: 0x8)
    class UParticleSystemComponent* MainBallastLeftAir;                               // 0x1AA0 (size: 0x8)
    class UParticleSystemComponent* WakeAft;                                          // 0x1AA8 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftRight;                                // 0x1AB0 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftLeft;                                 // 0x1AB8 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeRight;                               // 0x1AC0 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeLeft;                                // 0x1AC8 (size: 0x8)
    class UParticleSystemComponent* SideRight;                                        // 0x1AD0 (size: 0x8)
    class UParticleSystemComponent* SideLeft;                                         // 0x1AD8 (size: 0x8)
    class UParticleSystemComponent* WakeFore;                                         // 0x1AE0 (size: 0x8)
    class UAudioComponent* BatteryCharging;                                           // 0x1AE8 (size: 0x8)
    class UPointLightComponent* PointLight7;                                          // 0x1AF0 (size: 0x8)
    class UStaticMeshComponent* Light5;                                               // 0x1AF8 (size: 0x8)
    class UPointLightComponent* PointLight6;                                          // 0x1B00 (size: 0x8)
    class UStaticMeshComponent* Light4;                                               // 0x1B08 (size: 0x8)
    class UPointLightComponent* PointLight5;                                          // 0x1B10 (size: 0x8)
    class UStaticMeshComponent* Light3;                                               // 0x1B18 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x1B20 (size: 0x8)
    class UStaticMeshComponent* Light2;                                               // 0x1B28 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x1B30 (size: 0x8)
    class UStaticMeshComponent* Light1;                                               // 0x1B38 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x1B40 (size: 0x8)
    class UStaticMeshComponent* Light;                                                // 0x1B48 (size: 0x8)
    class UParticleSystemComponent* BallastBubblesMainL;                              // 0x1B50 (size: 0x8)
    class UParticleSystemComponent* BallastBubblesMainR;                              // 0x1B58 (size: 0x8)
    class UAudioComponent* BallastBlowNegative;                                       // 0x1B60 (size: 0x8)
    class UAudioComponent* BallastBlowSafety;                                         // 0x1B68 (size: 0x8)
    class UAudioComponent* BallastBlowMain;                                           // 0x1B70 (size: 0x8)
    class UAudioComponent* BallastFloodNegative;                                      // 0x1B78 (size: 0x8)
    class UAudioComponent* BallastFloodSafety;                                        // 0x1B80 (size: 0x8)
    class UAudioComponent* BallastFloodMain;                                          // 0x1B88 (size: 0x8)
    class UParticleSystemComponent* BallastSteamNegative;                             // 0x1B90 (size: 0x8)
    class UParticleSystemComponent* BallastSteamSafety;                               // 0x1B98 (size: 0x8)
    class UParticleSystemComponent* BallastSteamMain;                                 // 0x1BA0 (size: 0x8)
    class USpotLightComponent* SpotLight5;                                            // 0x1BA8 (size: 0x8)
    class USpotLightComponent* SpotLight4;                                            // 0x1BB0 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x1BB8 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x1BC0 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x1BC8 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x1BD0 (size: 0x8)
    class UAudioComponent* WaterLapping;                                              // 0x1BD8 (size: 0x8)
    class UHatchComponent* LeftLadderHatchExit;                                       // 0x1BE0 (size: 0x8)
    class UHatchComponent* LeftLadderHatchEntrance;                                   // 0x1BE8 (size: 0x8)
    class UHatchComponent* RightLadderHatchExit;                                      // 0x1BF0 (size: 0x8)
    class UHatchComponent* RightLadderHatchEntrance;                                  // 0x1BF8 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentStbd;                  // 0x1C00 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentPort;                  // 0x1C08 (size: 0x8)
    class ULadderComponent* Ladder;                                                   // 0x1C10 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp4;                                           // 0x1C18 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp3;                                           // 0x1C20 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp2;                                           // 0x1C28 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp1;                                           // 0x1C30 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x1C38 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox1;                                 // 0x1C40 (size: 0x8)
    class USeatTriggerComponent* GunnerTrigger1;                                      // 0x1C48 (size: 0x8)
    class USeatExitComponent* GunnerExit1;                                            // 0x1C50 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat1;                                         // 0x1C58 (size: 0x8)
    class UBPAnchorDropped_C* AnchorDropped;                                          // 0x1C60 (size: 0x8)
    class UBPAnchorRaised_C* AnchorRaised;                                            // 0x1C68 (size: 0x8)
    class UBPAnchorComponent_C* BPAnchorComponent;                                    // 0x1C70 (size: 0x8)
    class USeatTriggerComponent* PeriscopeTrigger;                                    // 0x1C78 (size: 0x8)
    class USeatExitComponent* PeriscopeExit;                                          // 0x1C80 (size: 0x8)
    class UVehicleSeatComponent* PeriscopeSeat8;                                      // 0x1C88 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox0;                                 // 0x1C90 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox2;                                 // 0x1C98 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomWater;                                        // 0x1CA0 (size: 0x8)
    class UStaticMeshComponent* AmmoRoomRegion;                                       // 0x1CA8 (size: 0x8)
    class URoomComponent* AmmoRoom;                                                   // 0x1CB0 (size: 0x8)
    class UBoxComponent* DoorObstruction1;                                            // 0x1CB8 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor1;                                               // 0x1CC0 (size: 0x8)
    class UBoxComponent* DoorObstruction0;                                            // 0x1CC8 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor0;                                               // 0x1CD0 (size: 0x8)
    class UStaticMeshComponent* EngineRoomRegion;                                     // 0x1CD8 (size: 0x8)
    class UStaticMeshComponent* EngineRoomWater;                                      // 0x1CE0 (size: 0x8)
    class UFloodableComponent* Floodable;                                             // 0x1CE8 (size: 0x8)
    class URoomComponent* EngineRoom;                                                 // 0x1CF0 (size: 0x8)
    class UStaticMeshComponent* ControlRoomRegion;                                    // 0x1CF8 (size: 0x8)
    class UStaticMeshComponent* ControlRoomWater;                                     // 0x1D00 (size: 0x8)
    class URoomComponent* ControlRoom;                                                // 0x1D08 (size: 0x8)
    class USeatTriggerComponent* SafetyBallastTrigger;                                // 0x1D10 (size: 0x8)
    class USeatTriggerComponent* MainBallastTrigger;                                  // 0x1D18 (size: 0x8)
    class USeatTriggerComponent* NegativeBallastTrigger;                              // 0x1D20 (size: 0x8)
    class UVehicleSeatComponent* SafetyBallastSeat7;                                  // 0x1D28 (size: 0x8)
    class UVehicleSeatComponent* NegativeBallastSeat6;                                // 0x1D30 (size: 0x8)
    class USeatTriggerComponent* DivingOfficerTrigger;                                // 0x1D38 (size: 0x8)
    class UVehicleSeatComponent* MainBallastSeat5;                                    // 0x1D40 (size: 0x8)
    class USeatExitComponent* DivingOfficerExit;                                      // 0x1D48 (size: 0x8)
    class UVehicleSeatComponent* DivingOfficerSeat2;                                  // 0x1D50 (size: 0x8)
    class UBPSubmarineStencilComponent_C* CabinStencil;                               // 0x1D58 (size: 0x8)
    class USeatTriggerComponent* LeftTorpedoGunnerTrigger;                            // 0x1D60 (size: 0x8)
    class USeatExitComponent* LeftTorpedoGunnerExit;                                  // 0x1D68 (size: 0x8)
    class UVehicleSeatComponent* LeftTorpedoGunnerSeat4;                              // 0x1D70 (size: 0x8)
    class USeatTriggerComponent* SensorOperatorTrigger;                               // 0x1D78 (size: 0x8)
    class USeatExitComponent* SensorOperatorExit;                                     // 0x1D80 (size: 0x8)
    class UVehicleSeatComponent* SensorOperatorSeat3;                                 // 0x1D88 (size: 0x8)
    class USkeletalMeshComponent* Deck;                                               // 0x1D90 (size: 0x8)
    class USeatTriggerComponent* DriverTrigger;                                       // 0x1D98 (size: 0x8)
    class USeatExitComponent* DriverExit;                                             // 0x1DA0 (size: 0x8)
    class UCameraComponent* Camera;                                                   // 0x1DA8 (size: 0x8)
    class UVehicleSeatComponent* DriverSeat0;                                         // 0x1DB0 (size: 0x8)

}; // Size: 0x1DB8

#endif
