#ifndef UE4SS_SDK_BPLargeShipStorageShip_HPP
#define UE4SS_SDK_BPLargeShipStorageShip_HPP

class ABPLargeShipStorageShip_C : public ALargeShipStorage
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x16D0 (size: 0x8)
    class USpotLightComponent* SpotLightForeL;                                        // 0x16D8 (size: 0x8)
    class UStaticMeshComponent* LightForeL;                                           // 0x16E0 (size: 0x8)
    class UStaticMeshComponent* LightForeR;                                           // 0x16E8 (size: 0x8)
    class USpotLightComponent* SpotLightForeR;                                        // 0x16F0 (size: 0x8)
    class USkeletalMeshComponent* EngineWheel1;                                       // 0x16F8 (size: 0x8)
    class USkeletalMeshComponent* EngineWheel0;                                       // 0x1700 (size: 0x8)
    class USkeletalMeshComponent* NeutralEngine1;                                     // 0x1708 (size: 0x8)
    class USkeletalMeshComponent* NeutralEngine0;                                     // 0x1710 (size: 0x8)
    class USceneComponent* ShipEngineComponent;                                       // 0x1718 (size: 0x8)
    class UTransferLocationComponent* ShippableTransferLocation;                      // 0x1720 (size: 0x8)
    class UAudioComponent* WaterLapping;                                              // 0x1728 (size: 0x8)
    class UBPLargeShipStorageShipUpperForeLadder_C* UpperForeStarboardLadder;         // 0x1730 (size: 0x8)
    class UBPLargeShipStorageShipUpperForeLadder_C* UpperForePortLadder;              // 0x1738 (size: 0x8)
    class UTemperatureModifierBoxComponent* TemperatureModifierBox;                   // 0x1740 (size: 0x8)
    class UDecalComponent* SpotterDecal;                                              // 0x1748 (size: 0x8)
    class UDecalComponent* DoorDecalL2;                                               // 0x1750 (size: 0x8)
    class UDecalComponent* DoorDecalL1;                                               // 0x1758 (size: 0x8)
    class UDecalComponent* DoorDecalR2;                                               // 0x1760 (size: 0x8)
    class UDecalComponent* DoorDecalR1;                                               // 0x1768 (size: 0x8)
    class UDecalComponent* StockpileDecal;                                            // 0x1770 (size: 0x8)
    class UDecalComponent* EngineDecalL2;                                             // 0x1778 (size: 0x8)
    class UDecalComponent* EngineDecalL1;                                             // 0x1780 (size: 0x8)
    class UDecalComponent* EngineDecalR2;                                             // 0x1788 (size: 0x8)
    class UDecalComponent* EngineDecalR1;                                             // 0x1790 (size: 0x8)
    class UDecalComponent* GangwayDecalFrontR1;                                       // 0x1798 (size: 0x8)
    class UDecalComponent* GangwayDecalFrontL1;                                       // 0x17A0 (size: 0x8)
    class UDecalComponent* DriverDecal;                                               // 0x17A8 (size: 0x8)
    class UDecalComponent* GangwayDecalRearL;                                         // 0x17B0 (size: 0x8)
    class UDecalComponent* GangwayDecalRearR;                                         // 0x17B8 (size: 0x8)
    class UDecalComponent* AnchorDecal;                                               // 0x17C0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x17C8 (size: 0x8)
    class UStaticMeshComponent* SpotlightMesh1;                                       // 0x17D0 (size: 0x8)
    class UPointLightComponent* PointLight26;                                         // 0x17D8 (size: 0x8)
    class UPointLightComponent* PointLight27;                                         // 0x17E0 (size: 0x8)
    class UInstancedStaticMeshComponent* DeckLightMesh;                               // 0x17E8 (size: 0x8)
    class USceneComponent* DeckLights;                                                // 0x17F0 (size: 0x8)
    class USpotLightComponent* SpotLight8;                                            // 0x17F8 (size: 0x8)
    class UPointLightComponent* PointLight29;                                         // 0x1800 (size: 0x8)
    class UPointLightComponent* PointLight28;                                         // 0x1808 (size: 0x8)
    class UPointLightComponent* PointLight25;                                         // 0x1810 (size: 0x8)
    class UPointLightComponent* PointLight24;                                         // 0x1818 (size: 0x8)
    class UPointLightComponent* PointLight23;                                         // 0x1820 (size: 0x8)
    class UPointLightComponent* PointLight21;                                         // 0x1828 (size: 0x8)
    class UPointLightComponent* PointLight20;                                         // 0x1830 (size: 0x8)
    class UPointLightComponent* PointLight19;                                         // 0x1838 (size: 0x8)
    class UInstancedStaticMeshComponent* Light2;                                      // 0x1840 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x1848 (size: 0x8)
    class UStaticMeshComponent* LightMesh;                                            // 0x1850 (size: 0x8)
    class USceneComponent* Lights;                                                    // 0x1858 (size: 0x8)
    class UStaticMeshComponent* SpotLight;                                            // 0x1860 (size: 0x8)
    class UStaticMeshComponent* SpotlightBase;                                        // 0x1868 (size: 0x8)
    class UInstancedStaticMeshComponent* Light;                                       // 0x1870 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMeshAI;                                     // 0x1878 (size: 0x8)
    class UParticleSystemComponent* Exhaust2;                                         // 0x1880 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftLeft;                                 // 0x1888 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeRight;                               // 0x1890 (size: 0x8)
    class UParticleSystemComponent* WaveBreakForeLeft;                                // 0x1898 (size: 0x8)
    class UParticleSystemComponent* WaveBreakAftRight;                                // 0x18A0 (size: 0x8)
    class UParticleSystemComponent* SideRight;                                        // 0x18A8 (size: 0x8)
    class UParticleSystemComponent* WakeFore;                                         // 0x18B0 (size: 0x8)
    class UParticleSystemComponent* WakeAft;                                          // 0x18B8 (size: 0x8)
    class UParticleSystemComponent* Exhaust1;                                         // 0x18C0 (size: 0x8)
    class UParticleSystemComponent* SideLeft;                                         // 0x18C8 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox2;                                 // 0x18D0 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat4;                                         // 0x18D8 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox3;                                 // 0x18E0 (size: 0x8)
    class UVehicleSeatComponent* GunnerSeat3;                                         // 0x18E8 (size: 0x8)
    class USeatExitComponent* Gunner3Exit;                                            // 0x18F0 (size: 0x8)
    class USeatTriggerComponent* Gunner3Trigger;                                      // 0x18F8 (size: 0x8)
    class USeatExitComponent* Gunner4Exit;                                            // 0x1900 (size: 0x8)
    class USeatTriggerComponent* Gunner4Trigger;                                      // 0x1908 (size: 0x8)
    class UStaticMeshComponent* LadderMetal010;                                       // 0x1910 (size: 0x8)
    class UStaticMeshComponent* LadderMetal09;                                        // 0x1918 (size: 0x8)
    class UAudioComponent* IdleLoop;                                                  // 0x1920 (size: 0x8)
    class UBPWaterStencilComponent_C* BPtempWaterStencilComponent;                    // 0x1928 (size: 0x8)
    class UHatchComponent* RightLadderHatchExit;                                      // 0x1930 (size: 0x8)
    class UHatchComponent* RightLadderHatchEntrance;                                  // 0x1938 (size: 0x8)
    class UHatchComponent* LeftLadderHatchExit;                                       // 0x1940 (size: 0x8)
    class UHatchComponent* LeftLadderHatchEntrance;                                   // 0x1948 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentStbd;                  // 0x1950 (size: 0x8)
    class UBPShipEngineUseComponent_C* BPShipEngineUseComponentPort;                  // 0x1958 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x1960 (size: 0x8)
    class UBPLargeShipStorageShipLadder_C* ForeStarboardLadder;                       // 0x1968 (size: 0x8)
    class UBPLargeShipStorageShipLadder_C* ForePortLadder;                            // 0x1970 (size: 0x8)
    class UBoxComponent* RampControlVolume;                                           // 0x1978 (size: 0x8)
    class UBoxComponent* NoVehicleVolume;                                             // 0x1980 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox1;                                 // 0x1988 (size: 0x8)
    class UBPVehicleAccessBox_C* BPVehicleAccessBox;                                  // 0x1990 (size: 0x8)
    class UMapIntelligenceSourceComponent* MapIntelligenceSource;                     // 0x1998 (size: 0x8)
    class UBPAnchorDropped_C* AnchorDropped;                                          // 0x19A0 (size: 0x8)
    class UBPAnchorRaised_C* AnchorRaised;                                            // 0x19A8 (size: 0x8)
    class UBPAnchorComponent_C* BPAnchorComponent;                                    // 0x19B0 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponentRampArea;                // 0x19B8 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp3;                                           // 0x19C0 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp2;                                           // 0x19C8 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp1;                                           // 0x19D0 (size: 0x8)
    class UBPGangwayRamp_C* BPGangwayRamp4;                                           // 0x19D8 (size: 0x8)
    class UAITurretsControllerComponent* AITurretsController;                         // 0x19E0 (size: 0x8)
    class UBPLargeShipAIArtilleryGunTurretComponent_C* BPLargeShipAIArtilleryGunTurretComponent; // 0x19E8 (size: 0x8)
    class USeatExitComponent* SpotterExit;                                            // 0x19F0 (size: 0x8)
    class USeatExitComponent* DriverSeatExit;                                         // 0x19F8 (size: 0x8)
    class UVehicleSeatComponent* CraneSeat1;                                          // 0x1A00 (size: 0x8)
    class UStaticMeshComponent* LoadingAreaRegion;                                    // 0x1A08 (size: 0x8)
    class UStaticMeshComponent* LoadingAreaWater;                                     // 0x1A10 (size: 0x8)
    class URampRoomComponent* LoadingAreaRoom;                                        // 0x1A18 (size: 0x8)
    class USeatExitComponent* CraneExit;                                              // 0x1A20 (size: 0x8)
    class USeatTriggerComponent* CraneTrigger;                                        // 0x1A28 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBox;                                      // 0x1A30 (size: 0x8)
    class UStaticMeshComponent* LadderMetal08;                                        // 0x1A38 (size: 0x8)
    class UStaticMeshComponent* LadderMetal07;                                        // 0x1A40 (size: 0x8)
    class UTeamFlagMeshComponent* TeamFlagMesh;                                       // 0x1A48 (size: 0x8)
    class USeatTriggerComponent* SpotterTrigger;                                      // 0x1A50 (size: 0x8)
    class UVehicleSeatComponent* SpotterSeat2;                                        // 0x1A58 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x1A60 (size: 0x8)
    class UStaticMeshComponent* EngineRoomWater;                                      // 0x1A68 (size: 0x8)
    class UStaticMeshComponent* EngineRoomRegion;                                     // 0x1A70 (size: 0x8)
    class URoomComponent* EngineRoom;                                                 // 0x1A78 (size: 0x8)
    class UBoxComponent* DoorObstruction1;                                            // 0x1A80 (size: 0x8)
    class UBoxComponent* DoorObstruction0;                                            // 0x1A88 (size: 0x8)
    class UFloodableComponent* Floodable;                                             // 0x1A90 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor1;                                               // 0x1A98 (size: 0x8)
    class UBulkheadDoor* BulkheadDoor0;                                               // 0x1AA0 (size: 0x8)
    class USceneComponent* DoorsSceneComponent;                                       // 0x1AA8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x1AB0 (size: 0x8)
    class UCameraComponent* Camera;                                                   // 0x1AB8 (size: 0x8)
    class UBPWaterStencilComponent_C* BPWaterStencilComponent;                        // 0x1AC0 (size: 0x8)
    class UBoatHullMeshComponent* BoatHullMesh;                                       // 0x1AC8 (size: 0x8)
    class UVehicleSeatComponent* DriverSeat0;                                         // 0x1AD0 (size: 0x8)
    class USeatTriggerComponent* DriverSeatTrigger;                                   // 0x1AD8 (size: 0x8)
    class USkeletalMeshComponent* Deck;                                               // 0x1AE0 (size: 0x8)

    void BPOnClientBeginPlay();
    void ExecuteUbergraph_BPLargeShipStorageShip(int32 EntryPoint);
}; // Size: 0x1AE8

#endif
