#ifndef UE4SS_SDK_BPMaintenanceTunnel_HPP
#define UE4SS_SDK_BPMaintenanceTunnel_HPP

class ABPMaintenanceTunnel_C : public AMaintenanceTunnel
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0840 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0848 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck3;                                     // 0x0850 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck2;                                     // 0x0858 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck1;                                     // 0x0860 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck;                                      // 0x0868 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Placeholder;                                          // 0x0878 (size: 0x8)

}; // Size: 0x880

#endif
