#ifndef UE4SS_SDK_BPMaintenanceTunnel_HPP
#define UE4SS_SDK_BPMaintenanceTunnel_HPP

class ABPMaintenanceTunnel_C : public AMaintenanceTunnel
{
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent1;             // 0x0810 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BPBuildFootprintBoxComponent;              // 0x0818 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck3;                                     // 0x0820 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck2;                                     // 0x0828 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck1;                                     // 0x0830 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck;                                      // 0x0838 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Placeholder;                                          // 0x0848 (size: 0x8)

}; // Size: 0x850

#endif
