#ifndef UE4SS_SDK_BPMedicalRoomSpawnPoints_HPP
#define UE4SS_SDK_BPMedicalRoomSpawnPoints_HPP

class ABPMedicalRoomSpawnPoints_C : public ATemplate
{
    class USpawnPointComponent* SpawnPoint8;                                          // 0x0218 (size: 0x8)
    class USpawnPointComponent* SpawnPoint7;                                          // 0x0220 (size: 0x8)
    class USpawnPointComponent* SpawnPoint6;                                          // 0x0228 (size: 0x8)
    class USpawnPointComponent* SpawnPoint5;                                          // 0x0230 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x0238 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x0240 (size: 0x8)
    class USpawnPointComponent* SpawnPoint2;                                          // 0x0248 (size: 0x8)
    class USpawnPointComponent* SpawnPoint1;                                          // 0x0250 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
