#ifndef UE4SS_SDK_BPMGPillbox_HPP
#define UE4SS_SDK_BPMGPillbox_HPP

class ABPMGPillbox_C : public AMGPillbox
{
    class USeatTriggerComponent* SeatTriggerComponent;                                // 0x08A0 (size: 0x8)
    class UStructureSeatComponent* SeatComponent0;                                    // 0x08A8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck6;                                     // 0x08B0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck5;                                     // 0x08B8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck4;                                     // 0x08C0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck3;                                     // 0x08C8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck2;                                     // 0x08D0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck1;                                     // 0x08D8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck;                                      // 0x08E0 (size: 0x8)
    class UBoxComponent* ExtendedRepairBox;                                           // 0x08E8 (size: 0x8)
    class UMultiplexedSkeletalMeshComponent* MultiplexedSkeletalMesh;                 // 0x08F0 (size: 0x8)

}; // Size: 0x8F8

#endif
