#ifndef UE4SS_SDK_BPObservationBunkerT3_HPP
#define UE4SS_SDK_BPObservationBunkerT3_HPP

class ABPObservationBunkerT3_C : public AFortObservation
{
    class UTemplateComponent* FortCommonT3BreachedWalls;                              // 0x0870 (size: 0x8)
    class UBoxComponent* BlockBuildSiteMovement;                                      // 0x0878 (size: 0x8)
    class UStructureSeatComponent* OccupyComponent;                                   // 0x0880 (size: 0x8)
    class USeatTriggerComponent* SeatTriggerComponent;                                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0890 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0898 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* ObservationBunkerT3;                                  // 0x08B8 (size: 0x8)
    class UTemplateComponent* FortCommonDirtT3;                                       // 0x08C0 (size: 0x8)
    class UTemplateComponent* FortCommonDefenseMods;                                  // 0x08C8 (size: 0x8)
    class UTemplateComponent* FortCommonMods;                                         // 0x08D0 (size: 0x8)
    class UTemplateComponent* FortCommon;                                             // 0x08D8 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08E8 (size: 0x8)

}; // Size: 0x8F0

#endif
