#ifndef UE4SS_SDK_BPRelicBase2BuildSite_HPP
#define UE4SS_SDK_BPRelicBase2BuildSite_HPP

class ABPRelicBase2BuildSite_C : public ABPRelicBaseBuildSite_C
{
    class USpawnPointComponent* SpawnPoint5;                                          // 0x0878 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x0880 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x08B8 (size: 0x8)
    class UBoxComponent* BuildSite1;                                                  // 0x08C0 (size: 0x8)
    class UBoxComponent* BuildSite;                                                   // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* RelicBaseMesh;                                        // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x08D8 (size: 0x8)

}; // Size: 0x8E0

#endif
