#ifndef UE4SS_SDK_BPResourceContainer_HPP
#define UE4SS_SDK_BPResourceContainer_HPP

class ABPResourceContainer_C : public AResourceContainer
{
    class UBPResourceGroupRenderComponent_C* BPResourceGroupRenderComponent;          // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* Node25;                                               // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Node24;                                               // 0x0800 (size: 0x8)
    class UStaticMeshComponent* Node23;                                               // 0x0808 (size: 0x8)
    class UStaticMeshComponent* Node22;                                               // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Node21;                                               // 0x0818 (size: 0x8)
    class UStaticMeshComponent* Node20;                                               // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Node19;                                               // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Node18;                                               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* Node17;                                               // 0x0838 (size: 0x8)
    class UStaticMeshComponent* Node16;                                               // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Node15;                                               // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Node14;                                               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Node13;                                               // 0x0858 (size: 0x8)
    class UStaticMeshComponent* Node12;                                               // 0x0860 (size: 0x8)
    class UStaticMeshComponent* Node11;                                               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* Node10;                                               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Node09;                                               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Node08;                                               // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Node07;                                               // 0x0888 (size: 0x8)
    class UStaticMeshComponent* Node06;                                               // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Node05;                                               // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Node04;                                               // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* Node03;                                               // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Node02;                                               // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Node01;                                               // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* Node00;                                               // 0x08C0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x08C8 (size: 0x8)

}; // Size: 0x8D0

#endif
