#ifndef UE4SS_SDK_BPRefineryBuildSite_HPP
#define UE4SS_SDK_BPRefineryBuildSite_HPP

class ABPRefineryBuildSite_C : public ARefineryBuildSite
{
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0848 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0890 (size: 0x8)

}; // Size: 0x898

#endif
