#ifndef UE4SS_SDK_BPRelicBase1BuildSite_HPP
#define UE4SS_SDK_BPRelicBase1BuildSite_HPP

class ABPRelicBase1BuildSite_C : public ABPRelicBaseBuildSite_C
{
    class USpawnPointComponent* SpawnPoint5;                                          // 0x0828 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x0830 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0838 (size: 0x8)
    class UBoxComponent* BuildSite;                                                   // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Stairs3;                                              // 0x0848 (size: 0x8)
    class UStaticMeshComponent* RelicBaseMesh;                                        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0868 (size: 0x8)
    class UStaticMeshComponent* Stairs;                                               // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Stairs2;                                              // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Stairs1;                                              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
