#ifndef UE4SS_SDK_BPRelicBase3_HPP
#define UE4SS_SDK_BPRelicBase3_HPP

class ABPRelicBase3_C : public ABPRelicBase_C
{
    class USpawnPointComponent* SpawnPoint7;                                          // 0x0908 (size: 0x8)
    class USpawnPointComponent* SpawnPoint6;                                          // 0x0910 (size: 0x8)
    class USpawnPointComponent* SpawnPoint5;                                          // 0x0918 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x0920 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x0928 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0938 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0940 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0948 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x0950 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedGun;                            // 0x0958 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh41;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x0970 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0978 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0980 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0988 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0990 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem4;                                  // 0x0998 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x09A0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem3;                                  // 0x09A8 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x09B0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem2;                                  // 0x09B8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x09C0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x09C8 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh39;                                         // 0x09D8 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x09E8 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x09F8 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x0A08 (size: 0x8)
    class UChildActorComponent* ChildActor1;                                          // 0x0A10 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0A18 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0A28 (size: 0x8)
    class UChildActorComponent* ChildActor;                                           // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* Rope01;                                               // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0A48 (size: 0x8)
    class UChildActorComponent* Crates;                                               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* RelicMapBoard01;                                      // 0x0B18 (size: 0x8)
    class UBPRelicAIGarrisonTurret_C* BPRelicAIGarrisonTurret3;                       // 0x0B20 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0B28 (size: 0x8)
    class UBPRelicAIGarrisonTurret_C* BPRelicAIGarrisonTurret2;                       // 0x0B30 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0B38 (size: 0x8)
    class UBPRelicAIGarrisonTurret_C* BPRelicAIGarrisonTurret1;                       // 0x0B40 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0B48 (size: 0x8)
    class UBPRelicAIGarrisonTurret_C* BPRelicAIGarrisonTurret;                        // 0x0B50 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* TurretMesh3;                                          // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* TurretMesh1;                                          // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* TurretMesh2;                                          // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0B80 (size: 0x8)
    class UStaticMeshComponent* TurretMesh;                                           // 0x0B88 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x0B90 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0B98 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0BA0 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* RelicBaseMesh;                                        // 0x0BB0 (size: 0x8)

}; // Size: 0xBB8

#endif
