#ifndef UE4SS_SDK_BPRelicBase1_HPP
#define UE4SS_SDK_BPRelicBase1_HPP

class ABPRelicBase1_C : public ABPRelicBase_C
{
    class USpawnPointComponent* SpawnPoint7;                                          // 0x0908 (size: 0x8)
    class USpawnPointComponent* SpawnPoint6;                                          // 0x0910 (size: 0x8)
    class USpawnPointComponent* SpawnPoint5;                                          // 0x0918 (size: 0x8)
    class USpawnPointComponent* SpawnPoint4;                                          // 0x0920 (size: 0x8)
    class USpawnPointComponent* SpawnPoint3;                                          // 0x0928 (size: 0x8)
    class USpawnPointComponent* SpawnPoint;                                           // 0x0930 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0938 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMeshGun;                  // 0x0940 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMeshRoof;                 // 0x0948 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0950 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0958 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x0960 (size: 0x8)
    class UPointLightComponent* PointLight5;                                          // 0x0968 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0970 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0978 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x09B0 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x09B8 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x09C0 (size: 0x8)
    class UParticleSystemComponent* InteriorDrip;                                     // 0x09C8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* HangingWires07;                                       // 0x09D8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem2;                                  // 0x09E0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* HangingWires08;                                       // 0x09F0 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x09F8 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0A00 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0A08 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* Radio;                                                // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* Chair_02;                                             // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* RelicSandBagWall01;                                   // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0A30 (size: 0x8)
    class UChildActorComponent* Crates;                                               // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* StaticMesh_0;                                         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* RelicComputerStation01;                               // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0A68 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0A70 (size: 0x8)
    class UBPRelicAIGarrisonTurret_C* BPRelicAIGarrisonTurret2;                       // 0x0A78 (size: 0x8)
    class UBPRelicAIGarrisonTurret_C* BPRelicAIGarrisonTurret1;                       // 0x0A80 (size: 0x8)
    class UBPRelicAIGarrisonTurret_C* BPRelicAIGarrisonTurret;                        // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* Stairs;                                               // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* Stairs1;                                              // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* Stairs3;                                              // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* Stairs2;                                              // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* TurretMesh;                                           // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* TurretMesh2;                                          // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* TurretMesh1;                                          // 0x0AC0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x0AC8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0AD0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* RelicBaseMesh;                                        // 0x0AE8 (size: 0x8)

}; // Size: 0xAF0

#endif
