#ifndef UE4SS_SDK_BPResourceTrailer_HPP
#define UE4SS_SDK_BPResourceTrailer_HPP

class ABPResourceTrailer_C : public ABPTrailerBase_C
{
    class UStaticMeshComponent* Node16;                                               // 0x12A0 (size: 0x8)
    class UStaticMeshComponent* Node15;                                               // 0x12A8 (size: 0x8)
    class UStaticMeshComponent* Node14;                                               // 0x12B0 (size: 0x8)
    class UStaticMeshComponent* Node13;                                               // 0x12B8 (size: 0x8)
    class UStaticMeshComponent* Node12;                                               // 0x12C0 (size: 0x8)
    class UStaticMeshComponent* Node11;                                               // 0x12C8 (size: 0x8)
    class UStaticMeshComponent* Node10;                                               // 0x12D0 (size: 0x8)
    class UStaticMeshComponent* Node09;                                               // 0x12D8 (size: 0x8)
    class UStaticMeshComponent* Node08;                                               // 0x12E0 (size: 0x8)
    class UStaticMeshComponent* Node07;                                               // 0x12E8 (size: 0x8)
    class UStaticMeshComponent* Node06;                                               // 0x12F0 (size: 0x8)
    class UStaticMeshComponent* Node05;                                               // 0x12F8 (size: 0x8)
    class UStaticMeshComponent* Node04;                                               // 0x1300 (size: 0x8)
    class UStaticMeshComponent* Node03;                                               // 0x1308 (size: 0x8)
    class UStaticMeshComponent* Node02;                                               // 0x1310 (size: 0x8)
    class UStaticMeshComponent* Node01;                                               // 0x1318 (size: 0x8)
    class UStaticMeshComponent* Node00;                                               // 0x1320 (size: 0x8)
    class UBPResourceGroupRenderComponent_C* BPResourceGroupRenderComponent;          // 0x1328 (size: 0x8)

}; // Size: 0x1330

#endif
