#ifndef UE4SS_SDK_BPRiflePillbox_HPP
#define UE4SS_SDK_BPRiflePillbox_HPP

class ABPRiflePillbox_C : public AFoxholeTurret
{
    class USeatTriggerComponent* SeatTriggerComponent;                                // 0x08B0 (size: 0x8)
    class UStructureSeatComponent* SeatComponent0;                                    // 0x08B8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck5;                                     // 0x08C0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck4;                                     // 0x08C8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck3;                                     // 0x08D0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck2;                                     // 0x08D8 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck1;                                     // 0x08E0 (size: 0x8)
    class UBuildSocketComponent* LandscapeCheck;                                      // 0x08E8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* RiflePillbox;                                         // 0x08F8 (size: 0x8)

}; // Size: 0x900

#endif
