#ifndef UE4SS_SDK_BPRocketGroundZero_HPP
#define UE4SS_SDK_BPRocketGroundZero_HPP

class ABPRocketGroundZero_C : public ARocketGroundZero
{
    class UParticleSystemComponent* ParticleSystem2;                                  // 0x0870 (size: 0x8)
    class UAudioComponent* Audio1;                                                    // 0x0878 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0880 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem7;                                  // 0x0888 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem6;                                  // 0x0890 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem5;                                  // 0x0898 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem4;                                  // 0x08A0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem3;                                  // 0x08A8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x08B0 (size: 0x8)
    class UParticleSystemComponent* Smoke;                                            // 0x08B8 (size: 0x8)
    class UParticleSystemComponent* Ash;                                              // 0x08C0 (size: 0x8)
    class UDecalComponent* ScorchMarks;                                               // 0x08C8 (size: 0x8)
    class UDecalComponent* CraterDecal;                                               // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x08D8 (size: 0x8)
    class UPostProcessComponent* PostProcess;                                         // 0x08E0 (size: 0x8)
    class USphereComponent* Sphere1;                                                  // 0x08E8 (size: 0x8)

}; // Size: 0x8F0

#endif
