#ifndef UE4SS_SDK_BPRocketSite_HPP
#define UE4SS_SDK_BPRocketSite_HPP

class ABPRocketSite_C : public ARocketFacility
{
    class UBPNoBuildBoxComponent_C* BPNoBuildBoxComponent;                            // 0x0910 (size: 0x8)
    class UDecalComponent* Corner04;                                                  // 0x0918 (size: 0x8)
    class UDecalComponent* Corner03;                                                  // 0x0920 (size: 0x8)
    class UDecalComponent* Corner02;                                                  // 0x0928 (size: 0x8)
    class UDecalComponent* Corner01;                                                  // 0x0930 (size: 0x8)
    class UDecalComponent* Center Decal;                                              // 0x0938 (size: 0x8)
    class UBoxComponent* ShippableTransferCollision;                                  // 0x0940 (size: 0x8)
    class UBuildSocketComponent* PipeInput0;                                          // 0x0948 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0950 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0958 (size: 0x8)

}; // Size: 0x960

#endif
