#ifndef UE4SS_SDK_BPRocketSite_HPP
#define UE4SS_SDK_BPRocketSite_HPP

class ABPRocketSite_C : public ARocketFacility
{
    class UBPNoBuildBoxComponent_C* BPNoBuildBoxComponent;                            // 0x0950 (size: 0x8)
    class UDecalComponent* Corner04;                                                  // 0x0958 (size: 0x8)
    class UDecalComponent* Corner03;                                                  // 0x0960 (size: 0x8)
    class UDecalComponent* Corner02;                                                  // 0x0968 (size: 0x8)
    class UDecalComponent* Corner01;                                                  // 0x0970 (size: 0x8)
    class UDecalComponent* Center Decal;                                              // 0x0978 (size: 0x8)
    class UBoxComponent* ShippableTransferCollision;                                  // 0x0980 (size: 0x8)
    class UBuildSocketComponent* PipeInput0;                                          // 0x0988 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0998 (size: 0x8)

}; // Size: 0x9A0

#endif
