#ifndef UE4SS_SDK_BPSeaportBuildSite_HPP
#define UE4SS_SDK_BPSeaportBuildSite_HPP

class ABPSeaportBuildSite_C : public ASeaportBuildSite
{
    class UStaticMeshComponent* TransferAreaMesh2;                                    // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* TransferAreaMesh1;                                    // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* GarrisonWindow;                                       // 0x0800 (size: 0x8)
    class UStaticMeshComponent* Handrail1;                                            // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SeaportSideway;                                       // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Handrail;                                             // 0x0818 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Seaport;                                              // 0x0828 (size: 0x8)

}; // Size: 0x830

#endif
