#ifndef UE4SS_SDK_BPSeaportBuildSite_HPP
#define UE4SS_SDK_BPSeaportBuildSite_HPP

class ABPSeaportBuildSite_C : public ASeaportBuildSite
{
    class UStaticMeshComponent* TransferAreaMesh2;                                    // 0x0830 (size: 0x8)
    class UStaticMeshComponent* TransferAreaMesh1;                                    // 0x0838 (size: 0x8)
    class UStaticMeshComponent* GarrisonWindow;                                       // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Handrail1;                                            // 0x0848 (size: 0x8)
    class UStaticMeshComponent* SeaportSideway;                                       // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Handrail;                                             // 0x0858 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0860 (size: 0x8)
    class UStaticMeshComponent* Seaport;                                              // 0x0868 (size: 0x8)

}; // Size: 0x870

#endif
