#ifndef UE4SS_SDK_BPSeaport_HPP
#define UE4SS_SDK_BPSeaport_HPP

class ABPSeaport_C : public ASeaport
{
    class UBPLoadingAreaBox_C* BPLoadingAreaBoxWater1;                                // 0x0910 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBoxWater0;                                // 0x0918 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBoxLand1;                                 // 0x0920 (size: 0x8)
    class UBPLoadingAreaBox_C* BPLoadingAreaBoxLand0;                                 // 0x0928 (size: 0x8)
    class UAudioComponent* Audio;                                                     // 0x0930 (size: 0x8)
    class UTemperatureModifierBoxComponent* TemperatureModifierBox;                   // 0x0938 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Cylinder1;                                            // 0x0948 (size: 0x8)
    class UStaticMeshComponent* Cylinder;                                             // 0x0950 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0958 (size: 0x8)
    class UStaticMeshComponent* Searchlight;                                          // 0x0960 (size: 0x8)
    class UBPSeaportAITurret_C* BPSeaportAITurret2;                                   // 0x0968 (size: 0x8)
    class UBPSeaportAITurret_C* BPSeaportAITurret;                                    // 0x0970 (size: 0x8)
    class UBPSeaportAITurret_C* BPSeaportAITurret1;                                   // 0x0978 (size: 0x8)
    class UStaticMeshComponent* TransferAreaMesh2;                                    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* TransferAreaMesh1;                                    // 0x0988 (size: 0x8)
    class UStaticMeshComponent* Box21;                                                // 0x0990 (size: 0x8)
    class UStaticMeshComponent* Box20;                                                // 0x0998 (size: 0x8)
    class UStaticMeshComponent* Box19;                                                // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Box16;                                                // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Box15;                                                // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Box14;                                                // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Box13;                                                // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Box12;                                                // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Box11;                                                // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* Box10;                                                // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* Box8;                                                 // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* Box7;                                                 // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Box6;                                                 // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* Box5;                                                 // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Box4;                                                 // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* Box3;                                                 // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* Box2;                                                 // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* Box1;                                                 // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* Box;                                                  // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging030;                               // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging029;                               // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging028;                               // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging027;                               // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging026;                               // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging025;                               // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging024;                               // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging023;                               // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging022;                               // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging021;                               // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging020;                               // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging019;                               // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging018;                               // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging017;                               // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging016;                               // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging013;                               // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging011;                               // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging015;                               // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging014;                               // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging04;                                // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging010;                               // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging09;                                // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging07;                                // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging06;                                // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging05;                                // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* FishermanNetHanging012;                               // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* SeaportSideway;                                       // 0x0AF8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* Seaport;                                              // 0x0B08 (size: 0x8)

}; // Size: 0xB10

#endif
