#ifndef UE4SS_SDK_BPStorageFacilityBuildSite_HPP
#define UE4SS_SDK_BPStorageFacilityBuildSite_HPP

class ABPStorageFacilityBuildSite_C : public AStorageFacilityBuildSite
{
    class UStaticMeshComponent* StaticMesh8;                                          // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* HomeRegionTarp03;                                     // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* ItemCrate;                                            // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* BasicCrates03;                                        // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* Barrel_11;                                            // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* BulwarkDressingMetalBracket;                          // 0x0800 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0810 (size: 0x8)

}; // Size: 0x818

#endif
