#ifndef UE4SS_SDK_BPStorageFacilityBuildSite_HPP
#define UE4SS_SDK_BPStorageFacilityBuildSite_HPP

class ABPStorageFacilityBuildSite_C : public AStorageFacilityBuildSite
{
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0820 (size: 0x8)
    class UStaticMeshComponent* HomeRegionTarp03;                                     // 0x0828 (size: 0x8)
    class UStaticMeshComponent* ItemCrate;                                            // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* BasicCrates03;                                        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Barrel_11;                                            // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* BulwarkDressingMetalBracket;                          // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0870 (size: 0x8)

}; // Size: 0x878

#endif
