#ifndef UE4SS_SDK_BPTownBase3_HPP
#define UE4SS_SDK_BPTownBase3_HPP

class ABPTownBase3_C : public ATownBase
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* FlagMeshRoof;                                         // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* FlagMesh;                                             // 0x08E0 (size: 0x8)
    class USpawnPointComponent* Spawn19;                                              // 0x08E8 (size: 0x8)
    class USpawnPointComponent* Spawn18;                                              // 0x08F0 (size: 0x8)
    class USpawnPointComponent* Spawn17;                                              // 0x08F8 (size: 0x8)
    class USpawnPointComponent* Spawn16;                                              // 0x0900 (size: 0x8)
    class USpawnPointComponent* Spawn15;                                              // 0x0908 (size: 0x8)
    class USpawnPointComponent* Spawn14;                                              // 0x0910 (size: 0x8)
    class USpawnPointComponent* Spawn13;                                              // 0x0918 (size: 0x8)
    class USpawnPointComponent* Spawn12;                                              // 0x0920 (size: 0x8)
    class USpawnPointComponent* Spawn11;                                              // 0x0928 (size: 0x8)
    class USpawnPointComponent* Spawn10;                                              // 0x0930 (size: 0x8)
    class USpawnPointComponent* Spawn9;                                               // 0x0938 (size: 0x8)
    class USpawnPointComponent* Spawn8;                                               // 0x0940 (size: 0x8)
    class USpawnPointComponent* Spawn7;                                               // 0x0948 (size: 0x8)
    class USpawnPointComponent* Spawn6;                                               // 0x0950 (size: 0x8)
    class USpawnPointComponent* Spawn5;                                               // 0x0958 (size: 0x8)
    class USpawnPointComponent* Spawn4;                                               // 0x0960 (size: 0x8)
    class USpawnPointComponent* Spawn3;                                               // 0x0968 (size: 0x8)
    class USpawnPointComponent* Spawn2;                                               // 0x0970 (size: 0x8)
    class USpawnPointComponent* Spawn1;                                               // 0x0978 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0980 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedBase;                           // 0x0988 (size: 0x8)
    class UStaticMeshComponent* Bollard19;                                            // 0x0990 (size: 0x8)
    class UStaticMeshComponent* Bollard18;                                            // 0x0998 (size: 0x8)
    class UStaticMeshComponent* Bollard17;                                            // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Bollard16;                                            // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Bollard15;                                            // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Bollard14;                                            // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Bollard13;                                            // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Bollard12;                                            // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Bollard11;                                            // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* Bollard10;                                            // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* Bollard9;                                             // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* Bollard8;                                             // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Bollard7;                                             // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* Bollard6;                                             // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Bollard5;                                             // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* Bollard4;                                             // 0x0A08 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x0A10 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0A18 (size: 0x8)
    class USpotLightComponent* SpotLight4;                                            // 0x0A20 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0A30 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0A40 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x0A48 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x0A50 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* HouseLantern2;                                        // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* HouseLantern1;                                        // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* HouseLantern;                                         // 0x0A70 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x0A78 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x0A80 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x0A88 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x0A90 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x0A98 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x0AA0 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x0AA8 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0AB0 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0AB8 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0AC0 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0AC8 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0AD0 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0AD8 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0AE0 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* Window6;                                              // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* Window5;                                              // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* Window4;                                              // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* Window3;                                              // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x0B18 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x0B20 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x0B28 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0B30 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0B38 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0B40 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_BackRight;                        // 0x0B48 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0B50 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_FrontRight;                       // 0x0B58 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0B60 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0B68 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0B70 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0B78 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_BackLeft;                         // 0x0B80 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x0B88 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x0B90 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_FrontLeft;                        // 0x0B98 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0BA0 (size: 0x8)
    class UCameraComponent* ViewTargetCamera;                                         // 0x0BA8 (size: 0x8)
    class UStaticMeshComponent* TownBaseMesh;                                         // 0x0BB0 (size: 0x8)

    void BPSetTeamVisuals(const int32 VisualTeamId);
    void ExecuteUbergraph_BPTownBase3(int32 EntryPoint);
}; // Size: 0xBB8

#endif
