#ifndef UE4SS_SDK_BPTownBase1_HPP
#define UE4SS_SDK_BPTownBase1_HPP

class ABPTownBase1_C : public ATownBase
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* FlagMesh;                                             // 0x08F8 (size: 0x8)
    class USpawnPointComponent* Spawn9;                                               // 0x0900 (size: 0x8)
    class USpawnPointComponent* Spawn8;                                               // 0x0908 (size: 0x8)
    class USpawnPointComponent* Spawn7;                                               // 0x0910 (size: 0x8)
    class USpawnPointComponent* Spawn6;                                               // 0x0918 (size: 0x8)
    class USpawnPointComponent* Spawn5;                                               // 0x0920 (size: 0x8)
    class USpawnPointComponent* Spawn4;                                               // 0x0928 (size: 0x8)
    class USpawnPointComponent* Spawn3;                                               // 0x0930 (size: 0x8)
    class USpawnPointComponent* Spawn2;                                               // 0x0938 (size: 0x8)
    class USpawnPointComponent* Spawn1;                                               // 0x0940 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0948 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedBase;                           // 0x0950 (size: 0x8)
    class UChildActorComponent* OilLantern;                                           // 0x0958 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0960 (size: 0x8)
    class UPointLightComponent* PointLight4;                                          // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0970 (size: 0x8)
    class UPointLightComponent* PointLight3;                                          // 0x0978 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0980 (size: 0x8)
    class UPointLightComponent* PointLight2;                                          // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0990 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0998 (size: 0x8)
    class UStaticMeshComponent* Bollard7;                                             // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Bollard6;                                             // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Bollard5;                                             // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Bollard4;                                             // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Bollard3;                                             // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Bollard2;                                             // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Bollard1;                                             // 0x09D0 (size: 0x8)
    class UBoxComponent* Box1;                                                        // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* IModFileCabinet06;                                    // 0x09E0 (size: 0x8)
    class UBoxComponent* Box;                                                         // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* IModLocker07;                                         // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* IModChalkBoard02;                                     // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* BottlesCrate02;                                       // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* IModDeskPapers01;                                     // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* Paper02;                                              // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* Paper01;                                              // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* IModDeskPapers02;                                     // 0x0A20 (size: 0x8)
    class UDecalComponent* Decal36;                                                   // 0x0A28 (size: 0x8)
    class UDecalComponent* Decal35;                                                   // 0x0A30 (size: 0x8)
    class UDecalComponent* Decal34;                                                   // 0x0A38 (size: 0x8)
    class UDecalComponent* Decal33;                                                   // 0x0A40 (size: 0x8)
    class UDecalComponent* Decal32;                                                   // 0x0A48 (size: 0x8)
    class UDecalComponent* Decal31;                                                   // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal30;                                                   // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal29;                                                   // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x0A68 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x0A70 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x0A78 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x0A80 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x0A88 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0A90 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0A98 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x0AA0 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x0AA8 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x0AB0 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x0AB8 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x0AC0 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x0AC8 (size: 0x8)
    class UDecalComponent* Decal28;                                                   // 0x0AD0 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x0AD8 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x0AE0 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x0AE8 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0AF0 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0AF8 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0B00 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0B08 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0B10 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0B18 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* HouseLantern;                                         // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* Window5;                                              // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* Window4;                                              // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* Window3;                                              // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0B58 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x0B60 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0B68 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0B70 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0B78 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Clock;                            // 0x0B80 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0B88 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0B90 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Back;                             // 0x0B98 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x0BA0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0BA8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x0BB0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0BB8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Front;                            // 0x0BC0 (size: 0x8)
    class UCameraComponent* ViewTargetCamera;                                         // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* TownBaseMesh;                                         // 0x0BD0 (size: 0x8)

    void BPSetTeamVisuals(const int32 VisualTeamId);
    void ExecuteUbergraph_BPTownBase1(int32 EntryPoint);
}; // Size: 0xBD8

#endif
