#ifndef UE4SS_SDK_BPTrenchEmpDirtDecals_HPP
#define UE4SS_SDK_BPTrenchEmpDirtDecals_HPP

class ABPTrenchEmpDirtDecals_C : public ATemplate
{
    class UDecalComponent* Decal7;                                                    // 0x0218 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0220 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0228 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0230 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0238 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0240 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0248 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0250 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0258 (size: 0x8)

}; // Size: 0x260

#endif
