#ifndef UE4SS_SDK_BPTrenchBuildSite_HPP
#define UE4SS_SDK_BPTrenchBuildSite_HPP

class ABPTrenchBuildSite_C : public AFortBuildSiteBase
{
    class UTemplateComponent* TrenchCommonDirtT1T2;                                   // 0x0800 (size: 0x8)
    class UBPTrenchBlockerBox_C* BPTrenchBlockerBox;                                  // 0x0808 (size: 0x8)
    class UStaticMeshComponent* SideRope01;                                           // 0x0810 (size: 0x8)
    class UStaticMeshComponent* SideRope04;                                           // 0x0818 (size: 0x8)
    class UStaticMeshComponent* SideRope03;                                           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* SideRope02;                                           // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Side03;                                               // 0x0830 (size: 0x8)
    class UStaticMeshComponent* Side02;                                               // 0x0838 (size: 0x8)
    class UDecalComponent* BSDecal03;                                                 // 0x0840 (size: 0x8)
    class UDecalComponent* BSDecal02;                                                 // 0x0848 (size: 0x8)
    class UDecalComponent* BSDecal01;                                                 // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Side01;                                               // 0x0858 (size: 0x8)
    class UBoxComponent* BuildsiteOverlapBlock;                                       // 0x0860 (size: 0x8)
    class UBuildSocketComponent* RightSocket;                                         // 0x0868 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0870 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x0878 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x0880 (size: 0x8)
    class UBoxComponent* WorkBox;                                                     // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
