#ifndef UE4SS_SDK_BPTrainCoal_HPP
#define UE4SS_SDK_BPTrainCoal_HPP

class ABPTrainCoal_C : public ARailVehicle
{
    class UStaticMeshComponent* Node012;                                              // 0x1230 (size: 0x8)
    class UStaticMeshComponent* Node011;                                              // 0x1238 (size: 0x8)
    class UStaticMeshComponent* Node010;                                              // 0x1240 (size: 0x8)
    class UStaticMeshComponent* Node09;                                               // 0x1248 (size: 0x8)
    class UStaticMeshComponent* Node08;                                               // 0x1250 (size: 0x8)
    class UStaticMeshComponent* Node07;                                               // 0x1258 (size: 0x8)
    class UStaticMeshComponent* Node06;                                               // 0x1260 (size: 0x8)
    class UStaticMeshComponent* Node05;                                               // 0x1268 (size: 0x8)
    class UStaticMeshComponent* Node04;                                               // 0x1270 (size: 0x8)
    class UStaticMeshComponent* Node03;                                               // 0x1278 (size: 0x8)
    class UStaticMeshComponent* Node02;                                               // 0x1280 (size: 0x8)
    class UStaticMeshComponent* Node01;                                               // 0x1288 (size: 0x8)
    class UStaticMeshComponent* Node00;                                               // 0x1290 (size: 0x8)
    class UBPResourceGroupRenderComponent_C* BPResourceGroupRenderComponent;          // 0x1298 (size: 0x8)
    class UBoxComponent* UseVolume;                                                   // 0x12A0 (size: 0x8)

}; // Size: 0x12A8

#endif
