#ifndef UE4SS_SDK_BPTrenchIntBuildGhost_HPP
#define UE4SS_SDK_BPTrenchIntBuildGhost_HPP

class ABPTrenchIntBuildGhost_C : public ABuildGhost
{
    class UStaticMeshComponent* TrenchBuildsite02SideRope02;                          // 0x0580 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope010;                         // 0x0588 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post04;                              // 0x0590 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope09;                          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope08;                          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post03;                              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope07;                          // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope06;                          // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post02;                              // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope05;                          // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post01;                              // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope011;                         // 0x05D8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side04;                              // 0x05E0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side03;                              // 0x05E8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side02;                              // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side01;                              // 0x05F8 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x0600 (size: 0x8)
    class UBuildSocketComponent* RightSocket;                                         // 0x0608 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x0610 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0618 (size: 0x8)

}; // Size: 0x620

#endif
