#ifndef UE4SS_SDK_BPTrenchIntT3_HPP
#define UE4SS_SDK_BPTrenchIntT3_HPP

class ABPTrenchIntT3_C : public AFort
{
    class UTemplateComponent* TrenchIntDirtDecals;                                    // 0x0850 (size: 0x8)
    class UBPTrenchBlockerBox_C* BPTrenchBlockerBox;                                  // 0x0858 (size: 0x8)
    class UTemplateComponent* TrenchIntCommonMods;                                    // 0x0860 (size: 0x8)
    class UStaticMeshComponent* WallFront;                                            // 0x0868 (size: 0x8)
    class UStaticMeshComponent* WallBack;                                             // 0x0870 (size: 0x8)
    class UStaticMeshComponent* WallLeft;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0880 (size: 0x8)
    class UStaticMeshComponent* WallRight;                                            // 0x0888 (size: 0x8)
    class UStaticMeshComponent* WallCornerBackLeft;                                   // 0x0890 (size: 0x8)
    class UStaticMeshComponent* WallCornerFrontLeft;                                  // 0x0898 (size: 0x8)
    class UStaticMeshComponent* WallCornerFrontRight;                                 // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* WallCornerBackRight;                                  // 0x08A8 (size: 0x8)
    class UBPTrenchRoofModSlot_C* BPTrenchRoofModSlot;                                // 0x08B0 (size: 0x8)
    class UTemplateComponent* TrenchIntCommon;                                        // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
