#ifndef UE4SS_SDK_BPTrainCaboose_HPP
#define UE4SS_SDK_BPTrainCaboose_HPP

class ABPTrainCaboose_C : public ACabooseRailVehicle
{
    class UVehicleSeatComponent* PassengerSeat3;                                      // 0x1230 (size: 0x8)
    class USeatTriggerComponent* PassengerTrigger3;                                   // 0x1238 (size: 0x8)
    class USeatTriggerComponent* PassengerTrigger2;                                   // 0x1240 (size: 0x8)
    class USeatTriggerComponent* PassengerTrigger1;                                   // 0x1248 (size: 0x8)
    class USeatExitComponent* PassengerExit3;                                         // 0x1250 (size: 0x8)
    class USeatExitComponent* PassengerExit2;                                         // 0x1258 (size: 0x8)
    class USeatExitComponent* PassengerExit1;                                         // 0x1260 (size: 0x8)
    class UVehicleSeatComponent* PassengerSeat2;                                      // 0x1268 (size: 0x8)
    class UVehicleSeatComponent* PassengerSeat1;                                      // 0x1270 (size: 0x8)
    class USeatExitComponent* PassengerExit;                                          // 0x1278 (size: 0x8)
    class USeatTriggerComponent* PassengerTrigger;                                    // 0x1280 (size: 0x8)
    class UVehicleSeatComponent* PassengerSeat0;                                      // 0x1288 (size: 0x8)

}; // Size: 0x1290

#endif
