#ifndef UE4SS_SDK_BPTrenchBuildGhost_HPP
#define UE4SS_SDK_BPTrenchBuildGhost_HPP

class ABPTrenchBuildGhost_C : public ABuildGhost
{
    class UStaticMeshComponent* TrenchBuildsite02Side02;                              // 0x0580 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope01;                          // 0x0588 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope04;                          // 0x0590 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope03;                          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope02;                          // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side03;                              // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Side01;                              // 0x05B0 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x05B8 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x05C0 (size: 0x8)
    class UBuildSocketComponent* RightSocket;                                         // 0x05C8 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x05D0 (size: 0x8)

}; // Size: 0x5D8

#endif
