#ifndef UE4SS_SDK_BPTrenchEmpT1_HPP
#define UE4SS_SDK_BPTrenchEmpT1_HPP

class ABPTrenchEmpT1_C : public AFort
{
    class UTemplateComponent* TrenchEmpCommonSockets;                                 // 0x0830 (size: 0x8)
    class UTemplateComponent* TrenchEmpDirtDecals;                                    // 0x0838 (size: 0x8)
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x0840 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommonDirtT1T2;                                // 0x0848 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommonMods;                                    // 0x0850 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommon;                                        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* BackCornerL;                                          // 0x0860 (size: 0x8)
    class UStaticMeshComponent* RightCornerR;                                         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* RightCornerL;                                         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* FrontCornerR;                                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* FrontCornerL;                                         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* LeftCornerR;                                          // 0x0888 (size: 0x8)
    class UStaticMeshComponent* LeftCornerL;                                          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* BackCornerR;                                          // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* Front;                                                // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* FrontLeft;                                            // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* BackLeft;                                             // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* FrontRight;                                           // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* BackRight;                                            // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* Left;                                                 // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* Back;                                                 // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* Right;                                                // 0x08E0 (size: 0x8)

}; // Size: 0x8E8

#endif
