#ifndef UE4SS_SDK_BPTrenchIntCommonDirtT1T2_HPP
#define UE4SS_SDK_BPTrenchIntCommonDirtT1T2_HPP

class ABPTrenchIntCommonDirtT1T2_C : public ATemplate
{
    class UStaticMeshComponent* RearDirt;                                             // 0x0220 (size: 0x8)
    class UStaticMeshComponent* BackLeftCorner;                                       // 0x0228 (size: 0x8)
    class UStaticMeshComponent* FrontLeftCorner;                                      // 0x0230 (size: 0x8)
    class UStaticMeshComponent* FrontRightCorner;                                     // 0x0238 (size: 0x8)
    class UStaticMeshComponent* BackRightCorner;                                      // 0x0240 (size: 0x8)
    class UStaticMeshComponent* RightDirt;                                            // 0x0248 (size: 0x8)
    class UStaticMeshComponent* LeftDirt;                                             // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FrontDirt;                                            // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
