#ifndef UE4SS_SDK_BPTrenchDestroyedT1_HPP
#define UE4SS_SDK_BPTrenchDestroyedT1_HPP

class ABPTrenchDestroyedT1_C : public AFort
{
    class UTemplateComponent* TrenchCommonDirtT1T2;                                   // 0x0820 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh1;                // 0x0828 (size: 0x8)
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x0830 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01Back;                              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01Front;                             // 0x0840 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0848 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01Left;                              // 0x0850 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01Right;                             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01OpenRight;                         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01OpenLeft;                          // 0x0868 (size: 0x8)
    class UTemplateComponent* TrenchCommon;                                           // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0878 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0880 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0888 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0890 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0898 (size: 0x8)

}; // Size: 0x8A0

#endif
