#ifndef UE4SS_SDK_BPTrenchConnectorDestroyedT3_HPP
#define UE4SS_SDK_BPTrenchConnectorDestroyedT3_HPP

class ABPTrenchConnectorDestroyedT3_C : public AFortConnector
{
    class UTemplateComponent* TrenchConnectorCommonT3;                                // 0x0850 (size: 0x8)
    class UTemplateComponent* TrenchConnectorCommon;                                  // 0x0858 (size: 0x8)
    class UDecalComponent* GravelBack;                                                // 0x0860 (size: 0x8)
    class UDecalComponent* GravelFront;                                               // 0x0868 (size: 0x8)
    class UStaticMeshComponent* WallRight;                                            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* WallLeft;                                             // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Destroyed;                                            // 0x0880 (size: 0x8)
    class UStaticMeshComponent* DirtFrontRight;                                       // 0x0888 (size: 0x8)
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x0898 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
