#ifndef UE4SS_SDK_BPTrenchCommonDirtT3_HPP
#define UE4SS_SDK_BPTrenchCommonDirtT3_HPP

class ABPTrenchCommonDirtT3_C : public ATemplate
{
    class UStaticMeshComponent* OpenWallRight;                                        // 0x0218 (size: 0x8)
    class UStaticMeshComponent* OpenWallLeft;                                         // 0x0220 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x0228 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x0230 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0238 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0240 (size: 0x8)
    class UStaticMeshComponent* WallRight;                                            // 0x0248 (size: 0x8)
    class UStaticMeshComponent* WallLeft;                                             // 0x0250 (size: 0x8)
    class UStaticMeshComponent* WallBack;                                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* WallFront;                                            // 0x0260 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
