#ifndef UE4SS_SDK_BPTrenchT1_HPP
#define UE4SS_SDK_BPTrenchT1_HPP

class ABPTrenchT1_C : public AFort
{
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x0800 (size: 0x8)
    class UTemplateComponent* TrenchCommonMods;                                       // 0x0808 (size: 0x8)
    class UTemplateComponent* TrenchCommon;                                           // 0x0810 (size: 0x8)
    class UStaticMeshComponent* DirtOpenWallRight;                                    // 0x0818 (size: 0x8)
    class UStaticMeshComponent* DirtOpenWallLeft;                                     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* DirtFrontRight;                                       // 0x0828 (size: 0x8)
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0830 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0848 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0850 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0858 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x0860 (size: 0x8)
    class UDecalComponent* DecalRight;                                                // 0x0868 (size: 0x8)
    class UDecalComponent* DecalLeft;                                                 // 0x0870 (size: 0x8)
    class UDecalComponent* DecalBack;                                                 // 0x0878 (size: 0x8)
    class UDecalComponent* DecalFront;                                                // 0x0880 (size: 0x8)
    class UStaticMeshComponent* OpenWallRight;                                        // 0x0888 (size: 0x8)
    class UStaticMeshComponent* OpenWallLeft;                                         // 0x0890 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* WallRight;                                            // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* WallLeft;                                             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* WallBack;                                             // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* WallFront;                                            // 0x08D8 (size: 0x8)

}; // Size: 0x8E0

#endif
