#ifndef UE4SS_SDK_BPTrenchEmpDestroyedT1_HPP
#define UE4SS_SDK_BPTrenchEmpDestroyedT1_HPP

class ABPTrenchEmpDestroyedT1_C : public ADestroyedFort
{
    class UTemplateComponent* TrenchEmpCommonSockets;                                 // 0x0830 (size: 0x8)
    class UTemplateComponent* BPTrenchEmpCommonDirtT1T2;                              // 0x0838 (size: 0x8)
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x0840 (size: 0x8)
    class UDecalComponent* FloorDecal;                                                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01Right;                  // 0x0850 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01Back;                   // 0x0858 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01Left;                   // 0x0860 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01FrontRight;             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01FrontLeft;              // 0x0870 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01Front;                  // 0x0878 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01BackRight;              // 0x0880 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT1Destroyed01BackLeft;               // 0x0888 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommon;                                        // 0x0890 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01;                                  // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
