#ifndef UE4SS_SDK_BPTrenchEmpCommonDirtT3_HPP
#define UE4SS_SDK_BPTrenchEmpCommonDirtT3_HPP

class ABPTrenchEmpCommonDirtT3_C : public ATemplate
{
    class UStaticMeshComponent* DirtCorner2;                                          // 0x0218 (size: 0x8)
    class UStaticMeshComponent* DirtCorner8;                                          // 0x0220 (size: 0x8)
    class UStaticMeshComponent* DirtCorner7;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* DirtCorner6;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* DirtCorner5;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* DirtCorner4;                                          // 0x0240 (size: 0x8)
    class UStaticMeshComponent* DirtCorner1;                                          // 0x0248 (size: 0x8)
    class UStaticMeshComponent* DirtCorner3;                                          // 0x0250 (size: 0x8)
    class UStaticMeshComponent* FrontLeft;                                            // 0x0258 (size: 0x8)
    class UStaticMeshComponent* BackLeft;                                             // 0x0260 (size: 0x8)
    class UStaticMeshComponent* FrontRight;                                           // 0x0268 (size: 0x8)
    class UStaticMeshComponent* BackRight;                                            // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Left;                                                 // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Back;                                                 // 0x0280 (size: 0x8)
    class UStaticMeshComponent* Right;                                                // 0x0288 (size: 0x8)
    class UStaticMeshComponent* Front;                                                // 0x0290 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0298 (size: 0x8)

}; // Size: 0x2A0

#endif
