#ifndef UE4SS_SDK_BPTrenchConnectorDestroyedT2_HPP
#define UE4SS_SDK_BPTrenchConnectorDestroyedT2_HPP

class ABPTrenchConnectorDestroyedT2_C : public AFortConnector
{
    class UTemplateComponent* TrenchConnectorDestroyedCommonT1T2;                     // 0x0820 (size: 0x8)
    class UTemplateComponent* TrenchConnectorCommon;                                  // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Destroyed;                                            // 0x0830 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0838 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0840 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0848 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0858 (size: 0x8)

}; // Size: 0x860

#endif
