#ifndef UE4SS_SDK_BPTrenchIntDestroyedT3_HPP
#define UE4SS_SDK_BPTrenchIntDestroyedT3_HPP

class ABPTrenchIntDestroyedT3_C : public AFort
{
    class UStaticMeshComponent* Floor;                                                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* WallFront;                                            // 0x0858 (size: 0x8)
    class UStaticMeshComponent* WallBack;                                             // 0x0860 (size: 0x8)
    class UStaticMeshComponent* WallLeft;                                             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* WallCornerBackRight;                                  // 0x0870 (size: 0x8)
    class UStaticMeshComponent* WallRight;                                            // 0x0878 (size: 0x8)
    class UStaticMeshComponent* WallCornerBackLeft;                                   // 0x0880 (size: 0x8)
    class UStaticMeshComponent* WallCornerFrontLeft;                                  // 0x0888 (size: 0x8)
    class UStaticMeshComponent* WallCornerFrontRight;                                 // 0x0890 (size: 0x8)
    class USceneComponent* Meshes;                                                    // 0x0898 (size: 0x8)
    class UDecalComponent* DecalLeft1;                                                // 0x08A0 (size: 0x8)
    class UDecalComponent* DecalBack1;                                                // 0x08A8 (size: 0x8)
    class UDecalComponent* DecalFront1;                                               // 0x08B0 (size: 0x8)
    class UDecalComponent* DecalRight1;                                               // 0x08B8 (size: 0x8)
    class USceneComponent* Decals;                                                    // 0x08C0 (size: 0x8)
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x08C8 (size: 0x8)
    class UTemplateComponent* TrenchCommonMods;                                       // 0x08D0 (size: 0x8)
    class UTemplateComponent* TrenchIntCommon;                                        // 0x08D8 (size: 0x8)

}; // Size: 0x8E0

#endif
