#ifndef UE4SS_SDK_BPTrenchT2_HPP
#define UE4SS_SDK_BPTrenchT2_HPP

class ABPTrenchT2_C : public AFort
{
    class UTemplateComponent* TrenchDirtDecals;                                       // 0x0830 (size: 0x8)
    class UTemplateComponent* TrenchCommonDirtT1T2;                                   // 0x0838 (size: 0x8)
    class UTemplateComponent* TrenchCommonMods;                                       // 0x0840 (size: 0x8)
    class UTemplateComponent* TrenchCommon;                                           // 0x0848 (size: 0x8)
    class UStaticMeshComponent* OpenWallRight;                                        // 0x0850 (size: 0x8)
    class UStaticMeshComponent* OpenWallLeft;                                         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* CornerFrontRight;                                     // 0x0860 (size: 0x8)
    class UStaticMeshComponent* CornerFrontLeft;                                      // 0x0868 (size: 0x8)
    class UStaticMeshComponent* CornerBackLeft;                                       // 0x0870 (size: 0x8)
    class UStaticMeshComponent* CornerBackRight;                                      // 0x0878 (size: 0x8)
    class UStaticMeshComponent* WallRight;                                            // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0888 (size: 0x8)
    class UStaticMeshComponent* WallLeft;                                             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* WallBack;                                             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* WallFront;                                            // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
