#ifndef UE4SS_SDK_BPTrenchIntBuildSite_HPP
#define UE4SS_SDK_BPTrenchIntBuildSite_HPP

class ABPTrenchIntBuildSite_C : public AFortBuildSiteBase
{
    class UBoxComponent* BuildsiteOverlapBlock;                                       // 0x07E0 (size: 0x8)
    class UBPTrenchBlockerBox_C* BPTrenchBlockerBox;                                  // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope02;                          // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope010;                         // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post04;                              // 0x0800 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope09;                          // 0x0808 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope08;                          // 0x0810 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post01;                              // 0x0818 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope07;                          // 0x0820 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post03;                              // 0x0828 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope06;                          // 0x0830 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02Post02;                              // 0x0838 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope05;                          // 0x0840 (size: 0x8)
    class UStaticMeshComponent* TrenchBuildsite02SideRope011;                         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Side04;                                               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Side03;                                               // 0x0858 (size: 0x8)
    class UTemplateComponent* TrenchIntCommonDirtT1T2;                                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* Side02;                                               // 0x0868 (size: 0x8)
    class UDecalComponent* BSDecal;                                                   // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Side01;                                               // 0x0878 (size: 0x8)
    class UBuildSocketComponent* FrontSocket;                                         // 0x0880 (size: 0x8)
    class UBuildSocketComponent* RightSocket;                                         // 0x0888 (size: 0x8)
    class UBuildSocketComponent* BackSocket;                                          // 0x0890 (size: 0x8)
    class UBuildSocketComponent* LeftSocket;                                          // 0x0898 (size: 0x8)
    class UBoxComponent* WorkBox;                                                     // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
