#ifndef UE4SS_SDK_BPTrenchEmpCommonMods_HPP
#define UE4SS_SDK_BPTrenchEmpCommonMods_HPP

class ABPTrenchEmpCommonMods_C : public ATemplate
{
    class UBPTrenchDefenseModSlot_C* BackRightDefenseModSlot;                         // 0x0218 (size: 0x8)
    class UBPTrenchUnderModSlot_C* UnderModSlot;                                      // 0x0220 (size: 0x8)
    class UBPTrenchDefenseModSlot_C* FrontRightDefenseModSlot;                        // 0x0228 (size: 0x8)
    class UBPTrenchDefenseModSlot_C* RightDefenseModSlot;                             // 0x0230 (size: 0x8)
    class UBPTrenchDefenseModSlot_C* LeftDefenseModSlot;                              // 0x0238 (size: 0x8)
    class UBPTrenchDefenseModSlot_C* BackDefenseModSlot;                              // 0x0240 (size: 0x8)
    class UBPTrenchDefenseModSlot_C* FrontLeftDefenseModSlot;                         // 0x0248 (size: 0x8)
    class UBPTrenchDefenseModSlot_C* BackLeftDefenseModSlot;                          // 0x0250 (size: 0x8)
    class UBPTrenchDefenseModSlot_C* FrontDefenseModSlot;                             // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
