#ifndef UE4SS_SDK_BPTrenchDestroyedT2_HPP
#define UE4SS_SDK_BPTrenchDestroyedT2_HPP

class ABPTrenchDestroyedT2_C : public AFort
{
    class UTemplateComponent* TrenchCommonDirtT1T2;                                   // 0x0850 (size: 0x8)
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0858 (size: 0x8)
    class UStaticMeshComponent* TrenchT2Destroyed01Left;                              // 0x0860 (size: 0x8)
    class UStaticMeshComponent* TrenchT2Destroyed01RIght;                             // 0x0868 (size: 0x8)
    class UStaticMeshComponent* TrenchT2Destroyed01OpenRIght;                         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* TrenchT2Destroyed01OpenLeft;                          // 0x0878 (size: 0x8)
    class UStaticMeshComponent* TrenchT2Destroyed01a;                                 // 0x0880 (size: 0x8)
    class UStaticMeshComponent* TrenchT2Destroyed01b;                                 // 0x0888 (size: 0x8)
    class UTemplateComponent* TrenchCommon;                                           // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0898 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x08A0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x08A8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x08B0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
