#ifndef UE4SS_SDK_BPTrenchEmpDestroyedT2_HPP
#define UE4SS_SDK_BPTrenchEmpDestroyedT2_HPP

class ABPTrenchEmpDestroyedT2_C : public ADestroyedFort
{
    class UTemplateComponent* BPTrenchEmpCommonDirtT1T2;                              // 0x0820 (size: 0x8)
    class UDecalComponent* DecalFloor1;                                               // 0x0828 (size: 0x8)
    class UDecalComponent* DecalFloor;                                                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedBack;                     // 0x0838 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedRight;                    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedLeft;                     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedFrontRight;               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedFrontLeft;                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedBackLeft;                 // 0x0860 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommon;                                        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01;                                  // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0878 (size: 0x8)

}; // Size: 0x880

#endif
