#ifndef UE4SS_SDK_BPTrenchEmpT2_HPP
#define UE4SS_SDK_BPTrenchEmpT2_HPP

class ABPTrenchEmpT2_C : public AFort
{
    class UTemplateComponent* TrenchEmpCommonDirt;                                    // 0x07F0 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommonMods;                                    // 0x07F8 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommon;                                        // 0x0800 (size: 0x8)
    class UStaticMeshComponent* BackCornerL;                                          // 0x0808 (size: 0x8)
    class UStaticMeshComponent* RightCornerR;                                         // 0x0810 (size: 0x8)
    class UStaticMeshComponent* RightCornerL;                                         // 0x0818 (size: 0x8)
    class UStaticMeshComponent* FrontCornerR;                                         // 0x0820 (size: 0x8)
    class UStaticMeshComponent* FrontCornerL;                                         // 0x0828 (size: 0x8)
    class UStaticMeshComponent* LeftCornerR;                                          // 0x0830 (size: 0x8)
    class UStaticMeshComponent* LeftCornerL;                                          // 0x0838 (size: 0x8)
    class UStaticMeshComponent* BackCornerR;                                          // 0x0840 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Front;                                                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* FrontLeft;                                            // 0x0858 (size: 0x8)
    class UStaticMeshComponent* BackLeft;                                             // 0x0860 (size: 0x8)
    class UStaticMeshComponent* FrontRight;                                           // 0x0868 (size: 0x8)
    class UStaticMeshComponent* BackRight;                                            // 0x0870 (size: 0x8)
    class UStaticMeshComponent* Left;                                                 // 0x0878 (size: 0x8)
    class UStaticMeshComponent* Back;                                                 // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Right;                                                // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
