#ifndef UE4SS_SDK_BPTrenchEmpDestroyedT2_HPP
#define UE4SS_SDK_BPTrenchEmpDestroyedT2_HPP

class ABPTrenchEmpDestroyedT2_C : public AFort
{
    class UDecalComponent* DecalFloor1;                                               // 0x0800 (size: 0x8)
    class UDecalComponent* DecalFloor;                                                // 0x0808 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedBack;                     // 0x0810 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedRight;                    // 0x0818 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedLeft;                     // 0x0820 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedFrontRight;               // 0x0828 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedFrontLeft;                // 0x0830 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT2DestroyedBackLeft;                 // 0x0838 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommon;                                        // 0x0840 (size: 0x8)
    class UStaticMeshComponent* TrenchT1Destroyed01;                                  // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0850 (size: 0x8)
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0858 (size: 0x8)
    class UStaticMeshComponent* DirtBackCornerL;                                      // 0x0860 (size: 0x8)
    class UStaticMeshComponent* DirtRightCornerR;                                     // 0x0868 (size: 0x8)
    class UStaticMeshComponent* DirtRightCornerL;                                     // 0x0870 (size: 0x8)
    class UStaticMeshComponent* DirtFrontCornerR;                                     // 0x0878 (size: 0x8)
    class UStaticMeshComponent* DirtFrontCornerL;                                     // 0x0880 (size: 0x8)
    class UStaticMeshComponent* DirtLeftCornerR;                                      // 0x0888 (size: 0x8)
    class UStaticMeshComponent* DirtLeftCornerL;                                      // 0x0890 (size: 0x8)
    class UStaticMeshComponent* DirtBackCornerR;                                      // 0x0898 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* DirtFrontRight;                                       // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x08D0 (size: 0x8)

}; // Size: 0x8D8

#endif
