#ifndef UE4SS_SDK_BPTrenchIntDestroyedT2_HPP
#define UE4SS_SDK_BPTrenchIntDestroyedT2_HPP

class ABPTrenchIntDestroyedT2_C : public AFort
{
    class UDecalComponent* DecalLeft1;                                                // 0x0820 (size: 0x8)
    class UDecalComponent* DecalBack1;                                                // 0x0828 (size: 0x8)
    class UDecalComponent* DecalFront1;                                               // 0x0830 (size: 0x8)
    class UDecalComponent* DecalRight1;                                               // 0x0838 (size: 0x8)
    class USceneComponent* Decals;                                                    // 0x0840 (size: 0x8)
    class UStaticMeshComponent* WallFrontLeftCorner01;                                // 0x0848 (size: 0x8)
    class UStaticMeshComponent* WallFrontRightCorner01;                               // 0x0850 (size: 0x8)
    class UStaticMeshComponent* WallBackRightCorner01;                                // 0x0858 (size: 0x8)
    class UStaticMeshComponent* WallBackRightCorner02;                                // 0x0860 (size: 0x8)
    class UStaticMeshComponent* WallBackLeftCorner02;                                 // 0x0868 (size: 0x8)
    class UStaticMeshComponent* WallBackLeftCorner01;                                 // 0x0870 (size: 0x8)
    class UStaticMeshComponent* WallFrontRightCorner02;                               // 0x0878 (size: 0x8)
    class UStaticMeshComponent* WallFrontLeftCorner02;                                // 0x0880 (size: 0x8)
    class USceneComponent* Scene;                                                     // 0x0888 (size: 0x8)
    class UTemplateComponent* TrenchIntCommonDirtT1T2;                                // 0x0890 (size: 0x8)
    class UBPStructurePuddleMesh_C* BPStructurePuddleMesh;                            // 0x0898 (size: 0x8)
    class UTemplateComponent* TrenchCommonMods;                                       // 0x08A0 (size: 0x8)
    class UTemplateComponent* TrenchIntCommon;                                        // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* WallRight;                                            // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* WallLeft;                                             // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* WallBack;                                             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* WallFront;                                            // 0x08D0 (size: 0x8)

}; // Size: 0x8D8

#endif
