#ifndef UE4SS_SDK_BPTrenchEmpDestroyedT3_HPP
#define UE4SS_SDK_BPTrenchEmpDestroyedT3_HPP

class ABPTrenchEmpDestroyedT3_C : public ADestroyedFort
{
    class UStaticMeshComponent* DirtCorner1;                                          // 0x0820 (size: 0x8)
    class UStaticMeshComponent* DirtCorner2;                                          // 0x0828 (size: 0x8)
    class UStaticMeshComponent* DirtCorner8;                                          // 0x0830 (size: 0x8)
    class UStaticMeshComponent* DirtCorner7;                                          // 0x0838 (size: 0x8)
    class UStaticMeshComponent* DirtCorner6;                                          // 0x0840 (size: 0x8)
    class UStaticMeshComponent* DirtCorner5;                                          // 0x0848 (size: 0x8)
    class UStaticMeshComponent* DirtCorner3;                                          // 0x0850 (size: 0x8)
    class UStaticMeshComponent* DirtCorner4;                                          // 0x0858 (size: 0x8)
    class UStaticMeshComponent* TrenchEmplacementT3Destroyed01;                       // 0x0860 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommon;                                        // 0x0868 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0878 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x0880 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0888 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0898 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* DirtFrontRight;                                       // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x08B0 (size: 0x8)

}; // Size: 0x8B8

#endif
