#ifndef UE4SS_SDK_BPTrenchT3Roof_HPP
#define UE4SS_SDK_BPTrenchT3Roof_HPP

class ABPTrenchT3Roof_C : public AModificationTemplate
{
    class UStaticMeshComponent* TrenchT3RoofLongRightOpenTrim;                        // 0x0218 (size: 0x8)
    class UStaticMeshComponent* TrenchT3RoofLongLeftOpenTrim;                         // 0x0220 (size: 0x8)
    class UStaticMeshComponent* TrenchT3RoofLongLeftTrim;                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* TrenchT3RoofLongRightTrim;                            // 0x0230 (size: 0x8)
    class UStaticMeshComponent* RoofLeftOpen;                                         // 0x0238 (size: 0x8)
    class UStaticMeshComponent* RoofLeft;                                             // 0x0240 (size: 0x8)
    class UStaticMeshComponent* RoofRightOpen;                                        // 0x0248 (size: 0x8)
    class UStaticMeshComponent* RoofRight;                                            // 0x0250 (size: 0x8)
    class UStaticMeshComponent* RoofEndBack;                                          // 0x0258 (size: 0x8)
    class UStaticMeshComponent* EndFront;                                             // 0x0260 (size: 0x8)
    class UStaticMeshComponent* EndBack;                                              // 0x0268 (size: 0x8)
    class UStaticMeshComponent* RoofEndFront;                                         // 0x0270 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0278 (size: 0x8)

}; // Size: 0x280

#endif
