#ifndef UE4SS_SDK_BPTrenchEmpCommonDirt_HPP
#define UE4SS_SDK_BPTrenchEmpCommonDirt_HPP

class ABPTrenchEmpCommonDirt_C : public ATemplate
{
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0218 (size: 0x8)
    class UStaticMeshComponent* DirtBackCornerL;                                      // 0x0220 (size: 0x8)
    class UStaticMeshComponent* DirtRightCornerR;                                     // 0x0228 (size: 0x8)
    class UStaticMeshComponent* DirtRightCornerL;                                     // 0x0230 (size: 0x8)
    class UStaticMeshComponent* DirtFrontCornerR;                                     // 0x0238 (size: 0x8)
    class UStaticMeshComponent* DirtFrontCornerL;                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* DirtLeftCornerR;                                      // 0x0248 (size: 0x8)
    class UStaticMeshComponent* DirtLeftCornerL;                                      // 0x0250 (size: 0x8)
    class UStaticMeshComponent* DirtBackCornerR;                                      // 0x0258 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x0260 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x0268 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0270 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0278 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x0280 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x0288 (size: 0x8)
    class UStaticMeshComponent* DirtFrontRight;                                       // 0x0290 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0298 (size: 0x8)

}; // Size: 0x2A0

#endif
