#ifndef UE4SS_SDK_BPTrainBridgeC_HPP
#define UE4SS_SDK_BPTrainBridgeC_HPP

class ABPTrainBridgeC_C : public ADrawbridge
{
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh1;                    // 0x08A0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* SideBColumn;                                          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* SideAColumn;                                          // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* TrimMesh2;                                            // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* TrimMesh1;                                            // 0x08C8 (size: 0x8)
    class UBoxComponent* BelowBlockingA;                                              // 0x08D0 (size: 0x8)
    class UBoxComponent* BelowBlockingB;                                              // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* TrainBridgeSectionSideA;                              // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* TrainBridgeSectionSideB;                              // 0x08E8 (size: 0x8)
    class UMultiplexedSkeletalMeshComponent* MultiplexedSkeletalMesh;                 // 0x08F0 (size: 0x8)

}; // Size: 0x8F8

#endif
