#ifndef UE4SS_SDK_BPTrenchConnectorDestroyedCommonT1T2_HPP
#define UE4SS_SDK_BPTrenchConnectorDestroyedCommonT1T2_HPP

class ABPTrenchConnectorDestroyedCommonT1T2_C : public ATemplate
{
    class USceneComponent* DirtSplineRightTarget;                                     // 0x0218 (size: 0x8)
    class USceneComponent* DirtSplineLeftTarget;                                      // 0x0220 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x0228 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x0230 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x0238 (size: 0x8)
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0240 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x0248 (size: 0x8)
    class UStaticMeshComponent* DirtFrontRight;                                       // 0x0250 (size: 0x8)
    class USplineConnectorComponent* DirtSplineLeft;                                  // 0x0258 (size: 0x8)
    class USplineConnectorComponent* DirtSplineRight;                                 // 0x0260 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0268 (size: 0x8)

}; // Size: 0x270

#endif
