#ifndef UE4SS_SDK_BPTrenchEmpBuildSite_HPP
#define UE4SS_SDK_BPTrenchEmpBuildSite_HPP

class ABPTrenchEmpBuildSite_C : public AFortBuildSiteBase
{
    class UTemplateComponent* TrenchEmpCommonSockets;                                 // 0x07E0 (size: 0x8)
    class UBoxComponent* BuildsiteOverlapBlock3;                                      // 0x07E8 (size: 0x8)
    class UBoxComponent* BuildsiteOverlapBlock2;                                      // 0x07F0 (size: 0x8)
    class UBoxComponent* BuildsiteOverlapBlock1;                                      // 0x07F8 (size: 0x8)
    class UBoxComponent* BuildsiteOverlapBlock;                                       // 0x0800 (size: 0x8)
    class UTemplateComponent* TrenchEmpCommonDirtT1T2;                                // 0x0808 (size: 0x8)
    class UBPTrenchBlockerCapsule_C* BPTrenchBlockerCapsule;                          // 0x0810 (size: 0x8)
    class UStaticMeshComponent* BackLeft;                                             // 0x0818 (size: 0x8)
    class UStaticMeshComponent* FrontRight;                                           // 0x0820 (size: 0x8)
    class UStaticMeshComponent* BackRight;                                            // 0x0828 (size: 0x8)
    class UStaticMeshComponent* Left;                                                 // 0x0830 (size: 0x8)
    class UStaticMeshComponent* Back;                                                 // 0x0838 (size: 0x8)
    class UStaticMeshComponent* Front;                                                // 0x0840 (size: 0x8)
    class UStaticMeshComponent* FrontLeft;                                            // 0x0848 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0850 (size: 0x8)
    class UStaticMeshComponent* Right;                                                // 0x0858 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0860 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0868 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0870 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0878 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0880 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0888 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0890 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0898 (size: 0x8)
    class UBoxComponent* WorkBox;                                                     // 0x08A0 (size: 0x8)

}; // Size: 0x8A8

#endif
