#ifndef UE4SS_SDK_BPTrenchEmpBuildGhost_HPP
#define UE4SS_SDK_BPTrenchEmpBuildGhost_HPP

class ABPTrenchEmpBuildGhost_C : public ABuildGhost
{
    class UTemplateComponent* TrenchEmpCommonSockets;                                 // 0x0580 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BuildFootprint135;                         // 0x0588 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BuildFootprint45;                          // 0x0590 (size: 0x8)
    class UBPBuildFootprintBoxComponent_C* BuildFootprint90;                          // 0x0598 (size: 0x8)
    class UStaticMeshComponent* FrontLeft;                                            // 0x05A0 (size: 0x8)
    class UStaticMeshComponent* BackLeft;                                             // 0x05A8 (size: 0x8)
    class UStaticMeshComponent* FrontRight;                                           // 0x05B0 (size: 0x8)
    class UStaticMeshComponent* BackRight;                                            // 0x05B8 (size: 0x8)
    class UStaticMeshComponent* Left;                                                 // 0x05C0 (size: 0x8)
    class UStaticMeshComponent* Back;                                                 // 0x05C8 (size: 0x8)
    class UStaticMeshComponent* Front;                                                // 0x05D0 (size: 0x8)
    class UStaticMeshComponent* Right;                                                // 0x05D8 (size: 0x8)

}; // Size: 0x5E0

#endif
