#ifndef UE4SS_SDK_BPTrenchDestroyedT3_HPP
#define UE4SS_SDK_BPTrenchDestroyedT3_HPP

class ABPTrenchDestroyedT3_C : public AFort
{
    class ULocationMultiplexedMeshComponent* LocationMultiplexedMesh;                 // 0x0850 (size: 0x8)
    class UTemplateComponent* TrenchCommon;                                           // 0x0858 (size: 0x8)
    class UStaticMeshComponent* DirtOpenRight;                                        // 0x0860 (size: 0x8)
    class UStaticMeshComponent* DirtOpenLeft;                                         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* Floor;                                                // 0x0870 (size: 0x8)
    class UStaticMeshComponent* DirtFrontRight;                                       // 0x0878 (size: 0x8)
    class UStaticMeshComponent* DirtFrontLeft;                                        // 0x0880 (size: 0x8)
    class UStaticMeshComponent* DirtBackLeft;                                         // 0x0888 (size: 0x8)
    class UStaticMeshComponent* DirtRight;                                            // 0x0890 (size: 0x8)
    class UStaticMeshComponent* DirtBackRight;                                        // 0x0898 (size: 0x8)
    class UStaticMeshComponent* DirtFront;                                            // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* DirtBack;                                             // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* DirtLeft;                                             // 0x08B0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x08B8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x08C0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x08C8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x08D0 (size: 0x8)

}; // Size: 0x8D8

#endif
