#ifndef UE4SS_SDK_BPVehicleFactory_HPP
#define UE4SS_SDK_BPVehicleFactory_HPP

class ABPVehicleFactory_C : public AVehicleFactory
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0800 (size: 0x8)
    class UTemperatureModifierBoxComponent* TemperatureModifierBox;                   // 0x0808 (size: 0x8)
    class UVisibilityToggleAreaComponent* VisibilityToggleArea;                       // 0x0810 (size: 0x8)
    class UStaticMeshComponent* Flag;                                                 // 0x0818 (size: 0x8)
    class UPointLightComponent* PointLight1;                                          // 0x0820 (size: 0x8)
    class UStaticMeshComponent* Lantern2;                                             // 0x0828 (size: 0x8)
    class UPointLightComponent* PointLight;                                           // 0x0830 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x0838 (size: 0x8)
    class UStaticMeshComponent* IntLamp2;                                             // 0x0840 (size: 0x8)
    class UStaticMeshComponent* IntLamp1;                                             // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Lantern;                                              // 0x0850 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedStaticMesh;                     // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMesh56;                                         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMesh55;                                         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh53;                                         // 0x0870 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem6;                                  // 0x0878 (size: 0x8)
    class UBoxComponent* Collision08;                                                 // 0x0880 (size: 0x8)
    class UBoxComponent* Collision07;                                                 // 0x0888 (size: 0x8)
    class UBoxComponent* Collision06;                                                 // 0x0890 (size: 0x8)
    class UBoxComponent* Collision05;                                                 // 0x0898 (size: 0x8)
    class UBoxComponent* Collision04;                                                 // 0x08A0 (size: 0x8)
    class UBoxComponent* Collision03;                                                 // 0x08A8 (size: 0x8)
    class UBoxComponent* Collision02;                                                 // 0x08B0 (size: 0x8)
    class UBoxComponent* Collision01;                                                 // 0x08B8 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x08C0 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x08C8 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh52;                                         // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh51;                                         // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh50;                                         // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh49;                                         // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh48;                                         // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh47;                                         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMesh46;                                         // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMesh45;                                         // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMesh44;                                         // 0x0918 (size: 0x8)
    class UStaticMeshComponent* StaticMesh43;                                         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* StaticMesh42;                                         // 0x0928 (size: 0x8)
    class UStaticMeshComponent* StaticMesh41;                                         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x0938 (size: 0x8)
    class UStaticMeshComponent* StaticMesh39;                                         // 0x0940 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0948 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0950 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem5;                                  // 0x0958 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem4;                                  // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0970 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem3;                                  // 0x0978 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x0980 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* SM_Tire_02;                                           // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* SledgeHammer;                                         // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Toolbox;                                              // 0x0A00 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem2;                                  // 0x0A08 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x0A10 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0A18 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0A20 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0A28 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0A30 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0A38 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0A40 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0A48 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0A68 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0A70 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0A78 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0AD8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateTop;                                       // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0B30 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0B38 (size: 0x8)
    class UStaticMeshComponent* FactoryRoof;                                          // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* Factory;                                              // 0x0B48 (size: 0x8)

    void Deprecated();
    void BPSetTeamVisuals(const int32 VisualTeamId);
    void ExecuteUbergraph_BPVehicleFactory(int32 EntryPoint);
}; // Size: 0xB50

#endif
