#ifndef UE4SS_SDK_FortGarrisionLockers01_HPP
#define UE4SS_SDK_FortGarrisionLockers01_HPP

class AFortGarrisionLockers01_C : public AModificationTemplate
{
    class USpotLightComponent* SpotLight;                                             // 0x0218 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0220 (size: 0x8)
    class UStaticMeshComponent* Blanket09;                                            // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Blanket06;                                            // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Shelf;                                                // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Blanket05;                                            // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Blanket04;                                            // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Blanket03;                                            // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Blanket02;                                            // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Blanket01;                                            // 0x0260 (size: 0x8)
    class UStaticMeshComponent* Locker03;                                             // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Locker02;                                             // 0x0270 (size: 0x8)
    class UStaticMeshComponent* Locker01;                                             // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Locker04;                                             // 0x0280 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0288 (size: 0x8)

}; // Size: 0x290

#endif
