#ifndef UE4SS_SDK_FortSupportWallPipes01_HPP
#define UE4SS_SDK_FortSupportWallPipes01_HPP

class AFortSupportWallPipes01_C : public AModificationTemplate
{
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0218 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0220 (size: 0x8)
    class UStaticMeshComponent* Pipes_09;                                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0240 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0248 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0250 (size: 0x8)

}; // Size: 0x258

#endif
