#ifndef UE4SS_SDK_FortSupportAltarW_HPP
#define UE4SS_SDK_FortSupportAltarW_HPP

class AFortSupportAltarW_C : public AModificationTemplate
{
    class UStaticMeshComponent* StaticMesh;                                           // 0x0218 (size: 0x8)
    class UStaticMeshComponent* SunflowerPickup01;                                    // 0x0220 (size: 0x8)
    class UStaticMeshComponent* Books_03;                                             // 0x0228 (size: 0x8)
    class USkeletalMeshComponent* HelmetF_MetalWarden;                                // 0x0230 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FortIModAltarW;                                       // 0x0240 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0248 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0250 (size: 0x8)

}; // Size: 0x258

#endif
