#ifndef UE4SS_SDK_FortGarrisionCardTableW_HPP
#define UE4SS_SDK_FortGarrisionCardTableW_HPP

class AFortGarrisionCardTableW_C : public AModificationTemplate
{
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0218 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0220 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Card05;                                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Card031;                                              // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Card07;                                               // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Card03;                                               // 0x0258 (size: 0x8)
    class UStaticMeshComponent* Card04;                                               // 0x0260 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0268 (size: 0x8)
    class UStaticMeshComponent* Chair04;                                              // 0x0270 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0278 (size: 0x8)
    class UStaticMeshComponent* Barchair01;                                           // 0x0280 (size: 0x8)
    class UStaticMeshComponent* Candles1;                                             // 0x0288 (size: 0x8)
    class UStaticMeshComponent* FortIModCardTableW;                                   // 0x0290 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0298 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

#endif
