#ifndef UE4SS_SDK_FortCommandStrategyGameC_HPP
#define UE4SS_SDK_FortCommandStrategyGameC_HPP

class AFortCommandStrategyGameC_C : public AModificationTemplate
{
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0218 (size: 0x8)
    class UStaticMeshComponent* Bottle01;                                             // 0x0220 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Apple02;                                              // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Cans_03;                                              // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Candles1;                                             // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Barstool01;                                           // 0x0248 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom02;                                  // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Chair_02;                                             // 0x0258 (size: 0x8)
    class UStaticMeshComponent* FortIModStrategyGameC;                                // 0x0260 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0268 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0270 (size: 0x8)

}; // Size: 0x278

#endif
