#ifndef UE4SS_SDK_FortGarrisionPantry02_HPP
#define UE4SS_SDK_FortGarrisionPantry02_HPP

class AFortGarrisionPantry02_C : public AModificationTemplate
{
    class USpotLightComponent* SpotLight;                                             // 0x0218 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0220 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0228 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0230 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0238 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0240 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0248 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0250 (size: 0x8)
    class UStaticMeshComponent* Locker04;                                             // 0x0258 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0260 (size: 0x8)

}; // Size: 0x268

#endif
