#ifndef UE4SS_SDK_FortSupportSparringRingC_HPP
#define UE4SS_SDK_FortSupportSparringRingC_HPP

class AFortSupportSparringRingC_C : public AModificationTemplate
{
    class UStaticMeshComponent* Barchair01;                                           // 0x0218 (size: 0x8)
    class UStaticMeshComponent* Barstool01;                                           // 0x0220 (size: 0x8)
    class UStaticMeshComponent* Bottle01;                                             // 0x0228 (size: 0x8)
    class UStaticMeshComponent* Bottle04;                                             // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Rope01;                                               // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Rope02;                                               // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Bucket;                                               // 0x0248 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0250 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0258 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0260 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0268 (size: 0x8)
    class UStaticMeshComponent* FortIModSparringRing;                                 // 0x0270 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0278 (size: 0x8)

}; // Size: 0x280

#endif
