#ifndef UE4SS_SDK_FortGarrisionInstrumentsW_HPP
#define UE4SS_SDK_FortGarrisionInstrumentsW_HPP

class AFortGarrisionInstrumentsW_C : public AModificationTemplate
{
    class UStaticMeshComponent* Barstool01;                                           // 0x0218 (size: 0x8)
    class UStaticMeshComponent* Barchair01;                                           // 0x0220 (size: 0x8)
    class UStaticMeshComponent* Guitar;                                               // 0x0228 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0230 (size: 0x8)
    class UStaticMeshComponent* Lantern;                                              // 0x0238 (size: 0x8)
    class UStaticMeshComponent* Trumpet;                                              // 0x0240 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0248 (size: 0x8)
    class UStaticMeshComponent* Locker01;                                             // 0x0250 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0258 (size: 0x8)

}; // Size: 0x260

#endif
