#ifndef UE4SS_SDK_FortGarrisionDishwashStation01_HPP
#define UE4SS_SDK_FortGarrisionDishwashStation01_HPP

class AFortGarrisionDishwashStation01_C : public AModificationTemplate
{
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0218 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0220 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0228 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0230 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0238 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0240 (size: 0x8)
    class UStaticMeshComponent* Locker04;                                             // 0x0248 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0250 (size: 0x8)

}; // Size: 0x258

#endif
