#ifndef UE4SS_SDK_FortCommandPropagandaPosterW_HPP
#define UE4SS_SDK_FortCommandPropagandaPosterW_HPP

class AFortCommandPropagandaPosterW_C : public AModificationTemplate
{
    class UStaticMeshComponent* PropagandaPosterWarV3;                                // 0x0218 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterWarV7;                                // 0x0220 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterWarV5;                                // 0x0228 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterWarV2;                                // 0x0230 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterWarV9;                                // 0x0238 (size: 0x8)
    class UStaticMeshComponent* FortIModPropagandaPosterW;                            // 0x0240 (size: 0x8)
    class UBoxComponent* Collision;                                                   // 0x0248 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0250 (size: 0x8)

}; // Size: 0x258

#endif
