#ifndef UE4SS_SDK_TownWMedAttachedG1Destroyed_HPP
#define UE4SS_SDK_TownWMedAttachedG1Destroyed_HPP

class ATownWMedAttachedG1Destroyed_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh21;                                         // 0x0600 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh14;                                         // 0x0608 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh13;                                         // 0x0610 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh12;                                         // 0x0618 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh11;                                         // 0x0620 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh10;                                         // 0x0628 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0630 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh20;                                         // 0x0638 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh8;                                          // 0x0640 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh7;                                          // 0x0648 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh19;                                         // 0x0650 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh18;                                         // 0x0658 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh9;                                          // 0x0660 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh17;                                         // 0x0668 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0670 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh15;                                         // 0x0678 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh6;                                          // 0x0680 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh5;                                          // 0x0688 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh4;                                          // 0x0690 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x0698 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x06A0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh16;                                         // 0x06A8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x06B0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x06C8 (size: 0x8)

}; // Size: 0x6D0

#endif
