#ifndef UE4SS_SDK_TownCMedGarrisonG2_HPP
#define UE4SS_SDK_TownCMedGarrisonG2_HPP

class ATownCMedGarrisonG2_C : public AGarrisonHouse
{
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0888 (size: 0x8)
    class UDecalComponent* Decal46;                                                   // 0x0890 (size: 0x8)
    class UDecalComponent* Decal45;                                                   // 0x0898 (size: 0x8)
    class UDecalComponent* Decal44;                                                   // 0x08A0 (size: 0x8)
    class UDecalComponent* Decal43;                                                   // 0x08A8 (size: 0x8)
    class UDecalComponent* Decal42;                                                   // 0x08B0 (size: 0x8)
    class UDecalComponent* Decal41;                                                   // 0x08B8 (size: 0x8)
    class UDecalComponent* Decal40;                                                   // 0x08C0 (size: 0x8)
    class UDecalComponent* Decal39;                                                   // 0x08C8 (size: 0x8)
    class UDecalComponent* Decal38;                                                   // 0x08D0 (size: 0x8)
    class UDecalComponent* Decal37;                                                   // 0x08D8 (size: 0x8)
    class UDecalComponent* Decal36;                                                   // 0x08E0 (size: 0x8)
    class UDecalComponent* Decal35;                                                   // 0x08E8 (size: 0x8)
    class UDecalComponent* Decal34;                                                   // 0x08F0 (size: 0x8)
    class UDecalComponent* Decal33;                                                   // 0x08F8 (size: 0x8)
    class UDecalComponent* Decal32;                                                   // 0x0900 (size: 0x8)
    class UDecalComponent* Decal31;                                                   // 0x0908 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterColV2;                                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterColV1;                                // 0x0918 (size: 0x8)
    class UDecalComponent* Decal30;                                                   // 0x0920 (size: 0x8)
    class UDecalComponent* Decal29;                                                   // 0x0928 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x0930 (size: 0x8)
    class UDecalComponent* Decal28;                                                   // 0x0938 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x0940 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x0948 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x0950 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x0958 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x0960 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x0968 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x0970 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x0978 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x0980 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x0988 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x0990 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x0998 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x09A0 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x09A8 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* Ivy32;                                                // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* Ivy31;                                                // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* Ivy30;                                                // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* Ivy29;                                                // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* Ivy28;                                                // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Ivy27;                                                // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* Ivy26;                                                // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* Ivy25;                                                // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* Ivy24;                                                // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* Ivy23;                                                // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* Ivy21;                                                // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* Ivy20;                                                // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* Ivy19;                                                // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* Ivy18;                                                // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* Ivy17;                                                // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* Ivy16;                                                // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* Ivy15;                                                // 0x0A48 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0A68 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0A70 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0A78 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* Window4;                                              // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* Window3;                                              // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x0AA0 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0AA8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0AB0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0AB8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0AC0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Back;                             // 0x0AC8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x0AD0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Front;                            // 0x0AD8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x0AE0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0AE8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0AF0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0AF8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0B10 (size: 0x8)

}; // Size: 0xB18

#endif
