#ifndef UE4SS_SDK_TownCMedGarrisonG2Destroyed_HPP
#define UE4SS_SDK_TownCMedGarrisonG2Destroyed_HPP

class ATownCMedGarrisonG2Destroyed_C : public ADestroyedGarrisonHouse
{
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0628 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0630 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0638 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0640 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0648 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0650 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0688 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0690 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0698 (size: 0x8)

}; // Size: 0x6A0

#endif
