#ifndef UE4SS_SDK_TownWSmall1_HPP
#define UE4SS_SDK_TownWSmall1_HPP

class ATownWSmall1_C : public AEmplacementHouse
{
    class UStructureSeatComponent* OccupiableComponent;                               // 0x0890 (size: 0x8)
    class UBoxComponent* NoBuild;                                                     // 0x0898 (size: 0x8)
    class UStaticMeshComponent* UnbuiltMesh;                                          // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* sandbag04;                                            // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0918 (size: 0x8)
    class UStaticMeshComponent* sandbag01;                                            // 0x0920 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0928 (size: 0x8)
    class UStaticMeshComponent* TownWSmall1;                                          // 0x0930 (size: 0x8)

}; // Size: 0x938

#endif
