#ifndef UE4SS_SDK_TownCSmallG1_HPP
#define UE4SS_SDK_TownCSmallG1_HPP

class ATownCSmallG1_C : public AGarrisonHouse
{
    class UDecalComponent* Decal5;                                                    // 0x0830 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0838 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0840 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x0850 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0858 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x0860 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0868 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x0870 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x0878 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0880 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
