#ifndef UE4SS_SDK_TownCLargeGarrisonGS1_HPP
#define UE4SS_SDK_TownCLargeGarrisonGS1_HPP

class ATownCLargeGarrisonGS1_C : public AGarrisonStation
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x08E0 (size: 0x8)
    class USpawnPointComponent* Spawn5;                                               // 0x08E8 (size: 0x8)
    class USpawnPointComponent* Spawn4;                                               // 0x08F0 (size: 0x8)
    class USpawnPointComponent* Spawn3;                                               // 0x08F8 (size: 0x8)
    class USpawnPointComponent* Spawn2;                                               // 0x0900 (size: 0x8)
    class USpawnPointComponent* Spawn1;                                               // 0x0908 (size: 0x8)
    class USpawnPointComponent* Spawn0;                                               // 0x0910 (size: 0x8)
    class UStaticMeshComponent* RadioStationMesh1;                                    // 0x0918 (size: 0x8)
    class UStaticMeshComponent* ArtilleryShelterMesh;                                 // 0x0920 (size: 0x8)
    class UStaticMeshComponent* GarrisonStationBase;                                  // 0x0928 (size: 0x8)
    class UStaticMeshComponent* OperatingPostMesh;                                    // 0x0930 (size: 0x8)
    class UStaticMeshComponent* RadioStationMesh;                                     // 0x0938 (size: 0x8)
    class UDecalComponent* Decal32;                                                   // 0x0940 (size: 0x8)
    class UDecalComponent* Decal31;                                                   // 0x0948 (size: 0x8)
    class UDecalComponent* Decal30;                                                   // 0x0950 (size: 0x8)
    class UDecalComponent* Decal29;                                                   // 0x0958 (size: 0x8)
    class UDecalComponent* Decal28;                                                   // 0x0960 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x0968 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x0970 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0978 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x0980 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x0988 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x0990 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x0998 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x09A0 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x09A8 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x09B0 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x09B8 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x09C0 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x09C8 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x09D0 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x09D8 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x09E0 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x09E8 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x09F0 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x09F8 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0A00 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0A08 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0A10 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0A18 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0A20 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* Window4;                                              // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* Window3;                                              // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x0A48 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0A68 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Back;                             // 0x0A70 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x0A78 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Front;                            // 0x0A80 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x0A88 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0A90 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0A98 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0AA0 (size: 0x8)
    class UBPBicycleSpawnLocationComponent_C* BPBicycleSpawnLocationComponent;        // 0x0AA8 (size: 0x8)
    class UCameraComponent* ViewTargetCamera;                                         // 0x0AB0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0AC0 (size: 0x8)
    class UBoxComponent* ArtilleryShelterWeakPoint;                                   // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0AD0 (size: 0x8)

    void ReceiveBeginPlay();
    void OnResearched(const class UTechTreeComponent* TechTreeComponent, const ETechComponentID TechID);
    void ExecuteUbergraph_TownCLargeGarrisonGS1(int32 EntryPoint);
}; // Size: 0xAD8

#endif
