#ifndef UE4SS_SDK_TownCMedGarrisonG1_HPP
#define UE4SS_SDK_TownCMedGarrisonG1_HPP

class ATownCMedGarrisonG1_C : public AGarrisonHouse
{
    class UDecalComponent* Decal38;                                                   // 0x0870 (size: 0x8)
    class UDecalComponent* Decal37;                                                   // 0x0878 (size: 0x8)
    class UDecalComponent* Decal36;                                                   // 0x0880 (size: 0x8)
    class UDecalComponent* Decal35;                                                   // 0x0888 (size: 0x8)
    class UDecalComponent* Decal34;                                                   // 0x0890 (size: 0x8)
    class UDecalComponent* Decal33;                                                   // 0x0898 (size: 0x8)
    class UDecalComponent* Decal32;                                                   // 0x08A0 (size: 0x8)
    class UDecalComponent* Decal31;                                                   // 0x08A8 (size: 0x8)
    class UDecalComponent* Decal30;                                                   // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x08B8 (size: 0x8)
    class UDecalComponent* Decal29;                                                   // 0x08C0 (size: 0x8)
    class UDecalComponent* Decal28;                                                   // 0x08C8 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x08D0 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x08D8 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x08E0 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x08E8 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x08F0 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x08F8 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x0900 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x0908 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterColV4;                                // 0x0910 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterColV3;                                // 0x0918 (size: 0x8)
    class UStaticMeshComponent* PropagandaPosterColV2;                                // 0x0920 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0928 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0938 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0940 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x0948 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x0950 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x0958 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x0960 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x0968 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x0970 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0978 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0980 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0988 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0990 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0998 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x09A0 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x09A8 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x09B0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* Window4;                                              // 0x09C0 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x09C8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Back;                             // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* Window3;                                              // 0x09D8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x09E0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x09F0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x09F8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Front;                            // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x0A08 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0A10 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x0A18 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0A20 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0A28 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0A40 (size: 0x8)

}; // Size: 0xA48

#endif
