#ifndef UE4SS_SDK_TownCSmallG2_HPP
#define UE4SS_SDK_TownCSmallG2_HPP

class ATownCSmallG2_C : public AGarrisonHouse
{
    class UDecalComponent* Decal8;                                                    // 0x0870 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0878 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0880 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0888 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0890 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0898 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x08A0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x08B0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x08B8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x08C0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x08C8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x08D8 (size: 0x8)

}; // Size: 0x8E0

#endif
