#ifndef UE4SS_SDK_TownCSmallG1_HPP
#define UE4SS_SDK_TownCSmallG1_HPP

class ATownCSmallG1_C : public AGarrisonHouse
{
    class UDecalComponent* Decal5;                                                    // 0x08A0 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x08A8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x08B0 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* Window2;                                              // 0x08C0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* Window1;                                              // 0x08D0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x08D8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Right;                            // 0x08E0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret_Left;                             // 0x08E8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x08F8 (size: 0x8)

}; // Size: 0x900

#endif
