#ifndef UE4SS_SDK_TownWMedAttachedG2Destroyed_HPP
#define UE4SS_SDK_TownWMedAttachedG2Destroyed_HPP

class ATownWMedAttachedG2Destroyed_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh29;                                         // 0x0628 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh28;                                         // 0x0630 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh27;                                         // 0x0638 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh26;                                         // 0x0640 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh25;                                         // 0x0648 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh24;                                         // 0x0650 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh13;                                         // 0x0658 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh23;                                         // 0x0660 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh12;                                         // 0x0668 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh22;                                         // 0x0670 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh21;                                         // 0x0678 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh20;                                         // 0x0680 (size: 0x8)
    class UBoxComponent* UseAreaBox1;                                                 // 0x0688 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0690 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh19;                                         // 0x0698 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh7;                                          // 0x06A0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh11;                                         // 0x06A8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh18;                                         // 0x06B0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh17;                                         // 0x06B8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh16;                                         // 0x06C0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh15;                                         // 0x06C8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh14;                                         // 0x06D0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh6;                                          // 0x06D8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh5;                                          // 0x06E0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x06E8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x06F0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x06F8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0700 (size: 0x8)
    class UArrowComponent* StructureArrow1;                                           // 0x0708 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0710 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0718 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0720 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0728 (size: 0x8)

}; // Size: 0x730

#endif
