#ifndef UE4SS_SDK_UniqueWCoalPlantG1Destroyed_HPP
#define UE4SS_SDK_UniqueWCoalPlantG1Destroyed_HPP

class AUniqueWCoalPlantG1Destroyed_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh8;                                          // 0x0618 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh7;                                          // 0x0620 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh6;                                          // 0x0628 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh5;                                          // 0x0630 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh4;                                          // 0x0638 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x0640 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x0648 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0650 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0658 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0670 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0678 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0680 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0688 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x06A0 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x06A8 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerOut01;                                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerIn01;                                 // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* TownRubbleFlat01;                                     // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x06D0 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x06D8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x06E0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x06E8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x06F0 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0700 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0708 (size: 0x8)

}; // Size: 0x710

#endif
