#ifndef UE4SS_SDK_UniqueWWindMillG1Destroyed_HPP
#define UE4SS_SDK_UniqueWWindMillG1Destroyed_HPP

class AUniqueWWindMillG1Destroyed_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x0600 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0608 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0620 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0628 (size: 0x8)
    class UStaticMeshComponent* Ivy061;                                               // 0x0630 (size: 0x8)
    class UStaticMeshComponent* Ivy14Corner;                                          // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Ivy10;                                                // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0648 (size: 0x8)
    class UStaticMeshComponent* Ivy06;                                                // 0x0650 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0658 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0660 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0668 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0670 (size: 0x8)
    class UStaticMeshComponent* TownWSmall1Destroyed;                                 // 0x0678 (size: 0x8)

}; // Size: 0x680

#endif
