#ifndef UE4SS_SDK_UniqueCChurchG1Destroyed_HPP
#define UE4SS_SDK_UniqueCChurchG1Destroyed_HPP

class AUniqueCChurchG1Destroyed_C : public ADestroyedGarrisonHouse
{
    class UStaticMeshComponent* StaticMesh63;                                         // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMesh58;                                         // 0x0630 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x0638 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x0640 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0648 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0650 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0658 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0668 (size: 0x8)
    class USceneComponent* RuinedProps;                                               // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh60;                                         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMesh62;                                         // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMesh61;                                         // 0x0688 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x0690 (size: 0x8)
    class USceneComponent* HuskProps;                                                 // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMesh59;                                         // 0x06A0 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x06A8 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x06B0 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x06B8 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x06C0 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x06C8 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x06D0 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x06D8 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x06E0 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x06E8 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x06F0 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x06F8 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0700 (size: 0x8)
    class UStaticMeshComponent* StaticMesh57;                                         // 0x0708 (size: 0x8)
    class UStaticMeshComponent* StaticMesh56;                                         // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMesh55;                                         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMesh54;                                         // 0x0720 (size: 0x8)
    class UStaticMeshComponent* StaticMesh53;                                         // 0x0728 (size: 0x8)
    class UStaticMeshComponent* StaticMesh52;                                         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMesh50;                                         // 0x0738 (size: 0x8)
    class UStaticMeshComponent* StaticMesh49;                                         // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMesh48;                                         // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMesh47;                                         // 0x0750 (size: 0x8)
    class UStaticMeshComponent* StaticMesh46;                                         // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMesh45;                                         // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMesh44;                                         // 0x0768 (size: 0x8)
    class UStaticMeshComponent* StaticMesh43;                                         // 0x0770 (size: 0x8)
    class UStaticMeshComponent* StaticMesh42;                                         // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMesh41;                                         // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x0788 (size: 0x8)
    class UStaticMeshComponent* StaticMesh39;                                         // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x07D8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x07E0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x07E8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* UniqueCChurchG1Ruin;                                  // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0800 (size: 0x8)

    void OnEnterExit(bool Enter, class AActor* Actor);
}; // Size: 0x808

#endif
