#ifndef UE4SS_SDK_UniqueWWarehouseG2_HPP
#define UE4SS_SDK_UniqueWWarehouseG2_HPP

class AUniqueWWarehouseG2_C : public AGarrisonStation
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0900 (size: 0x8)
    class USpawnPointComponent* Spawn6;                                               // 0x0908 (size: 0x8)
    class USpawnPointComponent* Spawn5;                                               // 0x0910 (size: 0x8)
    class USpawnPointComponent* Spawn4;                                               // 0x0918 (size: 0x8)
    class USpawnPointComponent* Spawn3;                                               // 0x0920 (size: 0x8)
    class USpawnPointComponent* Spawn2;                                               // 0x0928 (size: 0x8)
    class USpawnPointComponent* Spawn1;                                               // 0x0930 (size: 0x8)
    class USpawnPointComponent* Spawn0;                                               // 0x0938 (size: 0x8)
    class UBoxComponent* ArtilleryShelterWeakPoint;                                   // 0x0940 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0948 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0950 (size: 0x8)
    class UStaticMeshComponent* window03;                                             // 0x0958 (size: 0x8)
    class UStaticMeshComponent* window04;                                             // 0x0960 (size: 0x8)
    class UCameraComponent* ViewTargetCamera;                                         // 0x0968 (size: 0x8)
    class UBPBicycleSpawnLocationComponent_C* BPBicycleSpawnLocationComponent;        // 0x0970 (size: 0x8)
    class USpotLightComponent* SpotLight3;                                            // 0x0978 (size: 0x8)
    class USpotLightComponent* SpotLight2;                                            // 0x0980 (size: 0x8)
    class USpotLightComponent* SpotLight1;                                            // 0x0988 (size: 0x8)
    class USpotLightComponent* SpotLight;                                             // 0x0990 (size: 0x8)
    class UDecalComponent* AITurretMarker03;                                          // 0x0998 (size: 0x8)
    class UDecalComponent* AITurretMarker02;                                          // 0x09A0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret3;                                 // 0x09A8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret2;                                 // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* RadioStationRoofMesh;                                 // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateTop;                                       // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom02;                                  // 0x09E8 (size: 0x8)
    class UBoxComponent* GarrisonStationRadioStationStaticSwap;                       // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* RadioStationMesh;                                     // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* WoodenCrateBottom03;                                  // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0A08 (size: 0x8)
    class UBoxComponent* GarrisonStationOperatingPostStaticSwap;                      // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* OperatingPostMesh;                                    // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0A50 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x0A58 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0A60 (size: 0x8)
    class UStaticMeshComponent* HomeRegionCrates02;                                   // 0x0A68 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0A78 (size: 0x8)
    class UBoxComponent* ArtilleryShelterMeshStaticSwap;                              // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* ArtilleryShelterMesh;                                 // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* EntranceRampBack;                                     // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* EntranceRampFront;                                    // 0x0A98 (size: 0x8)
    class UBoxComponent* PillarCollision02;                                           // 0x0AA0 (size: 0x8)
    class UBoxComponent* PillarCollision01;                                           // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0AB0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0AD8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0AE0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0AE8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0AF0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0AF8 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* HangingWires02;                                       // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0B10 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0B28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0B30 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0B38 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0B40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0B48 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0B50 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0B58 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0B60 (size: 0x8)
    class UStaticMeshComponent* Shelf01;                                              // 0x0B68 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0B70 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0B78 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0B80 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0B88 (size: 0x8)
    class UBoxComponent* RailingCollision02;                                          // 0x0B90 (size: 0x8)
    class UBoxComponent* RailingCollision01;                                          // 0x0B98 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0BA0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0BA8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0BB0 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0BB8 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0BC0 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0BC8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0BD0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0BD8 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x0BE0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x0BE8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x0BF0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0C00 (size: 0x8)

    void ReceiveBeginPlay();
    void OnResearched(const class UTechTreeComponent* TechTreeComponent, const ETechComponentID TechID);
    void ExecuteUbergraph_UniqueWWarehouseG2(int32 EntryPoint);
}; // Size: 0xC08

#endif
