#ifndef UE4SS_SDK_UniqueWWarehouseG4Destroyed_HPP
#define UE4SS_SDK_UniqueWWarehouseG4Destroyed_HPP

class AUniqueWWarehouseG4Destroyed_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x05F0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x05F8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0600 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0608 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0610 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0618 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0620 (size: 0x8)
    class UStaticMeshComponent* Cardboard09;                                          // 0x0628 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0630 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Cardboard04;                                          // 0x0640 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0648 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0650 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0658 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* Cardboard03;                                          // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x0688 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0690 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* Cardboard01;                                          // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* HangingCloth02;                                       // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* HangingCloth06;                                       // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* HangingCloth05;                                       // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* HangingCloth04;                                       // 0x0700 (size: 0x8)
    class UStaticMeshComponent* HangingCloth03;                                       // 0x0708 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x0710 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x0718 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x0720 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x0728 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x0730 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0738 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x0740 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0748 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0750 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0758 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0760 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0768 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0770 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0778 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0780 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0788 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* CrudeOil;                                             // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* TrenchWoodPlank2;                                     // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0800 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem6;                                  // 0x0808 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0810 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0818 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0820 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x0828 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0830 (size: 0x8)
    class UBoxComponent* StaticMeshProps1;                                            // 0x0838 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0840 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0848 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0850 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0858 (size: 0x8)

}; // Size: 0x860

#endif
