#ifndef UE4SS_SDK_UniqueCChurchG1_HPP
#define UE4SS_SDK_UniqueCChurchG1_HPP

class AUniqueCChurchG1_C : public AGarrisonHouse
{
    class UStaticMeshComponent* StaticMesh70;                                         // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMesh69;                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* StaticMesh68;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMesh67;                                         // 0x0848 (size: 0x8)
    class UDecalComponent* Decal93;                                                   // 0x0850 (size: 0x8)
    class UDecalComponent* Decal92;                                                   // 0x0858 (size: 0x8)
    class UDecalComponent* Decal91;                                                   // 0x0860 (size: 0x8)
    class UDecalComponent* Decal90;                                                   // 0x0868 (size: 0x8)
    class UDecalComponent* Decal89;                                                   // 0x0870 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem7;                                  // 0x0878 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem6;                                  // 0x0880 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem5;                                  // 0x0888 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem4;                                  // 0x0890 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem3;                                  // 0x0898 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem2;                                  // 0x08A0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x08A8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem;                                   // 0x08B0 (size: 0x8)
    class USceneComponent* particles;                                                 // 0x08B8 (size: 0x8)
    class UDecalComponent* Decal88;                                                   // 0x08C0 (size: 0x8)
    class UDecalComponent* Decal87;                                                   // 0x08C8 (size: 0x8)
    class UDecalComponent* Decal86;                                                   // 0x08D0 (size: 0x8)
    class UDecalComponent* Decal85;                                                   // 0x08D8 (size: 0x8)
    class UDecalComponent* Decal84;                                                   // 0x08E0 (size: 0x8)
    class UDecalComponent* Decal83;                                                   // 0x08E8 (size: 0x8)
    class UDecalComponent* Decal82;                                                   // 0x08F0 (size: 0x8)
    class UDecalComponent* Decal81;                                                   // 0x08F8 (size: 0x8)
    class UDecalComponent* Decal80;                                                   // 0x0900 (size: 0x8)
    class UDecalComponent* Decal79;                                                   // 0x0908 (size: 0x8)
    class UDecalComponent* Decal78;                                                   // 0x0910 (size: 0x8)
    class UDecalComponent* Decal77;                                                   // 0x0918 (size: 0x8)
    class UDecalComponent* Decal76;                                                   // 0x0920 (size: 0x8)
    class UDecalComponent* Decal75;                                                   // 0x0928 (size: 0x8)
    class UDecalComponent* Decal74;                                                   // 0x0930 (size: 0x8)
    class UDecalComponent* Decal64;                                                   // 0x0938 (size: 0x8)
    class UDecalComponent* Decal63;                                                   // 0x0940 (size: 0x8)
    class UDecalComponent* Decal73;                                                   // 0x0948 (size: 0x8)
    class UDecalComponent* Decal72;                                                   // 0x0950 (size: 0x8)
    class UDecalComponent* Decal71;                                                   // 0x0958 (size: 0x8)
    class UDecalComponent* Decal69;                                                   // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh66;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh65;                                         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* StaticMesh64;                                         // 0x0978 (size: 0x8)
    class UStaticMeshComponent* StaticMesh63;                                         // 0x0980 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0988 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea5;                       // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh62;                                         // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMesh61;                                         // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh60;                                         // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh59;                                         // 0x09B0 (size: 0x8)
    class UDecalComponent* Decal68;                                                   // 0x09B8 (size: 0x8)
    class UDecalComponent* Decal67;                                                   // 0x09C0 (size: 0x8)
    class UDecalComponent* Decal66;                                                   // 0x09C8 (size: 0x8)
    class UDecalComponent* Decal62;                                                   // 0x09D0 (size: 0x8)
    class UDecalComponent* Decal61;                                                   // 0x09D8 (size: 0x8)
    class UDecalComponent* Decal60;                                                   // 0x09E0 (size: 0x8)
    class UDecalComponent* Decal59;                                                   // 0x09E8 (size: 0x8)
    class UDecalComponent* Decal58;                                                   // 0x09F0 (size: 0x8)
    class UDecalComponent* Decal57;                                                   // 0x09F8 (size: 0x8)
    class UDecalComponent* Decal56;                                                   // 0x0A00 (size: 0x8)
    class UDecalComponent* Decal55;                                                   // 0x0A08 (size: 0x8)
    class UDecalComponent* Decal54;                                                   // 0x0A10 (size: 0x8)
    class UDecalComponent* Decal53;                                                   // 0x0A18 (size: 0x8)
    class UDecalComponent* Decal52;                                                   // 0x0A20 (size: 0x8)
    class UDecalComponent* Decal51;                                                   // 0x0A28 (size: 0x8)
    class UDecalComponent* Decal47;                                                   // 0x0A30 (size: 0x8)
    class UDecalComponent* Decal49;                                                   // 0x0A38 (size: 0x8)
    class UDecalComponent* Decal48;                                                   // 0x0A40 (size: 0x8)
    class UDecalComponent* Decal50;                                                   // 0x0A48 (size: 0x8)
    class UDecalComponent* Decal46;                                                   // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal45;                                                   // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal44;                                                   // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal43;                                                   // 0x0A68 (size: 0x8)
    class UDecalComponent* Decal42;                                                   // 0x0A70 (size: 0x8)
    class UDecalComponent* Decal41;                                                   // 0x0A78 (size: 0x8)
    class UDecalComponent* Decal40;                                                   // 0x0A80 (size: 0x8)
    class UDecalComponent* Decal39;                                                   // 0x0A88 (size: 0x8)
    class UDecalComponent* Decal38;                                                   // 0x0A90 (size: 0x8)
    class UDecalComponent* Decal37;                                                   // 0x0A98 (size: 0x8)
    class UDecalComponent* Decal36;                                                   // 0x0AA0 (size: 0x8)
    class UDecalComponent* Decal35;                                                   // 0x0AA8 (size: 0x8)
    class UDecalComponent* Decal34;                                                   // 0x0AB0 (size: 0x8)
    class UDecalComponent* Decal33;                                                   // 0x0AB8 (size: 0x8)
    class UDecalComponent* Decal32;                                                   // 0x0AC0 (size: 0x8)
    class UDecalComponent* Decal31;                                                   // 0x0AC8 (size: 0x8)
    class UDecalComponent* Decal30;                                                   // 0x0AD0 (size: 0x8)
    class UDecalComponent* Decal29;                                                   // 0x0AD8 (size: 0x8)
    class UDecalComponent* Decal28;                                                   // 0x0AE0 (size: 0x8)
    class UDecalComponent* Decal27;                                                   // 0x0AE8 (size: 0x8)
    class UDecalComponent* Decal26;                                                   // 0x0AF0 (size: 0x8)
    class UDecalComponent* Decal25;                                                   // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh58;                                         // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh57;                                         // 0x0B08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0B10 (size: 0x8)
    class UDecalComponent* Decal24;                                                   // 0x0B18 (size: 0x8)
    class UDecalComponent* Decal23;                                                   // 0x0B20 (size: 0x8)
    class UDecalComponent* Decal22;                                                   // 0x0B28 (size: 0x8)
    class UDecalComponent* Decal21;                                                   // 0x0B30 (size: 0x8)
    class UDecalComponent* Decal20;                                                   // 0x0B38 (size: 0x8)
    class UDecalComponent* Decal19;                                                   // 0x0B40 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x0B48 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x0B50 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x0B58 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x0B60 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x0B68 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0B70 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x0B78 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0B80 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x0B88 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0B90 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0B98 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0BA0 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0BA8 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0BB0 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0BB8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0BC0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0BC8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0BD0 (size: 0x8)
    class UDecalComponent* AITurretMarker02;                                          // 0x0BD8 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0BE0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh56;                                         // 0x0BE8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh55;                                         // 0x0BF0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh54;                                         // 0x0BF8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh53;                                         // 0x0C00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh52;                                         // 0x0C08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh51;                                         // 0x0C10 (size: 0x8)
    class UStaticMeshComponent* StaticMesh50;                                         // 0x0C18 (size: 0x8)
    class UStaticMeshComponent* StaticMesh49;                                         // 0x0C20 (size: 0x8)
    class UStaticMeshComponent* StaticMesh48;                                         // 0x0C28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh47;                                         // 0x0C30 (size: 0x8)
    class UStaticMeshComponent* StaticMesh46;                                         // 0x0C38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh45;                                         // 0x0C40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh44;                                         // 0x0C48 (size: 0x8)
    class UStaticMeshComponent* StaticMesh43;                                         // 0x0C50 (size: 0x8)
    class UStaticMeshComponent* StaticMesh42;                                         // 0x0C58 (size: 0x8)
    class UStaticMeshComponent* StaticMesh41;                                         // 0x0C60 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x0C68 (size: 0x8)
    class UStaticMeshComponent* StaticMesh39;                                         // 0x0C70 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0C78 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0C80 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x0C88 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0C90 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0C98 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0CA0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x0CA8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0CB0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0CB8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0CC0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0CC8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x0CD0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0CD8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0CE0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0CE8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0CF0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0CF8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0D00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0D08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0D10 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0D18 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0D20 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0D28 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0D30 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0D38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0D40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0D48 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0D50 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0D58 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0D60 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0D68 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0D70 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0D78 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0D80 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0D88 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0D90 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0D98 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0DA0 (size: 0x8)
    class USceneComponent* Props;                                                     // 0x0DA8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea3;                       // 0x0DB0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0DB8 (size: 0x8)
    class UStaticMeshComponent* window03;                                             // 0x0DC0 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0DC8 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0DD0 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0DD8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret2;                                 // 0x0DE0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x0DE8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x0DF0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0DF8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0E00 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0E08 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0E10 (size: 0x8)

    void OnEnterExit(bool Enter, class AActor* Actor);
}; // Size: 0xE18

#endif
