#ifndef UE4SS_SDK_UniqueWCoalPlantG1_HPP
#define UE4SS_SDK_UniqueWCoalPlantG1_HPP

class AUniqueWCoalPlantG1_C : public AGarrisonHouse
{
    class UBPBicycleSpawnLocationComponent_C* BPBicycleSpawnLocationComponent;        // 0x08A0 (size: 0x8)
    class UDecalComponent* AITurretMarker03;                                          // 0x08A8 (size: 0x8)
    class UDecalComponent* AITurretMarker02;                                          // 0x08B0 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x08B8 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* TownRubbleWall01;                                     // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* TownRubbleStraight01;                                 // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* MachineryVarious01;                                   // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x08F0 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x08F8 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0900 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0908 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0918 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x0920 (size: 0x8)
    class UStaticMeshComponent* Table04;                                              // 0x0928 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0938 (size: 0x8)
    class UStaticMeshComponent* TownRubbleFloor02;                                    // 0x0940 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0948 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0950 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerIn01;                                 // 0x0958 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0968 (size: 0x8)
    class UDecalComponent* RubbleDecal;                                               // 0x0970 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0978 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0980 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x09A8 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* window04;                                             // 0x09B8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret3;                                 // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* window03;                                             // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x09D8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret2;                                 // 0x09E0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x09E8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x09F0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x09F8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem6;                                  // 0x0A00 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem5;                                  // 0x0A08 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem3;                                  // 0x0A10 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x0A18 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0A20 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0A28 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0A38 (size: 0x8)

}; // Size: 0xA40

#endif
