#ifndef UE4SS_SDK_UniqueWTrainStationG1Destroyed_HPP
#define UE4SS_SDK_UniqueWTrainStationG1Destroyed_HPP

class AUniqueWTrainStationG1Destroyed_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh12;                                         // 0x0638 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh11;                                         // 0x0640 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh10;                                         // 0x0648 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh9;                                          // 0x0650 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh8;                                          // 0x0658 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh7;                                          // 0x0660 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh6;                                          // 0x0668 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh5;                                          // 0x0670 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh4;                                          // 0x0678 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x0680 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x0688 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0690 (size: 0x8)
    class UStaticMeshComponent* UniqueWTrainStationG1Ruin;                            // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMesh77;                                         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh76;                                         // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh75;                                         // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh74;                                         // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh73;                                         // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh72;                                         // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh71;                                         // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh70;                                         // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh69;                                         // 0x06E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh68;                                         // 0x06E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh67;                                         // 0x06F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh66;                                         // 0x06F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh65;                                         // 0x0700 (size: 0x8)
    class UStaticMeshComponent* StaticMesh64;                                         // 0x0708 (size: 0x8)
    class UStaticMeshComponent* StaticMesh63;                                         // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMesh62;                                         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMesh61;                                         // 0x0720 (size: 0x8)
    class UStaticMeshComponent* StaticMesh60;                                         // 0x0728 (size: 0x8)
    class UStaticMeshComponent* StaticMesh59;                                         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMesh58;                                         // 0x0738 (size: 0x8)
    class UStaticMeshComponent* StaticMesh57;                                         // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMesh56;                                         // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMesh55;                                         // 0x0750 (size: 0x8)
    class UStaticMeshComponent* StaticMesh54;                                         // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMesh53;                                         // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMesh52;                                         // 0x0768 (size: 0x8)
    class UStaticMeshComponent* StaticMesh51;                                         // 0x0770 (size: 0x8)
    class UStaticMeshComponent* StaticMesh50;                                         // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMesh49;                                         // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMesh48;                                         // 0x0788 (size: 0x8)
    class UStaticMeshComponent* StaticMesh47;                                         // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMesh46;                                         // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMesh45;                                         // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh42;                                         // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh44;                                         // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh43;                                         // 0x07B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh41;                                         // 0x07C0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x07C8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x07D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh39;                                         // 0x07E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh38;                                         // 0x07E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0800 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0808 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0810 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x0818 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0820 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0828 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0858 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0860 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0918 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0920 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0928 (size: 0x8)

}; // Size: 0x930

#endif
