#ifndef UE4SS_SDK_UniqueWWaterMillG1_HPP
#define UE4SS_SDK_UniqueWWaterMillG1_HPP

class AUniqueWWaterMillG1_C : public AGarrisonHouse
{
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* TownStaircase03;                                      // 0x0878 (size: 0x8)
    class UBoxComponent* PropCollison04;                                              // 0x0880 (size: 0x8)
    class UBoxComponent* PropCollison03;                                              // 0x0888 (size: 0x8)
    class UBoxComponent* PropCollison02;                                              // 0x0890 (size: 0x8)
    class UBoxComponent* PropCollison01;                                              // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* ScrapPiece_03;                                        // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* ScrapPiece_05;                                        // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* ScrapPiece_04;                                        // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* ToolsScrewdriver02;                                   // 0x0908 (size: 0x8)
    class UStaticMeshComponent* ToolsHandsaw;                                         // 0x0910 (size: 0x8)
    class UStaticMeshComponent* ToolsHacksaw;                                         // 0x0918 (size: 0x8)
    class UStaticMeshComponent* Toolbox;                                              // 0x0920 (size: 0x8)
    class UStaticMeshComponent* FarmTools_SmallHoe;                                   // 0x0928 (size: 0x8)
    class UStaticMeshComponent* FarmTools_Shovel;                                     // 0x0930 (size: 0x8)
    class UStaticMeshComponent* FarmTools_Pitchfork;                                  // 0x0938 (size: 0x8)
    class UStaticMeshComponent* FarmTools_LargeHoe;                                   // 0x0940 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0948 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0950 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0958 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* WoodBarrel_03;                                        // 0x0978 (size: 0x8)
    class UStaticMeshComponent* WoodBarrel_02;                                        // 0x0980 (size: 0x8)
    class UStaticMeshComponent* WoodBarrel_01;                                        // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* WoodOldPlankSquarev2;                                 // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* WoodOldPlankSquarev1;                                 // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* WoodOldPillarRound;                                   // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* WoodOldPillarSquare;                                  // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0A10 (size: 0x8)
    class UBoxComponent* PropCollisonMesh;                                            // 0x0A18 (size: 0x8)
    class UDecalComponent* AITurretMarker02;                                          // 0x0A20 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0A28 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0A30 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x0A38 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem5;                                  // 0x0A40 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem3;                                  // 0x0A48 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0A68 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0A70 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0A88 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0A90 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* window03;                                             // 0x0AA0 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0AA8 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0AB0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret2;                                 // 0x0AB8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x0AC0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x0AC8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea2;                       // 0x0AD0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0AD8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0AE0 (size: 0x8)
    class USkeletalMeshComponent* SK_WaterWheel;                                      // 0x0AE8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0AF0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0AF8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0B00 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0B08 (size: 0x8)

}; // Size: 0xB10

#endif
