#ifndef UE4SS_SDK_UniqueWWarehouseG4_HPP
#define UE4SS_SDK_UniqueWWarehouseG4_HPP

class AUniqueWWarehouseG4_C : public AGarrisonHouse
{
    class USpotLightComponent* SpotLight1;                                            // 0x0830 (size: 0x8)
    class UBoxComponent* ShootThroughCollision05;                                     // 0x0838 (size: 0x8)
    class UBoxComponent* ShootThroughCollision04;                                     // 0x0840 (size: 0x8)
    class UBoxComponent* ShootThroughCollision03;                                     // 0x0848 (size: 0x8)
    class UBoxComponent* ShootThroughCollision01;                                     // 0x0850 (size: 0x8)
    class UBoxComponent* ShootThroughCollision02;                                     // 0x0858 (size: 0x8)
    class UBoxComponent* Collision03;                                                 // 0x0860 (size: 0x8)
    class UBoxComponent* Collision02;                                                 // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0878 (size: 0x8)
    class UBoxComponent* Collision01;                                                 // 0x0880 (size: 0x8)
    class UStaticMeshComponent* Cardboard12;                                          // 0x0888 (size: 0x8)
    class USceneComponent* StaticMeshPropCollision;                                   // 0x0890 (size: 0x8)
    class UStaticMeshComponent* Light;                                                // 0x0898 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* HangingCloth05;                                       // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* HangingCloth03;                                       // 0x08B0 (size: 0x8)
    class UDecalComponent* Decal18;                                                   // 0x08B8 (size: 0x8)
    class UDecalComponent* Decal17;                                                   // 0x08C0 (size: 0x8)
    class UDecalComponent* Decal16;                                                   // 0x08C8 (size: 0x8)
    class UDecalComponent* Decal15;                                                   // 0x08D0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x08D8 (size: 0x8)
    class UDecalComponent* Decal10;                                                   // 0x08E0 (size: 0x8)
    class UDecalComponent* Decal9;                                                    // 0x08E8 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x08F0 (size: 0x8)
    class UDecalComponent* Decal13;                                                   // 0x08F8 (size: 0x8)
    class USceneComponent* Decals;                                                    // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x0918 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0928 (size: 0x8)
    class UStaticMeshComponent* HangingCloth02;                                       // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0938 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x0940 (size: 0x8)
    class UStaticMeshComponent* CrudeOil;                                             // 0x0948 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0950 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0958 (size: 0x8)
    class UStaticMeshComponent* TrenchWoodPlank2;                                     // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0978 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0980 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0998 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Cardboard03;                                          // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x09D8 (size: 0x8)
    class UStaticMeshComponent* Cardboard01;                                          // 0x09E0 (size: 0x8)
    class USceneComponent* StaticMeshProps;                                           // 0x09E8 (size: 0x8)
    class UDecalComponent* AITurretMarker03;                                          // 0x09F0 (size: 0x8)
    class UDecalComponent* AITurretMarker02;                                          // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* window04;                                             // 0x0A00 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret3;                                 // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* window03;                                             // 0x0A10 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret2;                                 // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* HangingCloth06;                                       // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* HangingCloth04;                                       // 0x0A28 (size: 0x8)
    class UDecalComponent* Decal14;                                                   // 0x0A30 (size: 0x8)
    class UDecalComponent* Decal12;                                                   // 0x0A38 (size: 0x8)
    class UDecalComponent* Decal11;                                                   // 0x0A40 (size: 0x8)
    class UDecalComponent* Decal7;                                                    // 0x0A48 (size: 0x8)
    class UDecalComponent* Decal6;                                                    // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal8;                                                    // 0x0A68 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0A70 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0A80 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0A88 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0A90 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0A98 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0AA0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x0AA8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x0AB0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0AC0 (size: 0x8)

}; // Size: 0xAC8

#endif
