#ifndef UE4SS_SDK_UniqueWBellTowerG1_HPP
#define UE4SS_SDK_UniqueWBellTowerG1_HPP

class AUniqueWBellTowerG1_C : public AGarrisonHouse
{
    class UDecalComponent* Decal;                                                     // 0x0830 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0838 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0840 (size: 0x8)
    class UStaticMeshComponent* RoofMesh;                                             // 0x0848 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0850 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0858 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x0860 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem5;                                  // 0x0868 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem4;                                  // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0880 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x0888 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0898 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x08A0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x08A8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
