#ifndef UE4SS_SDK_UniqueWBellTowerG1Destroyed_HPP
#define UE4SS_SDK_UniqueWBellTowerG1Destroyed_HPP

class AUniqueWBellTowerG1Destroyed_C : public ADestroyedGarrisonHouse
{
    class URuinedMeshComponent* RuinedMesh5;                                          // 0x05F0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh4;                                          // 0x05F8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x0600 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x0608 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0610 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh;                                           // 0x0618 (size: 0x8)
    class UStaticMeshComponent* RuinedBellTower;                                      // 0x0620 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0628 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0630 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0638 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0640 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0648 (size: 0x8)

}; // Size: 0x650

#endif
