#ifndef UE4SS_SDK_UniqueWPubG1Destroyed_HPP
#define UE4SS_SDK_UniqueWPubG1Destroyed_HPP

class AUniqueWPubG1Destroyed_C : public ADestroyedGarrisonHouse
{
    class UStaticMeshComponent* Cabinet4;                                             // 0x05F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x05F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x0600 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x0608 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh9;                                          // 0x0610 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh8;                                          // 0x0618 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh7;                                          // 0x0620 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh6;                                          // 0x0628 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh5;                                          // 0x0630 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh4;                                          // 0x0638 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh3;                                          // 0x0640 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh2;                                          // 0x0648 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh1;                                          // 0x0650 (size: 0x8)
    class UStaticMeshComponent* UniqueWPubG1Ruin;                                     // 0x0658 (size: 0x8)
    class UBoxComponent* StaticMeshCollision04;                                       // 0x0660 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0668 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x0670 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0678 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x0680 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0688 (size: 0x8)
    class UBoxComponent* StaticMeshCollision03;                                       // 0x0690 (size: 0x8)
    class UBoxComponent* StaticMeshCollision02;                                       // 0x0698 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x06A0 (size: 0x8)
    class UStaticMeshComponent* WoodBarrel_01;                                        // 0x06A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x06B0 (size: 0x8)
    class UStaticMeshComponent* Rug09;                                                // 0x06B8 (size: 0x8)
    class UStaticMeshComponent* PhotoFrame1;                                          // 0x06C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x06C8 (size: 0x8)
    class UStaticMeshComponent* Cabinet3;                                             // 0x06D0 (size: 0x8)
    class UStaticMeshComponent* CoverHalfBath1d;                                      // 0x06D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x06E0 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x06E8 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x06F0 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x06F8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0700 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0708 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerIn01;                                 // 0x0710 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0718 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0720 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0728 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0738 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0750 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0768 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0770 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0788 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0790 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x07A0 (size: 0x8)
    class UBoxComponent* StaticProps;                                                 // 0x07A8 (size: 0x8)
    class UBoxComponent* StaticMeshCollision01;                                       // 0x07B0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x07B8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x07C0 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x07C8 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x07D0 (size: 0x8)

}; // Size: 0x7D8

#endif
