#ifndef UE4SS_SDK_VillageWLargeG1_HPP
#define UE4SS_SDK_VillageWLargeG1_HPP

class AVillageWLargeG1_C : public AGarrisonHouse
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0870 (size: 0x8)
    class UStaticMeshComponent* TownStaircase03;                                      // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0888 (size: 0x8)
    class UBoxComponent* PropsCollison05;                                             // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x08A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh48;                                         // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x08C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh57;                                         // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh45;                                         // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh56;                                         // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x08E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x0900 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x0908 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0910 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0918 (size: 0x8)
    class UStaticMeshComponent* StaticMesh47;                                         // 0x0920 (size: 0x8)
    class UStaticMeshComponent* StaticMesh42;                                         // 0x0928 (size: 0x8)
    class UStaticMeshComponent* StaticMesh50;                                         // 0x0930 (size: 0x8)
    class UStaticMeshComponent* StaticMesh40;                                         // 0x0938 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0940 (size: 0x8)
    class UStaticMeshComponent* StaticMesh44;                                         // 0x0948 (size: 0x8)
    class UStaticMeshComponent* StaticMesh49;                                         // 0x0950 (size: 0x8)
    class UStaticMeshComponent* StaticMesh43;                                         // 0x0958 (size: 0x8)
    class UStaticMeshComponent* StaticMesh51;                                         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh52;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* Cabinet1;                                             // 0x0970 (size: 0x8)
    class UStaticMeshComponent* SideCabinet8;                                         // 0x0978 (size: 0x8)
    class UDecalComponent* AITurretMarker03;                                          // 0x0980 (size: 0x8)
    class UDecalComponent* AITurretMarker02;                                          // 0x0988 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0990 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0998 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem6;                                  // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* Lamp05;                                               // 0x09A8 (size: 0x8)
    class UStaticMeshComponent* Lamp01;                                               // 0x09B0 (size: 0x8)
    class UStaticMeshComponent* Lamp03;                                               // 0x09B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh55;                                         // 0x09C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh46;                                         // 0x09C8 (size: 0x8)
    class UStaticMeshComponent* KitchenTable;                                         // 0x09D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x09D8 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x09E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x09F8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0A00 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0A08 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0A10 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0A18 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0A20 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0A28 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0A30 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0A38 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0A40 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0A48 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0A50 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x0A58 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0A60 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0A68 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0A70 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0A78 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x0A80 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0A88 (size: 0x8)
    class UBoxComponent* PropsCollison01;                                             // 0x0A90 (size: 0x8)
    class UBoxComponent* PropsCollison06;                                             // 0x0A98 (size: 0x8)
    class UBoxComponent* PropsCollison04;                                             // 0x0AA0 (size: 0x8)
    class UBoxComponent* PropsCollison03;                                             // 0x0AA8 (size: 0x8)
    class UBoxComponent* PropsCollison02;                                             // 0x0AB0 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x0AB8 (size: 0x8)
    class UStaticMeshComponent* window04;                                             // 0x0AC0 (size: 0x8)
    class UStaticMeshComponent* window03;                                             // 0x0AC8 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0AD0 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0AD8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x0AE0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x0AE8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret3;                                 // 0x0AF0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret2;                                 // 0x0AF8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x0B00 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x0B08 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x0B10 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0B18 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x0B20 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0B28 (size: 0x8)

    void ReceiveBeginPlay();
    void UpdateLights();
    void ExecuteUbergraph_VillageWLargeG1(int32 EntryPoint);
}; // Size: 0xB30

#endif
