#ifndef UE4SS_SDK_VillageWMedAttachedG2_HPP
#define UE4SS_SDK_VillageWMedAttachedG2_HPP

class AVillageWMedAttachedG2_C : public AGarrisonHouse
{
    class UParticleSystemComponent* Lamp;                                             // 0x0830 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x0838 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x0840 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0848 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0850 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0858 (size: 0x8)
    class UBoxComponent* PropsCollison06;                                             // 0x0860 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x0868 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0870 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0878 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0880 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0888 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0890 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0898 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x08A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x08A8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x08B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x08B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x08C0 (size: 0x8)
    class UBoxComponent* PropsCollison05;                                             // 0x08C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x08D0 (size: 0x8)
    class UDecalComponent* AITurretMarker03;                                          // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x08E0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x08E8 (size: 0x8)
    class UBoxComponent* PropsCollison03;                                             // 0x08F0 (size: 0x8)
    class UBoxComponent* PropsCollison01;                                             // 0x08F8 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x0900 (size: 0x8)
    class UDecalComponent* AITurretMarker01;                                          // 0x0908 (size: 0x8)
    class UStaticMeshComponent* Cabinet6;                                             // 0x0910 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x0918 (size: 0x8)
    class UStaticMeshComponent* window04;                                             // 0x0920 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0928 (size: 0x8)
    class UBoxComponent* PropsCollison04;                                             // 0x0930 (size: 0x8)
    class UBoxComponent* PropsCollison02;                                             // 0x0938 (size: 0x8)
    class UStaticMeshComponent* Lamp02;                                               // 0x0940 (size: 0x8)
    class UStaticMeshComponent* Lamp01;                                               // 0x0948 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x0950 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x0958 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x0960 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x0968 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0970 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0978 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x0980 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0988 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0990 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0998 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x09A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x09A8 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x09B0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x09B8 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret3;                                 // 0x09C0 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x09C8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem4;                                  // 0x09D0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x09D8 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedRoof;                           // 0x09E0 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x09E8 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x09F0 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x09F8 (size: 0x8)

}; // Size: 0xA00

#endif
