#ifndef UE4SS_SDK_VillageWSmallG1_HPP
#define UE4SS_SDK_VillageWSmallG1_HPP

class AVillageWSmallG1_C : public AGarrisonHouse
{
    class UDecalComponent* AITurretMarker01;                                          // 0x08A0 (size: 0x8)
    class UDecalComponent* AITurretMarker02;                                          // 0x08A8 (size: 0x8)
    class UDecalComponent* AITurretMarker00;                                          // 0x08B0 (size: 0x8)
    class UDecalComponent* AITurretMarker03;                                          // 0x08B8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem1;                                  // 0x08C0 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem5;                                  // 0x08C8 (size: 0x8)
    class UParticleSystemComponent* ParticleSystem4;                                  // 0x08D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x08D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x08E0 (size: 0x8)
    class UBoxComponent* StaticMeshProps;                                             // 0x08E8 (size: 0x8)
    class UStaticMeshComponent* window04;                                             // 0x08F0 (size: 0x8)
    class UStaticMeshComponent* window03;                                             // 0x08F8 (size: 0x8)
    class UStaticMeshComponent* window02;                                             // 0x0900 (size: 0x8)
    class UStaticMeshComponent* window01;                                             // 0x0908 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret3;                                 // 0x0910 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret2;                                 // 0x0918 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret1;                                 // 0x0920 (size: 0x8)
    class UBPAIGarrisonTurret_C* BPAIGarrisonTurret;                                  // 0x0928 (size: 0x8)
    class UMultiplexedStaticMeshComponent* MultiplexedHouse;                          // 0x0930 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0938 (size: 0x8)

}; // Size: 0x940

#endif
