#ifndef UE4SS_SDK_VillageWLargeG2Destroyed_HPP
#define UE4SS_SDK_VillageWLargeG2Destroyed_HPP

class AVillageWLargeG2Destroyed_C : public ADestroyedGarrisonHouse
{
    class UDecalComponent* Decal6;                                                    // 0x05F0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh52;                                         // 0x05F8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh51;                                         // 0x0600 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh32;                                         // 0x0608 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh31;                                         // 0x0610 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh50;                                         // 0x0618 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh49;                                         // 0x0620 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh48;                                         // 0x0628 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh47;                                         // 0x0630 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh42;                                         // 0x0638 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh20;                                         // 0x0640 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh46;                                         // 0x0648 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh45;                                         // 0x0650 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh44;                                         // 0x0658 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh43;                                         // 0x0660 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh41;                                         // 0x0668 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh40;                                         // 0x0670 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh39;                                         // 0x0678 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh38;                                         // 0x0680 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh30;                                         // 0x0688 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh28;                                         // 0x0690 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh27;                                         // 0x0698 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh26;                                         // 0x06A0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh25;                                         // 0x06A8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh24;                                         // 0x06B0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh22;                                         // 0x06B8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh21;                                         // 0x06C0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh19;                                         // 0x06C8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh18;                                         // 0x06D0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh17;                                         // 0x06D8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh16;                                         // 0x06E0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh15;                                         // 0x06E8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh14;                                         // 0x06F0 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh37;                                         // 0x06F8 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh36;                                         // 0x0700 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh35;                                         // 0x0708 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh12;                                         // 0x0710 (size: 0x8)
    class URuinedMeshComponent* E;                                                    // 0x0718 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh23;                                         // 0x0720 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh13;                                         // 0x0728 (size: 0x8)
    class URuinedMeshComponent* RuinedMesh29;                                         // 0x0730 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0738 (size: 0x8)
    class UDecalComponent* Decal5;                                                    // 0x0740 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0748 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0750 (size: 0x8)
    class UBoxComponent* StaticMeshCollision03;                                       // 0x0758 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0760 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0768 (size: 0x8)
    class UBoxComponent* StaticMeshCollision02;                                       // 0x0770 (size: 0x8)
    class UBoxComponent* StaticMeshCollision01;                                       // 0x0778 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0780 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0788 (size: 0x8)
    class UStaticMeshComponent* Rug09;                                                // 0x0790 (size: 0x8)
    class UStaticMeshComponent* PhotoFrame1;                                          // 0x0798 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x07A0 (size: 0x8)
    class UStaticMeshComponent* Cabinet3;                                             // 0x07A8 (size: 0x8)
    class UStaticMeshComponent* CoverHalfBath1d;                                      // 0x07B0 (size: 0x8)
    class UStaticMeshComponent* TownRubbleCornerIn01;                                 // 0x07B8 (size: 0x8)
    class UDecalComponent* Decal4;                                                    // 0x07C0 (size: 0x8)
    class UDecalComponent* Decal3;                                                    // 0x07C8 (size: 0x8)
    class UDecalComponent* Decal2;                                                    // 0x07D0 (size: 0x8)
    class UDecalComponent* Decal1;                                                    // 0x07D8 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x07E0 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea1;                       // 0x07E8 (size: 0x8)
    class UBPStructureInteriorArea_C* BPStructureInteriorArea;                        // 0x07F0 (size: 0x8)
    class UStaticMeshComponent* Roof;                                                 // 0x07F8 (size: 0x8)
    class UStaticMeshComponent* HouseMesh;                                            // 0x0800 (size: 0x8)

}; // Size: 0x808

#endif
