#ifndef UE4SS_SDK_War_HPP
#define UE4SS_SDK_War_HPP

#include "War_enums.hpp"

struct FAcceptInviteToRegimentMessage
{
    FInviteToRegimentMessage InviteToAccept;                                          // 0x0000 (size: 0x60)
    FString TargetPlayerName;                                                         // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FAcceptJoinSquadWarMessage
{
    FJoinSquadWarMessage JoinMessage;                                                 // 0x0000 (size: 0x40)

}; // Size: 0x40

struct FAcceptSquadInviteWarMessage
{
    FSquadInviteInfo SquadInviteInfo;                                                 // 0x0000 (size: 0x58)
    FString NewMemberName;                                                            // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FActionStyle
{
    FButtonStyle ButtonStyle;                                                         // 0x0000 (size: 0x278)
    FText ToolTipText;                                                                // 0x0278 (size: 0x18)
    FText ToolTipDescription;                                                         // 0x0290 (size: 0x18)

}; // Size: 0x2A8

struct FActionsStyle
{
    FActionStyle AllStyles;                                                           // 0x0000 (size: 0xACA8)

}; // Size: 0xACA8

struct FActivateSquadWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FActivityIndicatorStyle
{
    class UCurveFloat* AlphaCurve;                                                    // 0x0000 (size: 0x8)
    class UCurveFloat* ScaleCurve;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FActivityResource
{
    float AmountC;                                                                    // 0x0000 (size: 0x4)
    float AmountW;                                                                    // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FActivityStateChange
{
    uint8 LastAckedSequence;                                                          // 0x0000 (size: 0x1)
    uint8 Sequence;                                                                   // 0x0001 (size: 0x1)
    ECharacterActivityState State;                                                    // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FActivityStateDebugTrace
{
    double Timestamp;                                                                 // 0x0000 (size: 0x8)
    TEnumAsByte<ENetRole> Role;                                                       // 0x0008 (size: 0x1)
    EActivityStateDebugTraceType Type;                                                // 0x0009 (size: 0x1)
    ECharacterActivityState ActivityState;                                            // 0x000A (size: 0x1)
    uint8 SequenceNumber;                                                             // 0x000B (size: 0x1)

}; // Size: 0x10

struct FActivityStateInfo
{
    class UAnimMontage* ActivityMontage;                                              // 0x0000 (size: 0x8)
    bool IsLooping;                                                                   // 0x0008 (size: 0x1)
    bool bIsReversed;                                                                 // 0x0009 (size: 0x1)
    float Duration;                                                                   // 0x000C (size: 0x4)
    FName SectionName;                                                                // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FActorLog
{
    TArray<FActorLogEntry> Entries;                                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FActorLogEntry
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    EActorLogEntryType Type;                                                          // 0x0020 (size: 0x1)
    uint16 AltType;                                                                   // 0x0022 (size: 0x2)
    int32 Value;                                                                      // 0x0024 (size: 0x4)
    FDateTime EventTime;                                                              // 0x0028 (size: 0x8)
    FName CodeName;                                                                   // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FActorLogPage
{
    TArray<FActorLogEntry> EntryList;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAddGlobalLogEntryRequest
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    EGlobalLogEntryType Type;                                                         // 0x0020 (size: 0x1)
    int8 MapId;                                                                       // 0x0021 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0022 (size: 0x1)
    int32 Value;                                                                      // 0x0024 (size: 0x4)
    int64 Timestamp;                                                                  // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FAdminCommandHttpResponse
{
    FString Result;                                                                   // 0x0000 (size: 0x10)
    FString Message;                                                                  // 0x0010 (size: 0x10)
    FString ServerName;                                                               // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminCommandHttpResponseGroup
{
    TArray<FAdminCommandHttpResponse> ResponseList;                                   // 0x0000 (size: 0x10)
    FString AdminOnlineID;                                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminCommandPlayerContext
{
    class UWorld* World;                                                              // 0x0000 (size: 0x8)
    class ASimPlayerController* AdminSimController;                                   // 0x0008 (size: 0x8)
    FString AdminOnlineID;                                                            // 0x0010 (size: 0x10)
    FString AdminPlayerName;                                                          // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAdminCommandResult
{
    FString Result;                                                                   // 0x0000 (size: 0x10)
    FString Message;                                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAdminSteamInfo
{
    FString steamId;                                                                  // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAlert
{
}; // Size: 0x60

struct FAlertAllPlayersOnTeamRPCInfo
{
    FString AlertText;                                                                // 0x0000 (size: 0x10)
    float Duration_Sec;                                                               // 0x0010 (size: 0x4)
    uint8 TeamId;                                                                     // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FAlertAllPlayersRPCInfo
{
    FString AlertText;                                                                // 0x0000 (size: 0x10)
    float Duration_Sec;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FAlertTownBuiltRPCInfo
{
    FString TownName;                                                                 // 0x0000 (size: 0x10)
    EWorldConquestMapId MapId;                                                        // 0x0010 (size: 0x1)
    uint8 TeamId;                                                                     // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FAlertTownDestroyedRPCInfo
{
    FString TownName;                                                                 // 0x0000 (size: 0x10)
    EWorldConquestMapId MapId;                                                        // 0x0010 (size: 0x1)
    uint8 TeamId;                                                                     // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FAlertTownUnderAttackRPCInfo
{
    FString TownName;                                                                 // 0x0000 (size: 0x10)
    EWorldConquestMapId MapId;                                                        // 0x0010 (size: 0x1)
    uint8 TeamId;                                                                     // 0x0011 (size: 0x1)

}; // Size: 0x18

struct FAlertWarOpsMessageRPCInfo
{
    EWarOpsAlertMessage MessageType;                                                  // 0x0000 (size: 0x1)
    bool bVar1Set;                                                                    // 0x0001 (size: 0x1)
    bool bVar2Set;                                                                    // 0x0002 (size: 0x1)
    int32 Var1;                                                                       // 0x0004 (size: 0x4)
    int32 Var2;                                                                       // 0x0008 (size: 0x4)
    float DurationSecs;                                                               // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAmmoDynamicData : public FTableRowBase
{
    float Damage;                                                                     // 0x0008 (size: 0x4)
    float Suppression;                                                                // 0x000C (size: 0x4)
    float ExplosionRadius;                                                            // 0x0010 (size: 0x4)
    TSubclassOf<class UDamageType> DamageType;                                        // 0x0018 (size: 0x8)
    float DamageInnerRadius;                                                          // 0x0020 (size: 0x4)
    float DamageFalloff;                                                              // 0x0024 (size: 0x4)
    float AccuracyRadius;                                                             // 0x0028 (size: 0x4)
    int16 EnvironmentImpactAmount;                                                    // 0x002C (size: 0x2)
    float AddedBurning;                                                               // 0x0030 (size: 0x4)
    float AddedHeat;                                                                  // 0x0034 (size: 0x4)
    float BreachingModifier;                                                          // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FAnalayticsReleaseReserveStockpileItemInfo
{
    FString StockpileName;                                                            // 0x0000 (size: 0x10)
    FName CodeName;                                                                   // 0x0010 (size: 0x8)
    int32 QuantityReleased;                                                           // 0x0018 (size: 0x4)
    int32 TotalQuantity;                                                              // 0x001C (size: 0x4)

}; // Size: 0x20

struct FAnalyticsChatInfo
{
    EChatChannel ChatChannel;                                                         // 0x0000 (size: 0x1)
    EChatLanguage ChatLanguage;                                                       // 0x0001 (size: 0x1)
    FString Message;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAnalyticsEvent
{
    FString WarId;                                                                    // 0x0000 (size: 0x10)
    EAnalyticsEventType EventType;                                                    // 0x0010 (size: 0x2)
    int64 UnixTimeStamp;                                                              // 0x0018 (size: 0x8)
    EAnalyticsAccessLevel AccessLevel;                                                // 0x0020 (size: 0x1)
    EWorldConquestMapId MapId;                                                        // 0x0021 (size: 0x1)
    FString ServerName;                                                               // 0x0028 (size: 0x10)
    float WorldPosX;                                                                  // 0x0038 (size: 0x4)
    float WorldPosY;                                                                  // 0x003C (size: 0x4)
    float WorldPosZ;                                                                  // 0x0040 (size: 0x4)
    FString OnlineID;                                                                 // 0x0048 (size: 0x10)
    FString PlayerName;                                                               // 0x0058 (size: 0x10)
    FString DeviceID;                                                                 // 0x0068 (size: 0x10)
    uint8 TeamId;                                                                     // 0x0078 (size: 0x1)
    FString JsonPayload;                                                              // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FAnalyticsFactoryOrderCompleteInfo
{
    TArray<FSpecializedFactoryOrderItem> OrderItems;                                  // 0x0000 (size: 0x10)
    EFactoryOrderAccess AccessLevel;                                                  // 0x0010 (size: 0x1)
    int16 SquadId;                                                                    // 0x0012 (size: 0x2)

}; // Size: 0x18

struct FAnalyticsItem
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    int32 Quantity;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FAnalyticsItemList
{
    TArray<FAnalyticsItem> ItemList;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnalyticsModBanInfo
{
    FString AdminPlayerName;                                                          // 0x0000 (size: 0x10)
    FString AdminOnlineID;                                                            // 0x0010 (size: 0x10)
    float DurationMins;                                                               // 0x0020 (size: 0x4)
    EBanReason BanReason;                                                             // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FAnalyticsPlayerRestrictedInfo
{
    FFriendlyFireStats FriendlyFireStats;                                             // 0x0000 (size: 0x14)
    FString RestrictionType;                                                          // 0x0018 (size: 0x10)
    float DurationMins;                                                               // 0x0028 (size: 0x4)
    bool bWasRestrictedByAdmin;                                                       // 0x002C (size: 0x1)

}; // Size: 0x30

struct FAnalyticsPrototypeResult
{
    FName PrototypeCodeName;                                                          // 0x0000 (size: 0x8)
    bool bPrototypeComplete;                                                          // 0x0008 (size: 0x1)
    bool bPrototypeSucceeded;                                                         // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FAnalyticsReserveItem
{
    FString StockpileName;                                                            // 0x0000 (size: 0x10)
    FAnalyticsItem Item;                                                              // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FAnalyticsReserveItemList
{
    FString StockpileName;                                                            // 0x0000 (size: 0x10)
    FAnalyticsItemList ItemList;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAnalyticsTeamKillInfo
{
    FString DeadPlayerName;                                                           // 0x0000 (size: 0x10)
    FString DeadPlayerOnlineID;                                                       // 0x0010 (size: 0x10)
    FString TeamKillSource;                                                           // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAnalyticsUnstuckInfo
{
    FVector NewLocation;                                                              // 0x0000 (size: 0xC)
    int32 NumUnstuckCommandsUsed;                                                     // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAnalyticsVehicleWrenchUnlockedInfo
{
    FName VehicleCodeName;                                                            // 0x0000 (size: 0x8)
    int16 SquadId;                                                                    // 0x0008 (size: 0x2)
    EFactionId FactionId;                                                             // 0x000A (size: 0x1)
    FString LastDriverOnlineID;                                                       // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAnalyticsWhisperInfo
{
    EChatLanguage ChatLanguage;                                                       // 0x0000 (size: 0x1)
    FString TargetOnlineID;                                                           // 0x0008 (size: 0x10)
    FString TargetPlayerName;                                                         // 0x0018 (size: 0x10)
    FString Message;                                                                  // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FArmourDirectionBoneNamesList
{
    EArmourDirection ArmourDirection;                                                 // 0x0000 (size: 0x1)
    TArray<FName> BoneNamesList;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FArmourProfile : public FTableRowBase
{
    float SuppressionModifier;                                                        // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FAssemblyItem
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int32 Duration;                                                                   // 0x0008 (size: 0x4)
    FName RequiredCodeName;                                                           // 0x000C (size: 0x8)

}; // Size: 0x14

struct FAssemblyModification
{
    TArray<FAssemblyItem> AssemblyItems;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAssignSquadOfficerToLeaderWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString OfficerOnlineId;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBallastInfo
{
    EBallastType Type;                                                                // 0x0000 (size: 0x1)
    FVector Offset;                                                                   // 0x0004 (size: 0xC)
    float FloodRate;                                                                  // 0x0010 (size: 0x4)
    float BlowRate;                                                                   // 0x0014 (size: 0x4)
    float BlowRateNoElectricity;                                                      // 0x0018 (size: 0x4)
    float BlowElectricityCost;                                                        // 0x001C (size: 0x4)
    float FloodedMass;                                                                // 0x0020 (size: 0x4)
    float TargetFloodPercent;                                                         // 0x0024 (size: 0x4)
    float FloodPercent;                                                               // 0x0028 (size: 0x4)

}; // Size: 0x2C

struct FBanReasonInfo
{
    EBanReason BanReason;                                                             // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FBaseStyle : public FSlateWidgetStyle
{
    FBuildStyle BuildStyle;                                                           // 0x0008 (size: 0x4C8)
    FContainerStyle ContainerStyle;                                                   // 0x04D0 (size: 0x338)
    FFacilityStyle FacilityStyle;                                                     // 0x0808 (size: 0xAF0)
    FFuelStyle FuelStyle;                                                             // 0x12F8 (size: 0x278)
    FSlateBrush ListEntryBGImage;                                                     // 0x1570 (size: 0x88)
    FSlateBrush ListEntryHighlightBGImage;                                            // 0x15F8 (size: 0x88)
    FSlateBrush AlternatingRowLightColour;                                            // 0x1680 (size: 0x88)
    FSlateBrush EquipmentSilhouetteMale;                                              // 0x1708 (size: 0x88)
    FSlateBrush EquipmentSilhouetteFemale;                                            // 0x1790 (size: 0x88)
    FScrollBarStyle BasicScrollBarStyle;                                              // 0x1818 (size: 0x4D0)
    FButtonStyle BasicIconButtonStyle;                                                // 0x1CE8 (size: 0x278)
    FButtonStyle InvariantBasicIconButtonStyle;                                       // 0x1F60 (size: 0x278)
    FButtonStyle ExpandButtonStyle;                                                   // 0x21D8 (size: 0x278)
    FButtonStyle CollapseButtonStyle;                                                 // 0x2450 (size: 0x278)
    FButtonStyle NextButtonStyle;                                                     // 0x26C8 (size: 0x278)
    FButtonStyle PrevButtonStyle;                                                     // 0x2940 (size: 0x278)
    FButtonStyle NoBGIconButtonStyle;                                                 // 0x2BB8 (size: 0x278)
    FButtonStyles ButtonStyles;                                                       // 0x2E30 (size: 0x9E0)
    FTextStyles TextStyles;                                                           // 0x3810 (size: 0x1CF0)
    FLogStyle LogStyle;                                                               // 0x5500 (size: 0xA0)
    FQueueStyle QueueStyle;                                                           // 0x55A0 (size: 0x1410)
    FIconsStyle IconsStyle;                                                           // 0x69B0 (size: 0xE58)
    FInputStyle InputStyle;                                                           // 0x7808 (size: 0x110)
    FInventoryStyle InventoryStyle;                                                   // 0x7918 (size: 0xB8)
    FItemStyle ItemStyle;                                                             // 0x79D0 (size: 0x1A0)
    FItemSubtypeStyle ItemSubtypeStyle;                                               // 0x7B70 (size: 0x38)
    FStatusStyle StatusEntriesStyle;                                                  // 0x7BA8 (size: 0x908)
    FActionsStyle ActionEntriesStyle;                                                 // 0x84B0 (size: 0xACA8)
    FColorsStyle ColorsStyle;                                                         // 0x13158 (size: 0x300)
    FDialogBoxStyle DialogBoxStyle;                                                   // 0x13458 (size: 0xD78)
    FProgressBarButtonStyle ProgressBarButtonStyle;                                   // 0x141D0 (size: 0x388)
    FButtonStyle PrototypeButtonStyle;                                                // 0x14558 (size: 0x278)
    FHelpToolTipStyle HelpToolTipStyle;                                               // 0x147D0 (size: 0x300)
    FHelpToolTipStyle ShortWarHelpToolTipStyle;                                       // 0x14AD0 (size: 0x300)
    FRocketSiteStyle RocketSiteStyle;                                                 // 0x14DD0 (size: 0x230)
    FStaticCheckBoxStyle StaticCheckBoxStyle;                                         // 0x15000 (size: 0x110)
    FInteractContextMenuStyle InteractContextMenuStyle;                               // 0x15110 (size: 0x198)
    float XSpaceBetweenColumns;                                                       // 0x152A8 (size: 0x4)
    float YSpaceBetweenWidgets;                                                       // 0x152AC (size: 0x4)
    float SimScreenSideColumnWidth;                                                   // 0x152B0 (size: 0x4)
    float SimScreenCenterColumnWidth;                                                 // 0x152B4 (size: 0x4)
    float SimScreenColumnHeight;                                                      // 0x152B8 (size: 0x4)
    float BackgroundBlurStrength;                                                     // 0x152BC (size: 0x4)
    FComboBoxStyle DropdownStyle;                                                     // 0x152C0 (size: 0x3D8)
    FTableRowStyle DropdownRowStyle;                                                  // 0x15698 (size: 0x7C8)
    FListViewStyle ListViewStyle;                                                     // 0x15E60 (size: 0xB70)
    FFactionSelectStyle FactionSelectStyle;                                           // 0x169D0 (size: 0x5A0)
    FLobbyStyle LobbyStyle;                                                           // 0x16F70 (size: 0x3B0)
    FSquadStyle SquadStyle;                                                           // 0x17320 (size: 0x1738)
    FTechTreeStyle TechTreeComponentStyle;                                            // 0x18A58 (size: 0x660)
    FTechTreeStyle TechTreeStyle;                                                     // 0x190B8 (size: 0x660)
    FHospitalStyle HospitalStyle;                                                     // 0x19718 (size: 0x198)
    FInfrastructuresStyle InfrastructuresStyle;                                       // 0x198B0 (size: 0x23A0)
    FWarStandardColour StandardColour;                                                // 0x1BC50 (size: 0x70)
    FReserveStockpileStyle ReserveStockpileStyle;                                     // 0x1BCC0 (size: 0x1078)
    FWarAchievementsStyle WarAchievementsStyle;                                       // 0x1CD38 (size: 0x98)
    FSlateBrush FactionIcons;                                                         // 0x1CDD0 (size: 0x110)
    FSlateBrush PlayerOnlineStatusIcons;                                              // 0x1CEE0 (size: 0x220)
    FGeneralPurposeIcons GeneralPurposeIcons;                                         // 0x1D100 (size: 0x88)
    FWeatherStyle WeatherStyle;                                                       // 0x1D188 (size: 0x778)
    FListeningAreaStyle ListeningAreaStyle;                                           // 0x1D900 (size: 0x88)
    FGearboxStyle GearboxStyle;                                                       // 0x1D988 (size: 0x110)
    FButtonStyle ItemHolderSortButtonStyle;                                           // 0x1DA98 (size: 0x278)
    FSearchBarStyle MapSearchBarStyle;                                                // 0x1DD10 (size: 0x1170)

}; // Size: 0x1EE80

struct FBatchModifiedRegimentIdMessage
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    int8 FactionId;                                                                   // 0x0004 (size: 0x1)
    TArray<FString> OnlineIdList;                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBatchRegimentIdRequest
{
    int32 RequestID;                                                                  // 0x0000 (size: 0x4)
    TArray<FString> OnlineIds;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBatchRegimentIdResponse
{
    int32 RequestID;                                                                  // 0x0000 (size: 0x4)
    TArray<int32> RegimentIds;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBenchmarkReplay
{
    FVector StartPosition;                                                            // 0x0000 (size: 0xC)
    FRotator StartRotation;                                                           // 0x000C (size: 0xC)
    TArray<FBenchmarkReplayFrame> Frames;                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FBenchmarkReplayFrame
{
    int32 Frame;                                                                      // 0x0000 (size: 0x4)
    FVector Input;                                                                    // 0x0004 (size: 0xC)
    bool bWantsToSprint;                                                              // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FBorderBaseInfo
{
    EWorldConquestMapId BorderMapID;                                                  // 0x0000 (size: 0x1)
    EHexDirection HexDirection;                                                       // 0x0001 (size: 0x1)
    uint8 RoadID;                                                                     // 0x0002 (size: 0x1)
    FDateTime NextClaimTime;                                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBridgeSideState
{
    bool bIsControlEnabled;                                                           // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FBuildFootprintInfo
{
    bool bCheckForLandscape;                                                          // 0x0000 (size: 0x1)
    bool bCheckForObstructions;                                                       // 0x0001 (size: 0x1)
    uint8 IgnoreMask;                                                                 // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FBuildResponse
{
    EBuildResponse Result;                                                            // 0x0000 (size: 0x1)
    EPlacementStatus PlacementStatus;                                                 // 0x0001 (size: 0x1)
    class AStructure* Structure;                                                      // 0x0008 (size: 0x8)
    FName CodeName;                                                                   // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FBuildSocketTag
{
    int64 SocketTypeMask;                                                             // 0x0000 (size: 0x8)
    int64 SocketTypeCategory;                                                         // 0x0008 (size: 0x8)
    FName Tag;                                                                        // 0x0010 (size: 0x8)
    FName ShowsTag;                                                                   // 0x0018 (size: 0x8)
    FName ShowsTagBoth;                                                               // 0x0020 (size: 0x8)
    FName ShowsTagHigher;                                                             // 0x0028 (size: 0x8)
    FName HidesTagBoth;                                                               // 0x0030 (size: 0x8)
    FName HidesTagHigher;                                                             // 0x0038 (size: 0x8)
    float MaxZOffset;                                                                 // 0x0040 (size: 0x4)
    EBuildSocketTagRule ApplicationRule;                                              // 0x0044 (size: 0x4)
    FName ConnectorAttachmentTag;                                                     // 0x0048 (size: 0x8)
    bool bIgnoreHidesTag;                                                             // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FBuildStyle
{
    FSlateBrush Categories;                                                           // 0x0000 (size: 0x4C8)

}; // Size: 0x4C8

struct FButtonStyles
{
    FButtonStyle OrangeHighlight;                                                     // 0x0000 (size: 0x278)
    FButtonStyle NoBGOrangeHighlight;                                                 // 0x0278 (size: 0x278)
    FButtonStyle Grey;                                                                // 0x04F0 (size: 0x278)
    FButtonStyle Red;                                                                 // 0x0768 (size: 0x278)

}; // Size: 0x9E0

struct FCachedLandscape
{
    FTransform LandscapeActorToWorld;                                                 // 0x0000 (size: 0x30)
    FBox Bounds;                                                                      // 0x0030 (size: 0x1C)
    class ALandscapeProxy* Proxy;                                                     // 0x0050 (size: 0x8)

}; // Size: 0x60

struct FCachedPlayerState
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString DeviceID;                                                                 // 0x0010 (size: 0x10)
    int32 RegimentID;                                                                 // 0x0020 (size: 0x4)
    int32 SquadId;                                                                    // 0x0024 (size: 0x4)
    int8 Level;                                                                       // 0x0028 (size: 0x1)
    int8 Rank;                                                                        // 0x0029 (size: 0x1)
    FString PlayerName;                                                               // 0x0030 (size: 0x10)
    int8 TeamId;                                                                      // 0x0040 (size: 0x1)
    float RecentTeamKills;                                                            // 0x0044 (size: 0x4)
    float RecentFriendlyCharacterDamage;                                              // 0x0048 (size: 0x4)
    float RecentFriendlyStructureDamage;                                              // 0x004C (size: 0x4)
    float RecentFriendlyVehicleDamage;                                                // 0x0050 (size: 0x4)
    int16 RecentNameChanges;                                                          // 0x0054 (size: 0x2)
    FDateTime TimeWhenCached;                                                         // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FCachedWorldStructure
{
    TSubclassOf<class AStructure> StructureClass;                                     // 0x0000 (size: 0x8)
    FVector WorldPosition;                                                            // 0x0008 (size: 0xC)

}; // Size: 0x18

struct FCalloutInfo
{
    FText Message;                                                                    // 0x0000 (size: 0x18)
    bool RequiresWorldMarker;                                                         // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FCharacterConditions
{
    EEquippedWeaponGripType GripType;                                                 // 0x0000 (size: 0x1)
    EWeatherType WeatherType;                                                         // 0x0001 (size: 0x1)
    float MaxVelocity;                                                                // 0x0004 (size: 0x4)
    float TriggerChance;                                                              // 0x0008 (size: 0x4)
    bool bRequiresGripType;                                                           // 0x000C (size: 0x1)
    bool bRequiresWeather;                                                            // 0x000D (size: 0x1)
    bool bRequiresWarming;                                                            // 0x000E (size: 0x1)

}; // Size: 0x10

struct FCharacterCustomizationInfo
{
    bool bIsFemale;                                                                   // 0x0000 (size: 0x1)
    int8 SkinTone;                                                                    // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FCharacterInvokeInfo
{
    FVector_NetQuantize ImpactPoint;                                                  // 0x0000 (size: 0xC)
    FMuzzleOffsetVector_NetQuantize MuzzleOffset;                                     // 0x000C (size: 0xC)
    FQuantizedTimestamp RenderTimestamp;                                              // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FCharacterRenderInfo
{
    class USkeletalMesh* Torso;                                                       // 0x0000 (size: 0x8)
    class UMaterialInterface* TorsoMaterial;                                          // 0x0008 (size: 0x8)
    class USkeletalMesh* Legs;                                                        // 0x0010 (size: 0x8)
    class UMaterialInterface* LegsMaterial;                                           // 0x0018 (size: 0x8)
    class USkeletalMesh* Back;                                                        // 0x0020 (size: 0x8)
    class UMaterialInterface* BackMaterial;                                           // 0x0028 (size: 0x8)
    class USkeletalMesh* Head;                                                        // 0x0030 (size: 0x8)
    class UMaterialInterface* HeadMaterial;                                           // 0x0038 (size: 0x8)
    class USkeletalMesh* Hands;                                                       // 0x0040 (size: 0x8)
    class UMaterialInterface* HandsMaterial;                                          // 0x0048 (size: 0x8)
    class USkeletalMesh* Helmet;                                                      // 0x0050 (size: 0x8)
    bool bCanUpdateHeadSkinTone;                                                      // 0x0058 (size: 0x1)
    bool bCanUpdateHandSkinTone;                                                      // 0x0059 (size: 0x1)

}; // Size: 0x60

struct FCharacterSkinToneInfo
{
    class UMaterialInstance* HeadMaterial;                                            // 0x0000 (size: 0x8)
    class UMaterialInstance* HandsMaterial;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FChatChannelStyle
{
    FRichTextFieldColor Color;                                                        // 0x0000 (size: 0x20)
    FRichTextFieldColor MessageColor;                                                 // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FChatStyle
{
    TMap<class EChatChannel, class FChatChannelStyle> ChannelStyleMap;                // 0x0000 (size: 0x50)
    FRichTextFieldColor EnemyNameColor;                                               // 0x0050 (size: 0x20)

}; // Size: 0x70

struct FCheatDisbandRegimentRequest
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    int32 RegimentID;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FCheatDisbandRegimentResponse
{
    FCheatDisbandRegimentRequest Request;                                             // 0x0000 (size: 0xC)
    FString RegimentName;                                                             // 0x0010 (size: 0x10)
    FString RegimentTag;                                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCheatEditRegimentRequest
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    int32 RegimentID;                                                                 // 0x0008 (size: 0x4)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    FString Tag;                                                                      // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCheatEditRegimentResponse
{
    FCheatEditRegimentRequest Request;                                                // 0x0000 (size: 0x30)

}; // Size: 0x30

struct FCheatGetRegimentInfoRequest
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    ERegimentQueryType QueryType;                                                     // 0x0008 (size: 0x1)
    FString QueryValue;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCheatGetRegimentInfoResponse
{
    FCheatGetRegimentInfoRequest Request;                                             // 0x0000 (size: 0x20)
    TArray<FRegiment> RegimentList;                                                   // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCheatGetSquadInfoRequest
{
    FString AdminOnlineID;                                                            // 0x0000 (size: 0x10)
    FString TargetOnlineID;                                                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCheatGetSquadInfoResponse
{
    FCheatGetSquadInfoRequest CheatGetSquadInfoRequest;                               // 0x0000 (size: 0x20)
    int32 ExpectedSquadId;                                                            // 0x0020 (size: 0x4)
    TArray<int32> ColonialSquadIds;                                                   // 0x0028 (size: 0x10)
    TArray<int32> WardenSquadIds;                                                     // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FCheatMakeRegimentCommanderRequest
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    FString CurrentCommanderOnlineID;                                                 // 0x0008 (size: 0x10)
    FString NewCommanderOnlineID;                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCheatMakeRegimentCommanderResponse
{
    FCheatMakeRegimentCommanderRequest Request;                                       // 0x0000 (size: 0x28)
    bool bIsSuccess;                                                                  // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FCheatRemoveFromRegimentRequest
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    FString TargetOnlineID;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCheatRemoveFromRegimentResponse
{
    FCheatRemoveFromRegimentRequest Request;                                          // 0x0000 (size: 0x18)
    bool bIsSuccess;                                                                  // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FCheatRemoveFromSquadRequest
{
    FString AdminOnlineID;                                                            // 0x0000 (size: 0x10)
    FString TargetOnlineID;                                                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FCheatRemoveFromSquadResponse
{
    FCheatRemoveFromSquadRequest CheatRemoveFromSquadRequest;                         // 0x0000 (size: 0x20)
    TArray<int32> RemovedFromColonialSquadIds;                                        // 0x0020 (size: 0x10)
    TArray<int32> RemovedFromWardenSquadIds;                                          // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FCheatViewRegimentInfoRequest
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    int32 RegimentID;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FCheatViewRegimentInfoResponse
{
    FCheatViewRegimentInfoRequest Request;                                            // 0x0000 (size: 0xC)
    FString RegimentName;                                                             // 0x0010 (size: 0x10)
    FString RegimentTag;                                                              // 0x0020 (size: 0x10)
    FString Link;                                                                     // 0x0030 (size: 0x10)
    EFactionId FactionId;                                                             // 0x0040 (size: 0x1)
    int32 Members;                                                                    // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FCheatViewSquadInfoRequest
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    int32 SquadId;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FCheatViewSquadInfoResponse
{
    FUObjectHandle Admin;                                                             // 0x0000 (size: 0x8)
    int32 SquadId;                                                                    // 0x0008 (size: 0x4)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    FString LeaderOnlineID;                                                           // 0x0020 (size: 0x10)
    FString LeaderName;                                                               // 0x0030 (size: 0x10)
    int16 MemberCount;                                                                // 0x0040 (size: 0x2)
    int16 InactiveMemberCount;                                                        // 0x0042 (size: 0x2)

}; // Size: 0x48

struct FClaimStatus
{
    bool bIsEnabled;                                                                  // 0x0000 (size: 0x1)
    bool bAllowReclaim;                                                               // 0x0001 (size: 0x1)
    bool bCanBeDemolished;                                                            // 0x0002 (size: 0x1)
    bool bCanBuildSiteBeDemolished;                                                   // 0x0003 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0004 (size: 0x1)
    int32 SquadId;                                                                    // 0x0008 (size: 0x4)
    int64 ClaimTime;                                                                  // 0x0010 (size: 0x8)
    int64 OriginalBuildTime;                                                          // 0x0018 (size: 0x8)
    int16 ClaimDurationHours;                                                         // 0x0020 (size: 0x2)
    int16 DemolishDurationHours;                                                      // 0x0022 (size: 0x2)

}; // Size: 0x28

struct FClearSquadsConditionalWarMessage
{
    int32 MinAgeMinutes;                                                              // 0x0000 (size: 0x4)
    int32 MaxHistoricalPlayers;                                                       // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FClientShardConfig
{
    int32 PopulationCap;                                                              // 0x0000 (size: 0x4)
    int32 RequiredVictoryTowns;                                                       // 0x0004 (size: 0x4)
    int32 ShortRequiredVictoryTowns;                                                  // 0x0008 (size: 0x4)
    FDateTime ScheduledConquestStartTime;                                             // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCodeNameQuantity
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int32 Quantity;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FCodeNameSmallQuantity
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int16 Quantity;                                                                   // 0x0008 (size: 0x2)

}; // Size: 0xC

struct FColorsStyle
{
    FSlateBrush ButtonBackground;                                                     // 0x0000 (size: 0x88)
    FButtonStyle Button;                                                              // 0x0088 (size: 0x278)

}; // Size: 0x300

struct FCommendHistory
{
    FString CommendedPlayerID;                                                        // 0x0000 (size: 0x10)
    int32 NumCommends;                                                                // 0x0010 (size: 0x4)
    int64 LastCommendUnixTimestamp;                                                   // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FCommsRating
{
    ECommsRatingCondition Condition;                                                  // 0x0010 (size: 0x1)

}; // Size: 0x20

struct FCommsRatingChatVoteInfo
{
}; // Size: 0x18

struct FConcreteSettler
{
    int64 StartTimeDateTimeTicks;                                                     // 0x0000 (size: 0x8)
    bool bEnabled;                                                                    // 0x0008 (size: 0x1)
    float ConcreteSettleDurationMins;                                                 // 0x000C (size: 0x4)
    float RoughnessStart;                                                             // 0x0010 (size: 0x4)
    float RoughnessEnd;                                                               // 0x0014 (size: 0x4)
    FLinearColor ColourStart;                                                         // 0x0018 (size: 0x10)
    FLinearColor ColourEnd;                                                           // 0x0028 (size: 0x10)

}; // Size: 0x48

struct FConnectionRule
{
    bool bDirectional;                                                                // 0x0000 (size: 0x1)
    ESocketDirection Direction;                                                       // 0x0004 (size: 0x4)
    int64 SocketTypeMask;                                                             // 0x0008 (size: 0x8)
    TArray<FName> ShowsTags;                                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FConnectorConfiguration
{
    int8 SocketIndex;                                                                 // 0x0000 (size: 0x1)
    FVector TargetLocation;                                                           // 0x0004 (size: 0xC)
    FQuat TargetRotation;                                                             // 0x0010 (size: 0x10)
    uint8 CustomData;                                                                 // 0x0020 (size: 0x1)
    EConnectorConfigurationFlag Flags;                                                // 0x0021 (size: 0x1)

}; // Size: 0x30

struct FConquestOverNotificationInfo
{
    uint8 ConquestWinner;                                                             // 0x0000 (size: 0x1)
    int8 NumColonialAchievements;                                                     // 0x0001 (size: 0x1)
    int8 NumWardenAchievements;                                                       // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FConstructionEquipmentConfig
{
    float MaxDeltaAngleToIgnoreRotation;                                              // 0x0000 (size: 0x4)
    float ScoopingAnimHalfwayDuration;                                                // 0x0004 (size: 0x4)
    float ScoopingAnimCompletionDuration;                                             // 0x0008 (size: 0x4)
    float MinAnimDuration;                                                            // 0x000C (size: 0x4)
    float MaxAnimDuration;                                                            // 0x0010 (size: 0x4)
    float ScoopDoorOpenDuration;                                                      // 0x0014 (size: 0x4)
    float MaterialDropDuration;                                                       // 0x0018 (size: 0x4)
    float MinScoopRotation;                                                           // 0x001C (size: 0x4)
    float MaxScoopRotation;                                                           // 0x0020 (size: 0x4)
    float MinScoopDoorRotation;                                                       // 0x0024 (size: 0x4)
    float MaxScoopDoorRotation;                                                       // 0x0028 (size: 0x4)
    float MinDistance;                                                                // 0x002C (size: 0x4)
    float MaxDistance;                                                                // 0x0030 (size: 0x4)
    float MinHeight;                                                                  // 0x0034 (size: 0x4)
    float MaxHeight;                                                                  // 0x0038 (size: 0x4)
    float StartingScoopDoorRotation;                                                  // 0x003C (size: 0x4)
    float StartingScoopRotation;                                                      // 0x0040 (size: 0x4)
    float StartingHeight;                                                             // 0x0044 (size: 0x4)
    float StartingDistance;                                                           // 0x0048 (size: 0x4)
    float StartingRotation;                                                           // 0x004C (size: 0x4)
    float ScoopingAnimStartHeight;                                                    // 0x0050 (size: 0x4)
    float ScoopingAnimMidHeight;                                                      // 0x0054 (size: 0x4)
    float ScoopingAnimStartDistance;                                                  // 0x0058 (size: 0x4)
    float ScoopingAnimEndDistance;                                                    // 0x005C (size: 0x4)
    float ScoopingAnimStartScoopRotation;                                             // 0x0060 (size: 0x4)
    float ScoopingAnimEndScoopRotation;                                               // 0x0064 (size: 0x4)
    float DumpMaterialHeight;                                                         // 0x0068 (size: 0x4)
    int32 GhostMaterialIndices;                                                       // 0x006C (size: 0x8)
    class UMaterial* GhostMaterial;                                                   // 0x0078 (size: 0x8)
    class UStaticMesh* ScoopMaterialMesh;                                             // 0x0080 (size: 0x8)
    FVector2D ArmHalfDimensions;                                                      // 0x0088 (size: 0x8)
    float ScoopRadius;                                                                // 0x0090 (size: 0x4)

}; // Size: 0x98

struct FConstructionEquipmentServerState
{
    TWeakObjectPtr<class ABuildSite> TargetBuildSite;                                 // 0x0000 (size: 0x8)
    float ServerTimestamp;                                                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FContainerStyle
{
    float HeaderHeight;                                                               // 0x0000 (size: 0x4)
    FSlateBrush HeaderImage;                                                          // 0x0008 (size: 0x88)
    FSlateBrush VeryLightContentImage;                                                // 0x0090 (size: 0x88)
    FSlateBrush LightContentImage;                                                    // 0x0118 (size: 0x88)
    FSlateBrush ContentImage;                                                         // 0x01A0 (size: 0x88)
    FSlateBrush DarkContentImage;                                                     // 0x0228 (size: 0x88)
    FSlateBrush CategoryImage;                                                        // 0x02B0 (size: 0x88)

}; // Size: 0x338

struct FContextMenuStyle
{
    FSlateBrush WhisperOnIcon;                                                        // 0x0000 (size: 0x88)
    FSlateBrush CommendOnIcon;                                                        // 0x0088 (size: 0x88)
    FSlateBrush VoteKickOnIcon;                                                       // 0x0110 (size: 0x88)
    FSlateBrush ViolationLogIcon;                                                     // 0x0198 (size: 0x88)
    FSlateBrush VoiceMuteOnIcon;                                                      // 0x0220 (size: 0x88)
    FSlateBrush VoiceMuteOffIcon;                                                     // 0x02A8 (size: 0x88)
    FSlateBrush MuteOffIcon;                                                          // 0x0330 (size: 0x88)
    FSlateBrush MuteOnIcon;                                                           // 0x03B8 (size: 0x88)
    FSlateBrush SquadInviteOnIcon;                                                    // 0x0440 (size: 0x88)
    FSlateBrush RegimentInviteIcon;                                                   // 0x04C8 (size: 0x88)
    FSlateBrush RegimentPromoteIcon;                                                  // 0x0550 (size: 0x88)
    FSlateBrush RegimentDemoteIcon;                                                   // 0x05D8 (size: 0x88)
    FSlateBrush RegimentDischargeIcon;                                                // 0x0660 (size: 0x88)
    FTextBlockStyle MenuLabel;                                                        // 0x06E8 (size: 0x268)
    FTextBlockStyle MenuHeading;                                                      // 0x0950 (size: 0x268)
    FSlateBrush MenuBackground;                                                       // 0x0BB8 (size: 0x88)
    FTextBlockStyle MenuKeybinding;                                                   // 0x0C40 (size: 0x268)
    FCheckBoxStyle MenuCheckbox;                                                      // 0x0EA8 (size: 0x580)

}; // Size: 0x1428

struct FControlSurface
{
    FVector Verts;                                                                    // 0x0000 (size: 0x30)
    FVector Pivot;                                                                    // 0x0030 (size: 0xC)
    FVector2D Dimensions;                                                             // 0x003C (size: 0x8)
    bool bVertical;                                                                   // 0x0044 (size: 0x1)
    bool bInvertedControls;                                                           // 0x0045 (size: 0x1)

}; // Size: 0x48

struct FControlsPage
{
    TArray<FControlsPageRow> MainColumn;                                              // 0x0000 (size: 0x10)
    TArray<FControlsPageRow> AltColumn;                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FControlsPageEntry
{
    TArray<FControlsPageEntryHotkey> Hotkeys;                                         // 0x0000 (size: 0x10)
    FSlateBrush OptionalImage;                                                        // 0x0010 (size: 0x88)

}; // Size: 0x98

struct FControlsPageEntryHotkey
{
    FSlateBrush Icon;                                                                 // 0x0000 (size: 0x88)
    FText IconText;                                                                   // 0x0088 (size: 0x18)
    FText Text;                                                                       // 0x00A0 (size: 0x18)

}; // Size: 0xB8

struct FControlsPageRow
{
    TArray<FControlsPageEntry> Entries;                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FConversionItem
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int32 Quantity;                                                                   // 0x0008 (size: 0x4)
    int32 Limit;                                                                      // 0x000C (size: 0x4)

}; // Size: 0x10

struct FConversionLiquid
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    float Quantity;                                                                   // 0x0008 (size: 0x4)
    float Limit;                                                                      // 0x000C (size: 0x4)

}; // Size: 0x10

struct FCraneComponentConfig
{
    TSubclassOf<class AGlobalShippableInfo> GlobalShippableInfo;                      // 0x0000 (size: 0x8)
    TSubclassOf<class ACraneMarker> AimMarker;                                        // 0x0008 (size: 0x8)
    class UMaterial* GhostMaterial;                                                   // 0x0010 (size: 0x8)
    int32 GhostMaterialIndices;                                                       // 0x0018 (size: 0x8)
    class USoundCue* ArmMovementSFXLoop;                                              // 0x0020 (size: 0x8)
    class USoundCue* DeployingSFXLoop;                                                // 0x0028 (size: 0x8)
    class USoundCue* PulleyMovementSFXLoop;                                           // 0x0030 (size: 0x8)
    class USoundCue* DeployedSFXTrigger;                                              // 0x0038 (size: 0x8)
    class USoundCue* PickUpSFXTrigger;                                                // 0x0040 (size: 0x8)
    class USoundCue* DropOffSFXTrigger;                                               // 0x0048 (size: 0x8)
    EShippableType MaxUndeployedShippableSize;                                        // 0x0050 (size: 0x1)
    float DeployedCameraViewRadius;                                                   // 0x0054 (size: 0x4)
    float MinHorizontalDistanceToTarget;                                              // 0x0058 (size: 0x4)
    float MaxHorizontalDistanceToTarget;                                              // 0x005C (size: 0x4)
    float MaxHeight;                                                                  // 0x0060 (size: 0x4)
    float PulleyOffset;                                                               // 0x0064 (size: 0x4)
    float DefaultCabRotationZ;                                                        // 0x0068 (size: 0x4)
    float MinCabRotationZ;                                                            // 0x006C (size: 0x4)
    float MaxCabRotationZ;                                                            // 0x0070 (size: 0x4)
    float CabRotationSpeed;                                                           // 0x0074 (size: 0x4)
    float CabRotationSpeedWithShippable;                                              // 0x0078 (size: 0x4)
    float HorizontalArmSpeed;                                                         // 0x007C (size: 0x4)
    float HorizontalArmSpeedWithShippable;                                            // 0x0080 (size: 0x4)
    float VerticalArmSpeed;                                                           // 0x0084 (size: 0x4)
    float VerticalArmSpeedWithShippable;                                              // 0x0088 (size: 0x4)
    float PulleySpeed;                                                                // 0x008C (size: 0x4)
    float PulleySpeedWithShippable;                                                   // 0x0090 (size: 0x4)
    float HookRotationSpeed;                                                          // 0x0094 (size: 0x4)
    float HookRotationSpeedWithShippable;                                             // 0x0098 (size: 0x4)
    FVector2D ArmHalfDimensions;                                                      // 0x009C (size: 0x8)
    FName ArmStartSocketName;                                                         // 0x00A4 (size: 0x8)
    FName ArmEndSocketName;                                                           // 0x00AC (size: 0x8)
    bool bIsAlwaysDeployed;                                                           // 0x00B4 (size: 0x1)
    bool bRequiresPower;                                                              // 0x00B5 (size: 0x1)
    bool bUseClosestCabRotationZ;                                                     // 0x00B6 (size: 0x1)
    bool bAllowsInventoryAccess;                                                      // 0x00B7 (size: 0x1)

}; // Size: 0xB8

struct FCraneComponents
{
    class USkeletalMeshComponent* MainMesh;                                           // 0x0000 (size: 0x8)
    class UStaticMeshComponent* BaseMesh;                                             // 0x0008 (size: 0x8)
    class UStaticMeshComponent* RopeMesh;                                             // 0x0010 (size: 0x8)
    class UBoxComponent* ShippableCollision;                                          // 0x0018 (size: 0x8)
    class UAudioComponent* ArmMovementSFXLoop;                                        // 0x0020 (size: 0x8)
    class UAudioComponent* DeployingSFXLoop;                                          // 0x0028 (size: 0x8)
    class UAudioComponent* PulleyMovementSFXLoop;                                     // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FCraterInfo
{
    TSubclassOf<class ACrater> Crater;                                                // 0x0000 (size: 0x8)
    TArray<class UPhysicalMaterial*> BlockingPhysicalMaterials;                       // 0x0008 (size: 0x10)
    float Radius;                                                                     // 0x0018 (size: 0x4)
    float OuterRadius;                                                                // 0x001C (size: 0x4)
    float SpawnWeight;                                                                // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FCraterMeshStop
{
    float Length;                                                                     // 0x0000 (size: 0x4)
    class UStaticMesh* StaticMesh;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCreateDebugMapPostRequest
{
    FCreateMapPostRequest Request;                                                    // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FCreateMapPostRequest
{
    FString Text;                                                                     // 0x0000 (size: 0x10)
    FVector2D NormalizedMapCoords;                                                    // 0x0010 (size: 0x8)
    int8 MapId;                                                                       // 0x0018 (size: 0x1)
    EMapPostType MapPostType;                                                         // 0x0019 (size: 0x1)
    EFacilityMapPostType FacilityMapPostType;                                         // 0x001A (size: 0x1)
    bool bIsModModeOn;                                                                // 0x001B (size: 0x1)
    int32 GroupId;                                                                    // 0x001C (size: 0x4)

}; // Size: 0x20

struct FCreateRegimentWarMessage
{
    FString Name;                                                                     // 0x0000 (size: 0x10)
    FString Tag;                                                                      // 0x0010 (size: 0x10)
    FString Link;                                                                     // 0x0020 (size: 0x10)
    int8 FactionId;                                                                   // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FCreateSquadWarMessage
{
    FString Name;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCrossRegionActorData
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FVector2D OriginLocation;                                                         // 0x0004 (size: 0x8)
    float OriginLocationZ;                                                            // 0x000C (size: 0x4)
    FRotator Rotation;                                                                // 0x0010 (size: 0xC)
    TArray<uint8> Serialized;                                                         // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FCrossRegionSerializedActor
{
    UClass* ActorClass;                                                               // 0x0000 (size: 0x8)
    TArray<uint8> ActorBytes;                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCursorStyle
{
    FSlateBrush Brush;                                                                // 0x0000 (size: 0x88)
    FVector2D Offset;                                                                 // 0x0088 (size: 0x8)

}; // Size: 0x90

struct FDamageAttributes
{
    TSubclassOf<class AWeaponFireFX> WeaponFireFXClass;                               // 0x0000 (size: 0x8)
    TSubclassOf<class AImpactEffect> ImpactEffect;                                    // 0x0008 (size: 0x8)
    TSubclassOf<class USimDamageType> DamageType;                                     // 0x0010 (size: 0x8)
    class USoundCue* ShotSoundCue;                                                    // 0x0018 (size: 0x8)
    class UParticleSystem* MuzzleFlashPS;                                             // 0x0020 (size: 0x8)
    float WeaponDamage;                                                               // 0x0028 (size: 0x4)
    float BestJitterConeHalfAngle;                                                    // 0x002C (size: 0x4)
    float WorstJitterConeHalfAngle;                                                   // 0x0030 (size: 0x4)
    float FiringPeriod;                                                               // 0x0034 (size: 0x4)
    float TimeToFullFireRateAndAccuracy;                                              // 0x0038 (size: 0x4)
    float EnemyPursueDuration;                                                        // 0x003C (size: 0x4)
    float ArmourDamageModifier;                                                       // 0x0040 (size: 0x4)
    float TargetStabilityReductionPerShot;                                            // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FDamageMitigation
{
    float Mitigation;                                                                 // 0x0000 (size: 0x4)
    class USoundBase* SFX;                                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDamageProfile : public FTableRowBase
{
    float LightVehicle;                                                               // 0x0008 (size: 0x4)
    float Tier1Tank;                                                                  // 0x000C (size: 0x4)
    float Tier2Tank;                                                                  // 0x0010 (size: 0x4)
    float Tier0Structure;                                                             // 0x0014 (size: 0x4)
    float Tier1Structure;                                                             // 0x0018 (size: 0x4)
    float Tier2Structure;                                                             // 0x001C (size: 0x4)
    float Tier2BStructure;                                                            // 0x0020 (size: 0x4)
    float Tier3Structure;                                                             // 0x0024 (size: 0x4)
    float Tier3BStructure;                                                            // 0x0028 (size: 0x4)
    float HeavyBuildSite;                                                             // 0x002C (size: 0x4)
    float Tier1GarrisonHouse;                                                         // 0x0030 (size: 0x4)
    float Tier2GarrisonHouse;                                                         // 0x0034 (size: 0x4)
    float Tier3GarrisonHouse;                                                         // 0x0038 (size: 0x4)
    float Trench;                                                                     // 0x003C (size: 0x4)
    float Tier1LargeShip;                                                             // 0x0040 (size: 0x4)
    float Tier1Ship;                                                                  // 0x0044 (size: 0x4)
    float WorldStructureHusk;                                                         // 0x0048 (size: 0x4)
    float Ice;                                                                        // 0x004C (size: 0x4)

}; // Size: 0x50

struct FDayNightCycleCubemapInfo
{
    float SunHeight;                                                                  // 0x0000 (size: 0x4)
    class UTextureCube* CubeMap;                                                      // 0x0008 (size: 0x8)
    float WhiteBalanceTemp;                                                           // 0x0010 (size: 0x4)
    FLinearColor FilmTint;                                                            // 0x0014 (size: 0x10)
    FLinearColor FilmTintShadow;                                                      // 0x0024 (size: 0x10)
    float Saturation;                                                                 // 0x0034 (size: 0x4)
    float Contrast;                                                                   // 0x0038 (size: 0x4)
    float CrushShadows;                                                               // 0x003C (size: 0x4)
    float CrushHighlights;                                                            // 0x0040 (size: 0x4)
    float Toe;                                                                        // 0x0044 (size: 0x4)
    float DirectionalLightTemperature;                                                // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FDecalData
{
    class UMaterialInterface* DecalMaterial;                                          // 0x0000 (size: 0x8)
    FVector DecalSize;                                                                // 0x0008 (size: 0xC)
    float LifeSpan;                                                                   // 0x0014 (size: 0x4)
    float FadeScreenSize;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FDecayInfo
{
    float FractionalSuppliesConsumed;                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FDecayPreventionStructureCounts
{
    int32 PossibleStructureCount;                                                     // 0x0000 (size: 0x4)
    int32 ClosestStructureCount;                                                      // 0x0004 (size: 0x4)
    int32 PreferredStructureCount;                                                    // 0x0008 (size: 0x4)
    int32 PreferredSuppliesPerTick;                                                   // 0x000C (size: 0x4)

}; // Size: 0x10

struct FDeleteMapPostRequest
{
    FString OriginalPosterOnlineId;                                                   // 0x0000 (size: 0x10)
    FString RequesterOnlineID;                                                        // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FDeleteMapPostResponse
{
    bool bSuccess;                                                                    // 0x0000 (size: 0x1)
    FString DeletedPostOwnerOnlineID;                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDenySquadOfficerToLeaderWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FDeployHistory
{
    FDateTime LastDeployTime;                                                         // 0x0000 (size: 0x8)
    FDateTime LastDeployTimeAlt;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDeploymentQueueEntry
{
    class ASimPlayerController* Controller;                                           // 0x0000 (size: 0x8)
    EWorldConquestMapId TargetMapID;                                                  // 0x0008 (size: 0x1)
    FSpawnPoint TravelPoint;                                                          // 0x000C (size: 0x4)
    bool bIsRecovery;                                                                 // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FDeviceIdBanRequest
{
    FString TargetDeviceId;                                                           // 0x0000 (size: 0x10)
    int64 BanDurationSec;                                                             // 0x0010 (size: 0x8)
    int64 UnderReviewDurationSec;                                                     // 0x0018 (size: 0x8)
    EBanReason BanReason;                                                             // 0x0020 (size: 0x1)
    FString AdminOnlineID;                                                            // 0x0028 (size: 0x10)
    FString AdminPlayerName;                                                          // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FDeviceIdBannedMessage
{
    FDeviceIdBanRequest DeviceIdBanRequest;                                           // 0x0000 (size: 0x48)
    bool bIsSenderServer;                                                             // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FDialogBoxStyle
{
    FSlateBrush BackgroundImage;                                                      // 0x0000 (size: 0x88)
    FTextBlockStyle MessageTextStyle;                                                 // 0x0088 (size: 0x268)
    FEditableTextBoxStyle TextInputBoxStyle;                                          // 0x02F0 (size: 0x7F0)
    FTextBlockStyle ButtonTextStyle;                                                  // 0x0AE0 (size: 0x268)
    FSlateColor BackgroundFillColour;                                                 // 0x0D48 (size: 0x28)
    float BackgroundBlurStrength;                                                     // 0x0D70 (size: 0x4)

}; // Size: 0xD78

struct FDisbandRegimentMessage
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FDynamicState
{
    float OpenAnimationDuration;                                                      // 0x0000 (size: 0x4)
    float ClosedAnimationDuration;                                                    // 0x0004 (size: 0x4)
    EDynamicState State;                                                              // 0x0008 (size: 0x1)

}; // Size: 0x18

struct FDynamicTierInfo
{
    bool bIsEnabled;                                                                  // 0x0000 (size: 0x1)
    TSubclassOf<class UWindowMeshSet> WindowMeshSet;                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FEmoteActivityOptions
{
    bool bLockStance;                                                                 // 0x0000 (size: 0x1)
    bool bHideWeapon;                                                                 // 0x0001 (size: 0x1)
    TArray<ESimCharacterStance> AllowedStances;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FEncumbranceManager
{
    bool bEnableItemEncumbrance;                                                      // 0x0000 (size: 0x1)
    bool bEnableMudEncumbrance;                                                       // 0x0001 (size: 0x1)
    FEncumbranceModifiers EncumbranceModifiers;                                       // 0x0004 (size: 0x50)
    int32 CurrentItemEncumbrance;                                                     // 0x0054 (size: 0x4)
    int32 CurrentMudEncumbrance;                                                      // 0x0058 (size: 0x4)

}; // Size: 0x88

struct FEncumbranceModifiers
{
    int32 BaselineEnc;                                                                // 0x0000 (size: 0x4)
    int32 MaxEnc;                                                                     // 0x0004 (size: 0x4)
    float ZeroEncTurnRateMod;                                                         // 0x0008 (size: 0x4)
    float ZeroEncMoveSpeedMod;                                                        // 0x000C (size: 0x4)
    float MaxEncTurnRateMod;                                                          // 0x0010 (size: 0x4)
    float MaxEncWalkingSpeedMod;                                                      // 0x0014 (size: 0x4)
    float MaxEncSprintingStaminaDrainMod;                                             // 0x0018 (size: 0x4)
    float MaxEncStaminaRestoreMod;                                                    // 0x001C (size: 0x4)
    float MaxEncEngineForceModifier;                                                  // 0x0020 (size: 0x4)
    float OverEncWalkingSpeedMod;                                                     // 0x0024 (size: 0x4)
    float OverEncTurnRateMod;                                                         // 0x0028 (size: 0x4)
    float OverEncSprintingStaminaDrainMod;                                            // 0x002C (size: 0x4)
    float OverEncStaminaRestoreMod;                                                   // 0x0030 (size: 0x4)
    float CurrentMaxSpeedMod;                                                         // 0x0034 (size: 0x4)
    float CurrentMaxSprintSpeedMod;                                                   // 0x0038 (size: 0x4)
    float CurrentTurnMod;                                                             // 0x003C (size: 0x4)
    float CurrentSprintingStaminaDrainMod;                                            // 0x0040 (size: 0x4)
    float CurrentStaminaRestoreMod;                                                   // 0x0044 (size: 0x4)
    float CurrentMassAlpha;                                                           // 0x0048 (size: 0x4)
    float CurrentEngineForceModifier;                                                 // 0x004C (size: 0x4)

}; // Size: 0x50

struct FEnvironmentModificationKey
{
}; // Size: 0x8

struct FExplosionMaterialOverride
{
    TEnumAsByte<EPhysicalSurface> PhysicalSurface;                                    // 0x0000 (size: 0x1)
    class UParticleSystem* ExplosionFX;                                               // 0x0008 (size: 0x8)
    class USoundCue* ExplosionSFX;                                                    // 0x0010 (size: 0x8)
    FDecalData Decal;                                                                 // 0x0018 (size: 0x20)

}; // Size: 0x38

struct FExternalWarServiceReplicatedState
{
    FRegimentClientReplicatedState RegimentClientReplicatedState;                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFacilityLightRenderInfo
{
    class UMeshComponent* MeshComponent;                                              // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FFacilityModification
{
    TArray<FMultiConversionInfo> ConversionEntries;                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFacilityRefineryOrder
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    TArray<FCodeNameQuantity> Input;                                                  // 0x0020 (size: 0x10)
    TArray<FCodeNameQuantity> CrateInput;                                             // 0x0030 (size: 0x10)
    TArray<FFuelQuantity> FuelInput;                                                  // 0x0040 (size: 0x10)
    TArray<FCodeNameQuantity> Output;                                                 // 0x0050 (size: 0x10)
    TArray<FCodeNameQuantity> CrateOutput;                                            // 0x0060 (size: 0x10)
    TArray<FFuelQuantity> FuelOutput;                                                 // 0x0070 (size: 0x10)
    int8 Index;                                                                       // 0x0080 (size: 0x1)
    EAccessLevel AccessLevel;                                                         // 0x0081 (size: 0x1)
    bool bHasConsumedMaterials;                                                       // 0x0082 (size: 0x1)
    bool bIsBlocked;                                                                  // 0x0083 (size: 0x1)
    EFacilityRefineryOrderState State;                                                // 0x0084 (size: 0x1)
    float ConsumeAmountModifier;                                                      // 0x0088 (size: 0x4)
    float ProgressNormalized;                                                         // 0x008C (size: 0x4)
    int64 LastUseTime;                                                                // 0x0090 (size: 0x8)

}; // Size: 0xA0

struct FFacilityStyle
{
    FSlateBrush ArrowBrush;                                                           // 0x0000 (size: 0x88)
    FSlateBrush PowerBrush;                                                           // 0x0088 (size: 0x88)
    FButtonStyle DisabledButtonStyle;                                                 // 0x0110 (size: 0x278)
    FButtonStyle PausedButtonStyle;                                                   // 0x0388 (size: 0x278)
    FButtonStyle EnabledButtonStyle;                                                  // 0x0600 (size: 0x278)
    FButtonStyle ConversionInfoStyle;                                                 // 0x0878 (size: 0x278)

}; // Size: 0xAF0

struct FFactionResourceState
{
    int32 AluminumAmount;                                                             // 0x0000 (size: 0x4)
    int32 TargetAluminumAmount;                                                       // 0x0004 (size: 0x4)
    int32 CopperAmount;                                                               // 0x0008 (size: 0x4)
    int32 TargetCopperAmount;                                                         // 0x000C (size: 0x4)
    int32 IronAmount;                                                                 // 0x0010 (size: 0x4)
    int32 TargetIronAmount;                                                           // 0x0014 (size: 0x4)
    int32 RareMetalAmount;                                                            // 0x0018 (size: 0x4)
    int32 TargetRareMetalAmount;                                                      // 0x001C (size: 0x4)
    double ActivityAmount;                                                            // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FFactionSelectStyle
{
    FButtonStyle ColonialButtonStyle;                                                 // 0x0000 (size: 0x278)
    FButtonStyle WardenButtonStyle;                                                   // 0x0278 (size: 0x278)
    FText ColonialHeader;                                                             // 0x04F0 (size: 0x18)
    FText WardenHeader;                                                               // 0x0508 (size: 0x18)
    FSlateColor FactionHeadTextColour;                                                // 0x0520 (size: 0x28)
    FText ColonialFlavourText;                                                        // 0x0548 (size: 0x18)
    FText WardenFlavourText;                                                          // 0x0560 (size: 0x18)
    FSlateColor QueueWarningImageColour;                                              // 0x0578 (size: 0x28)

}; // Size: 0x5A0

struct FFactoryProductionCategory
{
    EFactoryQueueType Type;                                                           // 0x0000 (size: 0x1)
    TArray<FFactoryProductionItem> CategoryItems;                                     // 0x0008 (size: 0x10)

}; // Size: 0x20

struct FFactoryProductionItem
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FFactoryQueue
{
    EFactoryQueueType Type;                                                           // 0x0000 (size: 0x1)
    float CraftingProgress;                                                           // 0x0004 (size: 0x4)
    float CraftingSpeedFactor;                                                        // 0x0008 (size: 0x4)
    TArray<FSpecializedFactoryOrder> Orders;                                          // 0x0010 (size: 0x10)
    TArray<FSpecializedFactoryOrder> CompletedOrders;                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FFestivalRenderInfo
{
    TArray<FMaterialOverride> MaterialOverrides;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFireIntensityThreshold
{
    EFireIntensity Intensity;                                                         // 0x0000 (size: 0x1)
    float DamageThreshold;                                                            // 0x0004 (size: 0x4)
    float FlamesPerSquareMeter;                                                       // 0x0008 (size: 0x4)
    float CharacterBurn;                                                              // 0x000C (size: 0x4)
    float FireDamageBaseGainRate;                                                     // 0x0010 (size: 0x4)
    float FireDamageBaseDecayRate;                                                    // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FFlameImpactFXInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    bool bActive;                                                                     // 0x000C (size: 0x1)

}; // Size: 0x10

struct FFoliageModificationInfo
{
    class UStaticMesh* OriginalMesh;                                                  // 0x0000 (size: 0x8)
    TSubclassOf<class AClientFoliageReplacement> Replacement;                         // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FFootPrintActorInfo
{
    class UPhysicalMaterial* PhysicalMaterial;                                        // 0x0000 (size: 0x8)
    TSubclassOf<class ADecalActor> FootPrintActorLeft;                                // 0x0008 (size: 0x8)
    TSubclassOf<class ADecalActor> FootPrintActorRight;                               // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FFortEmpConfig
{
    class UStaticMesh* FirstLRArtillerySegmentMesh;                                   // 0x0000 (size: 0x8)
    class UStaticMesh* SecondLRArtillerySegmentMesh;                                  // 0x0008 (size: 0x8)
    class UStaticMesh* FirstIntelCenterSegmentMesh;                                   // 0x0010 (size: 0x8)
    class UStaticMesh* SecondIntelCenterSegmentMesh;                                  // 0x0018 (size: 0x8)
    class UStaticMesh* FirstWeatherStationSegmentMesh;                                // 0x0020 (size: 0x8)
    class UStaticMesh* SecondWeatherStationSegmentMesh;                               // 0x0028 (size: 0x8)
    class UStaticMesh* FirstFortGarrisonSegmentMesh;                                  // 0x0030 (size: 0x8)
    class UStaticMesh* SecondFortGarrisonSegmentMesh;                                 // 0x0038 (size: 0x8)
    FName LRArtilleryPartCodeName;                                                    // 0x0040 (size: 0x8)
    FName WeatherStationPartCodeName;                                                 // 0x0048 (size: 0x8)
    FName IntelCenterPartCodeName;                                                    // 0x0050 (size: 0x8)
    FName FortGarrisonPartCodeName;                                                   // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FFreighterCargo
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    FSavedShippableData SavedData;                                                    // 0x0008 (size: 0xD0)

}; // Size: 0xD8

struct FFriendlyFireStats
{
    int32 TeamKills;                                                                  // 0x0000 (size: 0x4)
    int32 CharacterDamage;                                                            // 0x0004 (size: 0x4)
    int32 StructureDamage;                                                            // 0x0008 (size: 0x4)
    int32 VehicleDamage;                                                              // 0x000C (size: 0x4)
    int32 NameChanges;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FFuelInfo
{
    FFuelTank Tank;                                                                   // 0x0000 (size: 0x14)
    float ConsumptionRate;                                                            // 0x0014 (size: 0x4)

}; // Size: 0x20

struct FFuelQuantity
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    float Quantity;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFuelStyle
{
    FButtonStyle Button;                                                              // 0x0000 (size: 0x278)

}; // Size: 0x278

struct FFuelTank
{
    float RemainingFuel;                                                              // 0x0000 (size: 0x4)
    float FuelCapacity;                                                               // 0x0004 (size: 0x4)
    FName FuelItemCodeName;                                                           // 0x0008 (size: 0x8)
    bool bCanRefuelFromTanker;                                                        // 0x0010 (size: 0x1)
    bool bCanSiphon;                                                                  // 0x0011 (size: 0x1)

}; // Size: 0x14

struct FFuelTankerInfo
{
    class AActor* OwnerActor;                                                         // 0x0000 (size: 0x8)
    class UItemHolderComponent* OwnerItemHolder;                                      // 0x0008 (size: 0x8)
    class UGenericStockpileComponent* OwnerGenericStockpile;                          // 0x0010 (size: 0x8)
    class UStealthComponent* OwnerStealthComponent;                                   // 0x0018 (size: 0x8)
    class UAudioComponent* RefuelAudioComponent;                                      // 0x0020 (size: 0x8)
    float AmountRefueledPerSecond;                                                    // 0x0028 (size: 0x4)
    float RefuelCycleDuration;                                                        // 0x002C (size: 0x4)
    FVector FuelLocation;                                                             // 0x0030 (size: 0xC)
    class USoundCue* RefuelActivateSound;                                             // 0x0040 (size: 0x8)
    class USoundCue* RefuelSoundLoop;                                                 // 0x0048 (size: 0x8)
    class UMaterialInterface* RefuelCableMaterial;                                    // 0x0050 (size: 0x8)
    class UCableComponent* RefuelCableComponent;                                      // 0x0058 (size: 0x8)
    class AActor* TargetActorToRefuel;                                                // 0x0060 (size: 0x8)
    FFuelQuantity FuelBuffer;                                                         // 0x0068 (size: 0xC)
    bool bEnabled;                                                                    // 0x0091 (size: 0x1)

}; // Size: 0x98

struct FGameServerProfile
{
    TMap<EUserVoteKickCategory, int32> VoteKickCategoryCountMap;                      // 0x0000 (size: 0x50)
    FDateTime TimeOfLastVoteKickAgainstMe;                                            // 0x0050 (size: 0x8)
    int64 TimeOfLastVoteKick;                                                         // 0x0058 (size: 0x8)
    FDateTime FirstMonthlyVoteKickTime;                                               // 0x0060 (size: 0x8)
    uint16 MonthlyVoteKickCount;                                                      // 0x0068 (size: 0x2)
    FDateTime FirstDailyVoteKickTime;                                                 // 0x0070 (size: 0x8)
    uint16 DailyVoteKickCount;                                                        // 0x0078 (size: 0x2)
    FDateTime LastLogin;                                                              // 0x0080 (size: 0x8)
    FString LastVersion;                                                              // 0x0088 (size: 0x10)
    FDateTime LastFriendlyFire;                                                       // 0x0098 (size: 0x8)
    float RecentTeamKills;                                                            // 0x00A0 (size: 0x4)
    float RecentFriendlyCharacterDamage;                                              // 0x00A4 (size: 0x4)
    float RecentFriendlyStructureDamage;                                              // 0x00A8 (size: 0x4)
    float RecentFriendlyVehicleDamage;                                                // 0x00AC (size: 0x4)
    int16 RecentNameChanges;                                                          // 0x00B0 (size: 0x2)
    uint8 RestrictedState;                                                            // 0x00B2 (size: 0x1)
    TArray<FDateTime> RestrictionClearTimes;                                          // 0x00B8 (size: 0x10)
    FString PreviousPlayerName;                                                       // 0x00C8 (size: 0x10)
    FDateTime LastFreshLoginTime;                                                     // 0x00D8 (size: 0x8)
    int32 RecentLoginCount;                                                           // 0x00E0 (size: 0x4)
    FString UniqueDeviceID;                                                           // 0x00E8 (size: 0x10)
    FPlayerWarState PlayerWarState;                                                   // 0x00F8 (size: 0xA8)
    FSavedCharacterInventory CharacterInventory;                                      // 0x01A0 (size: 0x28)
    float Health;                                                                     // 0x01C8 (size: 0x4)
    bool IsBleeding;                                                                  // 0x01CC (size: 0x1)
    uint8 PlayerFlags;                                                                // 0x01CD (size: 0x1)
    bool bIsGodMode;                                                                  // 0x01CE (size: 0x1)
    int32 NumSelfServeFactionUnlocksUsed;                                             // 0x01D0 (size: 0x4)
    FString OfflineCharacterServer;                                                   // 0x01D8 (size: 0x10)
    FDateTime OfflineCharacterCreationTime;                                           // 0x01E8 (size: 0x8)
    float NormalizedStamina;                                                          // 0x01F0 (size: 0x4)
    EOutfitType OutfitType;                                                           // 0x01F4 (size: 0x1)
    FCharacterCustomizationInfo CharacterCustomizationInfo;                           // 0x01F5 (size: 0x2)
    FDateTime VoteKickImmunityTime;                                                   // 0x01F8 (size: 0x8)

}; // Size: 0x200

struct FGameplayFlags
{
    int32 Flags;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FGameplayParams
{
    float SuppressMultiplier;                                                         // 0x0000 (size: 0x4)
    float SuppressLossRate;                                                           // 0x0004 (size: 0x4)
    float StabilityGainRateMultiplier;                                                // 0x0008 (size: 0x4)
    float CoverFactorFloor;                                                           // 0x000C (size: 0x4)

}; // Size: 0x10

struct FGangwayRampSaveState
{
    ERampState State;                                                                 // 0x0000 (size: 0x1)
    float RampAngle;                                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGatherResult
{
    FName ResourceCodeName;                                                           // 0x0000 (size: 0x8)
    int32 GatheredAmount;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FGearboxStyle
{
    FSlateBrush GearboxLow;                                                           // 0x0000 (size: 0x88)
    FSlateBrush GearboxHigh;                                                          // 0x0088 (size: 0x88)

}; // Size: 0x110

struct FGeneralPurposeIcons
{
    FSlateBrush DownwardTriangle;                                                     // 0x0000 (size: 0x88)

}; // Size: 0x88

struct FGenericStockpileConfig
{
    EStockpileEntryType Type;                                                         // 0x0000 (size: 0x1)
    int32 QuantityLimit;                                                              // 0x0004 (size: 0x4)
    int32 TotalQuantityLimit;                                                         // 0x0008 (size: 0x4)
    TMap<FName, int32> QuantityOverrides;                                             // 0x0010 (size: 0x50)
    TMap<FName, int32> TotalQuantityOverrides;                                        // 0x0060 (size: 0x50)
    TArray<FName> ValidEntriesOverride;                                               // 0x00B0 (size: 0x10)
    TArray<FStockpileEntry> PreStockedEntries;                                        // 0x00C0 (size: 0x10)
    TMap<FName, float> RetrieveDurationModifiers;                                     // 0x00D0 (size: 0x50)

}; // Size: 0x120

struct FGetAnalyticsEventsRequest
{
    FString WarId;                                                                    // 0x0000 (size: 0x10)
    EAnalyticsEventType EventType;                                                    // 0x0010 (size: 0x2)

}; // Size: 0x18

struct FGetAnalyticsEventsResponse
{
    TArray<FAnalyticsEvent> EventList;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGetBanAndProfileRequest
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString DeviceID;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FGetBanAndProfileResponse
{
    FPlayerBan PlayerBan;                                                             // 0x0000 (size: 0x18)
    FGetProfileResponse ProfileResponse;                                              // 0x0018 (size: 0x58)

}; // Size: 0x70

struct FGetBanRequest
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString DeviceID;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FGetBanResponse
{
    FPlayerBan PlayerBan;                                                             // 0x0000 (size: 0x18)

}; // Size: 0x18

struct FGetMapPostsRequest
{
    bool bIsModModeOn;                                                                // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FGetMapPostsResponse
{
    TArray<FRepMapPost> MapPosts;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGetProfileRequest
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGetProfileResponse
{
    EGetProfileResponseCode ResponseCode;                                             // 0x0000 (size: 0x1)
    FWarPlayerProfileSerialized WarPlayerProfileSerializable;                         // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FGetSquadInfoWarMessage
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    int8 FactionId;                                                                   // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FGetSquadInfosResponse
{
    TArray<FSquadInfo> SquadInfos;                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGetSquadsResponse
{
    TArray<FSquad> Squads;                                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGetViolationsHttpRequest
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString DeviceID;                                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FGetViolationsHttpResponse
{
    TArray<FViolationEvent> EventList;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGetViolationsRequest
{
}; // Size: 0x28

struct FGetViolationsResponse
{
}; // Size: 0x38

struct FGlobalAdminCommand
{
}; // Size: 0x30

struct FGlobalAdminCommandRequest
{
    TArray<FString> Params;                                                           // 0x0000 (size: 0x10)
    FString TargetServerName;                                                         // 0x0010 (size: 0x10)
    FString AdminOnlineID;                                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FGlobalLogEntry
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    EGlobalLogEntryType Type;                                                         // 0x0020 (size: 0x1)
    int32 Value;                                                                      // 0x0024 (size: 0x4)
    FDateTime Timestamp;                                                              // 0x0028 (size: 0x8)
    int8 MapId;                                                                       // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FGlobalLogPage
{
    TArray<FGlobalLogEntry> Entries;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGlobalLogPageRequest
{
    int32 LogPageIndex;                                                               // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FGlobalLogPageResponse
{
    FGlobalLogPage LogPage;                                                           // 0x0000 (size: 0x10)
    int32 PageCount;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FGlobalResourceState
{
    FFactionResourceState Colonials;                                                  // 0x0000 (size: 0x28)
    FFactionResourceState Wardens;                                                    // 0x0028 (size: 0x28)

}; // Size: 0x50

struct FGlobalShardConfig
{
    int32 DefaultShardId;                                                             // 0x0000 (size: 0x4)
    bool bEnableOverpopMode;                                                          // 0x0004 (size: 0x1)
    bool bRedirectToShardSelector;                                                    // 0x0005 (size: 0x1)
    int32 OverpopShardId;                                                             // 0x0008 (size: 0x4)
    EOverpopText OverpopTextType;                                                     // 0x000C (size: 0x1)
    EOverpopButtonText OverpopYesButtonType;                                          // 0x000D (size: 0x1)
    EOverpopButtonText OverpopNoButtonType;                                           // 0x000E (size: 0x1)

}; // Size: 0x10

struct FGlobalShardProfile
{
    int32 XP;                                                                         // 0x0000 (size: 0x4)
    int16 CP;                                                                         // 0x0004 (size: 0x2)
    int8 CPToGive;                                                                    // 0x0006 (size: 0x1)
    int32 XPForCP;                                                                    // 0x0008 (size: 0x4)
    int8 Level;                                                                       // 0x000C (size: 0x1)
    TArray<FCommendHistory> CommendHistories;                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FGlobalSpawnPoint
{
    FSpawnPoint Local;                                                                // 0x0000 (size: 0x4)
    FVector2D Location;                                                               // 0x0004 (size: 0x8)
    EWorldConquestMapId MapId;                                                        // 0x000C (size: 0x1)

}; // Size: 0x10

struct FGlobalSpawnPointMinimal
{
    uint32 ID;                                                                        // 0x0000 (size: 0x4)
    EWorldConquestMapId MapId;                                                        // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FGrenadeDynamicData : public FTableRowBase
{
    float MinTossSpeed;                                                               // 0x0008 (size: 0x4)
    float MaxTossSpeed;                                                               // 0x000C (size: 0x4)
    float GrenadeFuseTimer;                                                           // 0x0010 (size: 0x4)
    float GrenadeRangeLimit;                                                          // 0x0014 (size: 0x4)
    float ArmourDamageModifier;                                                       // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FGunnerInfo
{
    FName AmmoName;                                                                   // 0x0000 (size: 0x8)
    int32 AmmoAmount;                                                                 // 0x0008 (size: 0x4)
    FVector2D YawAndPitch;                                                            // 0x000C (size: 0x8)
    bool bIsFiring;                                                                   // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FHUDInfo
{
}; // Size: 0x40

struct FHUDStyle : public FSlateWidgetStyle
{
    FSlateBrush ActiveItemSlotBrush;                                                  // 0x0008 (size: 0x88)
    FButtonStyle InventorySlotButtonStyle;                                            // 0x0090 (size: 0x278)
    FSlateBrush InventorySlotImageBrush;                                              // 0x0308 (size: 0x88)
    FSlateBrush EquipmentSlotImageBrush;                                              // 0x0390 (size: 0x440)
    FSlateBrush EquippedInventorySlotBrush;                                           // 0x07D0 (size: 0x88)
    FSlateBrush UnequippedInventorySlotBrush;                                         // 0x0858 (size: 0x88)
    FSlateBrush StackBackgroundBrush;                                                 // 0x08E0 (size: 0x88)
    FSlateBrush CursorOverTargetBrush;                                                // 0x0968 (size: 0x88)
    FSlateBrush CursorNotReadyBrush;                                                  // 0x09F0 (size: 0x88)
    FSlateBrush CursorIdleBrush;                                                      // 0x0A78 (size: 0x88)
    FTextBlockStyle ItemStackSizeTextBlockStyle;                                      // 0x0B00 (size: 0x268)
    FTextBlockStyle ItemStackSizeSmallTextBlockStyle;                                 // 0x0D68 (size: 0x268)
    FTextBlockStyle ButtonTextBlockStyle;                                             // 0x0FD0 (size: 0x268)
    FTextBlockStyle MapMarkerNotifTextBlockStyle;                                     // 0x1238 (size: 0x268)
    FTextBlockStyle ChatChannelTextBlockStyle;                                        // 0x14A0 (size: 0x268)
    FTextBlockStyle ChatTextBlockStyle;                                               // 0x1708 (size: 0x268)
    FTextBlockStyle EndscreenHeadingStyle;                                            // 0x1970 (size: 0x268)
    FTextBlockStyle EndscreenTextBlockStyle;                                          // 0x1BD8 (size: 0x268)
    FTextBlockStyle WeeklyWarCountdownTextBlockStyle;                                 // 0x1E40 (size: 0x268)
    FTextBlockStyle WoundedTimeTextBlockStyle;                                        // 0x20A8 (size: 0x268)
    float WoundedTextOffsetNormalized;                                                // 0x2310 (size: 0x4)
    FSlateBrush DefaultBlackBackground;                                               // 0x2318 (size: 0x88)
    FSlateBrush StaminaBarTop;                                                        // 0x23A0 (size: 0x88)
    FSlateBrush StaminaBarBackground;                                                 // 0x2428 (size: 0x88)
    FSlateBrush HotbarBackground;                                                     // 0x24B0 (size: 0x88)
    FSlateBrush SideAlertBackground;                                                  // 0x2538 (size: 0x88)
    FSlateBrush StorageBoxBackground;                                                 // 0x25C0 (size: 0x88)
    FSlateBrush EquippedBackground;                                                   // 0x2648 (size: 0x88)
    FSlateBrush CompasBackground;                                                     // 0x26D0 (size: 0x88)
    FSlateBrush CompasPoints;                                                         // 0x2758 (size: 0x88)
    FSlateBrush CompasNeedle;                                                         // 0x27E0 (size: 0x88)
    FSlateBrush CompassCustomArrow;                                                   // 0x2868 (size: 0x88)
    FSlateBrush FistIcon;                                                             // 0x28F0 (size: 0x88)
    FSlateBrush EncumberedIcon;                                                       // 0x2978 (size: 0x88)
    FSlateBrush EncumberedOverIcon;                                                   // 0x2A00 (size: 0x88)
    FSlateBrush GasMaskFilterFullIcon;                                                // 0x2A88 (size: 0x88)
    FSlateBrush GasMaskFilterLowIcon;                                                 // 0x2B10 (size: 0x88)
    FSlateBrush GasMaskFilterEmptyIcon;                                               // 0x2B98 (size: 0x88)
    FSlateBrush RadioBackpackIcon;                                                    // 0x2C20 (size: 0x88)
    FSlateBrush RadioBackpackInactiveIcon;                                            // 0x2CA8 (size: 0x88)
    FSlateBrush InvisibleIcon;                                                        // 0x2D30 (size: 0x88)
    FSlateBrush BleedingIcon;                                                         // 0x2DB8 (size: 0x88)
    FSlateBrush FlareIcon;                                                            // 0x2E40 (size: 0x88)
    FSlateBrush SubsystemTrackIcon;                                                   // 0x2EC8 (size: 0x88)
    FSlateBrush SubsystemFuelTankIcon;                                                // 0x2F50 (size: 0x88)
    FSlateBrush SubsystemTurretIcon;                                                  // 0x2FD8 (size: 0x88)
    FSlateBrush CoverIcon1;                                                           // 0x3060 (size: 0x88)
    FSlateBrush CoverIcon2;                                                           // 0x30E8 (size: 0x88)
    FSlateBrush CoverIcon3;                                                           // 0x3170 (size: 0x88)
    FSlateBrush SuppressionIcon;                                                      // 0x31F8 (size: 0x88)
    FSlateBrush LockIcon;                                                             // 0x3280 (size: 0x88)
    FSlateBrush MapMarkerNotifBackground;                                             // 0x3308 (size: 0x88)
    FSlateBrush ChatTabIcon;                                                          // 0x3390 (size: 0x88)
    FButtonStyle ChatOptionsIcon;                                                     // 0x3418 (size: 0x278)
    FButtonStyle ChatDiscordButton;                                                   // 0x3690 (size: 0x278)
    FSlateBrush ChatTabNotificationBrush;                                             // 0x3908 (size: 0x88)
    FSlateBrush ChatMainBackground;                                                   // 0x3990 (size: 0x88)
    FSlateBrush ChatTextFieldBackground;                                              // 0x3A18 (size: 0x88)
    FSlateBrush ChatChannelFieldBackground;                                           // 0x3AA0 (size: 0x88)
    FButtonStyle ChatUpVoteButton;                                                    // 0x3B28 (size: 0x278)
    FSlateBrush ChatWarserviceConnectivityIcon;                                       // 0x3DA0 (size: 0x88)
    FTextBlockStyle DescHeaderTextStyle;                                              // 0x3E28 (size: 0x268)
    FTextBlockStyle DescBodyTextStyle;                                                // 0x4090 (size: 0x268)
    FSlateBrush DescBackgroundBrush;                                                  // 0x42F8 (size: 0x88)
    FSlateBrush DescBackgroundBrushNoBottom;                                          // 0x4380 (size: 0x88)
    FSlateBrush GenericDescBackgroundBrush;                                           // 0x4408 (size: 0x88)
    FSlateBrush GenericDescBackgroundBrush2;                                          // 0x4490 (size: 0x88)
    FButtonStyle CreationButtonStyle;                                                 // 0x4518 (size: 0x278)
    FTextBlockStyle CreationHeadingStyle;                                             // 0x4790 (size: 0x268)
    FSlateBrush CreationBackgroundBrush;                                              // 0x49F8 (size: 0x88)
    FButtonStyle ButtonStyle;                                                         // 0x4A80 (size: 0x278)
    FButtonStyle UseIconButtonStyle;                                                  // 0x4CF8 (size: 0x278)
    FButtonStyle RecruitIconButtonStyle;                                              // 0x4F70 (size: 0x278)
    FButtonStyle StorageIconButtonStyle;                                              // 0x51E8 (size: 0x278)
    FButtonStyle AlertsLogButtonStyle;                                                // 0x5460 (size: 0x278)
    FButtonStyle HiddenAlertsLogButtonStyle;                                          // 0x56D8 (size: 0x278)
    FButtonStyle AlertToggleClosedButtonStyle;                                        // 0x5950 (size: 0x278)
    FButtonStyle AlertToggleOpenButtonStyle;                                          // 0x5BC8 (size: 0x278)
    FButtonStyle XButtonStyle;                                                        // 0x5E40 (size: 0x278)
    FButtonStyle CheckmarkButtonStyle;                                                // 0x60B8 (size: 0x278)
    FChatStyle ChatStyle;                                                             // 0x6330 (size: 0x70)
    FSlateSound WinResultSound;                                                       // 0x63A0 (size: 0x18)
    FSlateSound WinResultVictorySound;                                                // 0x63B8 (size: 0x18)
    FSlateSound WinResultDefeatSound;                                                 // 0x63D0 (size: 0x18)
    FSlateBrush RailCouplerIcon;                                                      // 0x63E8 (size: 0x88)

}; // Size: 0x6470

struct FHelpToolTipStyle
{
    FButtonStyle Button;                                                              // 0x0000 (size: 0x278)
    FSlateBrush BackgroundImage;                                                      // 0x0278 (size: 0x88)

}; // Size: 0x300

struct FHitNotify
{
    class USceneComponent* HitComponent;                                              // 0x0000 (size: 0x8)
    FVector_NetQuantize HitLocation;                                                  // 0x0008 (size: 0xC)
    FVector_NetQuantizeNormal HitNormal;                                              // 0x0014 (size: 0xC)
    FVector_NetQuantizeNormal HitFromDirection;                                       // 0x0020 (size: 0xC)
    TWeakObjectPtr<class UPhysicalMaterial> PhysMaterial;                             // 0x002C (size: 0x8)
    float Damage;                                                                     // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FHornData
{
    class USoundCue* Sound;                                                           // 0x0000 (size: 0x8)
    float CooldownSeconds;                                                            // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FHospitalStyle
{
    FSlateBrush UnoccupiedBedImage;                                                   // 0x0000 (size: 0x88)
    FSlateBrush OccupiedBedImage;                                                     // 0x0088 (size: 0x88)
    FSlateBrush BedFillImage;                                                         // 0x0110 (size: 0x88)

}; // Size: 0x198

struct FIconInfo
{
}; // Size: 0x10

struct FIconsStyle
{
    FSlateBrush ShowAllItems;                                                         // 0x0000 (size: 0x88)
    FSlateBrush SmallArms;                                                            // 0x0088 (size: 0x88)
    FSlateBrush HeavyArms;                                                            // 0x0110 (size: 0x88)
    FSlateBrush HeavyAmmo;                                                            // 0x0198 (size: 0x88)
    FSlateBrush Utility;                                                              // 0x0220 (size: 0x88)
    FSlateBrush Medical;                                                              // 0x02A8 (size: 0x88)
    FSlateBrush Supplies;                                                             // 0x0330 (size: 0x88)
    FSlateBrush Uniforms;                                                             // 0x03B8 (size: 0x88)
    FSlateBrush Vehicles;                                                             // 0x0440 (size: 0x88)
    FSlateBrush Structures;                                                           // 0x04C8 (size: 0x88)
    FSlateBrush BasicMaterials;                                                       // 0x0550 (size: 0x88)
    FSlateBrush RefinedMaterials;                                                     // 0x05D8 (size: 0x88)
    FSlateBrush ExplosiveMaterials;                                                   // 0x0660 (size: 0x88)
    FSlateBrush RefinedFuel;                                                          // 0x06E8 (size: 0x88)
    FSlateBrush SmallGarrison;                                                        // 0x0770 (size: 0x88)
    FSlateBrush LargeGarrison;                                                        // 0x07F8 (size: 0x88)
    FSlateBrush AdvancedMining;                                                       // 0x0880 (size: 0x88)
    FSlateBrush Encumbrance;                                                          // 0x0908 (size: 0x88)
    FSlateBrush Personal;                                                             // 0x0990 (size: 0x88)
    FSlateBrush Squad;                                                                // 0x0A18 (size: 0x88)
    FSlateBrush Orders;                                                               // 0x0AA0 (size: 0x88)
    FSlateBrush Time;                                                                 // 0x0B28 (size: 0x88)
    FSlateBrush Supporters;                                                           // 0x0BB0 (size: 0x88)
    FSlateBrush MaintenanceSupplies;                                                  // 0x0C38 (size: 0x88)
    FSlateBrush CratesSubCategory;                                                    // 0x0CC0 (size: 0x88)
    FSlateBrush WeaponsStructures;                                                    // 0x0D48 (size: 0x88)
    FSlateBrush Reservable;                                                           // 0x0DD0 (size: 0x88)

}; // Size: 0xE58

struct FIdleAnimation
{
    class UAnimMontage* ActivityMontage;                                              // 0x0000 (size: 0x8)
    FCharacterConditions Conditions;                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FImpactEffectOverride
{
    TEnumAsByte<EPhysicalSurface> PhysicalSurface;                                    // 0x0000 (size: 0x1)
    class UParticleSystem* EmitterTemplate;                                           // 0x0008 (size: 0x8)
    class USoundCue* HitSound;                                                        // 0x0010 (size: 0x8)
    FDecalData Decal;                                                                 // 0x0018 (size: 0x20)
    bool bOrientToHitDirection;                                                       // 0x0038 (size: 0x1)
    float DamageThreshold;                                                            // 0x003C (size: 0x4)

}; // Size: 0x40

struct FInfrastructureStyle
{
    FSlateBrush Icon;                                                                 // 0x0000 (size: 0x88)
    FText Name;                                                                       // 0x0088 (size: 0x18)

}; // Size: 0xA0

struct FInfrastructuresStyle
{
    FInfrastructureStyle Entries;                                                     // 0x0000 (size: 0x3C0)
    FTechTreeComponentUIItem Items;                                                   // 0x03C0 (size: 0x1CE0)
    FSlateBrush VoteBrush;                                                            // 0x20A0 (size: 0x88)
    FButtonStyle ActivityBonusButton;                                                 // 0x2128 (size: 0x278)

}; // Size: 0x23A0

struct FInitialCharacterState
{
    TArray<FItemInstance> ItemInstances;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FInputAction
{
    FText Name;                                                                       // 0x0000 (size: 0x18)
    EInputActionCategory Category;                                                    // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FInputActions
{
    TMap<class FName, class FInputAction> Actions;                                    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FInputStyle
{
    FSlateBrush PageUp;                                                               // 0x0000 (size: 0x88)
    FSlateBrush PageDown;                                                             // 0x0088 (size: 0x88)

}; // Size: 0x110

struct FInteractContextMenuStyle
{
    FSlateBrush LadderIcon;                                                           // 0x0000 (size: 0x88)
    FSlateBrush ServerTravelPortalIcon;                                               // 0x0088 (size: 0x88)
    FSlateBrush ReadableSignIcon;                                                     // 0x0110 (size: 0x88)

}; // Size: 0x198

struct FInventoryStyle
{
    FSlateBrush EncumbranceBorderBrush;                                               // 0x0000 (size: 0x88)
    FLinearColor LowEncumbranceColor;                                                 // 0x0088 (size: 0x10)
    FLinearColor MediumEncumbranceColor;                                              // 0x0098 (size: 0x10)
    FLinearColor HighEncumbranceColor;                                                // 0x00A8 (size: 0x10)

}; // Size: 0xB8

struct FInviteToRegimentMessage
{
    int32 InviterRegimentId;                                                          // 0x0000 (size: 0x4)
    FString TargetOnlineID;                                                           // 0x0008 (size: 0x10)
    FString InviterOnlineId;                                                          // 0x0018 (size: 0x10)
    FString InviterPlayerName;                                                        // 0x0028 (size: 0x10)
    int8 InviterFactionId;                                                            // 0x0038 (size: 0x1)
    FString RegimentName;                                                             // 0x0040 (size: 0x10)
    FString RegimentTag;                                                              // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FItemDynamicData : public FTableRowBase
{
    TArray<FProductionResource> CostPerCrate;                                         // 0x0008 (size: 0x10)
    int32 QuantityPerCrate;                                                           // 0x0018 (size: 0x4)
    float CrateProductionTime;                                                        // 0x001C (size: 0x4)
    float SingleRetrieveTime;                                                         // 0x0020 (size: 0x4)
    float CrateRetrieveTime;                                                          // 0x0024 (size: 0x4)
    int32 ResearchLevel;                                                              // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FItemGroupLayer
{
    float MeshSizeX;                                                                  // 0x0000 (size: 0x4)
    float MeshSizeY;                                                                  // 0x0004 (size: 0x4)
    int32 MeshesAlongX;                                                               // 0x0008 (size: 0x4)
    int32 MeshesAlongY;                                                               // 0x000C (size: 0x4)
    FVector MeshOffset;                                                               // 0x0010 (size: 0xC)

}; // Size: 0x1C

struct FItemGroupRenderLayout
{
    class UStaticMesh* StaticMesh;                                                    // 0x0000 (size: 0x8)
    int32 MaxAmount;                                                                  // 0x0008 (size: 0x4)
    FItemGroupLayer LayerConfig;                                                      // 0x000C (size: 0x1C)
    FItemGroupLayer OddLayerConfig;                                                   // 0x0028 (size: 0x1C)
    float MeshSizeZ;                                                                  // 0x0044 (size: 0x4)
    float YawJitter;                                                                  // 0x0048 (size: 0x4)
    float PitchJitter;                                                                // 0x004C (size: 0x4)
    float RollJitter;                                                                 // 0x0050 (size: 0x4)
    float OffsetJitter;                                                               // 0x0054 (size: 0x4)
    float ScaleJitter;                                                                // 0x0058 (size: 0x4)
    float LayerScaleDownFactor;                                                       // 0x005C (size: 0x4)
    FVector2D LayerScaleDownFactor2D;                                                 // 0x0060 (size: 0x8)
    bool bAllowFlipX;                                                                 // 0x0068 (size: 0x1)
    bool bAllowFlipZ;                                                                 // 0x0069 (size: 0x1)
    bool bAllowOddLayerRotation;                                                      // 0x006A (size: 0x1)
    FVector LocalRotation;                                                            // 0x006C (size: 0xC)
    float LocalScale;                                                                 // 0x0078 (size: 0x4)
    bool bIgnoreGenerateLayoutData;                                                   // 0x007C (size: 0x1)

}; // Size: 0x80

struct FItemHolderData
{
    class UItemHolderComponent* Component;                                            // 0x0000 (size: 0x8)
    TArray<FItemInstance> Items;                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FItemInstance
{
    class AItemPickup* PickupCDO;                                                     // 0x0000 (size: 0x8)
    class UItemComponent* ItemComponent;                                              // 0x0008 (size: 0x8)
    FName CodeName;                                                                   // 0x0010 (size: 0x8)
    int8 StackSize;                                                                   // 0x0018 (size: 0x1)
    uint16 Payload;                                                                   // 0x001A (size: 0x2)
    uint16 HolderId;                                                                  // 0x001C (size: 0x2)

}; // Size: 0x20

struct FItemProfileData
{
    bool bIsStockpilable;                                                             // 0x0000 (size: 0x1)
    bool bIsStackable;                                                                // 0x0001 (size: 0x1)
    bool bIsConvertibleToCrate;                                                       // 0x0002 (size: 0x1)
    bool bIsCratable;                                                                 // 0x0003 (size: 0x1)
    bool bIsStockpiledWithAmmo;                                                       // 0x0004 (size: 0x1)
    bool bUsableInVehicle;                                                            // 0x0005 (size: 0x1)
    int32 StackTransferLimit;                                                         // 0x0008 (size: 0x4)
    int32 RetrieveQuantity;                                                           // 0x000C (size: 0x4)
    int32 ReserveStockpileMaxQuantity;                                                // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FItemSlotFilter
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    TSet<FName> ExtraCodeNames;                                                       // 0x0008 (size: 0x50)
    int32 StackLimit;                                                                 // 0x0058 (size: 0x4)

}; // Size: 0xB0

struct FItemStyle
{
    float Size;                                                                       // 0x0000 (size: 0x4)
    FSlateColor EnabledColor;                                                         // 0x0008 (size: 0x28)
    FSlateColor DisabledColor;                                                        // 0x0030 (size: 0x28)
    FSlateColor CornerWidgetColor;                                                    // 0x0058 (size: 0x28)
    float CornerWidgetWidth;                                                          // 0x0080 (size: 0x4)
    float CornerWidgetHeight;                                                         // 0x0084 (size: 0x4)
    float CornerWidgetPadding;                                                        // 0x0088 (size: 0x4)
    FSlateBrush SlotFilterBrush;                                                      // 0x0090 (size: 0x88)
    FSlateBrush MultiSlotFilterBrush;                                                 // 0x0118 (size: 0x88)

}; // Size: 0x1A0

struct FItemSubtypeStyle
{
    float Size;                                                                       // 0x0000 (size: 0x4)
    float SecondaryHudSize;                                                           // 0x0004 (size: 0x4)
    float Padding;                                                                    // 0x0008 (size: 0x4)
    FSlateColor IconColour;                                                           // 0x0010 (size: 0x28)

}; // Size: 0x38

struct FJoinSquadRequestMessage
{
    FJoinSquadWarMessage JoinMessage;                                                 // 0x0000 (size: 0x40)
    FString LeaderOnlineID;                                                           // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FJoinSquadWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FSquadMember NewMember;                                                           // 0x0008 (size: 0x28)
    FString NewMemberRegimentTag;                                                     // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FLandscapeDeformationTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FLargeShipGunnerInfo
{
    FVector2D YawAndPitch;                                                            // 0x0000 (size: 0x8)
    bool bIsWorking;                                                                  // 0x0008 (size: 0x1)
    bool bIsFiring;                                                                   // 0x0009 (size: 0x1)
    int32 AmmoAmount;                                                                 // 0x000C (size: 0x4)
    FName AmmoName;                                                                   // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FLeakOffsetRange
{
    float RelativeStartX;                                                             // 0x0000 (size: 0x4)
    float RelativeEndX;                                                               // 0x0004 (size: 0x4)
    float Offset;                                                                     // 0x0008 (size: 0x4)
    ELeakOffsetRangeSide Side;                                                        // 0x000C (size: 0x1)

}; // Size: 0x10

struct FLiquidTank
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    float Amount;                                                                     // 0x0008 (size: 0x4)
    bool bIsTypeSet;                                                                  // 0x000C (size: 0x1)
    float MaxAmount;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FListViewStyle
{
    FHeaderRowStyle ListHeaderRowStyle;                                               // 0x0000 (size: 0xB70)

}; // Size: 0xB70

struct FListeningAreaDebugData
{
    FVector2D Location;                                                               // 0x0000 (size: 0x8)
    float Radius;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FListeningAreaStyle
{
    FSlateBrush RadiusBrush;                                                          // 0x0000 (size: 0x88)

}; // Size: 0x88

struct FLoSTraceHandle
{
}; // Size: 0x20

struct FLoadoutBackpackItem
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int32 Quantity;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FLoadoutData
{
    FString LoadoutName;                                                              // 0x0000 (size: 0x10)
    TArray<FLoadoutEquipmentItem> EquipmentItems;                                     // 0x0010 (size: 0x10)
    TArray<FLoadoutBackpackItem> BackpackItems;                                       // 0x0020 (size: 0x10)
    uint8 NumBackpackSlots;                                                           // 0x0030 (size: 0x1)
    uint8 bHasUniform;                                                                // 0x0031 (size: 0x1)
    uint8 bAllowPartialAssembly;                                                      // 0x0031 (size: 0x1)
    uint8 bAutoSubmitStarterItems;                                                    // 0x0031 (size: 0x1)

}; // Size: 0x38

struct FLoadoutEquipmentItem
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    uint8 Quantity;                                                                   // 0x0008 (size: 0x1)
    EEquipmentSlot EquipmentSlot;                                                     // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FLoadoutSaveData
{
    TArray<FLoadoutData> LoadoutDataC;                                                // 0x0000 (size: 0x10)
    TArray<FLoadoutData> LoadoutDataW;                                                // 0x0010 (size: 0x10)
    int32 SelectedLoadoutIndexC;                                                      // 0x0020 (size: 0x4)
    int32 SelectedLoadoutIndexW;                                                      // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FLobbyStyle
{
    FSlateBrush ColonialImage;                                                        // 0x0000 (size: 0x88)
    FSlateBrush WardenImage;                                                          // 0x0088 (size: 0x88)
    FSlateColor TitleTextColour;                                                      // 0x0110 (size: 0x28)
    FButtonStyle EditButton;                                                          // 0x0138 (size: 0x278)

}; // Size: 0x3B0

struct FLocalModerationInfo
{
    FString LastUsedSteamID;                                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLocalShardProfile
{
    FGameServerProfile GameServerProfile;                                             // 0x0000 (size: 0x200)
    FString LastWarId;                                                                // 0x0200 (size: 0x10)
    FDateTime OfflineCharacterExpiry;                                                 // 0x0210 (size: 0x8)
    EWorldConquestMapId OfflineCharacterMapId;                                        // 0x0218 (size: 0x1)

}; // Size: 0x220

struct FLocalShardProfileSerialized
{
    TArray<uint8> GameServerProfileBytes;                                             // 0x0000 (size: 0x10)
    FString LastWarId;                                                                // 0x0010 (size: 0x10)
    int64 OfflineCharacterExpiry;                                                     // 0x0020 (size: 0x8)
    uint8 OfflineCharacterMapId;                                                      // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FLocationMeshStop
{
    class UStaticMesh* StaticMesh;                                                    // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FLocationSkeletalMeshStop
{
    class USkeletalMesh* SkeletalMesh;                                                // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FLogCommsRatingChangeMessage
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    int8 NewCondition;                                                                // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FLogCreateRegimentRequest
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    FString RegimentName;                                                             // 0x0008 (size: 0x10)
    FString RegimentTag;                                                              // 0x0018 (size: 0x10)
    FString CreatorOnlineID;                                                          // 0x0028 (size: 0x10)
    FString CreatorName;                                                              // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FLogCreateSquadRequest
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString SquadName;                                                                // 0x0008 (size: 0x10)
    FString CreatorOnlineID;                                                          // 0x0018 (size: 0x10)
    FString CreatorName;                                                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FLogDisbandRegimentRequest
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    FString RegimentName;                                                             // 0x0008 (size: 0x10)
    FString RegimentTag;                                                              // 0x0018 (size: 0x10)
    FString InstigatorOnlineId;                                                       // 0x0028 (size: 0x10)
    FString InstigatorName;                                                           // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FLogEditRegimentRequest
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    FString RegimentName;                                                             // 0x0008 (size: 0x10)
    FString RegimentTag;                                                              // 0x0018 (size: 0x10)
    FString RegimentLink;                                                             // 0x0028 (size: 0x10)
    FString EditorOnlineID;                                                           // 0x0038 (size: 0x10)
    FString EditorName;                                                               // 0x0048 (size: 0x10)
    FString OldRegimentName;                                                          // 0x0058 (size: 0x10)
    FString OldRegimentTag;                                                           // 0x0068 (size: 0x10)
    FString OldRegimentLink;                                                          // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FLogRegimentMessage
{
    FString SenderName;                                                               // 0x0000 (size: 0x10)
    FString SenderOnlineId;                                                           // 0x0010 (size: 0x10)
    int8 SenderFactionId;                                                             // 0x0020 (size: 0x1)
    int32 RegimentID;                                                                 // 0x0024 (size: 0x4)
    FString RegimentName;                                                             // 0x0028 (size: 0x10)
    FString Text;                                                                     // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FLogSquadMessage
{
    FString SenderName;                                                               // 0x0000 (size: 0x10)
    FString SenderOnlineId;                                                           // 0x0010 (size: 0x10)
    int8 SenderFactionId;                                                             // 0x0020 (size: 0x1)
    int32 SquadId;                                                                    // 0x0024 (size: 0x4)
    FString SquadName;                                                                // 0x0028 (size: 0x10)
    FString Text;                                                                     // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FLogStyle
{
    FSlateColor RetrieveColor;                                                        // 0x0000 (size: 0x28)
    FSlateColor SubmitColor;                                                          // 0x0028 (size: 0x28)
    FSlateColor ItemColor;                                                            // 0x0050 (size: 0x28)
    FSlateColor QuantityColor;                                                        // 0x0078 (size: 0x28)

}; // Size: 0xA0

struct FLogWhisperMessage
{
    FString SenderName;                                                               // 0x0000 (size: 0x10)
    FString SenderOnlineId;                                                           // 0x0010 (size: 0x10)
    int8 SenderFactionId;                                                             // 0x0020 (size: 0x1)
    FString RecipientName;                                                            // 0x0028 (size: 0x10)
    FString RecipientOnlineID;                                                        // 0x0038 (size: 0x10)
    FString Text;                                                                     // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FLoreData
{
    FText HeaderText;                                                                 // 0x0000 (size: 0x18)
    FSlateBrush Icon;                                                                 // 0x0018 (size: 0x88)
    FText FlavourText;                                                                // 0x00A0 (size: 0x18)
    FText BodyText;                                                                   // 0x00B8 (size: 0x18)
    FText HintText;                                                                   // 0x00D0 (size: 0x18)
    TArray<FName> ActionNames;                                                        // 0x00E8 (size: 0x10)

}; // Size: 0xF8

struct FMapData
{
    FText DisplayName;                                                                // 0x0000 (size: 0x18)
    EWorldConquestMapId WorldConquestMapId;                                           // 0x0018 (size: 0x1)
    class UTexture2D* Image;                                                          // 0x0020 (size: 0x8)
    bool bIsInHexGrid;                                                                // 0x0028 (size: 0x1)
    FIntPoint GridCoord;                                                              // 0x002C (size: 0x8)
    bool bIsIsland;                                                                   // 0x0034 (size: 0x1)
    bool bCanOceanTravel;                                                             // 0x0035 (size: 0x1)

}; // Size: 0x50

struct FMapDetailStockpileInfo
{
    TArray<FStockpileEntry> Items;                                                    // 0x0000 (size: 0x10)
    TArray<FStockpileEntry> ItemCrates;                                               // 0x0010 (size: 0x10)
    TArray<FStockpileEntry> Vehicles;                                                 // 0x0020 (size: 0x10)
    TArray<FStockpileEntry> VehicleCrates;                                            // 0x0030 (size: 0x10)
    TArray<FStockpileEntry> Structures;                                               // 0x0040 (size: 0x10)
    TArray<FStockpileEntry> StructureCrates;                                          // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FMapElementScale
{
    float MapData;                                                                    // 0x0000 (size: 0x4)
    float MapIntel;                                                                   // 0x0004 (size: 0x4)
    float MapText;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMapElementVisibilityZoomThresholds
{
    FVector2D MapNames;                                                               // 0x0000 (size: 0x8)
    FVector2D MapData;                                                                // 0x0008 (size: 0x8)
    FVector2D MajorMapMarkerText;                                                     // 0x0010 (size: 0x8)
    FVector2D MinorMapMarkerText;                                                     // 0x0018 (size: 0x8)
    FVector2D MapIntel;                                                               // 0x0020 (size: 0x8)
    FVector2D MapGrid;                                                                // 0x0028 (size: 0x8)
    FVector2D HexBorder;                                                              // 0x0030 (size: 0x8)
    FVector2D MapPostLowRank;                                                         // 0x0038 (size: 0x8)
    FVector2D MapPostHighRank;                                                        // 0x0040 (size: 0x8)
    FVector2D RegionZones;                                                            // 0x0048 (size: 0x8)
    FVector2D Weather;                                                                // 0x0050 (size: 0x8)
    FVector2D Railways;                                                               // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FMapGridConfig
{
    FLinearColor BackgroundColor;                                                     // 0x0000 (size: 0x10)
    FSlateBrush BackgroundImage;                                                      // 0x0010 (size: 0x88)
    float BackgroundImageScale;                                                       // 0x0098 (size: 0x4)
    FLinearColor LineColor;                                                           // 0x009C (size: 0x10)
    FLinearColor KeypadLineColor;                                                     // 0x00AC (size: 0x10)
    float LineThickness;                                                              // 0x00BC (size: 0x4)
    float LineExtension;                                                              // 0x00C0 (size: 0x4)
    FLinearColor KeypadHighlightColor;                                                // 0x00C4 (size: 0x10)
    float KeypadTextItemScale;                                                        // 0x00D4 (size: 0x4)
    FLinearColor TextColor;                                                           // 0x00D8 (size: 0x10)
    FLinearColor KeypadTextColor;                                                     // 0x00E8 (size: 0x10)
    float LetterPositionOffsetY;                                                      // 0x00F8 (size: 0x4)
    float NumberPositionOffsetX;                                                      // 0x00FC (size: 0x4)
    float TextItemScale;                                                              // 0x0100 (size: 0x4)

}; // Size: 0x108

struct FMapIconStyle
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    EMapIconCategory Category;                                                        // 0x0008 (size: 0x2)
    bool bHideInSecureMap;                                                            // 0x000A (size: 0x1)
    bool bUseTeamSpecificIcon;                                                        // 0x000B (size: 0x1)
    float IntelDetectionRadius;                                                       // 0x000C (size: 0x4)
    float HalfDetectionAngle;                                                         // 0x0010 (size: 0x4)
    uint32 SortOrder;                                                                 // 0x0014 (size: 0x4)
    FSlateBrush FactionIconBrushes;                                                   // 0x0018 (size: 0x198)

}; // Size: 0x1B0

struct FMapIntelHistoricSnapshot
{
}; // Size: 0x18

struct FMapIntelList
{
    int8 MapId;                                                                       // 0x0000 (size: 0x1)
    TArray<int64> PackedIntelItems;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMapIntelLoSRequest
{
}; // Size: 0x28

struct FMapIntelRequest
{
}; // Size: 0x1

struct FMapIntelResponse
{
    TArray<FMapIntelList> MapIntelLists;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMapIntelUpdate
{
    int8 MapId;                                                                       // 0x0000 (size: 0x1)
    TArray<int64> PackedColonialIntelItems;                                           // 0x0008 (size: 0x10)
    TArray<int64> PackedWardenIntelItems;                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMapIntelligenceItem
{
    uint8 TeamId;                                                                     // 0x0000 (size: 0x1)
    EMapIntelligenceType Type;                                                        // 0x0001 (size: 0x1)
    float TimeRemaining;                                                              // 0x0004 (size: 0x4)
    FVector2D Location;                                                               // 0x0008 (size: 0x8)
    FVector2D NormalizedMapLocation;                                                  // 0x0010 (size: 0x8)
    bool bStructureWasAttackedRecently;                                               // 0x0018 (size: 0x1)
    uint8 ListeningTeamID;                                                            // 0x0019 (size: 0x1)

}; // Size: 0x1C

struct FMapIntelligenceTypeConfig
{
    EMapIntelCategory Category;                                                       // 0x0000 (size: 0x2)
    float FadeSeconds;                                                                // 0x0004 (size: 0x4)
    float ExpirySeconds;                                                              // 0x0008 (size: 0x4)
    FMapIntelligenceTypeIcon FactionIconBrush;                                        // 0x0010 (size: 0x220)
    bool bRequiresPlayerLineOfSight;                                                  // 0x0230 (size: 0x1)

}; // Size: 0x238

struct FMapIntelligenceTypeIcon
{
    FSlateBrush IconBrush;                                                            // 0x0000 (size: 0x88)
    FSlateBrush FadedIconBrush;                                                       // 0x0088 (size: 0x88)

}; // Size: 0x110

struct FMapItem
{
    int32 ObjectIndex;                                                                // 0x0000 (size: 0x4)
    int32 ObjectSerialNumber;                                                         // 0x0004 (size: 0x4)
    EMapTeamId TeamId;                                                                // 0x0008 (size: 0x1)
    EMapTeamId ListeningTeamID;                                                       // 0x0009 (size: 0x1)
    EMapIconType IconType;                                                            // 0x000A (size: 0x1)
    uint8 Flags;                                                                      // 0x000B (size: 0x1)
    FVector2D NormalizedLocation;                                                     // 0x000C (size: 0x8)
    uint8 ViewDirection;                                                              // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FMapItemDetails
{
    uint16 Flags;                                                                     // 0x0000 (size: 0x2)
    int16 DetailValue;                                                                // 0x0002 (size: 0x2)
    int16 AltDetailValue;                                                             // 0x0004 (size: 0x2)
    FMapDetailStockpileInfo StockpileInfo;                                            // 0x0008 (size: 0x60)
    TArray<FReserveStockpileMapDetailInfo> ReserveStockpileInfoList;                  // 0x0068 (size: 0x10)
    TArray<uint8> Values;                                                             // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FMapItemInfo
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int16 DetailValue;                                                                // 0x0008 (size: 0x2)

}; // Size: 0xC

struct FMapLegendFactionStyle
{
    FSlateBrush InfantryBrush;                                                        // 0x0000 (size: 0x88)
    FSlateBrush VehicleBrush;                                                         // 0x0088 (size: 0x88)
    FSlateBrush LargeShipBrush;                                                       // 0x0110 (size: 0x88)
    FSlateBrush StructureBrush;                                                       // 0x0198 (size: 0x88)
    FSlateBrush DefenseBrush;                                                         // 0x0220 (size: 0x88)
    FSlateBrush HowitzerBrush;                                                        // 0x02A8 (size: 0x88)
    FSlateBrush OutpostBrush;                                                         // 0x0330 (size: 0x88)
    FSlateBrush FieldHospitalBrush;                                                   // 0x03B8 (size: 0x88)
    FSlateBrush FacilityBrush;                                                        // 0x0440 (size: 0x88)

}; // Size: 0x4C8

struct FMapLegendFilter
{
    uint16 VisibleCategories;                                                         // 0x0000 (size: 0x2)
    uint16 VisibleIntelC;                                                             // 0x0002 (size: 0x2)
    uint16 VisibleIntelW;                                                             // 0x0004 (size: 0x2)
    uint8 VisibleIcons;                                                               // 0x0006 (size: 0xC)

}; // Size: 0x12

struct FMapLegendStyle
{
    FSlateBrush WinConditionBrush;                                                    // 0x0000 (size: 0x88)
    FMapLegendFactionStyle Colonial;                                                  // 0x0088 (size: 0x4C8)
    FMapLegendFactionStyle Warden;                                                    // 0x0550 (size: 0x4C8)

}; // Size: 0xA18

struct FMapPostDetails
{
    uint16 Flags;                                                                     // 0x0000 (size: 0x2)
    TArray<FMapPostItemEntry> SummedItems;                                            // 0x0008 (size: 0x10)
    TArray<FMapItemInfo> MapItemInfos;                                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMapPostEntry
{
    FMapPostMember Member;                                                            // 0x0000 (size: 0x20)
    FString Text;                                                                     // 0x0020 (size: 0x10)
    int64 UnixTimeStamp;                                                              // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FMapPostItemEntry
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int32 Quantity;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMapPostManager
{
}; // Size: 0x38

struct FMapPostMember
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString Name;                                                                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMapPostQueryData
{
    int32 MapPostID;                                                                  // 0x0000 (size: 0x4)
    int8 MapId;                                                                       // 0x0004 (size: 0x1)
    int8 FacilityMapPostType;                                                         // 0x0005 (size: 0x1)
    FVector2D NormalizedMapCoords;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMapPostReplyRequest
{
    FString OriginalPosterOnlineId;                                                   // 0x0000 (size: 0x10)
    FString ReplyText;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMapPostReplyResponse
{
    bool bSuccess;                                                                    // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FMapPostRequest
{
    int32 MapPostID;                                                                  // 0x0000 (size: 0x4)
    int8 OriginMapID;                                                                 // 0x0004 (size: 0x1)
    EFactionId RequesterFactionID;                                                    // 0x0005 (size: 0x1)
    FString RequesterOnlineID;                                                        // 0x0008 (size: 0x10)
    FUObjectHandle Requester;                                                         // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMapPostResponse
{
    FMapPostQueryData QueryData;                                                      // 0x0000 (size: 0x10)
    int8 OriginMapID;                                                                 // 0x0010 (size: 0x1)
    EFactionId RequesterFactionID;                                                    // 0x0011 (size: 0x1)
    FString RequesterOnlineID;                                                        // 0x0018 (size: 0x10)
    FUObjectHandle Requester;                                                         // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FMapPostStyle
{
    FSlateBrush MarkerIcon;                                                           // 0x0000 (size: 0x88)
    FLinearColor GlobalTeamColour;                                                    // 0x0088 (size: 0x10)
    FLinearColor SquadColour;                                                         // 0x0098 (size: 0x10)
    FLinearColor RegimentColour;                                                      // 0x00A8 (size: 0x10)
    FLinearColor IntelligenceColour;                                                  // 0x00B8 (size: 0x10)
    FLinearColor FacilityColour;                                                      // 0x00C8 (size: 0x10)
    FLinearColor LogisticsColour;                                                     // 0x00D8 (size: 0x10)
    FButtonStyle UpVoteButton;                                                        // 0x00E8 (size: 0x278)
    FButtonStyle UpVoteButtonVoted;                                                   // 0x0360 (size: 0x278)
    FButtonStyle DownVoteButton;                                                      // 0x05D8 (size: 0x278)
    FButtonStyle DownVoteButtonVoted;                                                 // 0x0850 (size: 0x278)
    FButtonStyle ReplyButton;                                                         // 0x0AC8 (size: 0x278)
    FEditableTextBoxStyle TextInputBoxStyle;                                          // 0x0D40 (size: 0x7F0)
    FSlateBrush BackgroundImage;                                                      // 0x1530 (size: 0x88)
    FSlateBrush ContentBackgroundImage;                                               // 0x15B8 (size: 0x88)
    FSlateBrush FacilityPostMapIcons;                                                 // 0x1640 (size: 0x3B8)

}; // Size: 0x19F8

struct FMapPostVoteRequest
{
    FString OriginalPosterOnlineId;                                                   // 0x0000 (size: 0x10)
    EMapPostVoteType VoteType;                                                        // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FMapPostVoteResponse
{
    bool bSuccess;                                                                    // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FMapRailwayFactionMessage
{
    int8 FactionId;                                                                   // 0x0000 (size: 0x1)
    int8 MapId;                                                                       // 0x0001 (size: 0x1)
    TArray<FMapRailwayLine> Lines;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMapRailwayLine
{
    FVector2D P0;                                                                     // 0x0000 (size: 0x8)
    FVector2D P1;                                                                     // 0x0008 (size: 0x8)
    FVector2D P2;                                                                     // 0x0010 (size: 0x8)
    FVector2D P3;                                                                     // 0x0018 (size: 0x8)
    FVector2D P4;                                                                     // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FMapRailwayMessage
{
    int8 MapId;                                                                       // 0x0000 (size: 0x1)
    int32 Version;                                                                    // 0x0004 (size: 0x4)
    TArray<FMapRailwayLine> Lines;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMapRailwayRequest
{
}; // Size: 0x1

struct FMapRailwayResponse
{
    TArray<FMapRailwayMessage> Messages;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMapSnapshotDatum
{
    uint32 IntelCount;                                                                // 0x0000 (size: 0x4)
    bool RequesterScouted;                                                            // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FMapSnapshotRequest
{
}; // Size: 0x58

struct FMapStyle : public FSlateWidgetStyle
{
    FTextBlockStyle MapMarkerTextBlockStyle;                                          // 0x0008 (size: 0x268)
    FTextBlockStyle MajorMapMarkerTextBlockStyle;                                     // 0x0270 (size: 0x268)
    FTextBlockStyle MapNameTextBlockStyle;                                            // 0x04D8 (size: 0x268)
    FSlateBrush PlayerMarkerBrush;                                                    // 0x0740 (size: 0x88)
    FSlateBrush ClaimedTownColonial;                                                  // 0x07C8 (size: 0x88)
    FSlateBrush ClaimedTownWarden;                                                    // 0x0850 (size: 0x88)
    FSlateBrush WatchTowerRadiusBrush;                                                // 0x08D8 (size: 0x88)
    FSlateBrush WatchTowerConeBrush;                                                  // 0x0960 (size: 0x88)
    FMapGridConfig GridConfig;                                                        // 0x09E8 (size: 0x108)
    FLinearColor DisabledRegionTint;                                                  // 0x0AF0 (size: 0x10)
    float MinZoom;                                                                    // 0x0B00 (size: 0x4)
    float DefaultZoom;                                                                // 0x0B04 (size: 0x4)
    float MaxZoom;                                                                    // 0x0B08 (size: 0x4)
    FMapElementVisibilityZoomThresholds MapElementVisibilityZoomThresholds;           // 0x0B0C (size: 0x60)
    FMapElementScale MapElementScale;                                                 // 0x0B6C (size: 0xC)
    FLinearColor HexBorderColour;                                                     // 0x0B78 (size: 0x10)
    FLinearColor OceanZoneColour;                                                     // 0x0B88 (size: 0x10)
    float HexBorderThickness;                                                         // 0x0B98 (size: 0x4)
    float MinIconScale;                                                               // 0x0B9C (size: 0x4)
    float MaxIconScale;                                                               // 0x0BA0 (size: 0x4)
    float MinIntelIconScale;                                                          // 0x0BA4 (size: 0x4)
    float MaxIntelIconScale;                                                          // 0x0BA8 (size: 0x4)
    float MinPlayerMarkerScale;                                                       // 0x0BAC (size: 0x4)
    float MaxPlayerMarkerScale;                                                       // 0x0BB0 (size: 0x4)
    FSlateBrush TownBaseBrush;                                                        // 0x0BB8 (size: 0x88)
    FMapLegendStyle LegendStyle;                                                      // 0x0C40 (size: 0xA18)
    FLinearColor ScorchedIconColor;                                                   // 0x1658 (size: 0x10)
    FSlateBrush RegionMapContextBG;                                                   // 0x1668 (size: 0x88)
    FWinConditionStyle WinConditionStyle;                                             // 0x16F0 (size: 0x330)
    FMapPostStyle MapPostStyle;                                                       // 0x1A20 (size: 0x19F8)
    FTravelMapStyle TravelMapStyle;                                                   // 0x3418 (size: 0x530)
    FMapIconStyle MapIconStyles;                                                      // 0x3948 (size: 0x9480)

}; // Size: 0xCDC8

struct FMapTextItem
{
    FVector2D NormalizedLocation;                                                     // 0x0000 (size: 0x8)
    FString Text;                                                                     // 0x0008 (size: 0x10)
    EMapMarkerType MapMarkerType;                                                     // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FMaterialOverride
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    class UMaterialInstance* Material;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMeleeAttackData
{
    float StaminaCostNormalized;                                                      // 0x0000 (size: 0x4)
    float Damage;                                                                     // 0x0004 (size: 0x4)
    float Delay;                                                                      // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FMeleeDynamicData : public FTableRowBase
{
    float ChargingMaxSpeedModifier;                                                   // 0x0008 (size: 0x4)
    float BlockingMaxSpeedModifier;                                                   // 0x000C (size: 0x4)
    FMeleeAttackData QuickAttack;                                                     // 0x0010 (size: 0xC)
    FMeleeAttackData LongAttack;                                                      // 0x001C (size: 0xC)

}; // Size: 0x28

struct FMeshConfigSurfaceSettings
{
    bool bEnableSurfaceDeltaLowerBound;                                               // 0x0000 (size: 0x1)
    float SurfaceDeltaLowerBound;                                                     // 0x0004 (size: 0x4)
    bool bEnableSurfaceDeltaUpperBound;                                               // 0x0008 (size: 0x1)
    float SurfaceDeltaUpperBound;                                                     // 0x000C (size: 0x4)
    bool bRequireBothSidesWithinBounds;                                               // 0x0010 (size: 0x1)
    TArray<class UPhysicalMaterial*> PhysMatBlockList;                                // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMeshStop
{
    int32 Threshold;                                                                  // 0x0000 (size: 0x4)
    class UStaticMesh* StaticMesh;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FModBanRequest
{
    FString TargetOnlineID;                                                           // 0x0000 (size: 0x10)
    FString TargetPlayerName;                                                         // 0x0010 (size: 0x10)
    FString TargetDeviceId;                                                           // 0x0020 (size: 0x10)
    int8 TargetPlayerTeamId;                                                          // 0x0030 (size: 0x1)
    int64 BanDurationSec;                                                             // 0x0038 (size: 0x8)
    int64 UnderReviewDurationSec;                                                     // 0x0040 (size: 0x8)
    EBanReason BanReason;                                                             // 0x0048 (size: 0x1)
    FString AdminOnlineID;                                                            // 0x0050 (size: 0x10)
    FString AdminPlayerName;                                                          // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FModerationHelper
{
}; // Size: 0x1

struct FModificationDefinition
{
    FText DisplayName;                                                                // 0x0000 (size: 0x18)
    FText Description;                                                                // 0x0018 (size: 0x18)
    FSlateBrush Icon;                                                                 // 0x0030 (size: 0x88)
    int64 RequiredSocketConnectionMask;                                               // 0x00B8 (size: 0x8)
    int64 HiddenBySocketConnectionMask;                                               // 0x00C0 (size: 0x8)
    bool bIsRemovable;                                                                // 0x00C8 (size: 0x1)
    bool bVehicleBlocksRemoval;                                                       // 0x00C9 (size: 0x1)
    bool bHiddenByDefault;                                                            // 0x00CA (size: 0x1)
    bool bVisualsAreClientOnly;                                                       // 0x00CB (size: 0x1)
    bool bShowInBuildSite;                                                            // 0x00CC (size: 0x1)
    bool bBuildFootprintIgnoresConnectedActors;                                       // 0x00CD (size: 0x1)
    ETechID TechID;                                                                   // 0x00CE (size: 0x2)
    EInfrastructureType InfrastructureType;                                           // 0x00D0 (size: 0x1)
    int32 InfrastructureAmount;                                                       // 0x00D4 (size: 0x4)
    TSubclassOf<class AModificationTemplate> BuildFootprintTemplate;                  // 0x00D8 (size: 0x8)
    TMap<class EFortTier, class FModificationTier> Tiers;                             // 0x00E0 (size: 0x50)

}; // Size: 0x130

struct FModificationSlotMigration
{
    uint8 PreviousComponentDirection;                                                 // 0x0000 (size: 0x1)
    EFortModificationType ModificationType;                                           // 0x0001 (size: 0x1)
    FName SlotName;                                                                   // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FModificationSocketPreviewInfo
{
    FName ModificationSlotComponentName;                                              // 0x0000 (size: 0x8)
    EFortModificationType ModificationType;                                           // 0x0008 (size: 0x1)
    EFortTier ModificationTier;                                                       // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FModificationTier
{
    FResourceAmounts ResourceAmounts;                                                 // 0x0000 (size: 0x20)
    FResourceAmounts RemoveCostOverride;                                              // 0x0020 (size: 0x20)
    bool bUseTemplateActor;                                                           // 0x0040 (size: 0x1)
    class UStaticMesh* TemplateMesh;                                                  // 0x0048 (size: 0x8)
    TSubclassOf<class AModificationTemplate> TemplateActor;                           // 0x0050 (size: 0x8)
    bool bUsePreviewMesh;                                                             // 0x0058 (size: 0x1)
    class UStaticMesh* PreviewMesh;                                                   // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FModifiedFoliageInfo
{
}; // Size: 0x10

struct FModifiedRegimentIdMessage
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    int8 FactionId;                                                                   // 0x0004 (size: 0x1)
    FString OnlineID;                                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FModifiedSquadIdMessage
{
    int8 FactionId;                                                                   // 0x0000 (size: 0x1)
    FString OnlineID;                                                                 // 0x0008 (size: 0x10)
    TArray<FModifiedSquadIdRecord> Records;                                           // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FModifiedSquadIdRecord
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    bool bIsLeader;                                                                   // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FModifiedSquadInfoMessage
{
    FSquadInfo SquadInfo;                                                             // 0x0000 (size: 0x40)

}; // Size: 0x40

struct FModifiedSquadMessage
{
    FSquad ModifiedSquad;                                                             // 0x0000 (size: 0x68)

}; // Size: 0x68

struct FModularMount
{
    FName ItemCodeName;                                                               // 0x0000 (size: 0x8)
    FName CodeName;                                                                   // 0x0008 (size: 0x8)
    TSubclassOf<class UMountComponent> Component;                                     // 0x0010 (size: 0x8)
    class USkeletalMesh* SkeletalMesh;                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FModularMounts
{
    TArray<FModularMount> Entries;                                                    // 0x0000 (size: 0x10)

}; // Size: 0x20

struct FMountDynamicData : public FTableRowBase
{
    float SuppressionMultiplier;                                                      // 0x0008 (size: 0x4)
    float MaxHorizontalDeviation;                                                     // 0x000C (size: 0x4)
    float MaxVerticalDeviation;                                                       // 0x0010 (size: 0x4)
    float CoverProvided;                                                              // 0x0014 (size: 0x4)
    FWeaponFiringConeInfo FiringConeInfo;                                             // 0x0018 (size: 0x1C)
    float TrackingSpeed;                                                              // 0x0034 (size: 0x4)
    float TrackingThreshold;                                                          // 0x0038 (size: 0x4)
    int32 MaxAmmo;                                                                    // 0x003C (size: 0x4)
    float MinDistance;                                                                // 0x0040 (size: 0x4)
    float MaxDistance;                                                                // 0x0044 (size: 0x4)
    float MaxReachability;                                                            // 0x0048 (size: 0x4)
    int32 ScopeRadius;                                                                // 0x004C (size: 0x4)
    float MinYaw;                                                                     // 0x0050 (size: 0x4)
    float MaxYaw;                                                                     // 0x0054 (size: 0x4)
    float YawOffset;                                                                  // 0x0058 (size: 0x4)
    float MinPitch;                                                                   // 0x005C (size: 0x4)
    float MaxPitch;                                                                   // 0x0060 (size: 0x4)
    float FiringDuration;                                                             // 0x0064 (size: 0x4)
    float ReloadDuration;                                                             // 0x0068 (size: 0x4)
    float DamageMultiplier;                                                           // 0x006C (size: 0x4)
    float ArtilleryAccuracyMinDist;                                                   // 0x0070 (size: 0x4)
    float ArtilleryAccuracyMaxDist;                                                   // 0x0074 (size: 0x4)
    float AddedBurningMultiplier;                                                     // 0x0078 (size: 0x4)
    float FiringImpulse;                                                              // 0x007C (size: 0x4)
    float ArmourDamageModifier;                                                       // 0x0080 (size: 0x4)
    float TargetStabilityReductionPerShot;                                            // 0x0084 (size: 0x4)
    float BreachingModifier;                                                          // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FMovementModifierData
{
    FMovementModifierForStanceData Stances;                                           // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FMovementModifierForStanceData
{
    float TurnRateScale;                                                              // 0x0000 (size: 0x4)
    float WalkingSpeedScale;                                                          // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FMultiAmmo
{
    int32 Ammo;                                                                       // 0x0000 (size: 0x4)
    FName AmmoType;                                                                   // 0x0004 (size: 0x8)
    FName DesiredAmmoType;                                                            // 0x000C (size: 0x8)
    TArray<FName> CompatibleAmmoNames;                                                // 0x0018 (size: 0x10)
    TArray<int32> AmmoSlotFilterAmounts;                                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMultiConversionInfo
{
    TArray<FConversionItem> ItemInput;                                                // 0x0000 (size: 0x10)
    TArray<FConversionItem> CrateInput;                                               // 0x0010 (size: 0x10)
    TArray<FConversionLiquid> LiquidInput;                                            // 0x0020 (size: 0x10)
    TArray<FConversionItem> ItemOutput;                                               // 0x0030 (size: 0x10)
    TArray<FConversionItem> CrateOutput;                                              // 0x0040 (size: 0x10)
    TArray<FConversionLiquid> LiquidOutput;                                           // 0x0050 (size: 0x10)
    int32 Duration;                                                                   // 0x0060 (size: 0x4)
    int32 PowerDelta;                                                                 // 0x0064 (size: 0x4)
    bool bConsumeResourceNodes;                                                       // 0x0068 (size: 0x1)

}; // Size: 0x70

struct FMuzzleInfo
{
    int32 GunnerIndex;                                                                // 0x0000 (size: 0x4)
    int32 MuzzleIndex;                                                                // 0x0004 (size: 0x4)
    FName SocketName;                                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMuzzleOffsetVector_NetQuantize : public FVector
{
}; // Size: 0xC

struct FNamedParameterRange
{
    FName Name;                                                                       // 0x0000 (size: 0x8)
    float Start;                                                                      // 0x0008 (size: 0x4)
    float End;                                                                        // 0x000C (size: 0x4)

}; // Size: 0x10

struct FNewsItemInfo
{
    class UTexture2DDynamic* ImageTexture;                                            // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FOutfitMeshInfo
{
    TMap<class EOutfitMeshInfoType, class FCharacterRenderInfo> OutfitMeshTable;      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FOutpostInfo
{
    int8 TeamId;                                                                      // 0x0000 (size: 0x1)
    FVector2D_NetQuantize Location;                                                   // 0x0004 (size: 0xC)

}; // Size: 0x10

struct FPIDController
{
    FVector PID;                                                                      // 0x0000 (size: 0xC)
    float IntegralSaturation;                                                         // 0x000C (size: 0x4)
    float OutputSaturation;                                                           // 0x0010 (size: 0x4)
    bool bUseValueRate;                                                               // 0x0020 (size: 0x1)

}; // Size: 0x24

struct FPathSocket
{
    uint8 ID;                                                                         // 0x0000 (size: 0x1)
    float PackedAlpha;                                                                // 0x0004 (size: 0x4)
    TWeakObjectPtr<class UBuildSocketComponent> Socket;                               // 0x0008 (size: 0x8)
    FTimerHandle CleanupHandle;                                                       // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPayloadMeshes
{
    int32 GunnerIndex;                                                                // 0x0050 (size: 0x4)
    bool bUseForMuzzleTransform;                                                      // 0x0054 (size: 0x1)

}; // Size: 0x58

struct FPhysicalMaterialResolver
{
    TArray<class UPhysicalMaterial*> MaterialsEffectedByImpact;                       // 0x0000 (size: 0x10)
    class UPhysicalMaterial* ImpactedMaterial;                                        // 0x0010 (size: 0x8)
    class UPhysicalMaterial* SnowMaterial;                                            // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPipelineSocket
{
    EPipeType Type;                                                                   // 0x0000 (size: 0x1)
    uint8 Index;                                                                      // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FPipelineSystem
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    float Amount;                                                                     // 0x0008 (size: 0x4)
    float MaxAmount;                                                                  // 0x000C (size: 0x4)

}; // Size: 0x28

struct FPlayerActivity
{
    float EnemyPlayerDamage;                                                          // 0x0000 (size: 0x4)
    float FriendlyPlayerDamage;                                                       // 0x0004 (size: 0x4)
    float EnemyDamage;                                                                // 0x0008 (size: 0x4)
    float FriendlyDamage;                                                             // 0x000C (size: 0x4)
    int32 FriendlyConstruction;                                                       // 0x0010 (size: 0x4)
    int32 FriendlyRepairing;                                                          // 0x0014 (size: 0x4)
    float FriendlyHealing;                                                            // 0x0018 (size: 0x4)
    int16 FriendlyRevivals;                                                           // 0x001C (size: 0x2)
    int16 VehiclesTransferred;                                                        // 0x001E (size: 0x2)
    float VehicleSelfDamage;                                                          // 0x0020 (size: 0x4)
    float VehicleSelfDamageC;                                                         // 0x0024 (size: 0x4)
    float VehicleSelfDamageW;                                                         // 0x0028 (size: 0x4)
    int32 MaterialsSubmitted;                                                         // 0x002C (size: 0x4)
    int32 MaterialsGathered;                                                          // 0x0030 (size: 0x4)
    int32 SuppliesDelivered;                                                          // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FPlayerAdjustment
{
    FVector NewLocation;                                                              // 0x0000 (size: 0xC)
    FVector NewVelocity;                                                              // 0x000C (size: 0xC)
    class UPrimitiveComponent* NewBase;                                               // 0x0018 (size: 0x8)
    FName NewBaseBoneName;                                                            // 0x0020 (size: 0x8)
    bool bHasBase;                                                                    // 0x0028 (size: 0x1)
    bool bBaseRelativePosition;                                                       // 0x0029 (size: 0x1)
    bool bBaseRelativeVelocity;                                                       // 0x002A (size: 0x1)
    uint8 ServerMovementMode;                                                         // 0x002B (size: 0x1)
    uint8 QuantizedStagger;                                                           // 0x002C (size: 0x1)

}; // Size: 0x30

struct FPlayerBan
{
    int64 BanLiftTimeUnix;                                                            // 0x0000 (size: 0x8)
    int64 UnderReviewLiftTimeUnix;                                                    // 0x0008 (size: 0x8)
    EBanReason BanReason;                                                             // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FPlayerModBannedMessage
{
    FModBanRequest ModBanRequest;                                                     // 0x0000 (size: 0x70)
    bool bIsSenderServer;                                                             // 0x0070 (size: 0x1)

}; // Size: 0x78

struct FPlayerServerData
{
    EFactionId FactionId;                                                             // 0x0000 (size: 0x1)
    EWorldConquestMapId RegionId;                                                     // 0x0001 (size: 0x1)
    EPermissionLevel PermissionLevel;                                                 // 0x0002 (size: 0x1)
    FString Name;                                                                     // 0x0008 (size: 0x10)
    FString OnlineID;                                                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FPlayerSpawnPoints
{
    FGlobalSpawnPoint StaticBase;                                                     // 0x0000 (size: 0x10)
    FGlobalSpawnPoint ForwardBase;                                                    // 0x0010 (size: 0x10)
    FGlobalSpawnPoint MedicalBase;                                                    // 0x0020 (size: 0x10)
    ESpawnPointCategory SelectedCategory;                                             // 0x0030 (size: 0x1)

}; // Size: 0x34

struct FPlayerSpawnPointsInfo
{
    FSpawnPointInfo StaticBase;                                                       // 0x0000 (size: 0x6)
    FSpawnPointInfo ForwardBase;                                                      // 0x0006 (size: 0x6)
    FSpawnPointInfo MedicalBase;                                                      // 0x000C (size: 0x6)

}; // Size: 0x12

struct FPlayerVoteBannedMessage
{
    FVoteKickRequest VoteKickRequest;                                                 // 0x0000 (size: 0x58)
    bool bIsSenderServer;                                                             // 0x0058 (size: 0x1)
    int64 BanDurationSec;                                                             // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FPlayerVoteKickInfo
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    FString DeviceID;                                                                 // 0x0020 (size: 0x10)
    int32 RegimentID;                                                                 // 0x0030 (size: 0x4)
    uint8 TeamId;                                                                     // 0x0034 (size: 0x1)
    EUserVoteKickCategory VoteKickCategory;                                           // 0x0035 (size: 0x1)
    TMap<EUserVoteKickCategory, int32> VoteKickCategoryCountMap;                      // 0x0038 (size: 0x50)
    float RecentTeamKills;                                                            // 0x0088 (size: 0x4)
    float RecentFriendlyCharacterDamage;                                              // 0x008C (size: 0x4)
    float RecentFriendlyStructureDamage;                                              // 0x0090 (size: 0x4)
    float RecentFriendlyVehicleDamage;                                                // 0x0094 (size: 0x4)
    int16 RecentNameChanges;                                                          // 0x0098 (size: 0x2)

}; // Size: 0xA0

struct FPlayerWarState
{
    int8 LastTeamId;                                                                  // 0x0000 (size: 0x1)
    float TimePlayedTeam0;                                                            // 0x0004 (size: 0x4)
    float TimePlayedTeam1;                                                            // 0x0008 (size: 0x4)
    FPlayerSpawnPoints SpawnPoints;                                                   // 0x000C (size: 0x34)
    FDeployHistory DeployHistory;                                                     // 0x0040 (size: 0x10)
    FTechTreeComponentVotes TechTreeVotes;                                            // 0x0050 (size: 0x2)
    EZombieType ZombieType;                                                           // 0x0052 (size: 0x1)
    int32 NumUnstuckCommandsUsed;                                                     // 0x0054 (size: 0x4)
    FDateTime LastPostTravelInvul;                                                    // 0x0058 (size: 0x8)
    FDateTime LastResourceSpawn;                                                      // 0x0060 (size: 0x8)
    float TimeInConquest;                                                             // 0x0068 (size: 0x4)
    FPlayerActivity Activity;                                                         // 0x006C (size: 0x38)

}; // Size: 0xA8

struct FPowerGridInfo
{
    int32 PowerDelta;                                                                 // 0x0000 (size: 0x4)
    int32 MaxConnections;                                                             // 0x0004 (size: 0x4)
    bool bAllowDisabling;                                                             // 0x0009 (size: 0x1)
    bool bIsDisabled;                                                                 // 0x000A (size: 0x1)
    int32 PowerProvided;                                                              // 0x000C (size: 0x4)
    int32 PowerConsumed;                                                              // 0x0010 (size: 0x4)
    TWeakObjectPtr<class AActor> Connections;                                         // 0x0014 (size: 0x20)
    FName ConnectionNames;                                                            // 0x0034 (size: 0x20)

}; // Size: 0x5C

struct FProductionResource
{
    FName ItemCodeName;                                                               // 0x0000 (size: 0x8)
    uint16 Quantity;                                                                  // 0x0008 (size: 0x2)

}; // Size: 0xC

struct FProgressBarButtonStyle
{
    FSlateBrush BGImage;                                                              // 0x0000 (size: 0x88)
    FSlateBrush FillImage;                                                            // 0x0088 (size: 0x88)
    FButtonStyle Button;                                                              // 0x0110 (size: 0x278)

}; // Size: 0x388

struct FProjectileHitInfo_NetQuantize
{
    FVector_NetQuantize ImpactPoint;                                                  // 0x0000 (size: 0xC)
    FVector_NetQuantizeNormal ImpactNormal;                                           // 0x000C (size: 0xC)
    TWeakObjectPtr<class AActor> Actor;                                               // 0x0018 (size: 0x8)
    TWeakObjectPtr<class UPrimitiveComponent> Component;                              // 0x0020 (size: 0x8)
    FName BoneName;                                                                   // 0x0028 (size: 0x8)
    TWeakObjectPtr<class UPhysicalMaterial> PhysMaterial;                             // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FPuddleDecalInfo
{
    FDecalData Decal;                                                                 // 0x0000 (size: 0x20)
    TArray<class UPhysicalMaterial*> RequiredPhysMats;                                // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPuddleInfo
{
    FVector Location;                                                                 // 0x0000 (size: 0xC)
    FQuat Rotation;                                                                   // 0x0010 (size: 0x10)
    class UPuddleComponent* Volume;                                                   // 0x0020 (size: 0x8)
    class UDecalComponent* Decal;                                                     // 0x0028 (size: 0x8)
    TWeakObjectPtr<class AActor> SpawnBlocker;                                        // 0x0030 (size: 0x8)
    float Radius;                                                                     // 0x0038 (size: 0x4)
    float Rainfall;                                                                   // 0x003C (size: 0x4)
    float MaxRainfall;                                                                // 0x0040 (size: 0x4)
    int8 DecalIx;                                                                     // 0x0044 (size: 0x1)
    int8 DevastatedDecalIx;                                                           // 0x0045 (size: 0x1)
    int8 SpawnedDecalIx;                                                              // 0x0046 (size: 0x1)

}; // Size: 0x50

struct FPutProfileRequest
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FWarPlayerProfileSerialized WarPlayerProfileSerialized;                           // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FQuantizedTimestamp
{
    uint32 Value;                                                                     // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FQueueStyle
{
    FSlateBrush ProductionArrowRightBGImage;                                          // 0x0000 (size: 0x88)
    FSlateBrush ProductionArrowRightFillImage;                                        // 0x0088 (size: 0x88)
    FSlateBrush ProgressBarBGImage;                                                   // 0x0110 (size: 0x88)
    FSlateBrush ProgressBarFillImage;                                                 // 0x0198 (size: 0x88)
    FSlateBrush EmptyButtonImage;                                                     // 0x0220 (size: 0x88)
    FButtonStyle AddButtonStyle;                                                      // 0x02A8 (size: 0x278)
    FButtonStyle CancelButtonStyle;                                                   // 0x0520 (size: 0x278)
    FButtonStyle SubmitButtonStyle;                                                   // 0x0798 (size: 0x278)
    FButtonStyle PickupButtonStyle;                                                   // 0x0A10 (size: 0x278)
    FButtonStyle UpgradeButtonStyle;                                                  // 0x0C88 (size: 0x278)
    FSlateBrush TimerIcon;                                                            // 0x0F00 (size: 0x88)
    FSlateBrush CostBackgroundStyle;                                                  // 0x0F88 (size: 0x88)
    FComboBoxStyle AccessLevelStyle;                                                  // 0x1010 (size: 0x3D8)
    FSlateColor QueueTimerColor;                                                      // 0x13E8 (size: 0x28)

}; // Size: 0x1410

struct FQueuedPlayer
{
    FUniqueNetIdRepl UniqueId;                                                        // 0x0000 (size: 0x28)
    class AWarBeaconClient* BeaconClient;                                             // 0x0028 (size: 0x8)
    FDateTime TimeoutTime;                                                            // 0x0030 (size: 0x8)
    bool IsConnected;                                                                 // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FRPCBorderBaseClaimRequest
{
    FUObjectHandle ObjectHandle;                                                      // 0x0000 (size: 0x8)
    EWorldConquestMapId OriginMapID;                                                  // 0x0008 (size: 0x1)
    uint8 RoadID;                                                                     // 0x0009 (size: 0x1)
    EFactionId ClaimingFaction;                                                       // 0x000A (size: 0x1)

}; // Size: 0xC

struct FRPCBorderBaseClaimResponse
{
    FUObjectHandle ObjectHandle;                                                      // 0x0000 (size: 0x8)
    EFactionId ClaimingFaction;                                                       // 0x0008 (size: 0x1)
    uint8 Response;                                                                   // 0x0009 (size: 0x1)
    bool bIsUsable;                                                                   // 0x000A (size: 0x1)
    bool bAllowClaimOverride;                                                         // 0x000B (size: 0x1)

}; // Size: 0xC

struct FRPCCrossRegionActorBroadcast
{
    EWorldConquestMapId OriginServer;                                                 // 0x0000 (size: 0x1)
    int64 InitTicks;                                                                  // 0x0008 (size: 0x8)
    TArray<int32> Ids;                                                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FRPCCrossRegionActorRequest
{
    EWorldConquestMapId RequestingServer;                                             // 0x0000 (size: 0x1)
    TArray<int32> Ids;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRPCCrossRegionChangelistBroadcast
{
    EWorldConquestMapId OriginServer;                                                 // 0x0000 (size: 0x1)
    TArray<FCrossRegionActorData> NewActors;                                          // 0x0008 (size: 0x10)
    TArray<int32> RemovedActors;                                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FRPCIntelCenterFireListeningAreaEvent
{
    FVector2D Location2D;                                                             // 0x0000 (size: 0x8)
    EFactionId FactionId;                                                             // 0x0008 (size: 0x1)
    float Radius;                                                                     // 0x000C (size: 0x4)
    float Duration;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FRPCLRAFireShellEvent
{
    FVector2D Location2D;                                                             // 0x0000 (size: 0x8)
    EFactionId FactionId;                                                             // 0x0008 (size: 0x1)
    ELongRangeArtilleryType ArtilleryType;                                            // 0x0009 (size: 0x1)
    FVector2D ShooterLocation;                                                        // 0x000C (size: 0x8)

}; // Size: 0x14

struct FRPCMapItemRequest
{
    EWorldConquestMapId Origin;                                                       // 0x0000 (size: 0x1)
    EFactionId RequesterFactionID;                                                    // 0x0001 (size: 0x1)
    FString RequesterOnlineID;                                                        // 0x0008 (size: 0x10)
    FUObjectHandle Requester;                                                         // 0x0018 (size: 0x8)
    FUObjectHandle MapItem;                                                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FRPCMapItemResponse
{
    EWorldConquestMapId Origin;                                                       // 0x0000 (size: 0x1)
    FUObjectHandle Requester;                                                         // 0x0004 (size: 0x8)
    FUObjectHandle MapItem;                                                           // 0x000C (size: 0x8)
    FMapItemDetails MapItemDetails;                                                   // 0x0018 (size: 0x88)

}; // Size: 0xA0

struct FRPCMapPostMessage
{
    bool bFoundMapPostDetails;                                                        // 0x0000 (size: 0x1)
    int32 MapPostID;                                                                  // 0x0004 (size: 0x4)
    FMapPostDetails MapPostDetails;                                                   // 0x0008 (size: 0x28)
    FUObjectHandle Requester;                                                         // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FRPCRegionZoneRequest
{
    EWorldConquestMapId Origin;                                                       // 0x0000 (size: 0x1)
    FUObjectHandle Requester;                                                         // 0x0004 (size: 0x8)
    EFactionId Faction;                                                               // 0x000C (size: 0x1)

}; // Size: 0x10

struct FRPCRegionZoneResponse
{
    EWorldConquestMapId Origin;                                                       // 0x0000 (size: 0x1)
    FUObjectHandle Requester;                                                         // 0x0004 (size: 0x8)
    FRegionMinimalData Data;                                                          // 0x0010 (size: 0x28)

}; // Size: 0x38

struct FRPCRocketLaunchCodeRequest
{
    FUObjectHandle Requester;                                                         // 0x0000 (size: 0x8)
    uint16 LaunchCodeID;                                                              // 0x0008 (size: 0x2)
    EWorldConquestMapId Origin;                                                       // 0x000A (size: 0x1)
    EFactionId FactionId;                                                             // 0x000B (size: 0x1)
    FVector_NetQuantize LocalStrikeLocation;                                          // 0x000C (size: 0xC)

}; // Size: 0x18

struct FRPCRocketLaunchCodeResponse
{
    FUObjectHandle Requester;                                                         // 0x0000 (size: 0x8)
    uint16 LaunchCodeID;                                                              // 0x0008 (size: 0x2)
    EWorldConquestMapId Origin;                                                       // 0x000A (size: 0x1)
    ERocketLaunchResponse TraceResult;                                                // 0x000B (size: 0x1)
    FVector_NetQuantize LocalStrikeLocation;                                          // 0x000C (size: 0xC)
    FWarGridCoordinate Coordinate;                                                    // 0x0018 (size: 0x6)

}; // Size: 0x20

struct FRPCRocketLaunchFail
{
    uint16 LaunchCodeID;                                                              // 0x0000 (size: 0x2)
    EWorldConquestMapId Origin;                                                       // 0x0002 (size: 0x1)

}; // Size: 0x4

struct FRPCRocketPreLaunchAlert
{
    uint16 LaunchCodeID;                                                              // 0x0000 (size: 0x2)
    EWorldConquestMapId Origin;                                                       // 0x0002 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0003 (size: 0x1)
    EWorldConquestMapId TargetMapID;                                                  // 0x0004 (size: 0x1)
    FWarGridCoordinate Coordinate;                                                    // 0x0006 (size: 0x6)
    FVector_NetQuantize LocalStrikeLocation;                                          // 0x000C (size: 0xC)

}; // Size: 0x18

struct FRPCRocketPreLaunchUpdateAlert
{
    EWorldConquestMapId Origin;                                                       // 0x0000 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0001 (size: 0x1)
    EWorldConquestMapId TargetMapID;                                                  // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FRPCRocketTargetUpdate
{
    uint16 LaunchCodeID;                                                              // 0x0000 (size: 0x2)
    EWorldConquestMapId Origin;                                                       // 0x0002 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0003 (size: 0x1)
    FVector_NetQuantize LocalStrikeLocation;                                          // 0x0004 (size: 0xC)
    float LaunchTimeRemaining;                                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FRPCRocketTravel
{
    EWorldConquestMapId Origin;                                                       // 0x0000 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0001 (size: 0x1)
    FRocketLaunchCodeInfo Info;                                                       // 0x0004 (size: 0x1C)
    FVector_NetQuantize LocalStrikeLocation;                                          // 0x0020 (size: 0xC)

}; // Size: 0x2C

struct FRPCWeatherConnectRequest
{
    FWeatherStationID SenderID;                                                       // 0x0000 (size: 0x2)
    FWarGridCoordinate SenderCoordinate;                                              // 0x0002 (size: 0x6)
    FVector2D WorldLocation2D;                                                        // 0x0008 (size: 0x8)
    uint8 TargetLocalID;                                                              // 0x0010 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0011 (size: 0x1)

}; // Size: 0x14

struct FRPCWeatherConnectResponse
{
    FWeatherStationID SenderID;                                                       // 0x0000 (size: 0x2)
    FWarGridCoordinate SenderCoordinate;                                              // 0x0002 (size: 0x6)
    uint8 TargetLocalID;                                                              // 0x0008 (size: 0x1)
    EWeatherStationResult Result;                                                     // 0x0009 (size: 0x1)

}; // Size: 0xA

struct FRPCWeatherDisconnectEvent
{
    FWeatherStationID SenderID;                                                       // 0x0000 (size: 0x2)
    uint8 TargetLocalID;                                                              // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FRPCWeatherDisconnectRequest
{
    FWeatherStationID SenderID;                                                       // 0x0000 (size: 0x2)
    uint8 TargetLocalID;                                                              // 0x0002 (size: 0x1)
    EFactionId FactionId;                                                             // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FRPCWeatherDisconnectResponse
{
    FWeatherStationID SenderID;                                                       // 0x0000 (size: 0x2)
    uint8 TargetLocalID;                                                              // 0x0002 (size: 0x1)
    EWeatherStationResult Result;                                                     // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FRWDAdjustment
{
    FVector NewLoc;                                                                   // 0x0000 (size: 0xC)
    FQuat NewRot;                                                                     // 0x0010 (size: 0x10)
    FVector NewVelocity;                                                              // 0x0020 (size: 0xC)
    FVector NewAngularMomentum;                                                       // 0x002C (size: 0xC)
    uint8 ServerMovementMode;                                                         // 0x0038 (size: 0x1)
    class UPrimitiveComponent* NewBase;                                               // 0x0040 (size: 0x8)
    FName NewBaseBoneName;                                                            // 0x0048 (size: 0x8)
    bool bHasBase;                                                                    // 0x0050 (size: 0x1)
    bool bBaseRelativePosition;                                                       // 0x0051 (size: 0x1)
    uint8 QuantizedMuddyness;                                                         // 0x0052 (size: 0x1)

}; // Size: 0x60

struct FRWDMove
{
    FVector_NetQuantize100 Loc;                                                       // 0x0000 (size: 0xC)
    FVector2D_NetQuantize10 InAccel;                                                  // 0x000C (size: 0x8)
    float Timestamp;                                                                  // 0x0014 (size: 0x4)
    uint32 View;                                                                      // 0x0018 (size: 0x4)
    uint8 Roll;                                                                       // 0x001C (size: 0x1)
    uint8 CompressedMoveFlags;                                                        // 0x001D (size: 0x1)
    uint8 MovementMode;                                                               // 0x001E (size: 0x1)
    uint8 QuantizedMuddyness;                                                         // 0x001F (size: 0x1)

}; // Size: 0x20

struct FRWDMoveBase
{
    class UPrimitiveComponent* MovementBase;                                          // 0x0000 (size: 0x8)
    FName BoneName;                                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FRWDMoveDual
{
    FVector2D_NetQuantize10 InAccel;                                                  // 0x0000 (size: 0x8)
    float Timestamp;                                                                  // 0x0008 (size: 0x4)
    uint32 View;                                                                      // 0x000C (size: 0x4)
    uint8 CompressedMoveFlags;                                                        // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FRWDMoveTrailer
{
    FVector_NetQuantize100 Loc;                                                       // 0x0000 (size: 0xC)
    uint8 MovementMode;                                                               // 0x000C (size: 0x1)

}; // Size: 0x10

struct FRWDVeryShortAdjustment
{
    FVector NewLoc;                                                                   // 0x0000 (size: 0xC)
    FQuat NewRot;                                                                     // 0x0010 (size: 0x10)
    uint8 ServerMovementMode;                                                         // 0x0020 (size: 0x1)
    class UPrimitiveComponent* NewBase;                                               // 0x0028 (size: 0x8)
    FName NewBaseBoneName;                                                            // 0x0030 (size: 0x8)
    bool bHasBase;                                                                    // 0x0038 (size: 0x1)
    bool bBaseRelativePosition;                                                       // 0x0039 (size: 0x1)
    uint8 QuantizedMuddyness;                                                         // 0x003A (size: 0x1)

}; // Size: 0x40

struct FRailParticleSystem
{
    class UParticleSystemComponent* System;                                           // 0x0000 (size: 0x8)
    float OriginalYaw;                                                                // 0x0008 (size: 0x4)
    float CurrentYaw;                                                                 // 0x000C (size: 0x4)

}; // Size: 0x10

struct FRailPhysicsState
{
    FQuat WorldRotation;                                                              // 0x0000 (size: 0x10)
    class ARailwayTrack* FrontTrack;                                                  // 0x0010 (size: 0x8)
    class ARailwayTrack* RearTrack;                                                   // 0x0018 (size: 0x8)
    FVector WorldLocation;                                                            // 0x0020 (size: 0xC)
    float LinearMomentum;                                                             // 0x002C (size: 0x4)
    float DeferredImpulses;                                                           // 0x0030 (size: 0x4)
    float Forces;                                                                     // 0x0034 (size: 0x4)
    float LinearSpeed;                                                                // 0x0038 (size: 0x4)
    float FrontAlpha;                                                                 // 0x003C (size: 0x4)
    float RearAlpha;                                                                  // 0x0040 (size: 0x4)
    bool bFrontWagonToRail;                                                           // 0x0044 (size: 0x1)
    bool bRearWagonToRail;                                                            // 0x0045 (size: 0x1)
    bool bWasCollidingWithTrailer;                                                    // 0x0046 (size: 0x1)
    bool bWasBlocked;                                                                 // 0x0047 (size: 0x1)

}; // Size: 0x50

struct FRailSwitchState
{
    uint8 ID;                                                                         // 0x0000 (size: 0x1)
    bool bIsActive;                                                                   // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FRampData
{
    bool bUseGangwayRampTransformAsPivot;                                             // 0x0000 (size: 0x1)
    FTransform Pivot;                                                                 // 0x0010 (size: 0x30)
    float MaxExtension;                                                               // 0x0040 (size: 0x4)
    float SurfaceOffset;                                                              // 0x0044 (size: 0x4)
    float Width;                                                                      // 0x0048 (size: 0x4)
    float MinimumAngle;                                                               // 0x004C (size: 0x4)
    float MaximumAngle;                                                               // 0x0050 (size: 0x4)
    float AnimationAngleOffset;                                                       // 0x0054 (size: 0x4)
    bool bCanOpenWithoutSurface;                                                      // 0x0058 (size: 0x1)
    float RampAngleWithNoDock;                                                        // 0x005C (size: 0x4)
    bool bRequireSandWhenNotAtDock;                                                   // 0x0060 (size: 0x1)

}; // Size: 0x70

struct FRay_NetQuantize
{
    FVector_NetQuantize Origin;                                                       // 0x0000 (size: 0xC)
    FVector_NetQuantizeNormal Direction;                                              // 0x000C (size: 0xC)

}; // Size: 0x18

struct FReassignSquadLeaderWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString NewLeaderOnlineId;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRefinableItemInfo
{
    TSubclassOf<class AItemPickup> SourceItemClass;                                   // 0x0000 (size: 0x8)
    TSubclassOf<class AItemPickup> RefinedItemClass;                                  // 0x0008 (size: 0x8)
    float SpeedModifier;                                                              // 0x0010 (size: 0x4)
    float YieldModifier;                                                              // 0x0014 (size: 0x4)
    int32 MaxRefinedItemCount;                                                        // 0x0018 (size: 0x4)
    int32 TransferStackSize;                                                          // 0x001C (size: 0x4)

}; // Size: 0x20

struct FRefinableItemModifier
{
    FName SourceItemCodeName;                                                         // 0x0000 (size: 0x8)
    FName RefinedItemCodeName;                                                        // 0x0008 (size: 0x8)
    float SpeedModifier;                                                              // 0x0010 (size: 0x4)
    float YieldModifier;                                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FRefinementOrder
{
    FName SourceItemCodeName;                                                         // 0x0000 (size: 0x8)
    FName RefinedItemCodeName;                                                        // 0x0008 (size: 0x8)
    float ResourcesRefinedPerMinute;                                                  // 0x0010 (size: 0x4)
    int32 RemainingSourceCount;                                                       // 0x0014 (size: 0x4)
    float CompletedCount;                                                             // 0x0018 (size: 0x4)
    float ProgressForCurrentUnit;                                                     // 0x001C (size: 0x4)
    EFactionId OrderOwnerFactionId;                                                   // 0x0020 (size: 0x1)

}; // Size: 0x24

struct FRefinementOrderInfo
{
    ERefineryOrderAccessLevel AccessLevel;                                            // 0x0000 (size: 0x1)
    TArray<FRefinementOrder> OrderList;                                               // 0x0008 (size: 0x10)
    int64 ExpiryTimestampTicks;                                                       // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FRegiment
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    int8 TeamId;                                                                      // 0x0004 (size: 0x1)
    FString Name;                                                                     // 0x0008 (size: 0x10)
    FString Tag;                                                                      // 0x0018 (size: 0x10)
    FString Link;                                                                     // 0x0028 (size: 0x10)
    TArray<FRegimentMember> Members;                                                  // 0x0038 (size: 0x10)
    FString LastActiveWarId;                                                          // 0x0048 (size: 0x10)

}; // Size: 0xA8

struct FRegimentChangeRoleMessage
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    FString TargetOnlineID;                                                           // 0x0008 (size: 0x10)
    ERegimentRole DesiredTargetRole;                                                  // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FRegimentChatMessage
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    FString SenderOnlineId;                                                           // 0x0008 (size: 0x10)
    FString SenderName;                                                               // 0x0018 (size: 0x10)
    FString Message;                                                                  // 0x0028 (size: 0x10)
    int8 ChatLanguage;                                                                // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FRegimentClientReplicatedState
{
    TArray<FRegiment> ActiveRegimentList;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRegimentCreatedMessage
{
    FString CreatorOnlineID;                                                          // 0x0000 (size: 0x10)
    FRegimentInfo RegimentInfo;                                                       // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FRegimentEditMessage
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    FString Name;                                                                     // 0x0008 (size: 0x10)
    FString Tag;                                                                      // 0x0018 (size: 0x10)
    FString Link;                                                                     // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FRegimentFullMessage
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FRegimentIdChangedMessage
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    int32 RegimentID;                                                                 // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FRegimentIdClearedMessage
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRegimentInfo
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FString Tag;                                                                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRegimentInfoRequest
{
    int32 RequestID;                                                                  // 0x0000 (size: 0x4)
    TArray<int32> RegimentIds;                                                        // 0x0008 (size: 0x10)
    TArray<FString> OnlineIds;                                                        // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FRegimentInfoResponse
{
    int32 RequestID;                                                                  // 0x0000 (size: 0x4)
    TArray<FRegimentInfo> RegimentInfos;                                              // 0x0008 (size: 0x10)
    TArray<int32> RegimentIds;                                                        // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FRegimentManager
{
}; // Size: 0x3A0

struct FRegimentMember
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    ERegimentRole Role;                                                               // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FRegimentMemberSquadIdMessage
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    int32 SquadId;                                                                    // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FRegimentMemberSquadIdsMessage
{
    TArray<FRegimentMemberSquadIdMessage> Messages;                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRegimentMessage
{
    FRegiment Regiment;                                                               // 0x0000 (size: 0xA8)

}; // Size: 0xA8

struct FRegimentNotificationMessage
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    ERegimentNotificationType Type;                                                   // 0x0004 (size: 0x1)
    FString TargetOnlineID;                                                           // 0x0008 (size: 0x10)
    FString TargetPlayerName;                                                         // 0x0018 (size: 0x10)
    ERegimentRole NewRole;                                                            // 0x0028 (size: 0x1)
    FString NewRegimentName;                                                          // 0x0030 (size: 0x10)
    FString NewRegimentTag;                                                           // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FRegimentPromptParams
{
    FText Name;                                                                       // 0x0000 (size: 0x18)
    FText Tag;                                                                        // 0x0018 (size: 0x18)
    FText Link;                                                                       // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FRegionConnectionInfo
{
    FString MapCodename;                                                              // 0x0000 (size: 0x10)
    FString ServerName;                                                               // 0x0010 (size: 0x10)
    int8 serverType;                                                                  // 0x0020 (size: 0x1)
    FString Version;                                                                  // 0x0028 (size: 0x10)
    FString steamId;                                                                  // 0x0038 (size: 0x10)
    FString ipAddress;                                                                // 0x0048 (size: 0x10)
    uint16 Port;                                                                      // 0x0058 (size: 0x2)
    uint16 PortBeacon;                                                                // 0x005A (size: 0x2)
    uint64 packedWarStatus;                                                           // 0x0060 (size: 0x8)
    uint64 packedServerState;                                                         // 0x0068 (size: 0x8)
    int16 colonialQueueSize;                                                          // 0x0070 (size: 0x2)
    int16 wardenQueueSize;                                                            // 0x0072 (size: 0x2)
    int16 ColonialOpenSlots;                                                          // 0x0074 (size: 0x2)
    int16 WardenOpenSlots;                                                            // 0x0076 (size: 0x2)

}; // Size: 0x78

struct FRegionLog
{
    TArray<FRegionLogEntry> Entries;                                                  // 0x0000 (size: 0x10)
    int32 NextEntryIndex;                                                             // 0x0010 (size: 0x4)
    uint32 NextRegionLogID;                                                           // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FRegionLogEntry
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString PlayerName;                                                               // 0x0010 (size: 0x10)
    ERegionLogEntryType Type;                                                         // 0x0020 (size: 0x1)
    uint32 Value;                                                                     // 0x0024 (size: 0x4)
    FDateTime EventTime;                                                              // 0x0028 (size: 0x8)
    float LocationX;                                                                  // 0x0030 (size: 0x4)
    float LocationY;                                                                  // 0x0034 (size: 0x4)
    uint32 RegionLogID;                                                               // 0x0038 (size: 0x4)
    FName CodeName;                                                                   // 0x003C (size: 0x8)

}; // Size: 0x48

struct FRegionLogPage
{
    TArray<FRegionLogEntry> Entries;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRegionLogs
{
    FRegionLog Colonial;                                                              // 0x0000 (size: 0x18)
    FRegionLog Warden;                                                                // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FRegionMapData
{
    int32 Version;                                                                    // 0x0000 (size: 0x4)
    EWorldConquestMapId RegionId;                                                     // 0x0004 (size: 0x1)
    int8 ScorchedVictoryTowns;                                                        // 0x0005 (size: 0x1)
    TArray<FMapItem> MapItems;                                                        // 0x0008 (size: 0x10)
    TArray<FMapItem> MapItemsC;                                                       // 0x0018 (size: 0x10)
    TArray<FMapItem> MapItemsW;                                                       // 0x0028 (size: 0x10)
    TArray<FMapTextItem> TextItems;                                                   // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FRegionMinimalData
{
    EFactionId StarterRegionTeamID;                                                   // 0x0000 (size: 0x1)
    TArray<FVector2D> ColonialStarterRegionZones;                                     // 0x0008 (size: 0x10)
    TArray<FVector2D> WardenStarterRegionZones;                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FRegionZoneManager
{
}; // Size: 0xC0

struct FRemoveFromSquadWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString TargetOnlineID;                                                           // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRemoveMemberFromRegimentMessage
{
    int32 RegimentID;                                                                 // 0x0000 (size: 0x4)
    FString MemberToRemoveOnlineId;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRenameSquadWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString NewName;                                                                  // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRepMapPost
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FMapPostEntry OriginalEntry;                                                      // 0x0008 (size: 0x38)
    TArray<FMapPostEntry> ReplyList;                                                  // 0x0040 (size: 0x10)
    FVector2D NormalizedMapCoords;                                                    // 0x0050 (size: 0x8)
    int8 MapId;                                                                       // 0x0058 (size: 0x1)
    EMapPostType MapPostType;                                                         // 0x0059 (size: 0x1)
    EFacilityMapPostType FacilityMapPostType;                                         // 0x005A (size: 0x1)
    EMapPostVoteType LocalVoteType;                                                   // 0x005B (size: 0x1)
    int32 GroupId;                                                                    // 0x005C (size: 0x4)
    int32 TotalVotes;                                                                 // 0x0060 (size: 0x4)
    int32 Rank;                                                                       // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FRepPipelineSystem
{
    int32 Index;                                                                      // 0x0000 (size: 0x4)
    FName CodeName;                                                                   // 0x0004 (size: 0x8)
    float Amount;                                                                     // 0x000C (size: 0x4)
    float MaxAmount;                                                                  // 0x0010 (size: 0x4)
    float ThroughputNormalized;                                                       // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FRepPlayerMovement
{
    FVector LinearVelocity;                                                           // 0x0000 (size: 0xC)
    FVector Location;                                                                 // 0x000C (size: 0xC)
    FRotator Rotation;                                                                // 0x0018 (size: 0xC)
    class UPrimitiveComponent* MovementBase;                                          // 0x0028 (size: 0x8)
    FName BoneName;                                                                   // 0x0030 (size: 0x8)
    FQuantizedTimestamp Timestamp;                                                    // 0x0038 (size: 0x4)
    bool bServerHasBaseComponent;                                                     // 0x003C (size: 0x1)
    uint8 MovementMode;                                                               // 0x003D (size: 0x1)
    EVectorQuantization LocationQuantizationLevel;                                    // 0x003E (size: 0x1)
    EVectorQuantization VelocityQuantizationLevel;                                    // 0x003F (size: 0x1)
    ERotatorQuantization RotationQuantizationLevel;                                   // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FRepRWDMovement
{
    FVector LinearVelocity;                                                           // 0x0000 (size: 0xC)
    FVector AngularMomentum;                                                          // 0x000C (size: 0xC)
    FVector Location;                                                                 // 0x0018 (size: 0xC)
    FRotator Rotation;                                                                // 0x0024 (size: 0xC)
    float LastUpdateClientTimeStamp;                                                  // 0x0030 (size: 0x4)
    float ForwardInput;                                                               // 0x0034 (size: 0x4)
    float SteeringInput;                                                              // 0x0038 (size: 0x4)
    bool bHandbrakeActivated;                                                         // 0x003C (size: 0x1)
    bool bBoostActivated;                                                             // 0x003D (size: 0x1)
    bool bIsInManualLowGear;                                                          // 0x003E (size: 0x1)
    float SteeringAngle;                                                              // 0x0040 (size: 0x4)
    bool bHasTractor;                                                                 // 0x0044 (size: 0x1)
    bool bHasTrailer;                                                                 // 0x0045 (size: 0x1)
    bool bIsForcedUpdate;                                                             // 0x0046 (size: 0x1)
    FRepRWDTrailerMovement TrailerMovement;                                           // 0x0048 (size: 0x40)

}; // Size: 0x88

struct FRepRWDTrailerMovement
{
    class ARWDSimVehicle* Trailer;                                                    // 0x0000 (size: 0x8)
    FVector LinearVelocity;                                                           // 0x0008 (size: 0xC)
    FVector AngularMomentum;                                                          // 0x0014 (size: 0xC)
    FVector RelativeLocation;                                                         // 0x0020 (size: 0xC)
    FRotator Rotation;                                                                // 0x002C (size: 0xC)
    uint8 MovementMode;                                                               // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FRepRailwayMovement
{
    class ARailwayTrack* FrontTrack;                                                  // 0x0000 (size: 0x8)
    bool bFrontTrackSet;                                                              // 0x0008 (size: 0x1)
    class ARailwayTrack* RearTrack;                                                   // 0x0010 (size: 0x8)
    bool bRearTrackSet;                                                               // 0x0018 (size: 0x1)
    class ARailVehicle* Actor;                                                        // 0x0020 (size: 0x8)
    float LinearMomentum;                                                             // 0x0028 (size: 0x4)
    float PackedPrimaryAlpha;                                                         // 0x002C (size: 0x4)
    FVector Location;                                                                 // 0x0030 (size: 0xC)
    FRotator Rotation;                                                                // 0x003C (size: 0xC)

}; // Size: 0x48

struct FRepShipMovement
{
    FVector LinearVelocity;                                                           // 0x0000 (size: 0xC)
    FVector AngularMomentum;                                                          // 0x000C (size: 0xC)
    FVector Location;                                                                 // 0x0018 (size: 0xC)
    FRotator Rotation;                                                                // 0x0024 (size: 0xC)
    float LastUpdateClientTimeStamp;                                                  // 0x0030 (size: 0x4)
    float ForwardInput;                                                               // 0x0034 (size: 0x4)
    float RudderInput;                                                                // 0x0038 (size: 0x4)
    float RudderAngle;                                                                // 0x003C (size: 0x4)
    float DivePlaneAngle;                                                             // 0x0040 (size: 0x4)
    bool bStabilizerActivated;                                                        // 0x0044 (size: 0x1)
    bool bIsForcedUpdate;                                                             // 0x0045 (size: 0x1)

}; // Size: 0x48

struct FRepSnapInfo
{
    ESnapType Type;                                                                   // 0x0000 (size: 0x1)
    FName SocketName;                                                                 // 0x0004 (size: 0x8)
    FModificationSocketPreviewInfo ModificationSocketPreviewInfo;                     // 0x000C (size: 0xC)
    class UBuildSocketComponent* TargetSocket;                                        // 0x0018 (size: 0x8)
    float RotationZ;                                                                  // 0x0020 (size: 0x4)
    class USplineConnectorComponent* TargetPath;                                      // 0x0028 (size: 0x8)
    float PathPackedAlpha;                                                            // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FRepTrainMovement
{
    TArray<FRepRailwayMovement> Cars;                                                 // 0x0000 (size: 0x10)
    float LastUpdateClientTimeStamp;                                                  // 0x0010 (size: 0x4)
    int8 Acceleration;                                                                // 0x0014 (size: 0x1)
    uint8 bIsBoosting;                                                                // 0x0015 (size: 0x1)

}; // Size: 0x18

struct FReplicatedShippableData
{
    uint8 Payload;                                                                    // 0x0000 (size: 0x1)
    uint8 AltPayload;                                                                 // 0x0001 (size: 0x1)
    uint8 Temperature;                                                                // 0x0002 (size: 0x1)
    TArray<FStockpileEntry> Items;                                                    // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRequestSquadOfficerToLeaderMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString OfficerOnlineId;                                                          // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReservePower
{
    float MaxAmount;                                                                  // 0x0000 (size: 0x4)
    float Amount;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FReserveStockpileActionStyle
{
    FButtonStyle ButtonStyle;                                                         // 0x0000 (size: 0x278)
    FText ToolTipText;                                                                // 0x0278 (size: 0x18)
    FText ToolTipDescription;                                                         // 0x0290 (size: 0x18)

}; // Size: 0x2A8

struct FReserveStockpileData
{
    FString StockpileName;                                                            // 0x0000 (size: 0x10)
    FString OwnerOnlineID;                                                            // 0x0010 (size: 0x10)
    FString OwnerName;                                                                // 0x0020 (size: 0x10)
    TArray<FString> AllowedUserOnlineIDList;                                          // 0x0030 (size: 0x10)
    EReserveStockpileAccessLevel AccessLevel;                                         // 0x0040 (size: 0x1)
    int32 PassCode;                                                                   // 0x0044 (size: 0x4)
    int64 ExpiryTimestampTicks;                                                       // 0x0048 (size: 0x8)
    TArray<FStockpileEntry> Items;                                                    // 0x0050 (size: 0x10)
    TArray<FStockpileEntry> Vehicles;                                                 // 0x0060 (size: 0x10)
    TArray<FStockpileEntry> VehicleCrates;                                            // 0x0070 (size: 0x10)
    TArray<FStockpileEntry> Structures;                                               // 0x0080 (size: 0x10)
    TArray<FStockpileEntry> StructureCrates;                                          // 0x0090 (size: 0x10)

}; // Size: 0xB8

struct FReserveStockpileFailedPassCodeInfo
{
    int32 NumFailedAttempts;                                                          // 0x0000 (size: 0x4)
    int64 LastAttemptTimestampTicks;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FReserveStockpileMapDetailInfo
{
    FString StockpileName;                                                            // 0x0000 (size: 0x10)
    FMapDetailStockpileInfo StockpileInfo;                                            // 0x0010 (size: 0x60)

}; // Size: 0x70

struct FReserveStockpileStyle
{
    FReserveStockpileActionStyle ReleaseButtonStyle;                                  // 0x0000 (size: 0x2A8)
    FReserveStockpileActionStyle MakeHiddenButtonStyle;                               // 0x02A8 (size: 0x2A8)
    FReserveStockpileActionStyle MakeVisibleButtonStyle;                              // 0x0550 (size: 0x2A8)
    FReserveStockpileActionStyle ViewAccessCodeButtonStyle;                           // 0x07F8 (size: 0x2A8)
    FReserveStockpileActionStyle CopyAccessCodeButtonStyle;                           // 0x0AA0 (size: 0x2A8)
    FReserveStockpileActionStyle ResetAccessButtonStyle;                              // 0x0D48 (size: 0x2A8)
    FSlateBrush TabIcon;                                                              // 0x0FF0 (size: 0x88)

}; // Size: 0x1078

struct FResourceAmounts
{
    FCodeNameSmallQuantity Resource;                                                  // 0x0000 (size: 0xC)
    TArray<FCodeNameSmallQuantity> OtherResources;                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FResourceConverter
{
    TArray<FRefinementOrder> OrderList;                                               // 0x0000 (size: 0x10)
    TArray<FRefinableItemInfo> RefinableItems;                                        // 0x0010 (size: 0x10)

}; // Size: 0x30

struct FResourceRenderInfo
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    class UStaticMesh* StaticMesh;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FRewindContext
{
}; // Size: 0x20

struct FRichTextFieldColor
{
    FString ID;                                                                       // 0x0000 (size: 0x10)
    FLinearColor Color;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FRocketLaunchCodeInfo
{
    EWorldConquestMapId TargetMapID;                                                  // 0x0000 (size: 0x1)
    uint16 LaunchCodeID;                                                              // 0x0002 (size: 0x2)
    FVector StrikeLocation;                                                           // 0x0004 (size: 0xC)
    FVector LocalStrikeLocation;                                                      // 0x0010 (size: 0xC)

}; // Size: 0x1C

struct FRocketLaunchCodeRequest
{
    class ARocketFacility* RocketFacility;                                            // 0x0000 (size: 0x8)
    uint16 LaunchCodeID;                                                              // 0x0008 (size: 0x2)

}; // Size: 0x10

struct FRocketLaunchFire
{
    float StartTime;                                                                  // 0x0000 (size: 0x4)
    float EndTime;                                                                    // 0x0004 (size: 0x4)
    float Radius;                                                                     // 0x0008 (size: 0x4)
    float AddedHeat;                                                                  // 0x000C (size: 0x4)
    TSubclassOf<class UDamageType> DamageType;                                        // 0x0010 (size: 0x8)

}; // Size: 0x20

struct FRocketSiteStyle
{
    FSlateBrush SectionBGImage;                                                       // 0x0000 (size: 0x88)
    FSlateBrush ProgressBarBGImage;                                                   // 0x0088 (size: 0x88)
    FSlateBrush ProgressBarFillImage;                                                 // 0x0110 (size: 0x88)
    FSlateBrush ProgressBarMarker;                                                    // 0x0198 (size: 0x88)
    FLinearColor ToolTipTextColor;                                                    // 0x0220 (size: 0x10)

}; // Size: 0x230

struct FRoomComponentSaveState
{
    float WaterLevel;                                                                 // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FRoomDynamicData : public FTableRowBase
{
    uint8 RepairCost;                                                                 // 0x0008 (size: 0x1)
    uint8 LargeRepairCost;                                                            // 0x0009 (size: 0x1)
    float LeakChance;                                                                 // 0x000C (size: 0x4)
    float FloodedMass;                                                                // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FRoomLeak : public FFastArraySerializerItem
{
    FVector_NetQuantize Location;                                                     // 0x000C (size: 0xC)
    uint8 RoomIx;                                                                     // 0x0018 (size: 0x1)
    uint8 Damage;                                                                     // 0x0019 (size: 0x1)
    uint8 Radius;                                                                     // 0x001A (size: 0x1)
    TWeakObjectPtr<class UDecalComponent> ExteriorDecal;                              // 0x001C (size: 0x8)
    TWeakObjectPtr<class UDecalComponent> InteriorDecal;                              // 0x0024 (size: 0x8)
    TWeakObjectPtr<class UParticleSystemComponent> WaterFX;                           // 0x002C (size: 0x8)
    TWeakObjectPtr<class UParticleSystemComponent> AboveWaterFX;                      // 0x0034 (size: 0x8)
    TWeakObjectPtr<class UAudioComponent> LeakingSFXLoop;                             // 0x003C (size: 0x8)

}; // Size: 0x44

struct FRoomLeakArray : public FFastArraySerializer
{
    TArray<FRoomLeak> Items;                                                          // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FSavedActor
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)
    FString Name;                                                                     // 0x0030 (size: 0x10)
    UClass* ActorClass;                                                               // 0x0040 (size: 0x8)
    bool bIsLoadedFromMap;                                                            // 0x0048 (size: 0x1)
    TArray<uint8> ByteStream;                                                         // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FSavedBallastInfo
{
    float TargetFloodPercent;                                                         // 0x0000 (size: 0x4)
    float FloodPercent;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSavedCharacter
{
    float Health;                                                                     // 0x0000 (size: 0x4)
    TArray<FItemInstance> BagItems;                                                   // 0x0008 (size: 0x10)
    TArray<FItemInstance> EquippedItems;                                              // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSavedCharacterInventory
{
    TArray<FItemInstance> BagItems;                                                   // 0x0000 (size: 0x10)
    TArray<FItemInstance> EquippedItems;                                              // 0x0010 (size: 0x10)
    bool OverrideStarterGear;                                                         // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FSavedRecoveryCharacter
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    uint8 TeamId;                                                                     // 0x0010 (size: 0x1)
    FTransform Transform;                                                             // 0x0020 (size: 0x30)
    uint8 VisualCustomizationMask;                                                    // 0x0050 (size: 0x1)
    float Temperature;                                                                // 0x0054 (size: 0x4)
    float Muddyness;                                                                  // 0x0058 (size: 0x4)
    FSavedCharacter SavedCharacter;                                                   // 0x0060 (size: 0x28)
    FString ParentShipName;                                                           // 0x0088 (size: 0x10)

}; // Size: 0xA0

struct FSavedRecoveryVehicle : public FSavedActor
{
    FDateTime LastAutoSaveTimestamp;                                                  // 0x0060 (size: 0x8)
    FString OriginatorBuildSiteName;                                                  // 0x0068 (size: 0x10)

}; // Size: 0x80

struct FSavedShippableData
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    FName ContainedCodeName;                                                          // 0x0008 (size: 0x8)
    TArray<FItemInstance> Items;                                                      // 0x0010 (size: 0x10)
    TArray<FStockpileEntry> StoredItems;                                              // 0x0020 (size: 0x10)
    TArray<FStockpileEntry> ItemCrates;                                               // 0x0030 (size: 0x10)
    TArray<FStockpileEntry> ReservableItemCrates;                                     // 0x0040 (size: 0x10)
    float Fuel;                                                                       // 0x0050 (size: 0x4)
    FName FuelType;                                                                   // 0x0054 (size: 0x8)
    uint8 Payload;                                                                    // 0x005C (size: 0x1)
    uint8 AltPayload;                                                                 // 0x005D (size: 0x1)
    uint8 Temperature;                                                                // 0x005E (size: 0x1)
    uint8 TeamId;                                                                     // 0x005F (size: 0x1)
    bool bIsReservable;                                                               // 0x0060 (size: 0x1)
    int32 TankArmour;                                                                 // 0x0064 (size: 0x4)
    FGlobalSpawnPointMinimal GlobalSpawnPoint;                                        // 0x0068 (size: 0x8)

}; // Size: 0xD0

struct FSavedVehicle
{
    FTransform Transform;                                                             // 0x0000 (size: 0x30)
    UClass* ActorClass;                                                               // 0x0030 (size: 0x8)
    TArray<uint8> Bytes;                                                              // 0x0038 (size: 0x10)
    bool bHasTrailer;                                                                 // 0x0048 (size: 0x1)
    bool bFacingForward;                                                              // 0x0049 (size: 0x1)
    int32 RailEntryTrackId;                                                           // 0x004C (size: 0x4)
    float RailEntryPackedAlpha;                                                       // 0x0050 (size: 0x4)
    bool bRailIsTailFirst;                                                            // 0x0054 (size: 0x1)
    float ShipDepth;                                                                  // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FScheduledWeatherState
{
    FWeatherState State;                                                              // 0x0000 (size: 0x28)
    FVector2D NormalizedLocation;                                                     // 0x0028 (size: 0x8)
    FDateTime StartTime;                                                              // 0x0030 (size: 0x8)
    FDateTime EndTime;                                                                // 0x0038 (size: 0x8)
    int8 IntensityCurve;                                                              // 0x0040 (size: 0x1)

}; // Size: 0x50

struct FSearchBarStyle
{
    FSlateBrush SearchBarBrush;                                                       // 0x0000 (size: 0x88)
    FSlateBrush SearchImage;                                                          // 0x0088 (size: 0x88)
    FMargin BarPadding;                                                               // 0x0110 (size: 0x10)
    FSlateBrush MenuBorderBrush;                                                      // 0x0120 (size: 0x88)
    FMargin MenuBorderPadding;                                                        // 0x01A8 (size: 0x10)
    FTableRowStyle ItemStyle;                                                         // 0x01B8 (size: 0x7C8)
    FEditableTextBoxStyle TextInputBoxStyle;                                          // 0x0980 (size: 0x7F0)

}; // Size: 0x1170

struct FSecondaryHUDInfo
{
}; // Size: 0x28

struct FSecondaryResourceWeight
{
    TSubclassOf<class AItemPickup> ResourcePickupType;                                // 0x0000 (size: 0x8)
    int32 Weight;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FSensorPingResponse
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    FVector Location;                                                                 // 0x0008 (size: 0xC)
    FRotator Rotation;                                                                // 0x0014 (size: 0xC)
    uint8 QuantizedStrength;                                                          // 0x0020 (size: 0x1)
    bool bIsIntel;                                                                    // 0x0021 (size: 0x1)
    float ReceivedWorldTime;                                                          // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FServerTravelClientState
{
    EServerTravelStatusOnClient Status;                                               // 0x0000 (size: 0x1)
    EServerTravelOriginType OriginType;                                               // 0x0004 (size: 0x4)
    EWarServerType OriginServerType;                                                  // 0x0008 (size: 0x4)
    bool bIsBorderTravel;                                                             // 0x000C (size: 0x1)

}; // Size: 0x10

struct FSessionServerState
{
}; // Size: 0x14

struct FSessionWarStatus
{
}; // Size: 0x20

struct FShardConfig
{
    int32 PopulationCap;                                                              // 0x0000 (size: 0x4)
    TArray<FString> EnabledRegions;                                                   // 0x0008 (size: 0x10)
    FDateTime ScheduledConquestStartTime;                                             // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FShardStatus
{
    bool bShowColonialQueueWarning;                                                   // 0x0000 (size: 0x1)
    bool bShowWardenQueueWarning;                                                     // 0x0001 (size: 0x1)
    FString WarId;                                                                    // 0x0008 (size: 0x10)
    int32 SquadMaxSize;                                                               // 0x0018 (size: 0x4)
    bool bUseCustomSignaling;                                                         // 0x001C (size: 0x1)

}; // Size: 0x20

struct FShardStatusServerConnectionInfo
{
    FString currentMap;                                                               // 0x0000 (size: 0x10)
    FString steamId;                                                                  // 0x0010 (size: 0x10)
    FString ipAddress;                                                                // 0x0020 (size: 0x10)
    int32 Port;                                                                       // 0x0030 (size: 0x4)
    int32 BeaconPort;                                                                 // 0x0034 (size: 0x4)
    uint64 packedWarStatus;                                                           // 0x0038 (size: 0x8)
    uint64 packedServerState;                                                         // 0x0040 (size: 0x8)
    int16 colonialQueueSize;                                                          // 0x0048 (size: 0x2)
    int16 wardenQueueSize;                                                            // 0x004A (size: 0x2)
    FString Name;                                                                     // 0x0050 (size: 0x10)
    FString Version;                                                                  // 0x0060 (size: 0x10)
    int32 serverType;                                                                 // 0x0070 (size: 0x4)
    int16 openColonialSlots;                                                          // 0x0074 (size: 0x2)
    int16 openWardenSlots;                                                            // 0x0076 (size: 0x2)

}; // Size: 0x78

struct FShipAdjustment
{
    FVector NewLoc;                                                                   // 0x0000 (size: 0xC)
    FQuat NewRot;                                                                     // 0x0010 (size: 0x10)
    FVector NewVelocity;                                                              // 0x0020 (size: 0xC)
    FVector NewAngularMomentum;                                                       // 0x002C (size: 0xC)
    float RudderAngle;                                                                // 0x0038 (size: 0x4)
    float DivePlaneAngle;                                                             // 0x003C (size: 0x4)
    uint8 ServerMovementMode;                                                         // 0x0040 (size: 0x1)

}; // Size: 0x50

struct FShipDynamicData : public FTableRowBase
{
    float SecondsToMaxRPM;                                                            // 0x0008 (size: 0x4)
    float MaxPropellerRPM;                                                            // 0x000C (size: 0x4)
    float MaxRudderAngle;                                                             // 0x0010 (size: 0x4)
    float RudderTurnRate;                                                             // 0x0014 (size: 0x4)
    float Fp;                                                                         // 0x0018 (size: 0x4)
    float Fs;                                                                         // 0x001C (size: 0x4)
    float DragReferenceSpeed;                                                         // 0x0020 (size: 0x4)
    float Cpd1;                                                                       // 0x0024 (size: 0x4)
    float Cpd2;                                                                       // 0x0028 (size: 0x4)
    float Csd1;                                                                       // 0x002C (size: 0x4)
    float Csd2;                                                                       // 0x0030 (size: 0x4)
    float SlammingPower;                                                              // 0x0034 (size: 0x4)
    float GammaMax;                                                                   // 0x0038 (size: 0x4)
    float Cad;                                                                        // 0x003C (size: 0x4)
    float RudderLength;                                                               // 0x0040 (size: 0x4)
    float RudderDepth;                                                                // 0x0044 (size: 0x4)
    float ThrustVectoringPercent;                                                     // 0x0048 (size: 0x4)
    float MaxDivePlaneAngle;                                                          // 0x004C (size: 0x4)
    float DivePlaneTurnRate;                                                          // 0x0050 (size: 0x4)
    float VerticalThrustVectoringPercent;                                             // 0x0054 (size: 0x4)
    float BallastFloodRate;                                                           // 0x0058 (size: 0x4)
    float BallastBlowRate;                                                            // 0x005C (size: 0x4)
    float FullyFloodedEngineForceMultiplier;                                          // 0x0060 (size: 0x4)
    float BeachedEngineForceMultiplier;                                               // 0x0064 (size: 0x4)

}; // Size: 0x68

struct FShipVeryShortAdjustment
{
    FVector NewLoc;                                                                   // 0x0000 (size: 0xC)
    FQuat NewRot;                                                                     // 0x0010 (size: 0x10)
    float RudderAngle;                                                                // 0x0020 (size: 0x4)
    float DivePlaneAngle;                                                             // 0x0024 (size: 0x4)
    uint8 ServerMovementMode;                                                         // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FShippableInfo
{
    EShippableType Type;                                                              // 0x0000 (size: 0x1)
    bool bAllowShippableTransfer;                                                     // 0x0001 (size: 0x1)
    EShippableType MaxSupportedSize;                                                  // 0x0002 (size: 0x1)

}; // Size: 0xC

struct FShippableRenderInfo
{
    class UStaticMesh* Base;                                                          // 0x0000 (size: 0x8)
    class UStaticMesh* BaseDanglingRope;                                              // 0x0008 (size: 0x8)
    class UStaticMesh* BaseRope;                                                      // 0x0010 (size: 0x8)
    class UStaticMesh* ContainerDanglingRope;                                         // 0x0018 (size: 0x8)
    class UStaticMesh* ContainerRope;                                                 // 0x0020 (size: 0x8)
    FVector CollisionExtents;                                                         // 0x0028 (size: 0xC)
    float DanglingRopeOffsetZ;                                                        // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FSignPostVote
{
    FString VoterOnlineID;                                                            // 0x0000 (size: 0x10)
    bool bIsUpVote;                                                                   // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FSignedPayload
{
    uint8 Signature;                                                                  // 0x0000 (size: 0x14)
    TArray<uint8> Payload;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSkeletalMeshStop
{
    int32 Threshold;                                                                  // 0x0000 (size: 0x4)
    class USkeletalMesh* SkeletalMesh;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSnapshotManagerTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FSoundClassVolume
{
    FString ClassName;                                                                // 0x0000 (size: 0x10)
    float Value;                                                                      // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSpawnPoint
{
    uint32 ID;                                                                        // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSpawnPointInfo
{
    EWorldConquestMapId MapId;                                                        // 0x0000 (size: 0x1)
    uint8 SpawnPointType;                                                             // 0x0001 (size: 0x1)
    bool bIsAvailable;                                                                // 0x0002 (size: 0x1)
    uint16 SpawnCharges;                                                              // 0x0004 (size: 0x2)

}; // Size: 0x6

struct FSpawnPoints
{
    ESpawnPointType Type;                                                             // 0x0000 (size: 0x1)
    ESpawnPointCategory Category;                                                     // 0x0001 (size: 0x1)
    FSpawnPoint SpawnPointID;                                                         // 0x0004 (size: 0x4)
    TArray<class USpawnPointComponent*> HighPrioritySpawns;                           // 0x0008 (size: 0x10)
    TArray<class USpawnPointComponent*> LowPrioritySpawn;                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSpecializedFactoryOrder
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    EFactionId FactionId;                                                             // 0x0010 (size: 0x1)
    EFactoryOrderAccess AccessLevel;                                                  // 0x0011 (size: 0x1)
    int32 SquadId;                                                                    // 0x0014 (size: 0x4)
    TArray<FSpecializedFactoryOrderItem> OrderItems;                                  // 0x0018 (size: 0x10)
    float ProductionTimeMultiplier;                                                   // 0x0028 (size: 0x4)
    float CompleteTime;                                                               // 0x002C (size: 0x4)

}; // Size: 0x30

struct FSpecializedFactoryOrderItem
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    bool bIsPrototype;                                                                // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSpectateTarget
{
    class APlayerState* PlayerState;                                                  // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSplineConnectorComponentConfig
{
    FName ComponentName;                                                              // 0x0000 (size: 0x8)
    FTransform RelativeTransform;                                                     // 0x0010 (size: 0x30)
    float Distance;                                                                   // 0x0040 (size: 0x4)

}; // Size: 0x50

struct FSplineConnectorMeshConfig
{
    class UStaticMesh* Mesh;                                                          // 0x0000 (size: 0x8)
    TArray<class UStaticMesh*> Meshes;                                                // 0x0008 (size: 0x10)
    TArray<FDecalData> Decals;                                                        // 0x0018 (size: 0x10)
    bool bReceivesDecals;                                                             // 0x0028 (size: 0x1)
    class UMaterialInterface* BuildGhostMaterialOverride;                             // 0x0030 (size: 0x8)
    class UMaterialInterface* BuildSiteMaterialOverride;                              // 0x0038 (size: 0x8)
    ESplineConnectorMeshMode Mode;                                                    // 0x0040 (size: 0x4)
    TArray<FName> ComponentTags;                                                      // 0x0048 (size: 0x10)
    FName CollisionProfileName;                                                       // 0x0058 (size: 0x8)
    bool bCollisionOnly;                                                              // 0x0060 (size: 0x1)
    class UPhysicalMaterial* PhysMaterialOverride;                                    // 0x0068 (size: 0x8)
    uint8 CollisionIgnoreFlags;                                                       // 0x0070 (size: 0x1)
    TEnumAsByte<ECanBeCharacterBase> CanCharacterStepUpOn;                            // 0x0071 (size: 0x1)
    uint32 StartIndex;                                                                // 0x0074 (size: 0x4)
    uint32 EndIndex;                                                                  // 0x0078 (size: 0x4)
    float BoxWidth;                                                                   // 0x007C (size: 0x4)
    float BoxHeight;                                                                  // 0x0080 (size: 0x4)
    float BoxLengthPadding;                                                           // 0x0084 (size: 0x4)
    TArray<FSplineConnectorMeshConfigPoint> SpawnPoints;                              // 0x0088 (size: 0x10)
    TEnumAsByte<ESplineMeshAxis::Type> SplineMeshAxis;                                // 0x0098 (size: 0x1)
    FVector2D SplineStartOffset;                                                      // 0x009C (size: 0x8)
    FVector2D SplineEndOffset;                                                        // 0x00A4 (size: 0x8)
    float SplineBoundaryMin;                                                          // 0x00AC (size: 0x4)
    float SplineBoundaryMax;                                                          // 0x00B0 (size: 0x4)
    float MinSplineLength;                                                            // 0x00B4 (size: 0x4)
    bool bExtendSplineToMinLength;                                                    // 0x00B8 (size: 0x1)
    float MinSplineLengthForCollision;                                                // 0x00BC (size: 0x4)
    FVector2D SplineMaterialScaling;                                                  // 0x00C0 (size: 0x8)
    float Interval;                                                                   // 0x00C8 (size: 0x4)
    float IntervalDeltaPerDegree;                                                     // 0x00CC (size: 0x4)
    bool bEvenlySpace;                                                                // 0x00D0 (size: 0x1)
    bool bLinearPlacement;                                                            // 0x00D1 (size: 0x1)
    bool bFillRemainder;                                                              // 0x00D2 (size: 0x1)
    bool bFixedPitch;                                                                 // 0x00D3 (size: 0x1)
    float FixedPitch;                                                                 // 0x00D4 (size: 0x4)
    float StartOffset;                                                                // 0x00D8 (size: 0x4)
    float EndOffset;                                                                  // 0x00DC (size: 0x4)
    float MaxSnapToLandscapeOffset;                                                   // 0x00E0 (size: 0x4)
    bool bApplySlopeOffset;                                                           // 0x00E4 (size: 0x1)
    bool bAlternateY;                                                                 // 0x00E5 (size: 0x1)
    int32 MaxInstances;                                                               // 0x00E8 (size: 0x4)
    FTransform RelativeTransform;                                                     // 0x00F0 (size: 0x30)
    FRotator RandomRotationVariance;                                                  // 0x0120 (size: 0xC)
    FVector RandomPositionVariance;                                                   // 0x012C (size: 0xC)
    bool bDisplayOnInvalidPath;                                                       // 0x0138 (size: 0x1)
    int32 CopyPlacementRangeFrom;                                                     // 0x013C (size: 0x4)
    bool bIsEndCap;                                                                   // 0x0140 (size: 0x1)
    bool bEndCapReactsToSockets;                                                      // 0x0141 (size: 0x1)
    bool bReactToSurface;                                                             // 0x0142 (size: 0x1)
    FMeshConfigSurfaceSettings SurfaceSettings;                                       // 0x0148 (size: 0x28)

}; // Size: 0x170

struct FSplineConnectorMeshConfigPoint
{
    int32 PointIndex;                                                                 // 0x0000 (size: 0x4)
    float MinPrevDistance;                                                            // 0x0004 (size: 0x4)
    float MinNextDistance;                                                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSplineConnectorMeshConfigTransient
{
}; // Size: 0x38

struct FSplineConnectorTickFunction : public FTickFunction
{
}; // Size: 0x78

struct FSquad
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString SquadName;                                                                // 0x0008 (size: 0x10)
    int8 AccessLevel;                                                                 // 0x0018 (size: 0x1)
    FSquadMember Leader;                                                              // 0x0020 (size: 0x28)
    TArray<FSquadMember> MemberList;                                                  // 0x0048 (size: 0x10)
    TArray<FSquadMember> InactiveMemberList;                                          // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FSquadAccessLevelChangedMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    int8 AccessLevel;                                                                 // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FSquadDeletedMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSquadErrorResponse
{
    bool bSquadFull;                                                                  // 0x0000 (size: 0x1)
    bool bTooManySquads;                                                              // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSquadInfo
{
    int32 ID;                                                                         // 0x0000 (size: 0x4)
    FString Name;                                                                     // 0x0008 (size: 0x10)
    FString LeaderName;                                                               // 0x0018 (size: 0x10)
    FString LeaderOnlineID;                                                           // 0x0028 (size: 0x10)
    int16 OnlineActiveCount;                                                          // 0x0038 (size: 0x2)
    int16 OnlineInactiveCount;                                                        // 0x003A (size: 0x2)
    int8 AccessLevel;                                                                 // 0x003C (size: 0x1)

}; // Size: 0x40

struct FSquadInviteInfo
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString SquadName;                                                                // 0x0008 (size: 0x10)
    FSquadMember LeaderMember;                                                        // 0x0018 (size: 0x28)
    FString TargetOnlineID;                                                           // 0x0040 (size: 0x10)
    int8 FactionId;                                                                   // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FSquadInviteWarMessage
{
    FSquadInviteInfo SquadInviteInfo;                                                 // 0x0000 (size: 0x58)

}; // Size: 0x58

struct FSquadLeaderChangedMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString LeaderOnlineID;                                                           // 0x0008 (size: 0x10)
    FString LeaderName;                                                               // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSquadManager
{
}; // Size: 0x380

struct FSquadMember
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    bool bIsOfficer;                                                                  // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FSquadMemberDeltaMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString OnlineID;                                                                 // 0x0008 (size: 0x10)
    FString Name;                                                                     // 0x0018 (size: 0x10)
    bool bIsAdd;                                                                      // 0x0028 (size: 0x1)
    bool bIsActive;                                                                   // 0x0029 (size: 0x1)
    bool bIsOfficer;                                                                  // 0x002A (size: 0x1)

}; // Size: 0x30

struct FSquadMessageMessage
{
    FString OnlineID;                                                                 // 0x0000 (size: 0x10)
    FString Name;                                                                     // 0x0010 (size: 0x10)
    FString Message;                                                                  // 0x0020 (size: 0x10)
    int32 SquadId;                                                                    // 0x0030 (size: 0x4)
    int8 Language;                                                                    // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FSquadMessageWarMessage
{
    FString Message;                                                                  // 0x0000 (size: 0x10)
    int8 Language;                                                                    // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FSquadOfficerDeltaMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString OnlineID;                                                                 // 0x0008 (size: 0x10)
    bool bNewOfficerState;                                                            // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FSquadOfficerDeltaWarMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString OnlineID;                                                                 // 0x0008 (size: 0x10)
    bool bNewOfficerState;                                                            // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FSquadOfficerToLeaderResponseMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    bool bRequestSuccessful;                                                          // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FSquadOnlineCounts
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    int16 Active;                                                                     // 0x0004 (size: 0x2)
    int16 Inactive;                                                                   // 0x0006 (size: 0x2)

}; // Size: 0x8

struct FSquadOnlineCountsMessage
{
    TArray<FSquadOnlineCounts> SquadOnlineCounts;                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSquadRemovedMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSquadRenamedMessage
{
    int32 SquadId;                                                                    // 0x0000 (size: 0x4)
    FString Name;                                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSquadReplicatedState
{
    TArray<int32> ActiveSquadIdList;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSquadStyle
{
    FButtonStyle CreateButton;                                                        // 0x0000 (size: 0x278)
    FButtonStyle LeaveButton;                                                         // 0x0278 (size: 0x278)
    FButtonStyle SquadPanelToggleOnButton;                                            // 0x04F0 (size: 0x278)
    FButtonStyle SquadPanelToggleOffButton;                                           // 0x0768 (size: 0x278)
    FButtonStyle SquadPanelActivateButton;                                            // 0x09E0 (size: 0x278)
    FSlateBrush SquadActiveBrush;                                                     // 0x0C58 (size: 0x88)
    FCheckBoxStyle PrivacyCheckBox;                                                   // 0x0CE0 (size: 0x580)
    FSlateBrush PrivateIcon;                                                          // 0x1260 (size: 0x88)
    FSlateBrush LeaderIcon;                                                           // 0x12E8 (size: 0x88)
    FSlateBrush OfficerIcon;                                                          // 0x1370 (size: 0x88)
    FSlateColor SquadNameColour;                                                      // 0x13F8 (size: 0x28)
    FSlateColor LeaderNameColour;                                                     // 0x1420 (size: 0x28)
    FSlateColor InactiveLeaderNameColour;                                             // 0x1448 (size: 0x28)
    FSlateColor MemberNameColour;                                                     // 0x1470 (size: 0x28)
    FSlateColor InactiveMemberNameColour;                                             // 0x1498 (size: 0x28)
    FButtonStyle SquadListElementButton;                                              // 0x14C0 (size: 0x278)

}; // Size: 0x1738

struct FStaticArtilleryDamageParams
{
    TSubclassOf<class UDamageType> Type;                                              // 0x0000 (size: 0x8)
    float BaseAmount;                                                                 // 0x0008 (size: 0x4)
    float Radius;                                                                     // 0x000C (size: 0x4)
    float InnerRadius;                                                                // 0x0010 (size: 0x4)
    float Falloff;                                                                    // 0x0014 (size: 0x4)
    float AccuracyRadius;                                                             // 0x0018 (size: 0x4)
    TSubclassOf<class AWarExplosionEffect> ExplosionClass;                            // 0x0020 (size: 0x8)
    class USoundCue* ShotSoundCue;                                                    // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FStaticCheckBoxStyle
{
    FSlateBrush BGImage;                                                              // 0x0000 (size: 0x88)
    FSlateBrush FGImage;                                                              // 0x0088 (size: 0x88)

}; // Size: 0x110

struct FStaticMeshOverride
{
    class UStaticMesh* Target;                                                        // 0x0000 (size: 0x8)
    class UStaticMesh* Override;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FStatusStyle
{
    FSlateBrush BleedingImage;                                                        // 0x0000 (size: 0x88)
    FSlateBrush BleedingModerateImage;                                                // 0x0088 (size: 0x88)
    FSlateBrush BleedingCriticalImage;                                                // 0x0110 (size: 0x88)
    FSlateBrush EncumberedImage;                                                      // 0x0198 (size: 0x88)
    FSlateBrush EncumberedModerateImage;                                              // 0x0220 (size: 0x88)
    FSlateBrush EncumberedCriticalImage;                                              // 0x02A8 (size: 0x88)
    FSlateBrush HiddenImage;                                                          // 0x0330 (size: 0x88)
    FSlateBrush HiddenModerateImage;                                                  // 0x03B8 (size: 0x88)
    FSlateBrush HiddenCriticalImage;                                                  // 0x0440 (size: 0x88)
    FSlateBrush WoundedImage;                                                         // 0x04C8 (size: 0x88)
    FSlateBrush WoundedModerateImage;                                                 // 0x0550 (size: 0x88)
    FSlateBrush WoundedCriticalImage;                                                 // 0x05D8 (size: 0x88)
    FSlateBrush LowHealthImage;                                                       // 0x0660 (size: 0x88)
    FSlateBrush LowHealthModerateImage;                                               // 0x06E8 (size: 0x88)
    FSlateBrush LowHealthCriticalImage;                                               // 0x0770 (size: 0x88)
    FSlateBrush LockedImage;                                                          // 0x07F8 (size: 0x88)
    FSlateBrush UnlockedImage;                                                        // 0x0880 (size: 0x88)

}; // Size: 0x908

struct FStealthChecker
{
}; // Size: 0x1

struct FStockpileAccessEvent
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int16 Quantity;                                                                   // 0x0008 (size: 0x2)
    bool bIsCrate;                                                                    // 0x000A (size: 0x1)
    FString OnlineID;                                                                 // 0x0010 (size: 0x10)
    FString Name;                                                                     // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FStockpileBroadcastAlertInfo
{
    FString StockpilerOnlineID;                                                       // 0x0000 (size: 0x10)
    FString StockpilerPlayerName;                                                     // 0x0010 (size: 0x10)
    class AStructure* StockpiledStructure;                                            // 0x0020 (size: 0x8)
    TArray<FStockpileEntry> Submissions;                                              // 0x0028 (size: 0x10)
    bool bAreSubmissionsCrates;                                                       // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FStockpileEffects
{
    uint8 DebuffPercent;                                                              // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FStockpileEntry
{
    FName CodeName;                                                                   // 0x0000 (size: 0x8)
    int16 Quantity;                                                                   // 0x0008 (size: 0x2)

}; // Size: 0xC

struct FStockpileEvents
{
    TArray<FStockpileAccessEvent> ItemEvents;                                         // 0x0000 (size: 0x10)
    TArray<FStockpileAccessEvent> VehicleEvents;                                      // 0x0010 (size: 0x10)
    TArray<FStockpileAccessEvent> StructureEvents;                                    // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FStockpileItemFilter
{
    int32 ItemHolderSlotIndex;                                                        // 0x0000 (size: 0x4)
    int32 QuantityToSubmit;                                                           // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FStructureBuildStep
{
    FName RequiredCodeName;                                                           // 0x0000 (size: 0x8)
    FName NextStructureCodeName;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FStructureDynamicData : public FTableRowBase
{
    int32 MaxHealth;                                                                  // 0x0008 (size: 0x4)
    FResourceAmounts ResourceAmounts;                                                 // 0x0010 (size: 0x20)
    FResourceAmounts AltResourceAmounts;                                              // 0x0030 (size: 0x20)
    float DecayStartHours;                                                            // 0x0050 (size: 0x4)
    float DecayDurationHours;                                                         // 0x0054 (size: 0x4)
    int32 RepairCost;                                                                 // 0x0058 (size: 0x4)
    float StructuralIntegrity;                                                        // 0x005C (size: 0x4)
    int32 StoredItemCapacity;                                                         // 0x0060 (size: 0x4)
    int32 RamDamageReceivedFlags;                                                     // 0x0064 (size: 0x4)
    bool bCanBeHarvested;                                                             // 0x0068 (size: 0x1)
    bool IsVaultable;                                                                 // 0x0069 (size: 0x1)
    bool bIsDamagedWhileDrivingOver;                                                  // 0x006A (size: 0x1)

}; // Size: 0x70

struct FStructureProfileData
{
    bool bHasDynamicStartingCondition;                                                // 0x0000 (size: 0x1)
    bool bIsRepairable;                                                               // 0x0001 (size: 0x1)
    bool bIsUpgradeRotationAllowed;                                                   // 0x0002 (size: 0x1)
    bool bIsUsableFromVehicle;                                                        // 0x0003 (size: 0x1)
    bool bAllowUpgradeWhenDamaged;                                                    // 0x0004 (size: 0x1)
    bool bCanOverlapNonBlockingFoliage;                                               // 0x0005 (size: 0x1)
    bool bDisallowAdjacentUpgradesInIsland;                                           // 0x0006 (size: 0x1)
    bool bIncludeInStructureIslands;                                                  // 0x0007 (size: 0x1)
    bool bCanDecayBePrevented;                                                        // 0x0008 (size: 0x1)
    float VerticalEjectionDistance;                                                   // 0x000C (size: 0x4)
    bool bEnableStealth;                                                              // 0x0010 (size: 0x1)
    bool bIsRuinable;                                                                 // 0x0011 (size: 0x1)
    bool bBypassesRapidDecayForNearbyStructures;                                      // 0x0012 (size: 0x1)
    bool bUsesImpactsMaterial;                                                        // 0x0013 (size: 0x1)
    bool bIsBurnable;                                                                 // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FStructureStats
{
    class AActor* Structure;                                                          // 0x0000 (size: 0x8)
    float DecayRemainingTime_Sec;                                                     // 0x0008 (size: 0x4)
    float DecayAmount;                                                                // 0x000C (size: 0x4)
    bool bShouldDecay;                                                                // 0x0010 (size: 0x1)
    bool bCanApplyDecay;                                                              // 0x0011 (size: 0x1)
    bool bIsBuildSite;                                                                // 0x0012 (size: 0x1)
    int32 Health;                                                                     // 0x0014 (size: 0x4)
    int32 MaxHealth;                                                                  // 0x0018 (size: 0x4)
    FResourceAmounts ResourceRequirements;                                            // 0x0020 (size: 0x20)
    float ConcreteProgress;                                                           // 0x0040 (size: 0x4)
    float IslandHealth;                                                               // 0x0044 (size: 0x4)
    float IslandIntegrityBonus;                                                       // 0x0048 (size: 0x4)
    float Suppression;                                                                // 0x004C (size: 0x4)
    float ShelterBonus;                                                               // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FSubmarineDivePlane
{
    FVector Pivot;                                                                    // 0x0000 (size: 0xC)
    FVector2D Size;                                                                   // 0x000C (size: 0x8)

}; // Size: 0x14

struct FSurfaceMovementData
{
    class UPhysicalMaterial* PhysicalMaterial;                                        // 0x0000 (size: 0x8)
    float StaminaDrainModifier;                                                       // 0x0008 (size: 0x4)
    float MovementSpeedModifier;                                                      // 0x000C (size: 0x4)

}; // Size: 0x10

struct FTechResource
{
