{
  "": {
    "F7B3E3134BDFD4D9A7D52692CDFF720D": "12.7-мм",
    "45D2C1E8485F1B0D876989BAAC564C0C": "Артиллерийское орудие 120-68 “Koronides”",
    "916138E445876798C80845824CF00F8A": "Артиллерийское орудие 120-68 “Koronides”",
    "D4FB1A104B695DEAF462B295B8B01D45": "120-мм",
    "7F4B7CCF453614C47E0C3ABE06CE93EA": "150-мм",
    "70E8F99F481D13F68E84B0B73F53CEC8": "Противотанковое ружье Neville 20",
    "060FC4A347CAEAEB15F415A78AC7EFFA": "20мм",
    "18569AA2442755B30417B9A79CDF9929": "250мм",
    "059BF4FD4EFEB8A20D326F8C64D3EA5E": "Полевая пушка 30-250 “Tisiphone”",
    "D5872EE8494F4594FD185584E6E3E67F": "300-мм",
    "1C3C7C114F19674C49FF358B0FB80411": "30мм",
    "CAB09D624FC3C44F8E72E784DB49B0FA": "3C-Фугасная ракета",
    "7E3073EC411445DBF7B3D6A82C80B65F": "40-мм",
    "207EFC4040D06114E7C593BE1A96F7A4": "4C-Зажигательная ракета",
    "2823BCF6486F7BA780DFB9B648E03CA5": "68мм",
    "7208C0F2499AF0909F6934B938937C44": "7.62-мм",
    "64C33C4C4C5AD7FD90EBBA97A012B49A": "7.92-мм",
    "7B8F6445416315A78090889C40EE2C62": "75-мм",
    "79B37B824E0331C52F18A094D5938A33": "8-мм",
    "D8750ABC4423022DBF1E25BD003F2F54": "94.5мм",
    "8C27A8594CFAC77BC2ED14A335E43F3A": "9-мм",
    "ABE92E8B41355AF0EF2BF89C9F6AE45D": "Городской боевой противопехотный автомобиль колонистов. Он использует боеприпасы калибра 7,92 мм и уязвим сзади.",
    "DB42CDE2472CDA9F938C8EB6E78BCF2A": "Колонистский автотранспорт, используемый для переброски бойцов и припасов.",
    "6E22A7064B8B01616C97DCACB5358CA7": "Kraunian винтовка для дальнобойного огня. У модели отсутствует дальность и останавливающая сила других снайперских винтовок, но за то имеет непревзойденную надежность в разных условиях и повышенную скорострельность.",
    "E8DF220F4C61FFF4E87167BDB240E8F5": "Улучшение \"Большой Гарнизон\" постоянно соединяет эту базу с ближайшими оборонительными сооружениями.\r\n\r\nДля улучшения базы до уровня 3 требуется \"Большой гарнизон\".",
    "D0B5C6594E1D21848FCBB3B8F4B5BA31": "Временный Гарнизон, соединяющий эту базу с неподалеку стоящими оборонительными сооружениями. Оборонительные сооружения отключатся, если игроков будет слишком мало.\r\n\r\nЭто также позволяет захватить этот город для победы в войне.",
    "2E97128843820EB35C9F7594653DE298": "Станция переработки исходного сырья в материалы.",
    "DB8F146845B3D2707EEE4FAA7E9F3FB0": "Улучшение \"Малый Гарнизон\" постоянно соединяет эту базу с ближайшими оборонительными сооружениями.\r\n\r\nДля улучшения базы до уровня 2 требуется \"Малый Гарнизон\".",
    "9BC06F1F45F3DFB47E850090FE338208": "Мотоцикл Варденов с коляской, используемый в патрулях. Kivela Power Wheel может моментально ускоряться, сжигая дополнительное топливо.",
    "E67197AD45F7368F5E843F85DB73B7C6": "Городской боевой противопехотный автомобиль Варденов. Он использует боеприпасы калибра 7,92 мм и уязвим сзади.",
    "C1ADB43947CBF8A0166097B86CEA58D5": "Варденский грузовик для переброски пехоты и припасов.",
    "0810394D4C98AC57B6375A9556ADFDAF": "Преграда, используемая для предотвращения прохода по местности.",
    "CB0B50A44DDC10BE211DC4B4B7381153": "Барьер, который используется для предотвращения прохода через местность.",
    "42F6EE1B42458373F5AD0FACFAB8D199": "Основной барьер, предотвращающий свободное перемещение по местности.",
    "849F766947B123B6F7AC2B9B46735242": "Доменная печь, которая дополнительно перерабатывает тяжелую нефть в обогащенное масло, необходимое для передовых процессов.",
    "1B9EA5094C9510ADD875C682CD9695E1": "Компонент крови для реанимации раненых на поле боя.",
    "071146C64F45BB20DC7F9097F2927408": "Доска с различными картами регионов и полезными схемами. Тщательное планирование и навигация являются ключом к любой успешной операции.",
    "79E7DF2446C683B4A4C5BBBF7E6F0F00": "Пушечный вариант танкетки \"T12\", \"Ixion\" предоставляет экипажу больше поддержки, а также смонтированное орудие поддержки пехоты. Вес дополнительной брони привел к снижению максимальной скорости.",
    "1D3E7E0B40AD5A10BA91D0A502DFCD97": "Ведро для воды. Вы можете вылить воду на огонь, чтобы его потушить.",
    "5613ECB84871EAF807AF3C94E7410811": "Набор станков, формирующий сборочную линию пехотного оружия специального назначения и взрывчатых веществ.",
    "35906D654E7DA1A4DC94708B247DBD88": "Компактная противотанковая граната для стрельбы из дульного гранатомета винтовки или турели. Её заряд отлично подходит для обездвиживания бронетехники, а сама граната универсальна и удобна в транспортировке.",
    "3374580C4828A038F890F0865E7A4404": "Соединение чрезвычайно редких металлов, используемое при производстве самых продвинутых транспортных средств и оружия.",
    "7E40D2154CE6CB3C3E6061949B00885E": "Бетон используется для создания более прочных укреплений.",
    "9DF94D654A1A4D7A9594109BDFF73675": "Вагон-контейнер для перевозки угля для дозаправки поездов в поездках на большие расстояния. ",
    "5E7A0E644EAC8007BB97D79FC018D9C2": "Контейнер для перевоза больших партий ящиков. Этот тип контейнера может быть разгружен только на Базах Хранения или в Портах.",
    "E23C94E74E90656A4646E4B76C1064A2": "Контейнер для хранения больших объемов жидкостей. Близлежащие строения и транспортные средства могут заправляться прямо из этого контейнера. ",
    "0940EACD44FCACF5968E3D973AC19D10": "Вместительный контейнер для ресурсов имеющий возможность быть перевезённым некоторыми транспортными средствами.",
    "ABE5635E4960DF03209C51B702D6B9A4": "Ящик с предметами. Чтобы извлечь содержимое, необходимо поместить ящик в хранилище.",
    "ACF04FFB45D3815A46FBA8A4817BAB49": "Ящик запакованных сооружений.",
    "92413FCE410B5FD33CC7E7BECF7DFEEB": "Ящик с упакованным транспортом.",
    "E41316F941B33903879094BC79330D6A": "Урезанная версия штурмового танка Сильверхэнд, в которой броня и защита пожертвованы в пользу мощной 94,5-мм пушки. Эта оружейная платформа с открытым верхом специально разработана для перехвата бронетехники противника до того, как у него будет время нанести ответный удар. Его прозвище - дань уважения великому королю, в честь которого назван Сильверхенд; в то время как его титул был лишен, а его гордость задета, его гнев так и не был подавлен.",
    "1F5FBDDF4A8D12766DD862BCC40AA8A4": "Смертоносная длинноствольная снайперская винтовка с исключительным останавливающим действием. Quickhatch прекрасно подходит как для охоты на броню, так и на солдат противника.",
    "0670B3AB41061136BDA48382F2BA1F64": "Защитный барьер, который препятствует передвижению противника и обеспечивает прикрытие во время боя.",
    "41E8BDBD43A5DBAA714F13BB9B8F345F": "Защитный барьер, препятствующий продвижению противника и обеспечивающий укрытие в бою.",
    "A8CDA9DA405A9520FCAB96A5C7E7CCEE": "Оборонительное сооружение с 68-мм противотанковой пушкой. Это рудиментарное оружие когда-то было сконструировано для установки на корпус больших военно-морских судов, но в конечном итоге было снято с производства и перепрофилировано.",
    "00358E364B11C747248F818F086B46CD": "Защитная стена, препятствующая движению врага и обеспечивающая укрытие во время боя.",
    "3105F0534A0D724D774462A341DAA801": "Защитная стена, препятствующая движению врага и обеспечивающая укрытие во время боя.",
    "99C132674FFD45DF7D2E56B3BC711991": "Разрушенная орудийная траншея.",
    "BE5E36F541B479B4216542B5A6ADFC4B": "Разрушенная орудийная траншея.",
    "D66C394A48367596582750A9659F5C0C": "Разрушенная орудийная траншея.",
    "68092C204DF23054102EA1AA67500C02": "Разрушенная соединительная траншея.",
    "91F78F5F4497E20D3A4795993359477D": "Разрушенная соединительная траншея.",
    "BD1F34F343EC150E2863888593CE9063": "Уничтоженная соединительная траншея.",
    "2C46569947371E295E55CE9C92500740": "Разрушенная траншея.",
    "594A7EAA47FD9AAE46EBE090CB2A4429": "Разрушенная траншея.",
    "EB7366454EC479B9AD5D1C98A9730D2A": "Разрушенная траншея.",
    "4E49999842287992ED3A1386617B3BB1": "Устройство для перехвата радиопередач противника из близлежащих источников.",
    "F19A102C4321B3F939D887A4CABACDA7": "Устройство, используемое для перехвата радиопередач противника из близлежащих источников.",
    "662029924BA10BE1FE3BBCA7285337B9": "Бочка, содержащая топливо для использования с огненными оружиями.",
    "AED06A8142D5D69B92B9BEA908FCFCE2": "Спаренный крупнокалиберный противопехотный пулемет “Swallowtail” оснащен передней бронеплитой и идеален для огня на подавление. ",
    "412F9B3C4C78EE64DA2A659E761946AE": "Двуствольный крупнокалиберный противопехотный пулемет. “Sagittarii” оснащен направленной вперед бронеплитой и отлично справляется с подавлением. ",
    "07E2E2DF4A18549BA72607ABD8CE60D9": "Блиндаж, который используется как укрытие и как проходы между Бункерами. Соединяется с другими окопами и бункерами.",
    "9E2135994268AB8584299193965DF80B": "Траншея, которая используется для укрытия и прохода между бункерами. Соединяется с другими траншеями и бункерами.",
    "BC51F6BD4705B2E3B4FBCEAB125A1A82": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями и бункерами.",
    "DD2AB37D4FA6E5A48AD411916356CE29": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями и бункерами.",
    "76B16A824CBCB1A33968A6BFE11AD03F": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями и бункерами. Это специальный, динамически изменяемый, вариант траншеи, который может проходить под дорогами.",
    "DFFC4C2D4A663BFF702B08BAB37B7C5A": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями и бункерами. Это специальный, динамически изменяемый, вариант траншеи, который может проходить под дорогами.",
    "FF9A406C41A2FA315015A38BC88B91CB": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями и бункерами. Это специальный, динамически изменяемый, вариант траншеи, который может проходить под дорогами.",
    "2F7B619D405D508DFA5DEF94AA028D8C": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями. Этот вариант может служить огневой позицией для управляемых установок.",
    "A320DFC84F9F465BBF6EDAB03B974770": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями. Этот вариант может служить огневой позицией для управляемых установок.",
    "FA81A3C548714C37F5F2258FB1420749": "Траншея используемая для укрытия и прохода между бункерами. Соединяется с другими траншеями. Этот вариант может служить огневой позицией для управляемых установок.",
    "D8EDFE25412F16F3D52F71B321EB90C9": "Инженерное сооружение, обеспечивающее питание конструкций бункера, используя соединение по трубам.",
    "DF6685414ACEF01A0812CE95BB5B0BFD": "Инженерное сооружение, обеспечивающее питание конструкций бункера, используя соединение по трубам.",
    "23E6D64B495A0A6B46E711BCD9D03A93": "Сооружение, в котором хранится снаряжение и боеприпасы для артиллерии. Извлечение из инвентаря этого сооружения происходит очень быстро.",
    "3B196CD540FB62AD3622579FBF626BFE": "Сооружение, в котором хранится снаряжение и боеприпасы для артиллерии. Извлечение из инвентаря этого сооружения происходит очень быстро.",
    "BB7C28194487CA425C4DF98A61D4FE2C": "Завод по производству современных типов боеприпасов, таких как крупнокалиберные снаряды, ракеты и огнеметные боеприпасы.",
    "BE177EE4441C5F046CC8049B97050210": "Завод по переработке сырья в Обработанные строительные материалы. Дополнительные модификации могут позволить производить различные усовершенствованные материалы, необходимые для передового производства.",
    "77F7A5C245872D31C6810B8DFAFF6296": "Фабрика, которая перерабатывает сырье в Строительные материалы для продвинутых заводов. Дополнительные модификации позволяют разрабатывать разные материалы.",
    "321CB9FD49796CE9AB81229C03CB0B01": "Завод, специализирующийся на производстве пехотной униформы. Могут быть построены модификации для производства пехотного оружия и тяжелых боеприпасов.",
    "87312142472EB68405C143887E747795": "Быстролетящий взрывчатый снаряд, используемый на РПГ установках.",
    "D80FAAA943B11E8EE5B1FD8917D0EB63": "Полевой медицинский пункт используется для лечения тяжелораненых солдат на передовой. ",
    "401E46D3461494D138A23482166A0EDB": "Костёр",
    "DACD4BF34D13FA3410AFD4B1ADE16D36": "Первый в своем роде Skycaller представляет собой вариацию моторной коляски Niska с ракетной батареей Rycker, установленной в задней части кузова. Эта уникальная бронированная машина быстро и с легкостью запускает ракеты на большие расстояния и может быть перевооружена и передислоцирована в мгновение ока. Skycaller - это смертоносный результат комбинированной Nevish и Caoivish инженерии.",
    "BD812A6742F1D60A2CA2E09E408378F3": "Бортовой вагон для перевозки крупных ресурсов и боеприпасов поездом на большие расстояния. ",
    "13D9448B439D377ACF804D9C57381E7C": "Затопляемый резервуар и строительная платформа, облегчающая сборку и ремонт крупнейших морских судов.",
    "0C71638A4003A5349C54ECAF3E566645": "Официальная форма для офицеров подразделения. Пусть и непрактичная, в ней дежурный офицер может использовать свои полномочия для наказания подчиненных без последствий. Офицеры играют важную роль в вооруженных силах Варденов еще с тех времен, когда Каойва управлялась дюжиной королей.",
    "CDDD81B84541976034E1D6BA163C62BB": "Фундамент, который обеспечивает подходящую поверхность для строительства объектов.",
    "66CC30DF45FBD48814720C8A697FCD15": "Литейное крыло, обеспечивающее производство и сборку тяжелых боеприпасов, используемых в танках и тяжелом пехотном оружии.",
    "8DA8488E4CCE724BE7D96595F1312DAE": "Гараж, который облегчает модификацию и модернизацию транспортных средств.",
    "44C193C343183902EC1598A00A0E7236": "Центральное здание гарнизона жизненно важно для защиты города. Здесь игроки могут возрождаться и накапливать предметы.",
    "6FBF40EC4148F845D6E9838CCE86CE5E": "Центральное здание гарнизона жизненно важно для защиты города. Здесь игроки могут возрождаться и накапливать предметы.",
    "BEAB2C24421E9FFAC1FD26B28C0F991B": "Центральное здание гарнизона жизненно важно для защиты города. Здесь игроки могут возрождаться и накапливать предметы.",
    "F85BCBE9434061E78F8BBBA1F83C0D89": "Опорный пункт с гарнизоном, используемый для защиты города. Здесь игроки могут возрождаться и накапливать предметы.",
    "75C05BD74EA44B3459F6DD9AE7D7477F": "Ворота, дающие доступ к огороженной местности.",
    "F40945DD48E7FE4C35DD0188F1295FE7": "Ворота, которые дают доступ к огражденной зоне.",
    "FCF631C147D5FEC5ECAAEABFBEF23D0E": "Ворота, которые дают доступ к огражденной зоне.",
    "C123BDFD4EAF70CBDB604F8DBA641B22": "Генератор, потребляющий уголь для выработки энергии.",
    "798C0A354153FA97DF4B9EA6536829E6": "Генератор, потребляющий бензин для выработки большего количества энергии.",
    "2F41A7A64A16C1223014DE81956F79B9": "Насос для добычи нефти, использующий электричество для подачи в присоединенные трубы.",
    "BD0BCA3543C3C29E448EE9A8A07A0E05": "Тяжелый, современный вариант Pitch Gun, пистолет пулемет Lionclaw хорошо показывает себя как основное оружие в городских боях в условиях ближних столкновений.",
    "4D00771B4B5B472A271215A91FDC3430": "Тяжелобронированный вариант King Spire, жертвуя максимальной скоростью, Gallant Mk. II может похвастаться увесистым 30-мм орудием.",
    "4C3B15ED42125D7480A52F9BC253DD30": "Тяжело усиленный жилет, предназначенный для защиты гренадеров от струй реактивных газов. По итогу, бронежилет также уменьшает порезы и царапины в дополнение к гашению энергии пуль. ",
    "2A8BE1C34C0526F79ACF6D91681CC82B": "Усиленная модификация Lance, модель 25, она же \"Hasta\", использовалась при первой осаде Брайтуолла, города, который теперь в народе называют Блемиш. Подвергшись мощному бронетанковому сопротивлению в северной части Вели, танковые полки Колонистов запросили тяжелую машину с более эффективными возможностями поиска и уничтожения противника. Оснащенный 94,5-мм пушкой без башни, \"Hasta\" - превосходный истребитель танков.",
    "9116C94743283A454087F4ACE0D29789": "Тяжелый противотанковый снаряд.",
    "46724B5540021ABA9BCBB096CCD52C7E": "Тяжёлый автоматический пресс, сжимающий материалы в более плотную форму.",
    "A26D7B604F08AA4B21D755B90489E34E": "Тяжелое орудие разработанное для разрушения гарнизонов и фортификаций надвигающихся сил. Exalt лучше всего применима, находясь в оборонительной позиции, используя ее впечатляющую дальнобойность.",
    "B30E60B44B6340C80E9B3CBA1C235AAF": "Надежный грузовик от Bassett Motor Society предназначен для перевозки снаряжения на дальние расстояния. ",
    "7312CF5F420C4840C1D6F8B7AB84AAC2": "Тяжелая стационарная артиллерийская установка, способная вести сокрушительную огневую мощь по удаленным целям противника.",
    "F9A90325487C80A2A8DB16B087D95B58": "Тяжелая булава, сделанная из цельного дерева и покрытая свинцовыми заклепками. Часто используется при штурме укрепленных позиций в ближнем бою, где огнестрельное оружие менее эффективно, а старомодное дробящее оружие лучше для этого подходит.",
    "A040D2D145966F1A2E0D22B32ACB68AD": "Тяжелый мобильный кран для перевозки очень тяжелой экипировки.",
    "325F6DAF49E428E1E2423F8083F0DC00": "Тяжёлый переносной миномёт, оснащённый толстым лобовым щитом для атаки укрепленных позиций",
    "3C9D234C4A0EFD3161554E8A42C845F0": "Это тяжёлый, бронированный грузовик Дюнна. Оснащенный усиленной рамой, Лезебек способен выдержать больше попаданий, ценой скорости разгона. ",
    "B8101D7F4ABFB0076157E78860DFD2DB": "Сверхмощный боевой танк с толстой броней и разрушительной огневой мощью. Flood оснащен 75-мм башней и передним 12,7-мм противопехотным пулеметом. Тяжелая броня ограничивает максимальную скорость, но взамен он может выдержать много попаданий.",
    "557888F2425D443A3754D38FF3E68F46": "Сверхмощный боевой танк с толстой броней и разрушительной огневой мощью. Lance оснащен 75-мм башней и 12,7-мм зенитным пулеметом, установленным спереди. Тяжелая броня ограничивает максимальную скорость, но взамен она может понести большое наказание.",
    "6BCE5705403F3D8062BC3D983238B63B": "Тяжелогрузный колонистский грузовик, используемый для мобилизации войск и припасов.",
    "9BC20CBD4F82B56B829926AAB0EFFFD9": "Тяжелогрузный варденский грузовик для переброски пехоты и припасов.",
    "340573BC403E8059BF8EA7A91BFC2D18": "Мощная и дальнобойная снайперская винтовка. Clancy-Raca имеет чертовски сильную отдачу, но оснащена дальнобойной оптикой, и тем самым позволяет пехоте следить за полем боя и оказывать поддержку с безопасного расстояния.",
    "1994D61046CF0C62DCDBA8B98CE3EED0": "Противопехотное орудие большого калибра. Отлично подходит для подавления.",
    "08390D0C46412A24EF34288CAA71FC09": "Топливо высокого качества получаемое из Нефти. Используется в различных процессах на Фабриках.",
    "CCBBD74C4EB9271DBBECA0B96391FAC3": "Мощная печь, которая нагревает уголь до высоких температур для отделения нелетучего Коксового угля.",
    "DF0E3525485D81F6072D3C84FA8F3497": "Высокотемпературная печь, которая катализирует сырую нефть в очищенную тяжелую нефть.",
    "0E47C84B4819C0B2C1C2E0B22660C5F8": "Мощный заряд взрывчатого вещества, для которого требуется сопутствующий детонатор. Заряд Хавок очень эффективен при сносе больших строений. Заряд должен быть взорван выстрелом по нему. Истинный потенциал Хавок Заряда раскрывается при выполнении стратегических разрушений на безопасном расстоянии.",
    "7D8FA1B34320EA7C8774D89576D22C1A": "Высокотехнологичный пост прослушивания, предназначенный для перехвата и расшифровки вражеских передач. Разведывательный центр может нацеливаться на удаленные места и будет продолжать расшифровывать конфиденциальные передачи в течение длительного периода времени.",
    "63CA92E04D0FE15E13FC298EDF912E3C": "Высокотехнологичный метеорологический модуль, построенный на прочном фундаменте в бункерной системе. Эти станции помогают операторам предсказывать погодные условия. Несколько модулей метеостанций можно объединить в цепочку для более точного прогнозирования, что позволяет армиям готовиться к самым неблагоприятным условиям.",
    "97678A9F4AE94DBACE6C1B8F000042E9": "Легкий и манёвренный танк. “Девитт” оснащен 40-мм орудием, разработан для ведения городских боев.",
    "891DFDAC45CBDAD6EB7D39B2B7A58F5B": "Легкий и манёвренный танк. “Hatchet” оснащен 40-мм орудием, разработан для ведения городских боев.",
    "BA047D574FF12364673CD6A6DC2F22F3": "Обрез охотничьего ружья, обладающий увеличенным останавливающим воздействием и удобством в использовании в угоду потери в точности. Это традиционное гражданское огнестрельное оружие, способное произвести 2 выстрела подряд без перезарядки. Оно стало излюбленным вторичным оружием Caoivish Watchers и заполучило зловещую репутацию.",
    "5EEBA409482F1AD6C7AE7E85C975002F": "Большая Сборочная Платформа для производства продвинутой техники и оборудования, как например танки или поезда. Производство займет некоторое время и может быть прекращено в случае нехватки ресурсов.",
    "EC62CC58412440D4E23C7CBA9AC21CFF": "Большое здание, используемое для хранения ящиков, транспорта, а также грузовых контейнеров.",
    "2E7E0DB244163440077CE7A62C37E0D4": "Большое здание, используемое для хранения ящиков, транспортных средств, лодок и перевозимых грузов.",
    "06A4877C416917417F9ACBA44DB999B0": "Большая передовая база. Здесь игроки могут хранить снаряжение и возрождаться.",
    "1999FECB40FF4DE9FF6E91A65B0004F0": "Большая передовая база. Здесь игроки могут хранить снаряжение и возрождаться.",
    "B572582B475475CC0EAC4396606C91DA": "Большая передовая база. Игроки могут возрождаться здесь и складывать предметы.",
    "ECF915A74AF418023D2351A1CB61F605": "Большой промышленный котел для разжижения металлов для удаления примесей из современных материалов.",
    "985FCAC54A7A91242513AB92B016817E": "Большое медицинское учреждение для лечения тяжелораненых вернувшихся с поля боя.",
    "21DC32A84CC9B1B06A33D0B902E7E975": "Большой обрабатывающий барабан, позволяющий контролируемо подавать водород для получения аналогичного объема Бензина при меньшем потреблении сырой Нефти. ",
    "A71A14434198515B2130449921B346AD": "Большое транспортное судно Aquatipper используется для перевозки, транспорта, снаряжения и пехоты на большие морские пространства.",
    "94B578314EBB3B9E7F4F24A53ED1ED57": "Легкий бронированный транспорт, впервые замеченный в приграничных стычках между Сивой и Вели. Благодаря узкому корпусу, мог развертываться широким строем, подавляя силы противника.",
    "ADE614A6470D0CB66831B2A910D3D874": "Легкая артиллерия, предназначенная для установки в оборонительных укреплениях. Lariat оснащен грозным дальнобойным 120-мм орудием, предназначенным для сильного подавления пехоты противника.",
    "F00BFEEC43676E5CE6440DB3D2B5BE81": "Свет, который освещает окружающую местность. Для функционирования требуется по крайней мере минимальное количество энергии.",
    "0863B6A543ECCD93995DD2AC4968D4C9": "Местность, на которую нацелена ракета.",
    "310C20A047D44550CB384F8FDAF5226A": "Дальнобойная мобильная артиллерия Колонистов для ведения осадного огня по позициям противника.",
    "79122FD246C033F537757FA0D88CF3AA": "Colonial дальнобойная мобильная артиллерия для ведения осадного огня по позициям противника.",
    "40DD8C8E4A58BB0AA2E145AD0DFDF9A3": "Снаряд длительного горения, который зажигается в воздухе, освещая большую площадь и давая возможность обнаружить вражеские цели.",
    "906435B8438E53184E6B5CA9EA7AE97A": "Радиостанция дальнего действия, предназначенная для передачи приказов в крайних случаях.\nИногда нет времени для передачи приказа вручную.  ",
    "3CF4A6404018F2698D30D1BFA541252C": "Низкопрофильный бортовой вагон для транспортировки крупных ресурсов и боеприпасов на короткие расстояния по путям малой колеи.",
    "75BE38574144D6EE1C1F1085D925297F": "Механизм, создающий разломы в земле путем закачивания воды под высоким давлением для увеличения добычи нефти.",
    "5134C9D844FBDCE85A83E29BF38D7C00": "Волшебный ящик, дублирующий содержимое первого слота.",
    "F16C032A4356D6B5945DD1AD7C5D07E9": "Полевой мост для переброски легкого снаряжения на короткие дистации. Получает урон от транспорта, проезжающего по нему.",
    "5AE32C83458629A923D0A0ACE0C852CC": "Здание с минометными позициями, используемыми при защите города.",
    "AF5E0C7B4953A4E92C6C48836B169E7E": "Завод по крупносерийному производству военного снаряжения.",
    "57EB5012423821DF377391A599C0C6FE": "Завод по производству военного снаряжения.",
    "35DC470B411457F604EDC78818A6EF99": "Паллета для материалов.",
    "2FC15D1940E24085A4DC9DAFE755B1E3": "Медицинский бункер, используемый для лечения тяжелораненых на фронте бойцов.",
    "5D5F091A4333F9BDF12730B4B22BA67F": "Медпункт в бункере для лечения тяжелораненых на фронте бойцов.",
    "9F05AAD54ADB63D64CA29EA1EF2C5E54": "Медпункт в бункере для лечения тяжелораненых на фронте бойцов.",
    "B8E16A6F4322F73241A86B8E99FBBDCD": "Топливо среднего класса, получаемое из нефти. Используется в качестве топлива более высокого класса для транспортных средств и в различных применениях на объектах.",
    "52F819C94A4FB7D68080FEA14921C197": "Модифицированный Devitt со специальной башней типа Caine mortar, которая идет в ущерб максимальной скорости.",
    "3729EE67488A5DDA39955096FCC3346C": "Мотоцикл с коляской, используемый для патрулирования больших пространств. Скорость может быть увеличена за счет повышенного расхода топлива.",
    "EB42FEA34CE79F8CAB36C0A8DF52C365": "Моторная лодка для переброски небольших групп пехоты через реки и между островами.",
    "095F90EA4DBE1E287F589E95E8303BC7": "Станковая точка для развёртываемого пехотного оружия и снаряжения.",
    "53E5E9F6485E6A05C7AAB5AA17F64602": "Многоцелевой боевой танк с усиленной композитной броней, большой огневой мощью и низкой мобильностью. Он оснащен орудийной башней большого калибра и установленным на лобовой части пулеметом, который может нейтрализовать угрозы пехоты, стоящей впереди. Снаряжается 75 мм боеприпасами.",
    "4A725EBD4FD3211B67054EB4E0551E0A": "Многоцелевой колонистский внедорожник, способный вести разведку целей поблизости.",
    "12F425DF4BB2CA39EB0D76BC2FF4B033": "Многоцелевой внедорожник Варденов, способный вести разведку ближайших целей.",
    "329A5E954C449A6D068FE3B014FE2303": "Универсальный инструмент. Используется для обезвреживания мин, демонтажа колючей проволоки и вскрытия транспортных средств.",
    "81B26A394866F839029F09AB4976253E": "Мистический ящик с бесконечными ресурсами",
    "9A3557304EF64924F26FBDB3CB19F583": "Особенно торжественный флаг.",
    "B427B38E4B6A375CB9664590C5B78984": "Пистолет Ferro 879, импортируемый из восточной страны Estrella, часто встречается на полях сражений.",
    "67D734954C830181A4C42BA3CCB28371": "Костер для обогрева солдат во время снежных бурь. Необходим Дизель для розжига.",
    "898522CC4AC93FBD1DE535896836D8CF": "Портативный аппарат, который замешивает различные материалы для производства бетона, используется для строительства хорошо укрепленных сооружений.",
    "02C98F7147B981B0F235D890FB98C008": "Электрический щит для ручного отключения электропитания в сети.",
    "6C4EC81A4984D707E50FBFAD4AB329B9": "Электростанция, генерирующая огромное количество энергии, используя Нефть или Уголь.",
    "5212939C48FF1C642B8E6EB662591ED1": "Подготовленная зона для создания противотанковых и противопехотных минных заграждений.",
    "AF36B46549B82B8327C173B20E6E0342": "Перерабатывающий завод, который перерабатывает уголь в полезные материалы, используемые в производстве оборудования и электроэнергии.",
    "42490F284579F2525B717597767F805B": "Стойка используемая для установки нескольких единиц оружия.",
    "952D2A4746C7A202922E04831AD73301": "Наблюдательный пункт, предоставляющий союзникам информацию об окрестностях. Построенная из твердого бетона, эта надежная конструкция расширяет область своей эффективной дальности действия по сравнению с такими же, но менее укрепленными.",
    "C08F59AF40C5D83D647E19B12B194312": "Наблюдательный пункт, который предоставляет дружественным юнитам информацию об окрестностях. Укрепленная деревом, она может выдержать большее количество урона, чем стандартная радиостанция, и, следовательно, обладает повышенной эффективностью.",
    "98FDD84247786AD3619A06A7C390649A": "В регионе бушует ливень.",
    "2041E1E94A36F25C11F23DBC6B1E7491": "Помост для создания проходов над большими заводскими комплексами.",
    "601D72B24860CDD8206351BEE71FC3AC": "Помост предназначенный для прокладывания проходов над строениями.",
    "9C356F4C482A99F34DB28891873D9290": "Рампа, дающая доступ в подземный бункер.",
    "A548DAAE458E69AB6A32C39E233CBD17": "Рампа, дающая доступ в подземные бункера.",
    "F1F91A014F23A3D3B484BDBD771E25E6": "Рампа, дающая доступ к подземным Бункерам.",
    "548DACD345555EDD93D43DB8A81C5327": "Сырая вязкая жидкость, которая должна быть переработана в топливо на предприятиях.",
    "4F428A6749B2C8811BE67A9F3B7F53B6": "Реактор, объединяющий Воду с Тяжёлым топливом или с очищенным Коксовым углем. Вырабатывает более чистый природный газ, который в свою очередь более эффективно вырабатывает электроэнергию. Также выделяет куски необработанной Серы.",
    "4E219CEF49D98D8D1D97558D22BB0462": "Восстановленный Colonial прототип, который когда-то использовался в ранних механизированных войнах. Построенный на раме мощного трактора, этот бронированный автомобиль использовался для сопровождения солдат или, позднее, для поддержки более крупных бронетанковых войск.",
    "15C63D144D30014F7685FBBE9A21A092": "Станция, которая перерабатывает Нефть в полезные материалы, пригодные для строительства и выработки электроэнергии.",
    "F3EE5685426B24F5F00A219BF984F928": "Это усиленная бочка с чрезвычайно взрывчатыми веществами, необходимыми для самых смертоносных боеголовок.",
    "3FC569FC40B27F9AD9E26FA03F50CF7F": "Укрепленный блиндаж, который дает стрелковому гарнизону укрепленную оборонительную позицию для ведения огня по приближающимся врагам из относительной безопасности.",
    "A620ADF748599DC11DAF30B347F2F263": "Исследовательский центр, где игроки могут внести свой вклад в исследование дерева технологий своей фракции.",
    "6B158AB149C22B70F67B998F1FFCA739": "Ресурсное поле для сбора угля, который в свою очередь будет использоваться как в качестве топлива и в производстве на Фабриках, так и для доставки на Станцию переработки.",
    "925DFE2241AE18D5525CF7BEE32DC272": "Ресурсное поле для сбора компонентов, которые нужно доставить на станцию переработки.",
    "420703524C55DF6F7802A69F8F0653DB": "Ресурсное поле для сбора металлолома, который нужно доставить на Станцию переработки.",
    "932ED7584D5AE02116EC9A85FB19086B": "Ресурсное поле для сбора Серы, которую нужно доставить на Станцию переработки.",
    "A341B03B40416F682A8BAD8F317DC096": "Насадка для винтовки, стреляющая гранатами с помощью пневматической силы. Наряду со специализированными гранатами может запускать обычные.",
    "FF4760F8403753E1A1C0949DBEE74515": "Безопасное место для важных дел. В конце концов, всем пригодится.",
    "3D7398FD48AFD855E42AD1A4F4C1D058": "Чистое, безопасное место для приготовления продуктов питания. ",
    "EAE29E5647F210251BF383AE3E9DC1A3": "Отрезок железной дороги для тяжелых кранов. Этот тип железной дороги может быть построен только на фундаменте.",
    "666A59564F4699BB4E6CA99411AEF1E5": "Часть железнодорожных путей для вагонов малой колеи. Пути могут быть присоединены или ответвлены от существующих путей, чтобы сформировать сложные сети.",
    "2D40CD2B4A4B36D17C5712BB6E3CB22F": "Сегмент пути для узкоколейных вагонов. Пути могут присоединены или ответвлены от существующих железных дорог, формируя сложные сети. Эти пути могут быть построены только на Фундаменте.",
    "DE5BB7E34093B270F67BB082224C6468": "Отрезок железной дороги для железнодорожных вагонов. Пути могут присоединяться к существующим железным дорогам или отходить от них, образуя сложные сети.",
    "85B5B9A141B0C6C44DE9C88D80A2D134": "Отрезок железной дороги для железнодорожных вагонов. Пути могут присоединяться к существующим железным дорогам или отходить от них, образуя сложные сети. Этот тип железной дороги может быть построен только на фундаменте.",
    "AA586EEF445B20AAE11822A26C111DC1": "Отрезок железной дороги для железнодорожных вагонов. Пути могут присоединяться к существующим железным дорогам или отходить от них, образуя сложные сети. Этот тип железной дороги может быть построен только на фундаменте.",
    "AD9F111648BB9B389954B98DDC0C4432": "Ряд сложных механизмов, турбин и двигателей, используемых на крупных военных судах.",
    "3B08756B4852B8ED7C3FD7AC8B91AE8F": "Общий контейнер который может быть использован для хранения вещей.",
    "88817B5A41231C3D9AF60BA8CF7DDD58": "Снаряд, запускаемый на малые дистанции с помощью мортиры.",
    "11DBF78A434369DB13A3B8913D9E6B0F": "Огнестрельное оружие ближнего боя обычно используемое для охоты на птиц или в спортивной стрельбе. Его длинный приклад и прочная ствольная коробка дают модели Dragonfly стабильность и хороший контроль отдачи, что делает его достойным компаньоном Краунианских солдат в городских боях. Уничтожение кустарных баррикад и зачистка небольших комнат - легчайшие задачи для KRF1-750 Dragonfly.",
    "F5E727A94E4FFA6FF5986B9BF90B3B98": "Табличка для размещения полезной информации.",
    "774D1EB3444D55BA49E124944E8AF28B": "Простой товарный вагон для перевозки стройматериалов и больших предметов.",
    "4382DC1C459106E7D4EC86B558E25BB4": "Обыкновенный служебный вагон, позволяющий экипажу более эффективно обслуживать железную дорогу.",
    "B8181E7A409FB5D4F6BC258955103FC3": "Обычная доска для планирования операций.",
    "47495A0C4687DB7DCC18089FA7AC8A29": "Простая яма, вырытая в земле, чтобы обеспечить пехоте импровизированное укрытие от вражеского огня.",
    "829BDD544B22530FE8108C8A745F4A5C": "Простая мина, устанавливаемая под землю, оснащенная чувствительным датчиком давления, срабатывающий под весом тяжелого транспорта. Мины видны вражеской и союзной пехоте.",
    "6C21E17D41EF06A7948B64892AD63978": "Простой буксируемый прицеп, вмещающий обычные строительные материалы.",
    "7548CC834C207668759C83859E31A6FB": "Простой буксируемый прицеп, вмещающий более тяжёлые строительные материалы.",
    "6D5D87254EBD72F44EA3F287DADC76AB": "Простой буксируемый прицеп, вмещающий различные жидкости. Может использоваться для заправки техники.",
    "9260EFD245AA11C91000E6ABB873E77F": "Простой вариант Dunne Responder 3e, оснащенный мощным шлангом, предназначенным для тушения бушующего пламени.",
    "50E2CE4A4EECAC54805254885A49251D": "Простой велосипед в старом стиле Blumfield. Это уменьшенная модель для отдыха, созданная для спринтов на короткую дистанцию.",
    "87E4796C4FADEA341965F8A90D6EBB00": "Измененный вариант V.110, Gravekeeper оснащен встроенной установкой Bonesaw, превращающей бронеавтомобиль в эффективного борца с танками противника.",
    "B39230E34DF8620213AAB5A3D3915EB0": "Небольшая база, используемая в качестве плацдарма для вторжения в регионы противника. Здесь игроки могут возрождаться и накапливать предметы.",
    "F015AA4645293B138218E495E7B7249E": "Узкоколейный вагон-контейнер для перевозки необработанных ресурсов. ",
    "ADC8DAA54AF942CE0633EFA3CA951C55": "Центр мелкосерийного производства лодок.",
    "284764E84E6F56F282D64AB6F0CC51D5": "Центр мелкосерийного производства техники.",
    "FD14B135475379B5D33DF282DBC4664C": "В регионе снежная буря. Обзор уменьшен, а так же длительное пребывание вне укрытия приведет к обморожению.",
    "408E42104C80C3FA7E9A56ADE1A96D78": "Солдат, получивший тяжелое ранение на поле боя. Доставьте этого солдата в госпиталь, чтобы получить солдатское снаряжение.",
    "0D5F6D114B77905CE4E6CBB90E199C7E": "Пространство, предназначенное для хранения очищенных материалов, которые можно переносить на Фабрики и из них. Запасы могут быть общедоступными или зарезервированными.",
    "4CB8EE134B6F11F903323BA00CA8A395": "Специализированная пусковая платформа, предназначенная для монтажа и пуска разрушительной баллистической ракеты А0Е-9, известной в народе как AEON.",
    "8F2967214915F8C861BA64A936304D0F": "Специализированная техника, разработанная Bassett Motor Society, используемая при строительстве крупных сооружений.",
    "2BDB948D435DD27C5479A7959D65F110": "Стабилизированный портал в подземный мир. Принесите подношение, чтобы заманить смертоносных духов в обсидиановые камни.",
    "D92FBE734BC50E5AC519F486000C41E1": "Стандартная сборочная станция для производства основных транспортных средств и оборудования. Строительство займет время и может быть остановлено, если ресурсы будут исчерпаны. Некоторые проекты требуют, чтобы базовый автомобиль присутствовал на сборочной станции до начала производства.",
    "01536C904F6D50E1B42797A2ECD5B7D4": "Стандартный набор припасов для солдат. Для того чтобы игроки могли возрождаться, базы обязательно должны содержать Солдатское снаряжение.",
    "09A680CE484174FB7CE2DDBA5ED8E8DD": "Стандартная дымовая граната, предназначенная для сокрытия передвижения союзников или ухудшения видимости противника.",
    "C2DFA4FA46E8A09787B1659EA8E31291": "Стационарный сборщик, автоматически собирающий Уголь.",
    "D009E8D7439C6813523AF6AB85D0B356": "Стационарный сборщик, автоматически собирающий Компоненты.",
    "2AE345534F3FE5E044BA468C3161D541": "Стационарный сборщик, автоматически собирающий Металлолом.",
    "2977A856416985D34C006287876745D2": "Стационарный сборщик, автоматически собирающий Серу.",
    "86B356284D94A0657FBF0FBCE81FDC6D": "Сооружение производящее энергию путем сжигания дизеля.",
    "211790B44F306BEEAB795C8AEB7DDB3E": "Цилиндр из прочной ткани, установленный на треноге, призванный помочь операторам поблизости определить скорость и направление ветра.",
    "E816135B4A66E8C1220F92AAD576D712": "Цилиндр из прочной ткани, установленный на треноге, призван помочь операторам, находящимся поблизости, определить скорость и направление ветра.",
    "8C89D3EB468817667A734CA49548F3F6": "Старый фермерский грузовик, переделанный под военные нужды.",
    "FECDF12F4384E339D35524ACE682D1B6": "Временная передовая оперативная база. Игроки могут возрождаться здесь и накапливать предметы.",
    "36651F93494A7EA89C15F888D9B041B3": "Временный причал, обеспечивающий переброску грузов и войск на крупные военные корабли с берега.",
    "335505CA4DD2B6823A4271A26234435C": "Временная дорога, используемая для обеспечения проезда транспортных средств между основными дорогами и отдаленными базами.",
    "709116934FBFA3D0BEB00D91BB1E9B13": "Противотанковое ружье с режимом стрельбы с отсечкой по 3 выстрела и магазином большой вместимости. Собрана из модифицированной штурмовой винтовки \"Dusk\". Ствольная коробка была изменена под барабанный магазин с верхней подачей для лучшей стабильности и удобного заряжания, чтобы компенсировать громоздкую конструкцию и больший калибр.",
    "D581ABBD48D282A6772C6687B3F2E5A7": "Легкий ручной пулемет, способный быстро расправиться с пехотой противника. Catara — передовое оружие для современных Colonial.",
    "28E25751432CAFB28FB0F5AE61E7AB14": "Инструмент для рытья траншей и других укреплений.",
    "DED233DD427B065FCD3D17BD30D6F2E9": "Инструмент для постройки структур и сбора материалов.",
    "E74EC0C648B4F38DAD740FA18DA68158": "Инструмент для сбора компонентов из останков древнего вооружения и техники.",
    "8C5D9CF3428C79BC7BAC86AA4F1AED0E": "Грузовик, оснащенный усовершенствованной ракетной двигательной установкой, “Retiarius” окутывает небо смертоносными, визжащими ракетами, выпущенными с высокой частотой на большие расстояния. Вмещает шестнадцать ракет.",
    "B30AA138497437782A4300886DD21F45": "Уникальный завод по ковке деталей специализированной техники, необходимых для сборки транспортных средств. Требуется Коксовый уголь или Бензин.",
    "FF1AB26E40405D9AE2FF5495F68E1EB8": "Greyhound - вариация штурмовой винтовки Booker с увеличенной ствольной коробкой под противотанковые боеприпасы. Обладает удлиненным стволом, увеличивающим дальность стрельбы. Оставаясь при этом автоматической винтовкой, Greyhound является прекрасным инструментом для тех, кто предпочитает стрелять прежде, чем спрашивать.",
    "4D6A78FB4ABDE01432FC6DB3FD4A8A69": "Транспортное средство, которое когда-то использовалось офицерами для наблюдения за полем боя или для доставки предметов первой необходимости и приказов.",
    "D644BDC44EBC4A4720D92596F71A1003": "Транспорт, который отлично уничтожает вражеские фортификации.",
    "4805B3D04DA9C8D7B0D77AB7CFE23D7D": "Техника, использующаяся для постройки крупных сооружений.",
    "2CBCB7104DE035A60695DAB71E567A5F": "Универсальный легкий танк с повышенной маневренностью. Оснащен 40-мм орудием.",
    "F03BE70D45AE1B67DFC7A6B84E626420": "Оружие спроектированное, чтобы запускать специальные гранаты на большие расстояния. Это современное Kraunian оружие использует продвинутую систему запуска для повышенной эффективности в ущерб большого веса установки и снарядов. ",
    "1134F3234A5F463AE53A268D4DBF6B52": "Задвижка, регулирующая скорость потока в трубопроводе. Для настройки нужен Гаечный ключ.",
    "959786D541061EB81BE0BAAA89BE5E9B": "Хорошо укрепленный бункер с установленным пулеметом. Гарнизонные войска будут вести огонь на подавление по приближающимся врагам с фиксированного угла.",
    "B46BADA6427C7B4029B045A8DE9B9F96": "Мастерская для сборки многокомпонентных баллистических ракет большой дальности, таких как A0E-9, она же ракета AEON.",
    "110E6A2C4A6292DA195009B6B22305F9": "Рабочий стол удволетворяет разные потребности солдата: пишите письмо любимым, проводите инвентаризацию оставшихся рационов питания. Этот крепкий стол доступен каждому.",
    "0977932E4101EB7BA35DE7B25A2EE0AE": "Раненый игрок{0}. Перенесите этого солдата в безопасное место для оказания медицинской помощи.",
    "05D8FCE14C1B2295EB11CE89E8C6DA24": "Ракета A0E-9",
    "085BFDBE41391E9BA23112AB03491C2C": "Корпус ракеты A0E-9",
    "91105C03499C3F1BE6BE4DB856E5B0F8": "A0E-9 Ракетный Ускоритель",
    "3038291E4F4394EB893544B9BBDE8664": "Ракетная платформа A0E-9",
    "3A9D0CE146319179E0B675B8853E617F": "A0E-9 Ракетная платформа & A0E-9 Ракета",
    "5AF494EB493CBF37E6E7B7B62DCA4D55": "A0E-9 Ракетная платформа & A0E-9 Ракета",
    "8467BD9F497428290845D4B6490D2764": "A0E-9 Ракетная платформа & A0E-9 Ракета",
    "0D4AD0F8419784E10400D89AFACEF068": "A0E-9 Ракетная боеголовка",
    "D3FBCCB84F1965C600B7309A9D140B4F": "Осколочная граната A3 Harpa",
    "7EE7770544ABEF42F522FB9C94332E4E": "Бронебойный/РПГ",
    "646F134C496CB8DF04030CA679818E71": "Бронебойный выстрел РПГ",
    "256E939C4130A8A817DC9E8B1B0C091F": "Бронебойный навесной/РПГ",
    "5CF6980649BE7DDCB1FB02B440A3C159": "Боеприпасы для ARC/РПГ",
    "A0DC06784DFE2350A318C0ADE5D1233C": "ПТ гарнизон",
    "C65EBD67408C6507E5F42C9384641ED2": "ПТ гарнизон (Ур. 2)",
    "DC94FD1A4F04C9345DCF44AC5D776051": "ПТ гарнизон (Ур. 2)",
    "452C02DC44682EA5ED964781258A5910": "ПТ гарнизон (Ур. 3)",
    "B17D8640441F07CF889D20B79C0FE262": "Штурмовая винтовка Aalto 24",
    "8D2244F645195B7E119FB798C7C9E2E7": "Заброшенный арсенал",
    "F9BF31BF4559937622E6CBB5EEDB4A1D": "Заброшенный арсенал",
    "1A5343D24EF1242FED4038B6AEE5B624": "Доступ к резезервному складу",
    "10FBAC1C42EA44693A3D079F99BB9049": "Получить ссылку на сервер Discord этого Подразделения",
    "13E260D342466EC4C7BA899ACA57FB6A": "Доступ к дереву технологий.",
    "299EE0114E937B661974C38629F1DB42": "Дополнительный шанс 100% к пробитию бронированной техники.",
    "3748D06A4CF0E1CD9651E7BF1B716D7B": "Добавляет насос для нагнетания давления в трубу для воды. Добавляет выход для трубы.",
    "4CA02B2448DF735B8D722D8848020E1D": "Наступаем",
    "4F9290BD4F6302937D8F129F7752839D": "Продвинутые бункеры",
    "404395D5452B7AB804E20A8002ABE71F": "Продвинутый Разжижитель Угля",
    "00DC251C418EAE33D484529CE31D12B2": "Улучшенная строительная техника",
    "1E0FBF114D54147462F29E80BEE129CC": "Продвинутая подготовка",
    "EBC7C18745F760E825037881F5F017B4": "Продвинутая подготовка",
    "421C15994938A964D86582AA9EA01082": "Продвинутые чаны для переработки больших объёмов угля в Тяжёлую Нефть.",
    "F3C429E744EF3DCA6D577FAEE0AF046E": "Современное сортировочное оборудование для просеивания груды металлолома в поисках полезных материалов.",
    "2E0DB61849B0CB28D43254924C986178": "Вся мощь неподвижного Штурмового Орудия, при этом легко перемещаемая по рельсам. Эта разрушительная пушка способна уничтожать вражеские укрепления на огромных расстояниях.",
    "C1473BF745CF7EE5418F0CB724254A6E": "Вся техника в игре производится игроками. Для ознакомления, мы оставили в ближайшем Ящике всё необходимое для постройки грузовика. \r\n\r\nНажмите \"{0}\", когда будете внутри Гаража, чтобы открыть меню выбора техники и выберите 'Транспорт'.\r\n\r\nПоявится чертеж. \r\n\r\nС помощью базовых материалов из вашего инвентаря и молотка в ваших руках (\"{1}\", чтобы взять в руки), подойдите к чертежу и нажмите \"{2}\". Это потратит один материл на создание машины. Повторяйте, пока грузовик не будет построен.",
    "BCA32FE64613C72EAFE9ABBF703FDA5D": "Позволить игрокам видеть этот Резервируемый склад и отправлять в него.",
    "4B7A9A9944CC88C79313BEA8758EE3A6": "Позволяет бетонным сооружениям быть построенными в этой сети.",
    "3F51D1E242EE95695571389D924BB51B": "Позволяет строить Медицинский и Наблюдательный бункеры в этой сети.",
    "A4538C06460D98B2A6BC65923E2F3357": "Позволяет строить в этой бункерной сети штормовые пушки, разведывательные центры и метеостанции.",
    "20ADE92945A533482C8C2DB147EE0579": "Позволяет любому игроку закрывать/открывать это строение/транспорт.",
    "3FE159FD4A1B21E847106BA1E627CB1F": "Обеспечивает легкий доступ на крышу этого бункера",
    "6E54502B466D07F2D90679BEFDC66ECA": "Позволяет строить продвинутые предприятия.",
    "980899F241BB51BB958708973B66D0BA": "Позволяет строить продвинутые предприятия.",
    "A13BE7FE468697F92836E58F1788F22C": "Позволяет строить продвинутые предприятия.",
    "21EB240942BDDA7DD7796093DE1E3CA6": "Позволяет строить специализированные Фабрики.",
    "2666CC914A81BA338AA9B1A0DB20A2CF": "Позволяет строить специализированные предприятия.",
    "4CB9CB2C42C092D9A66F438B181D4B0C": "Позволяет строить специализированные сооружения.",
    "7D6F6EB64F68531718A733A81EC1418C": "Позволяет создавать ракетную платформу A0E-9 и ракету A0E-9.",
    "9E4796A947D48A9E06F0B1A311B18FAF": "Позволяет создавать ракетную платформу A0E-9 и ракету A0E-9.",
    "AC67792C499B7966C2A74B9D86A2E5E1": "Позволяет создавать ракетную платформу A0E-9 и ракету A0E-9.",
    "AB0E2636409675BBBED529BC5E463C83": "Позволяет пехоте обстреливать бронетехнику с безопасного расстояния. Эта РПГ на удивление легкая по сравнению с ее современниками. Ее вес — палка о двух концах, поскольку стрельба тяжелыми противотанковыми боеприпасами требует от оператора Carnyx подготовки к сильной отдаче.",
    "538B62F341F334A5CA837BA831FA63C0": "Позволяет безопасно стрелять из личного оружия изнутри этого Бункера.",
    "230F4A96430DC4B88DA4F8A3C9F13B21": "Позволяет членам отряда закрывать/открывать эту структуру/транспорт и получать к ним доступ в любое время.",
    "8BC98A3C4F41647812F1EFA0276BF98D": "Позволяет членам отряда закрывать/открывать это строение/транспорт и получать к ним доступ в любое время.",
    "397653894046CE62685644B9A017BEA5": "Позволяет этой структуре передавать разведанные на карту.",
    "803F34C244FFCA727C342E982D37A100": "Позволяет транспорту пересекать эту Траншею.",
    "1020D6A7418CD1D8CC71AF82029D5B90": "Позволяет отменить начатый запуск. Это действие должно быть сделано несколькими солдатами.",
    "24BB1904401D5F96B9FFE7B008C73C32": "Позволяет подключиться к другой Метеостанции, введя её код подключения.\r\n\r\n<RichText.Regular12.Orange> Должна быть неактивной.</>",
    "E0881685464D545BEB93A0B60BC2FFBE": "Позволяет ввести 4-значный код запуска, чтобы инициировать запуск ракеты. Это должно быть сделано несколькими солдатами.",
    "2E5ACDEA4438E2F950C1CDB635352352": "Алюминий",
    "25479D654A5B62650D03918F90C80C78": "Алюминиевый сплав",
    "7B423C2F4346D3306680DDBA6690A3D4": "Алюминиевый сплав используется для производства прототипов в инженерном центре.",
    "4333024F454F5914F0C770BC54248A10": "Алюминий можно переработать в Алюминиевый сплав, используемые в производстве прототипов.",
    "9CB69A3C4427264B80F202A1C4E8EAE4": "Всегда выводит из строя траки",
    "7A42C8054E3C9474D8C8F1903FEBB151": "Скорая помощь",
    "7C1727B141791F9A3774EB8176B883C3": "Машина скорой помощи",
    "969561C94645A423173ACDB0D8FEDA5D": "Боеприпасы",
    "B5A0F44D4F1548AD58DCBF9D9A2E6048": "Боеприпасы для Willow’s Bane модель 845",
    "2B47BB6A40FB28BC50D80D874FA2C301": "Топливо для огнемета “Molten Wind” v.II",
    "573A0901430DAC42F31B1DA2869B8D97": "Патроны распределены по отдельным обоймам. \r\n\r\nНе берите с собой слишком много патронов, они могут перегрузить вас, и если вы не будете достаточно расторопными, не принесут никакой пользы. \r\n\r\nПри перезарядке на \"{0}\", вы полностью теряете свою старую обойму, поэтому перезаряжайтесь только тогда когда это действительно необходимо.",
    "6B3F590A435AB55946EC4291BD9DBB64": "Завод по производству боеприпасов",
    "287EACEA4FA5B040658F949D3114043E": "Дозорная башня, которая предоставляет информацию о дружественных и вражеских силах в определенной области.",
    "BB9C41C34BE95CF524D9A68ADB7BD364": "Нефтяное месторождение, на котором можно добывать нефть для дальнейшей переработки или производства электроэнергии.",
    "359C0BBD41434663D2210BAE34FE0A3B": "Заброшенное здание в округе, которое было укреплено и размещенно гарнизоном.",
    "520E40A4465897CB6909AB982EF89947": "Некогда заброшенное здание в котором после укрепления расположился гарнизон.",
    "6925715A41430C49B7133BA0ED9E7CCC": "Заброшенное здание в мире, которое было укреплено и размещен гарнизон.",
    "7287B08A4554E0A48253F18A141CCF13": "Некогда заброшенное здание в котором после укрепления расположился гарнизон.",
    "C403C1CE4EC2D6BC384A2598C81413F0": "Граната-липучка необходима для пробивания тяжелой брони танков. Имеет малую дистанцию броска, неэффективна против сооружений.",
    "E6753E7042D00FBC1FE9F18B965519E0": "Усовершенствованный вариант универсальной сборочной установки BMS - Fabricator оснащен уникальным инструментом, предназначенным для выполнения сложных или специализированных строительных и земляных работ.",
    "CF5CA88E4B25F8D5D333F8BD457CA68E": "Противотанковое препятствие, препятствующее проезду техники на территорию и устойчивое к большинству видов повреждений.",
    "BCB57CE24277EE614493D3870232C97D": "Противотанковое препятствие, которое ограничивает проезд транспорта по территории. Может быть демонтировано с помощью Гаечного Ключа.",
    "3E767BF54AD3C8CD8C5794A295366BBC": "Территория, подвергшаяся разрушениям в результате взрыва ракеты.",
    "4FF9AEB9471E5F32F05AD0978CD2E4D9": "Зона в которой можно построить определённые сооружения и подготовить к перевозке.",
    "DAECD1FE49B2986E11E4C7A1F87F053C": "Бронированная Колонистская техника, используемая для поддержки пехоты во время штурмов.",
    "A8D45D054678B1E87811FD92753189FC": "Варденский бронированный вездеход, используемый для поддержки пехоты во время штурмов.",
    "0C110267401A61E4812700A5D1D9DA5F": "Бронированная машина-амфибия Колонистов, которая используется для перевозки пехоты как по суше, так и по морю.",
    "3B508C464E0D71999AEA6C865D3FD3E3": "Бронированный автомобиль-амфибия, позволяет перемещаться как по суше, так и по воде.",
    "38210D904CEC56EA82684A81ED481C39": "Бронебойный снаряд, используемый для пусковых установок РПГ непрямого действия.",
    "6128D3124DA308F4F754EA9A04B8934C": "Бронебойный противотанковый снаряд для использования с РПГ.",
    "D46DC87D4F9D8BD90738F395045E66A1": "Бронированный сухопутный корабль, усиленный старомодным сплавом. Этот почти неуязвимый зверь может перевозить до 8 пассажиров. Слухи о его существовании исходят из его боя.",
    "089A31E0489395AADF4E83B5605D23C8": "Бронированный вагон с пулеметной точкой, предназначенный для транспортировки пехоты на большие расстояния.",
    "CAF0D5B94820FA9927F5CFA48CA6FC91": "Сборочный отсек со специализированным оборудованием для быстрого изготовления и упаковки материалов, необходимых на передовой.",
    "F98FB64E41B0B50D3D2C3596A50D8578": "Установка, предназначенная для изготовления деталей, используемых при строительстве военных кораблей в сухом доке.",
    "C2DBF65D49CC8B89D774859A5C7BC1D2": "Сборочная станция для производства установленных оружейных платформ и специализированных танков.",
    "2F254DC44891E6535C6201B4724A13AA": "Сборочная станция для производства полевого вооружения и специальной техники, такой как Сборщик.",
    "88E1FE324B36D19DE98FB996E0ABC39B": "Сборочная платформа для производства полугусеничных машин и РСЗО.",
    "20A1C3664007D85568E78E8244AFA21D": "Сборочная платформа для производства тяжелых танков.",
    "DDED53D149082D9F5D73E1AE4022BB86": "Сборочная станция для производства легких транспортных средств для логистики, таких как грузовики.",
    "EAE40080413B1A736D3E658ADE6ED717": "Сборочная станция для производства автомобилей класса танк.",
    "D1C3541147558B79B9EEA9B8BFF91822": "Сборочная станция для производства железнодорожных вагонов.",
    "4A3D896B46DE138A5BBDB79697293EC7": "Автоматическая винтовка, сыгравшая ключевую роль в обеспечении Mesean интересов на Катоманском континенте. Несмотря на то, что автомат Catena не так скорострелен, как его собратья, многие солдаты отзываются о нем с любовью как о прочном, удобном в обращении и надежном оружии. Она не может похвастаться высокими показателями в какой-либо конкретной области, но в качестве винтовки общего назначения работает превосходно.",
    "2B39808F4BEEE3506D5FE88DCF8B6124": "Укрепленное противотанковое орудие, используемое гарнизоном.",
    "30F9241E45E138237EF27388086D76A0": "Укрепленное противотанковое орудие, используемое гарнизоном.",
    "8548255244214F885F3BC987D43CFF8B": "Окопное противотанковое орудие, используемый гарнизонными войсками.",
    "1EA65A55461E4B0A7920AFB286ED6FF8": "Укрепленная Гаубица, используемая гарнизоном.",
    "88D21E1046880ADCD0C1ECA1E33804F8": "Укрепленная гаубица, используемая гарнизоном.",
    "FD4E7168454AA0355E56E0A2B0B5BE3A": "Укрепленная гаубица, используемая гарнизоном.",
    "524FA7AF44764FE15E06C597B35BFA23": "Окопный бункер с размещенными войсками, вооруженными винтовками.",
    "D67BCCE842BCDAE460EF34AC5925EB38": "Окопный бункер с размещенными войсками, вооруженными винтовками.",
    "DD627D894CBEF4FA7B6F74AAC132C532": "Окопный бункер с размещенными войсками, вооруженными винтовками.",
    "2AEC4FD94C92D931CA73709E1A0E95FE": "Укрепленный пулемет, управляемый гарнизоном.",
    "5D4F55AB45C4585A9C3174B3FC6E4BFE": "Окопный пулемет, используемый гарнизонными войсками.",
    "83ADDE8E40F216F4941EA08A42058556": "Экстрактор, добывающий Уголь, даже когда на поле Угля закончились ресурсы",
    "3FB2C8014B36DA15F18FDA8096AC97AA": "Экстрактор, добывающий Повреждённые Компоненты, даже когда на поле Компонентов закончились ресурсы",
    "6EA293ED409CC43792912D9C09C71D3A": "Экстрактор, добывающий Металлолом, даже когда на поле Металлолома закончились ресурсы",
    "4FA0ECDD4F644E29713105B6429A047B": "Экстрактор, добывающий Серу и немного Угля, даже когда на поле Серы закончились ресурсы",
    "BEBB7F114EFF9D30C893DFA8A48D2F52": "Экстрактор, добывающий Серу и немного Угля, даже когда на поле Серы закончились ресурсы",
    "2C2D160A428EC77DFC0529BF2BF56353": "Расширенная мастерская для ручной обработки деликатных материалов.",
    "44636ACF41EB1B2E747168901D8D90B3": "Взрывная граната Estrellan, специально разработанная для использования в ручных гранатометах. Эта современная граната имеет увеличенный боезапас и смертельно опасна для живой пехоты и защитных сооружений.",
    "C2B0FD2F4A9ECDEB98F6F49A2C15ED2C": "Заряд взрывчатого вещества, детонирующий на заданной глубине. Стрельба этим противолодочным боеприпасом ведется с палубы военного корабля с помощью специальных пусковых установок.",
    "1A4965A840057F1C18D592AEA3A3425E": "Взрывная фляга используется для нейтрализации вражеской бронетехники. Тщательно разработанная жидкая бомба взрывается ослепительной вспышкой раскаленных осколков при ударе.",
    "E3283173491194AADB200889AEC23823": "Взрывчатые минометные снаряды.",
    "AA882514491A33224601429CA4D85AD6": "Зажигательный снаряд, используемый миномётами. Поджигает объекты вокруг точки взрыва.",
    "2FFC493745AD336FA09A7C918F944E58": "Промышленная башня для хранения различных видов топлива.",
    "9412D2F44236A4C90F19698CC2B4C79F": "Промышленная плавильная установка для переплавки отходов для удаления примесей. Требуется Коксовый уголь.",
    "B7EA2E194514BD75337954991CF58FD2": "Старая Крепость. Здесь игроки могут возрождаться и накапливать предметы.",
    "7D6629B140F3E6A721CA529CD155C39B": "Старое орудие береговой обороны, которое было повторно использовано для защиты ключевых объектов от бомбардировок с моря.",
    "A505DB14475E021CA9ED6EB028A9F393": "Старый форт. Здесь игроки могут возрождаться и накапливать предметы.",
    "7D4855DD49E6C9200A910E8BBB8FE967": "Старая шахта, которая автоматически собирает Компоненты, используя топливо.",
    "2C5C40C644F89632A8A528B61C30E352": "Старая шахта, которая автоматически собирает Металлолом, используя топливо.",
    "ADC9868E4290EDFEE4D2A99BCE350C68": "Старая шахта которая автоматически добывает Серу используя Топливо.",
    "438238C8412EFBC68EFBC6ACB6E9269D": "Старая Mesean винтовка времен войны. Обладает высокой останавливающей способностью, но не так точна, как ее современный вариант. Оружие, о котором ходят легенды: Howling Lions использовали Volta во время своего набега на пляжи Fisherman’s Row.",
    "7EEE189E4C3E6C2D5DA07688D313B0C8": "Артиллерийский, неразорвавшийся снаряд с одной из войн древности. Трещины на боках сигнализируют о мощном взрывчатом веществе, переносить с осторожностью.",
    "3994813743F8239B38E1719DA4C69A36": "Старая, но надежная модель краунианской длинноствольной винтовки. Omen — крепкое и простое оружие, которое лучше всего показывает себя в перестрелках на дальних дистанциях.",
    "BA343B0D481CD54B81AEC9B1B7EB3C94": "Открытый контейнер, помеченный для хранения сырых ресурсов, которые можно передавать на заводы и забирать из них. Запасы являются общедоступными.",
    "3061273B45958F0419EEBC903979244B": "Оптический инструмент для наблюдения за объектами на расстоянии.",
    "E0713BDF41E80039FBB40F860B7372AF": "Минометный снаряд, начиненный шрапннелью. Эффективен против пехоты.",
    "146E3BC4493F5187B80261B519E61AD8": "Подземное укрытие, служащее основой для постройки укреплений. Соединяется с другими Бункерами и Траншеями.",
    "1B8A795C4346BF4910F771A9CC959AE0": "Подземное укрытие, служащее основой для постройки укреплений. Соединяется с другими Бункерами и Траншеями.",
    "462C2AAC458B967E79A89CB1E96F900E": "Подземное укрытие, служащее основой для постройки укреплений. Соединяется с другими Бункерами и Траншеями.",
    "96AEF3EE49134BE9CA3562BFF39C8172": "Подземное укрытие которое служит основой для постоянных укреплений. Соединяется с другими бункерами и траншеями.",
    "CBE454CA4DE3742BC66CDC902E39708C": "Подземное укрытие которое служит основой для постоянных укреплений. Соединяется с другими бункерами и траншеями.",
    "D74CA7D0448C72B0FBAB39AA6E10FDB2": "Подземное укрытие которое служит основой для постоянных укреплений. Соединяется с другими бункерами и траншеями.",
    "AA2D0B2444A7325577C78395E4C05967": "Древний по современным стандартам, этот тяжело бронированный колонистский штурмовой танк владеет всепокрывающей защитой и оснащен двумя парными бортовыми пушками.",
    "7B4B83764CF353FCF65B9D99FAAB15BF": "Противотанковые боеприпасы",
    "7D63A5EF4E99E0E2A4609396B116AD60": "Противотанковый взрывной",
    "E34A663C4D6E568183406BB35FC6DC99": "Противотанковый взрывной",
    "E8FA475F4322C2BCEFBFA3B564BD9ED5": "Противотанковый взрывной",
    "7C8AE01C46A76B339ED3DF91D3C7F51B": "Противотанковый кинетический",
    "E7733BFE47422A5611A7F1969000571C": "Противотанковый кинетический",
    "6F622E7C4ECBCCFD937090A9D714B516": "Противотанковый ДОТ",
    "3E0D45274939B889EC317AAAD8705BB8": "Боеприпасы для противотанкового ружья",
    "6A5752A9482F81ADD20B5D83F37BF45F": "Противотанковая липкая бомба",
    "F34D3737475FA788605F419A2035CF54": "Противопехотная мина, наносящая критический урон ничего не подозревающим солдатам.",
    "CA01ACE742EB60D6417E0092AE5711D1": "Противопехотное минное заграждение, отлично работающее против невнимательных солдат. Видимо только вблизи.",
    "676F5FEA4DC1E0D107AA419AFC87486D": "Противотанковое минное заграждение с мощным зарядом для вывода транспортных средств противника из строя. Видимо только вблизи.",
    "E466A11F42816813A2355989C908791C": "Винтовка Argenti r.II",
    "3B4A004742F4396225D37A89EDA41387": "\"Ares\", вооружённый спаренным 75-мм орудием на башне, хоть и имеет недостаток в скорости и манёвренности, но его разрушительная мощь сполна компенсирует любые минусы этого танка. Разработка \"Ares\" была наполнена борьбой, а его история плотно сплетена с несколькими бунтами, бушевавшими на улицах города Dimiourg. Повстанцы реквизировали O-75a, первый прототип \"Ares\", и использовали его в местных битвах против сил Colonial. В процессе танк был уничтожен, но на это понадобилось непомерное количество усилий. Это событие вплело этого монстра в гобелен легенды о Colonial.",
    "09284D09449218360DF41C8EAE3F7314": "Оснащенный батареей из гранатометов Bonesaw, Thornfall предназначен для непрямого столкновения с техникой противника. Эта уникальная машина предназначена для поддержки наступления и плохо себя показывает в лобовых атаках.",
    "4FE32C9E48BEBECA05618A818A15338B": "Вооружённый взрывными снарядами калибра 40мм, Smelter отлично подходит для боя с бронированными целями. Передние пластины брони укрывают экипаж от плотного огня.",
    "B57E02DC42C110B1165928AC9F308126": "Бронеавтомобиль",
    "16FE3B95486836B5A7DC768871429B86": "Бронебойный",
    "7BC3E3594AF707EE486D10A8B882D85A": "Бронебойный",
    "89E1D86C4E0DF0898E165DB38396C7AB": "Бронебойный",
    "1499A7DD45E0DC3A5C297B9525DE06AF": "Бронеавтомобиль",
    "1906CDA343887D8C2561EBA7FDA6D151": "Бронеавтомобиль",
    "1AD8DA2A4295C17CF19B62998F4D7FF0": "Бронеавтомобиль",
    "5B382CCC4E70061B9FE1BE9A62C6EFB1": "Бронеавтомобиль",
    "75C3D21B4CD91A107EB544B34B8AD4A8": "Бронеавтомобиль",
    "7D2B50D64A9252C72E56A8897E440D3B": "Бронеавтомобиль",
    "84459BF049B049D1A6CE95B5BB1D6465": "Бронеавтомобиль",
    "ADF89343477EB10E23A2258BA9CCEA44": "Бронеавтомобиль",
    "EDE3E0F345E08F07B7651CA9908F645B": "Бронеавтомобиль",
    "9CC33CDA47786D2C118E63BF964B5B53": "Бронированный Военный Трактор",
    "D8C713AD495BBBD6D083FBB673EBE6B3": "Артиллерийские боеприпасы",
    "032310524326921E393FEC9576A20049": "Артиллерийские боеприпасы - это крупные предметы и должны быть физически перенесены к вашей артиллерии для перезарядки. \r\n\r\nНажмите \"{0}\", чтобы зарядить снаряд, когда стоите рядом с артиллерией. \r\n\r\nВы будете знать, что стоите достаточно близко, когда в левом нижнем углу появится подсказка. \r\n\r\nВыстрелы к артиллерии лежат в ящике неподалеку.",
    "1D7D3FF9464EF8F4DBBB77BB5574E183": "Артиллерийская подготовка",
    "E04D38FD4B4F1EE489829484ED764CF9": "Дистанция артиллерии",
    "E7095F264A0F3999B5E535895E442F36": "Дистанция артиллерии",
    "BEF308A743681EB0357FAFA43962E180": "Артиллерийское укрытие",
    "306201AC44F6AA3A4EB10A892ED86CB7": "Артиллерийское стрельбище",
    "768D1A844FAF003406F20DB9811742DD": "Артиллерийская подготовка",
    "80B30B2E4AD9708143AAF882A43E9A6D": "Артиллерийская подготовка",
    "D15DC121499F8111965E4F862889D146": "Артиллерийская подготовка",
    "4BECA10D446F2DBF7A4C318D0F1ED81A": "Артиллерия и ветер",
    "684E41AA4722C781B8AB0D98F71A8F92": "Артиллерия и всё оружие с параболической траекторией стрельбы подвержено влиянию ветра. \r\n\r\nСила и направление ветра будут влиять на траекторию и точность каждого выстрела. \r\n\r\nВы можете определить направление ветра по «флажкам» на строениях, например, на близлежащих радиовышках, или по установленному игроком ветроуказателю.\r\n\r\nСкорость ветра можно определить по тому, насколько сильно развевается флаг, или по высоте ветроуказателя.\r\n\r\nПристрелочный выстрел может быть полезным для определения текущего влияния ветра на вашу стрельбу.",
    "4C42D2B14B827D18517C9CB619528353": "Патроны для штурмовой винтовки",
    "2D9D3D13424DC64673FD7898A2650118": "Штурмовой танк",
    "44D43340487F92751E665C999A14A61E": "Штурмовой танк",
    "647966CE498AE39FB76178B6BB05C490": "Штурмовой танк",
    "C01E254C43ECE1C45AC4F0B4BBB00D69": "Штурмовой танк",
    "C10C3B9149C8AE06FBC2E1A2D23F9706": "Штурмовой танк",
    "6D3EDC0F417FD13057728BAC27878F22": "Собрать выбранную выкладку",
    "6D4C5E4843AF60B4F94113BEA220ED19": "Собрать выбранную выкладку снаряжения.",
    "962993C94EEE298FB2DB74AA6ACCFAE7": "Сборочная Бухта",
    "9F351F9844C8E89BC33C2682E291A71D": "Сборочные материалы I",
    "7FEADAB14DDDB46315E04FB48249A768": "Сборочные материалы II",
    "73092B1B41455FB70F8E3AA5225DEF3B": "Сборочные материалы III",
    "B8DA40AC47EEBC6838E97E82C92B738D": "Сборочные материалы IV",
    "4BF3ADB2426347104A372CB3ABD2ECDA": "Сборочные материалы V",
    "59AA1F294227A46FD442FEB0E31101CE": "Установить точку возрождения",
    "DC4D892841B6D810A02AD1A140CDD38D": "Присоединяемый на ствол винтовки, этот короткий клинок может протыкать врагов в ближнем бою.",
    "E240EA5F4021348EB53395BDE9D1DC3D": "В снаряженном состоянии автоматически периодически собирает разведывательную информацию.",
    "70D9B13940B7032E8997CF8C97D85F25": "Граната BF5 White Ash Flask",
    "49AE335D4D6E6A2555F6A99FAB791AFC": "Мобильный автокран БМС 2 класса",
    "0671D7C7434E205636B487A770356A25": "Бортовой грузовик BMS - Packmule",
    "6895B27F4010744B47C397B4A76BE2D3": "Balfour Falconer 250-мм",
    "A652FDF2436E1C3E5A60DEABF3FE15E4": "Balfour Rampart 68-мм",
    "D23195CE47C3C7F9FC9AB687FEBCB432": "Balfour Stockade 75-мм",
    "51EF2ACC4A46A94B876D79A2A5CA914F": "Balfour Wolfhound 40мм",
    "A6C68EC44575D472629393947913DE1B": "Бинты",
    "15EC16AC4525900296BA8F849C873642": "Колючая Проволока",
    "40DCC52641A2BEA2C8781AA76FBECD01": "Колючая проволока",
    "9C8F3E3F49EED660C7DC1DB0EAB48C4B": "Колючая проволока",
    "AFE26FC442A8A44A6E07078C446F6052": "Колючая проволока",
    "DEFFEB1542F16098DE717CBBC9E0E224": "Забор из колючей проволоки",
    "85C257DD4DE800F5B4A03BB06195F8DC": "Слитки из невероятно редких материалов, используемых в самых совершенных и сложных конструкциях, таких как большие военные корабли и ракеты AEON.",
    "5B8CE3C64337A2F9C985C5ADEF61535A": "База",
    "DEE926084933FAF21E74388FF496CB28": "Корабль-база",
    "85FCF46649BD8A17654F6099EE1B3A62": "Основы управления",
    "56E9AB08437B2C3F07B9B6B9A4A97425": "Базовые материалы",
    "4486854546BDD8408DB1399DF426B84B": "Базовая добыча",
    "14F93A8E4DA52E1721BB0AA5C8074B5F": "Базовая подготовка",
    "426491D64B0EB5D503D2D7AAF74335CA": "Базовая подготовка",
    "428D0601449BEADA5FD30E8732DF8104": "Базовая подготовка",
    "48A20D94443D0403F04A3EB845A2E254": "Базовая подготовка",
    "C551885241F0829D95C2F7B476F7E6A5": "Базовая подготовка - нажмите 'Е' для чтения таблички",
    "A21D89EB4DB45C22C77CE8800B557A8C": "Базовая подготовка - нажмите 'Е' для чтения таблички.",
    "2D728244461A766747E2B1AF999FFE26": "Курс молодого бойца",
    "918C96D94CD5A98C33932CBEC80273F7": "Основы управления транспортом",
    "8B342E6D4B748A0311B35BB746956FB7": "Основы управления водным транспортом",
    "CA569B7A4E573693319FA2877ABD5F24": "Линия ракетных платформ",
    "B1A4A34B4DABDBE0A1807FA3B600FA74": "Боевой танк",
    "BADC9CAC45AA98419BBFECBC07730579": "Боевой танк",
    "C9B6FAED4D6A9649507A529FCA2214AC": "Боевой танк",
    "D0CFDF384D7C6540501C4E9D29B19C40": "Боевой танк",
    "E2584992471875960E5AC9831A1C360D": "Боевой Танк",
    "EB73DAF04735416C9EDC1CA057B3BF59": "Боевой танк",
    "27CD79F64AD124F90E5DA58C89D0D5BA": "Линкор",
    "FB6901DF4B521D17E3DB058C29943DD8": "Линкор",
    "2D231692474A10B835AD15987C4261A9": "Штык-нож",
    "384007324813AFE2835C288261F1C85C": "Двухэтажная кровать не самая удобная, но после тяжелого дня для солдата как второй дом.",
    "46FF81A846392084A21528B050609541": "Перед тем как продолжить ваш КМБ, убедитесь, что установили свою точку возрождения в Передовой Базе недалеко от вас. \r\n\r\nНажмите \"{0}\", чтобы взаимодействовать с Базой. Вы увидите её инвентарь и различные опции по улучшению/управлению базой. Пока проигнорируйте эти опции.\r\n\r\nКликните по мигающему значку 'домика', на котором написано: \"Назначить точку возрождения.\"\r\n\r\nДля более детальной информации, кликните по иконке '?' в углу меню Базы.",
    "13E8607E4B11E966FF383C866DBA439E": "Велосипед",
    "3D0C540D469746133D2B58BDF7720455": "Бинокль",
    "2858687F4D89CC7A45C0969296E6B424": "Доменная печь",
    "E52E575F4B007AA26F9B53B54681749C": "Плазма",
    "1553632448AAEF6CB6590F92A1807877": "Граната Bomastone",
    "8BB336F4459740A6ADA7B28B2D91748B": "Штурмовая винтовка Booker Model 838",
    "3ACD511F4912CB4948C7A6A84A50D586": "Пограничная база",
    "76C7D6004480F7DF9F16CA97A6AC343C": "Пограничная база",
    "DAB76DD8460B940642C70183B489D8D3": "Пограничная База",
    "9F0F65CD4302C4CE3921109029A92512": "Рожденная и разведенная в северных холодах, это тяжелое пальто защищает Warden пехоту от всего кроме самых ужасных морозов.",
    "EE33C96F43870BE6829717B79B9424E3": "Мост",
    "F622BED543979E2D93843895A998A5FB": "Дробь",
    "35255C004C2A84C0BEA2D0BA1076D91C": "Строительство",
    "B2F0A8094EEF74E899DDF0AECCFEC187": "Огневая установка DAE 1b-2, выполненная в виде пильного полотна, оснащена тремя каскадными пулеметными башнями. То, чего \"Serra\" не хватает в мощности, она компенсирует исключительно скорострельностью для оружия такого размера.",
    "67E6082943E82F1416ED919ECF796D27": "Построенная на перевернутом шасси Flood, машина Mk. IX Stain представляет собой полнофункциональную мобильную артиллерийскую платформу. После развертывания Stain может вести огонь из 150-мм пушки на большие расстояния для поражения позиций противника непрямым огнем.",
    "060499444E1A1AC48E7009A0B0100C41": "Построенный на основе первого автоматического вооружения Легиона, “Lamentum” mm.IV по-прежнему представляет собой довольно устрашающую силу для боестолкновений. Обладая большим магазином и внушительной дальностью стрельбы, этот станковый пулемет отлично подходит для ведения плотного огня на подавление.",
    "129723254F4FA3055EC075AEF8F9EC9D": "Построенный для преодоления холмов в западных провинциях Аллиантского Союза, Taurine Rigger представляет собой велианскую модификацию, специализирующуюся на буксировке тяжелого снаряжения и припасов по опасной местности. Находящийся на службе Колониального Легиона почти три столетия, A150 стал незаменимым инструментом в операциях Колонистов. Поэтому неудивительно, что ему часто подражали, но никогда не воспроизводили.",
    "E37CF3AA40FC2B92AE19B2BFFA3DCDAD": "Созданный в дополнение к другим автономным артиллерийским установкам, установленный Huber Starbreaker запускает 94,5-мм снаряды на очень большие расстояния. Необходимый инструмент для пехоты, чтобы отбросить бронированные наступления Colonial.",
    "484B31D44BF6AC36F3681B9D05164FBA": "Бункер (Ур. 1)",
    "4D425013497B9B5EE061989B8508767E": "Бункер (Ур. 1)",
    "72334DCF44B98E54F677FE912CA3CC0B": "Бункер (Ур. 1)",
    "7FD22BA74AFB35B58402159E4950E71C": "Бункер (Ур. 1)",
    "A716D3E448E27E14FF848D8BA328B8E2": "Бункер (Ур. 1)",
    "C95659B948066EEE5E9651A374C6342D": "Бункер (Ур. 1)",
    "D408FD2A43D40667A3069D87DB7CB047": "Бункер (Ур. 1)",
    "D85D47F94DB1D5199C477EA8B3B0A960": "Бункер (Ур. 1)",
    "3C75FB8E4DA1AA89618AABB37738C340": "Бункер (Ур. 2)",
    "CD7E6AEE4109788F963DBCA9042D8073": "Бункер (Ур. 2)",
    "316EAAA94E1075F7A84CB59242477740": "Бункер (Ур. 3)",
    "499CBB884BDAA4EAFFB78EB00FB1C160": "Бункер (Ур. 3)",
    "4F52FC234B48AF7C774915B8728E72B9": "Бункер (Ур. 3)",
    "614680D946C3DF5953C2F5B27950E7D6": "Бункер (Ур. 3)",
    "91961E2944C28D8AC5A80CA77AC21E88": "Бункер (Ур. 3)",
    "B0AB88974820ED53D2F323BC11B8F8D8": "Бункер (Ур. 3)",
    "B69B10EB41281C5668D64B99B1ADB4AF": "Бункер (Ур. 3)",
    "0BE2018C4E7600273BBFB0926A3368F1": "Бункерная База",
    "2C90B2094C515F967A530F9FF3B5FD04": "Бункерная база",
    "58359C304D7483C5FE2CABB93B9C5565": "Бункерная база",
    "89EFC7894E13A4336D3FBBAF5EFF7081": "Бункерная база",
    "95E04A1F4A578E6639A4F9A7893B5230": "Бункерная База",
    "DE8F6CF34B47D27A97D26498470A0E83": "Бункерная База",
    "B79388114A649658BD9B7392F34E3002": "Угловой бункер (Ур. 1)",
    "E06894BE4FC768070961C6BA1A7C05F1": "Угловой бункер (Ур. 1)",
    "6C5CD6914591DE85BFE23B9B2FF95899": "Угловой бункер (Ур. 2)",
    "6D6C0D57456CD5906C50B0BF7C0E6EBC": "Угловой бункер (Ур. 2)",
    "2CE3A9FD4C0F548DFC0FA9AA6B4F4A58": "Угловой бункер (Ур. 3)",
    "EB8DAEE74DCD07A4DCD890893212EE02": "Угловой бункер (Ур. 3)",
    "F1141BC044BBDD2ACFC965938DE0E90C": "Зона Раскопок Угла Бункера",
    "16E6D2D14DDB9FE61DC987A33B3C2F02": "Место для выкапывания бункера",
    "774B74BC480322205AF8DF942CF274AA": "Площадка для Выкапывания Бункеров",
    "9D7C4C6C49C6FE229B83C28E0019262D": "Бункерная печь (Ур. 1)",
    "E32D1103404DCC185BA296A48AA5CA61": "Бункерная печь (Ур. 2)",
    "3CE9D0C346D032C3B85F41BBD98CBC67": "Бункерная печь (Ур. 3)",
    "58C77B2041868E44E07CB7BF59DED5C6": "Рампа (Ур. 1)",
    "AB0323BD4B2E183A2A6BE18947017318": "Рампа (Ур. 2)",
    "3527915849504828A54D32B292A55897": "Рампа (Ур. 3)",
    "6069A42B46A68A3CF4911BB9A0524B6F": "Койки",
    "8D0564AE4A7D162B63E36CAF21525D17": "Кабуз",
    "1E76100A4B41EAD50B1903917C499955": "Линкоры класса Каллахан — массивные, полнофункциональные мобильные базы. Они вмещают в себя достаточно огневой мощи для того, чтобы стирать в пыль вражеские суда вместе с экипажем или изливать смерть на берега противника, игнорируя ответный огонь за счёт своего укреплённого корпуса. Названный в честь основателя Сивы и первого Архонта, выстоявлего в борьбе с несколькими враждебными кланами, желавшими получить его голову. Несколько линкоров этого класса до сих пор пришвартованы к причалам Whedon's Row.",
    "47AE8B944AE9D9ACA5401BA9F2C4B00A": "Камера",
    "BF6D42B547FDE7EE6A4D469D64FEB21F": "Отменить запуск",
    "773539C34D3E0E6009BBC5BBE7B1FFA3": "Отменить заправку",
    "29A6FC6346783BE4E720D7B5B355FAAF": "Отменить ремонт",
    "679CF0D844CDEE683D4E9AB86C32DBF8": "Боеприпасы артиллерийского орудия",
    "0E6FD8764B655005ECD2B5B4A82764AC": "Наводчик",
    "2861CB11481E565228DFC7A6993E92E4": "Наводчик",
    "2930421D47EC21B3C966CC92655D8C70": "Стрелок",
    "2B1C7FD440AB516560C5BB9332E2E878": "Стрелок",
    "4890FFF94F782254756387816D6C0B41": "Наводчик",
    "48BE62C24A52FC1F686B1BA1FD330D14": "Наводчик",
    "4B9EF3A5491D8379E3032B9994F297DB": "Наводчик",
    "51ECB3244FDFF6B8431B9A87093FD7AC": "Стрелок",
    "5C12DF1D4EC4105A66013791A1AF6965": "Наводчик",
    "5CD267614E1A95C8E1C127B005B056B5": "Наводчик",
    "640A9E654294E08A39785C9DE9CC1CAD": "Наводчик",
    "640BE1EE4F6FB1DFDE25238D0A58AB96": "Наводчик",
    "7079246F46B9D85C365C7B916684743A": "Наводчик",
    "756DDD5043ED88F6751E309A05CAB156": "Наводчик",
    "81398FE44552F779D3E7F1B03557195E": "Артиллерист",
    "8315C78749C81A289F7AA0AF8EFEC7A6": "Наводчик",
    "8DE3C12B44176B3B9975789CC2F52953": "Наводчик",
    "94BE70E9424A233044C1C2AD1D90A283": "Наводчик",
    "9C87895D4E4F3558EC8AAF8BE01EB827": "Наводчик",
    "9E7AF3424BCB2AF117A041B821666EF6": "Стрелок",
    "A50FD36443E4E23540742B94117A935C": "Наводчик",
    "ADBEAD9F4915E80CBADEAB8546C3460D": "Наводчик",
    "AE91F5844E90DD848834E990B00F96DB": "Наводчик",
    "B2344A2A451F110AC694C2969B536FB3": "Наводчик",
    "B5AEC7DF4951DEFC301CC8AD9B6D791D": "Наводчик",
    "B62DE30642D7AA30A9E817AA5F8B5ADF": "Наводчик",
    "C1C6E730449313C219642FBF75D977C0": "Наводчик",
    "C1EEF8D34895CAC21D787789FD5E92AC": "Наводчик",
    "C2329B84497869D276459891BC0071A4": "Наводчик",
    "C2C799C441879E3849B3D6A00F47F4E6": "Наводчик",
    "C731333E4348DD99535FBC8F99BEAF98": "Наводчик",
    "C79801EE4B6B5C469E9E26A7645D11DC": "Стрелок",
    "D536BC564C4C527E040FAF9C839B0840": "Наводчик",
    "D6A9E89D444DA7F5A8465D850B119AD5": "Наводчик",
    "F84F78494A08049A8BFC2691C9B914F3": "Наводчик",
    "FE33F17647EC0E8F67C91F8089A9D034": "Наводчик",
    "9826FEAA4ADCCBC769AD49B5DB1E3832": "Caovish Парка",
    "8B21386A469DEF1ED9EB18ABCCEB5485": "По своей конструкции и прочности Caoivish броня не имеет себе равных. Все члены экипажа обеспечены прочным комбинезоном и ранцевыми ремнями для доступа к основным инструментам, необходимым для обслуживания и эксплуатации танка.",
    "53DBD4A2463DC1D888364B8F47E1D32C": "Caoivish инженеры запечатлены легендарными в песнях и статуях. Они носят специализированную форму, оснащенную ремнями и подсумками для легкого доступа к инструментам и подручным материалам.",
    "95AA7C9F4FE4BDCF0FDCCB9469598AB2": "Способный стрелять различными гранатами быстро и на большие расстояния, Fissura gd.I достаточно мобилен для удобства транспортировки, повышая при этом эффективность действий пехоты. ",
    "F87E18FD4755B4CB776A3EB320EE4892": "Способный стрелять различными гранатами быстро и на большие расстояния, \"Fissura gd.I\" достаточно мобилен для удобства транспортировки, повышая при этом эффективность действий пехоты. ",
    "46A596664BD5CA804F24A18218C8B6D0": "РПГ \"Carnyx\"",
    "038C70F64E276B0BC5124CA96B12234B": "Автоматическая винтовка Catena rt.IV",
    "A0304AB148E77AF71F6BB183D703BBF4": "Помост",
    "D85BBEEB45FD4DAEC608A489B4EC006B": "Платформа Помоста",
    "E27BBDD245BCB9327A6B968A5B6C416A": "Лестница Помоста",
    "B4F14CE84B8BECD58981A58064C4FAC7": "Наносит продолжительный урон",
    "17227DAE4C39D298FD77349E325BF4F2": "Меловая доска",
    "5DA7887C4258C3E2CB39189DCBFC40BA": "Сменить тип топлива",
    "011CA5F541D075F50B492CABA5EBFEDD": "Смените стойку на \"{0}\" чтобы присесть или \"{1}\" чтобы лечь для уменьшения вашей заметности и увеличения точности стрельбы. \r\n\r\nОсвойте передвижение в приседе или лежа далее на полосе препятствий.",
    "CA95D7E34CCB1C1AAB7B16AE8F5BE756": "Поменять тип топлива для текущего транспорта на Дизель или Бензин. Транспорт на Бензине имеет повышенную мощность.",
    "B3DE06B64E0BA3E8F1F93DB181593D80": "Куски необработанного угля, которые могут быть переработаны в материалы необходимые как для производства, так и выработки энергии на Заводах.",
    "C1E6A0284B37E5E5B582D8BD3DED6AEF": "Освободить 1 логистический город во вражеской стартовой территории, когда ваша фракция владеет менее чем 35% всех городов",
    "D5ABF0594143D621FFB66B9FA5C0F068": "Очистить входящее соединение",
    "3D8441594CCA8971F9EBA6A5B5831BF7": "Очистить исходящее соединение",
    "F560374A4D6E1F382A29348CA4D28987": "Очистить входящее соединение от другой метеостанции.\r\n\r\n<RichText.Regular12.Orange> Должно быть неактивно.</>",
    "486231D94731D5A1C73C108F85618CE4": "Очистите исходящее соединение с другой метеостанцией.\r\n\r\n<RichText.Regular12.Orange>Может быть неактивным.</>",
    "C47DCC72479A6F1DD6307B919D1F32A7": "Лезть",
    "5BA2187146CEB825CB4228AA35F47B70": "Закрыть доковую зону",
    "E45EDB8F4F9D682155319D8CEF73C968": "Закрывает доковую зону для строительства или ремонта кораблей.",
    "D9546E22416383B1AABF059FC045B64E": "Уголь",
    "08AA3BCC4623C87DB4E661A4F8A676CD": "Угольное поле",
    "7FAF2CEE488B1E9D22282F9DD0A4D416": "Угольный Преобразователь",
    "D79F7FC64BBDB3720DE384B1A449391D": "Угольная электростанция",
    "C82D1D704AFAF5F82D9090A61417B3E3": "Угольный завод",
    "05FB560543B6B5D7FB760A932DDF2596": "Береговое Орудие",
    "B88C47D34201E6ECE458878942B7BC8D": "Береговое Орудие",
    "1B679B5D4836AC9171AEBABE59DE5239": "Коксовый уголь",
    "D18901BE48F54CD90D61ABB39940BE7E": "Коксовая Печь",
    "B80277BE489804CA7459B39FBB06B7FE": "Collins орудие 68-мм",
    "335CC5A441994402460A2DA1C6B02C77": "Инженеры Колма Галлахера разработали вариант Outlaw с независимо вращающейся пулемётной башней, установленной поверх основного вооружения из спаренных противотанковых пушек. То, что ему не хватает в огневой мощи по сравнению со своим старшим братом, Highwayman с лихвой компенсирует это универсальностью.",
    "94F1CEFF4227509BE33B1989F55C6DAE": "Бронированная форма Колонистов",
    "CE22DA364D75F47BFC847E811CB9DDC2": "Бронеавтомобили Колонистов — это быстрые, хорошо оснащенные городские штурмовые платформы. Эти противопехотные машины оснащены спаренными пулеметами.",
    "06209EF04AC1AF6314401B9F8225E5A8": "Инженерная форма Колонистов",
    "CB181E6349AB3EF12388D088EE90B285": "Форма для гранат Колонистов",
    "B4E25007455E19F7C46FA1B02479FFC8": "Домашний регион Колонистов",
    "CB7C260743140BD84D36BF86EDE1C785": "Форма медика Колонистов",
    "970015384E151C88F0FD219FB6D53F4C": "Офицерская форма Колонистов",
    "33C6E9B1418286BEB4216094FB644868": "Колонистский дождевик",
    "D8DB9DFC4336C5ED55C9A990F246E78C": "Форма разведчика Колонистов",
    "29AC5303429354A56648F583E51FF6A4": "Утеплённая форма Колонистов",
    "12DB89BF4E72823287073CA4DF328868": "Колонистская солдатская форма",
    "3531DF4F4548B0DA79CC23A10FAA95A6": "Точка возрождения Колонистов",
    "DC42649544472E4A5C5CA7A9D1F4C78D": "Форма танкиста Колонистов",
    "17E625BF4F67CA1B168D2E90D6F48427": "Броневагон",
    "901E2C834747895953A856A5DC67E063": "Боевой Вагон",
    "21E762044E8DE112BAE0F9B2643DDF11": "Командование",
    "A6C9A53541B0C0D17A1767BC6731ADF4": "Обычное топливо, использующееся для заправки всех техник и ресурсных шахт.",
    "CFAB025E43945DD5A675929EA1B8735B": "Поле компонентов",
    "B6CE90A5448C96D16CD38A8E7B2BA03A": "Шахта компонентов",
    "3C4F4A45409283D939A56AB732B3108C": "Компоненты",
    "7385160042574D376AF15594840C9138": "Компоненты, которые могут быть переработаны в Рафинированные Материалы на перерабатывающем заводе",
    "8267F866424460C045FF40A62D7EA10D": "Вычислительный модуль",
    "92D1428F428EE050351557832DB379BC": "Железобетонный мост",
    "2E1BAFC24875F569598C04B027102999": "Бетонный фундамент (1x1)",
    "AC7C340A401CF179EBF08A8F2EA37431": "Бетонный фундамент (1x2)",
    "AE8BCA6D423E26FD2BB2A788298B8526": "Бетонный фундамент (2x2)",
    "62BAABFB4D334D702542EB91C34E9FEB": "Угол забетонированного фундамента (1x1)",
    "BBA3E405402547B83D4C3FA9A95AD67C": "Бетон",
    "D5B404CF40D1E05BD342BEA46DF35623": "Бетономешалка",
    "AE1573994B153ED04FD89CAA3717AE1C": "Бетонные конструкции",
    "CAF19C714CA9B02DA6B44DB5394C60A6": "Проводит энергию между электроопорой и другим сооружением.",
    "1ACF7DFF490EA4BF1F420C9FF3860726": "Строительные материалы",
    "36C1BF36454836BB112D9480C2E468A2": "Строительная техника",
    "5A65DC4C49309C1A165304877B648BBE": "Строительная техника",
    "6B24FD3749D698B926AB4EB742380547": "Строительная техника",
    "12C895724DA8D5DA673FBCAE80A77FA3": "Строительная площадка",
    "4CC605274C43052D3B206AB2A4E0DCE8": "Строительная площадка",
    "054DE0FF4483D71499703B9B68B5D811": "Контейнеровоз",
    "C24ADE5B4EB8622FFA2D779767B962D1": "Превращает пациента (тяжелораненого солдата) в Солдатские Припасы.",
    "C5029282468709AF7937B7BBF877B266": "Медь",
    "EAB24E7045D7FBD285D8B59E05492E76": "Медный сплав",
    "C6E827854959790FFB6DB8A3EA6480F9": "Медный сплав можно использовать для создания прототипов транспорта в инженерном центре.",
    "9867C9B54B91DB2156CF34B791B1B1D1": "Медь может быть переработана в медный сплав, который используется для разработки новой техники.",
    "38273AFC4AACFA88F89A3C9A2D3B2679": "Скопировать пароль",
    "9480EECC44D191EB108306ACBFCEF534": "Прикрой меня",
    "DA7A88824AE3F151D0B26ABF1745EE60": "Укрытия и подавление",
    "0F3ADBAF4570F287492A76B98060113F": "Крекинговая Установка",
    "534B3C724A31FF575ABE89A5B9CCC37D": "Кран",
    "60D70F564358A0AA1EB9379D93A0FE66": "Кран",
    "63CC9B4A469EEC8F696C6EA020432AED": "Кран",
    "35503F8748DDFD0502021BBFC576911F": "Рельсы для крана",
    "8B875CD6417482DAFF18E2AE309567B0": "Ящик",
    "0D5C342746C609324E58D0839D6376A5": "Станция перегрузки ящиков",
    "1D9661814728CC3654250D99AABD5C71": "Воронка",
    "770167924C272500D86179992E951FC9": "Воронка",
    "F15745E8462830CC9AB858ADC6A24C9E": "Создать резервный склад",
    "DA61CC4345AE336D97C22BA9FE2E2062": "Создать склад, для безопасного хранения снаряжения, на ограниченное время. Резервные склады для временно перемещения снаряжения и не для приватного хранения. Доступ может быть передан другим игрокам с помощью пароля.",
    "DF9D586046D58FFD050037A54776F41D": "Мортира Cremari",
    "DD97C63C4237E34D2D418785502C209C": "Тяжелораненный солдат",
    "54AE183A45F910F51E5E65956A2D7AA9": "Минное заграждение Crow’s Foot",
    "44CDCA2942B6EAB83A8B009F07B96CF7": "Крейсерский танк",
    "C083888748E3BEB666C25E961177F552": "Крейсерский танк",
    "CF181019476265E687412D8E123DECEF": "Крейсерский танк",
    "DC44C1C144DFB2BA01D9BFB0DE19E7AF": "Крейсерский танк",
    "901AE71547491F493E627791F4BD21D3": "Замена фильтра жидкостей",
    "CDDDC92F42A69E0F488D088F3B490226": "Измените фильтр жидкости, чтобы эта конструкция принимала только определенную жидкость.\r\n\r\n<RichText.Regular12.Orange> Должен быть пустым.</>",
    "A2923020423029BE99C15C933B982858": "Поврежденные компоненты",
    "3AB241504786F95F4CCA999EB9244219": "Поврежденные Компоненты, которые могут быть восстановлены в Компоненты.",
    "8BA2A8B243CD4CD2EA33C78734DECDC7": "Наносит Тяжелый взрывной урон при попадании",
    "1F1D93CF4F203BAE653799BDE8840A44": "Наносит урон броне техники",
    "F657ED234C95FFA2AC930EA57251B6B8": "Наносит урон броне техники",
    "A759CE2B4F59026953934D86CB982420": "Для расшифровки закодированных сообщений иногда требуется больше, чем просто рабочая сила. Эти современные компьютерные модули могут просто помочь. ",
    "3BFCADD34481D0AE0CDC31A58F2EB09B": "Удалить выкладку",
    "595BD3A94E07DAECB8ACFBADBE370727": "Удалить сохранённую выкладку снаряжения.",
    "33F864FA494AC77C7470509A269616B8": "Разрушить",
    "F7F2EAA84112598BD8BB21838CE54349": "Разрушает этот транспорт, полностью удаляя его из мира.",
    "0E47402D497FB3B729F523B31EA42356": "Разрушительный",
    "3D783BCB4F9168F145609AB5CCCB68E1": "Зона Высадки",
    "4C7EC533469CB299847A67A869AA0AD1": "Зона Высадки",
    "4D0D72D0452D2DB7E4B2DBA743A63E0B": "Зона Высадки",
    "5A25BD694237EBA2AFAEBC965B2386BC": "Зона Высадки",
    "5EC6C3764E3A9055DF183EA607BB7670": "Зона Высадки",
    "D292E9D04BCF39FE9F157699A38220E7": "Высадиться",
    "E1C74DB944F2AC7206FBC999F49ACA70": "Станковое Противотанковое ружье",
    "4E4DB2B344BB158A9C0B56829C85122D": "Установленный Хавок Заряд",
    "B65ECBC1481C3213858453A08B6FB4DE": "Развернутое орудие поддержки пехоты",
    "B6F3A3A745AEB338C211239D034879B4": "Станковый пулемет",
    "C90EB41E442883C0502BCD86C596E9DA": "Станковый пулемет",
    "0EDCD2F044E7D1BABCF65F87D05D2AEB": "Станковое Р.П.Г.",
    "B584DAC0494452860D7C50B075DD1BF3": "Станковое РПГ",
    "DA7DF8C74D9859AE0E5BE08B5C2AFD1A": "Установленная тренога",
    "F36D2ACC43944973C83DBAB1FFCE6CB0": "Карта высадки",
    "0264CF904E70D8C4F8186E8195DA4F16": "Точка высадки",
    "383B402E474BADFE7252DC83B28F1773": "Глубинная бомба",
    "3F86B586405A3BE3C77456B0F2ADF819": "Глубинный заряд",
    "908BF3B743992D354B6F789E3E8F1634": "Глубинный заряд",
    "9BAF48A647EBE059B00714BC83AF8500": "Разработанный для сопровождения и поддержки операций пехоты, полугусеничный бронетранспортер класса HH «Javelin» представляет собой бронированный, универсальный вездеход, который может быть оснащен различным навесным вооружением.",
    "498585524403BA7F3832B5A1EC4824BD": "Разработанный для сопровождения и поддержки пехоты, Полугусеничные бронетранспортер Ниска представляет собой бронированный, универсальный вездеход, который может быть оснащен различным навесным вооружением.",
    "26ED399A44B866863CC3E58124AABB22": "Разработанный для массового производства в Kraunia, этот штурмовой танк включает в себя модульную башенную систему для максимальной универсальности. Класс \"Falchion\" включает в себя мощную, хоть и урезанную, 40 мм пушку.",
    "79B1AA8344606FF1D0AA3DAC3B0BBDA6": "Type-C Charon, предназначенный для патрулирования рек, оснащен спаренными треножными установками и минометной пушкой на середине корпуса, способной преодолеть любое бронетанковое сопротивление на берегу или в открытых водах.",
    "99CCB6584F3388BD2B4B9BB0AE9CAB57": "Разработанный для того, чтобы дать отпор проклятой нежити, \"Центурион\" оснащён двумя крупнокалиберными пулемётами и смертоносной пушкой спереди.",
    "AD94AB834E437227E2D2AFBB61FEB2D9": "Морские мины, предназначенные для подводного размещения, детонируют при контакте с судами противника.",
    "BFA4A55D4B3C01FA9114FFA50DD0A9DA": "Уничтожь постройку",
    "7565C1BB4A349596B1A9C0B64F6C1BBB": "Разрушенная ракетная платформа A0E-9",
    "640BA4264BE2F2EE90A8D6B9FB290EAE": "Разрушенный Завод по производству боеприпасов",
    "EB1079FF433990E4027BDA9CF19D3268": "Разрушенный завод по производству боеприпасов",
    "C1D7DFB54213CB3D075A6A858DC72929": "Разрушенный угольный завод",
    "A0262E4B402C015853F8B18B07BCF8F2": "Разрушенное береговое орудие",
    "E86653B943E05A24CA0E22B3E5524719": "Уничтоженная станция перегрузки ящиков",
    "8A683CEA40456FF93C9975B833F71755": "Разрушенная дизельная электростанция",
    "5D7846154C0EAB3905ED519CFBCF7D42": "Разрушенный сухой док",
    "FC157C4B49D0310646094086775F97BA": "Разрушенный Мортирный дом",
    "B3282BFA4B54C7FA73DF7C92C499662F": "Разрушенный центр полевых модификаций",
    "02BBF10B4E6E5BAE4B4815BE9C0B1EC3": "Разрушенная топливная башня",
    "5B6CE9C34D1A721D353FEDAD3EE53991": "Разрушенный гарнизонный дом",
    "04C2A66849571C27BC0A0590F8537CA8": "Разрушенный Гарнизонный Дом",
    "05D64E054A9AEA6A8870F992BC39ACA6": "Разрушенный дом с гарнизоном",
    "0E9B84204D91D666F0475384F315B414": "Разрушенный гарнизонный дом",
    "183577D245A711D2CFE030B0DEC62619": "Разрушенный дом с гарнизоном",
    "23C52A394A2C6DDA9B3CF38ABEC83C0C": "Разрушенный дом с гарнизоном",
    "25D1C5EC44C45A256B39A381329E8C8A": "Разрушенный гарнизонный дом",
    "2641E3E74DE2F3DF0B37CF9C6D640D59": "Разрушенный гарнизонный дом",
    "31041A6A4E8329B1B3EC5C88450E6D46": "Разрушенный дом с гарнизоном",
    "386474574D25E11C900DE89108207B60": "Разрушенный дом с гарнизоном",
    "527049E64919167DA8E4BEA55760BC4C": "Разрушенный гарнизонный дом",
    "65C02B3443756C3882875A849A10F302": "Разрушенный гарнизонный дом",
    "6BA4DC11486E7E7A06AA56AA0ECE0C38": "Разрушенный гарнизонный дом",
    "6C854D8640A267DD19812A9CCF072CE2": "Разрушенный гарнизонный дом",
    "72554D834F54109F83271E8E8E300636": "Разрушенный гарнизонный дом",
    "8EA2BE9C45F46EC3660013B96D260F8C": "Разрушенный гарнизонный дом",
    "9ADFE6B84DD7DD2F34116A93280EB67A": "Разрушенный гарнизонный дом",
    "9B71AC5241BBE1A347E0C9A6DAC9F2EE": "Разрушенный гарнизонный дом",
    "9DE304714C744B9FC9793E804505DCC1": "Разрушенный гарнизонный дом",
    "A2D3D33E47F97B26DDA7F28EC1F6708D": "Разрушенный гарнизонный дом",
    "B084281A4E0464D5D4A61BA45383CB1B": "Разрушенный гарнизонный дом",
    "B7E6BA4B42B66B9794C64FB59CFF8668": "Разрушенный гарнизонный дом",
    "BAFD0E7841FD707C0FC3E8927B60FC68": "Разрушенный гарнизонный дом",
    "D1CB22D14B682590F9FF4E80F16D66C7": "Разрушенный гарнизонный дом",
    "D46726DC44584F50975574BB27C55C1F": "Разрушенный гарнизонный дом",
    "DCEFE81246CFD944F515D79886950C25": "Разрушенный гарнизонный дом",
    "E591AB8B44D7049016441EA7BF90F2E3": "Разрушенный гарнизонный дом",
    "E6C4199C43014DB9737BD8B66FBC2035": "Разрушенный гарнизонный дом",
    "FD701455480BB3FDD30B44AD4C324CE4": "Разрушенный гарнизонный дом",
    "49144AF243740726C3ACE0B854ADC61A": "Разрушенная большая сборочная станция",
    "23C305AB44A71DB4EB17BB9A9E08FF21": "Разрушенная станция перекачки жидкостей",
    "B72FA1B84F426DF6AC51208297986EC4": "Разрушенная станция перегрузки материалов",
    "BF97A0E0425EA6C7DE97B582813372B2": "Разрушенный завод материалов",
    "9ED578D946035C24AD0E7C825925A9B9": "Разрушенный металлургический завод",
    "AC342D774AC4FBAE785BB3B9FD48542B": "Разрушенный нефтеперерабатывающий завод",
    "EB0E0508430999CC19ED9B923BE9B3EB": "Разрушенная нефтяная скважина",
    "EE0B16BA442F876A6C64F9841D8112F0": "Разрушенная электростанция",
    "A10D31C94C380E975371FB81ABF64A35": "Разрушенная станция перегрузки ресурсов",
    "16A1282044DF6055D326AABEAF636E42": "Разрушенное Бомбоубежище ",
    "5FA6E8054562B139B530ABAA7B65547B": "Разрушенное Бомбоубежище ",
    "B4BFE1684FFA4084504FEABFA47D7D81": "Разрушенное Бомбоубежище ",
    "C44366554C8FDB5773027BBDC06F7CB0": "Разрушенная малая сборочная станция",
    "B7AB672A4B1C0A1708E1208FAC70D517": "Разрушенный Стационарный кран",
    "65E27155458C3491E8324199D1A5BDA9": "Разрушенный стационарный сборщик (Уголь)",
    "2C247A0146DD5C342256BEA146202A35": "Разрушенный стационарный сборщик (Компоненты)",
    "15B71A74488D43F90DFA84A53E0B6173": "Разрушенный стационарный сборщик (Металлолом)",
    "92DAFFA448C36DF3920431AA3D9B4052": "Разрушенный стационарный сборщик (Сера)",
    "0C76AEF743C765A6E38EF6A58F6CF09A": "Разрушенная Ратуша",
    "3478C25C4B7D33B34B7217ACBCED00DD": "Разрушенная ратуша",
    "E8B4F22842C789E1E3B0DBB10DEF2492": "Разрушенная Ратуша",
    "06F1BCF74DEDC31BDF53F8B1878F911F": "Разрушенная Траншея (Ур. 1)",
    "3F7E7DAE4538B9C70B62D695495177AC": "Разрушенная траншея (Ур. 1)",
    "F634D667469C9D1AE38CC28384E1023C": "Разрушенная Траншея (Ур. 2)",
    "FDED509B4BFD4A8CDB70138372C05A4F": "Разрушенная траншея (Ур. 2)",
    "24FD22CB4DC74792791565BE4DE2A339": "Разрушенная Траншея (Ур. 3)",
    "EA743F984C22A662B4AC4FBDC38F6CC1": "Разрушенная Траншея (Ур. 3)",
    "73B11259426A9E4FB490988B33137570": "Разрушенная соединительная траншея (Ур. 1)",
    "E29A87864B41D8E59FA3B5A0558BBCF4": "Разрушенная соединительная траншея (Ур. 2)",
    "FF99FCCD4E189A2E15D964A726148AEB": "Уничтоженная соединительная траншея (Ур. 3)",
    "B6E2C2DA4B64EF7B228846A010627C89": "Разрушенный водяной насос",
    "27B7124540F562B36200BB91E0F1118C": "Уничтоженное снаряжение, оставшееся на поле боя. Можно разделить на полезные ресурсы на перерабатывающем заводе (используя контекстное меню правой кнопки мыши)",
    "1A098F0341B09DFB96E94D8EDA7359D9": "Эсминец",
    "55D048084C2C90E1F05340B4247D7C43": "Истребитель Танков",
    "65F03D9E4801817E140093806CC2F7FB": "Уничтожает препятствия, которые могут быть убраны только гаечными ключами",
    "CAC7B220492912DC61A5F48E7B4EADDC": "Разобрать треногу",
    "7DAEE5534813241E9ACD98A9322ED69F": "Дизель",
    "BCE01A144C827D095F363D88D960D305": "Дизельная электростанция",
    "BE3F665C4C470BA0F86D529576402594": "Распустить Подразделение",
    "601D7FFB46841A19D0802DA9D0E4FDFB": "Разъединить все",
    "D124284B4C8C0841B3B25B9D9341CBB4": "Отключить все энерго линии, подключенные к этому зданию.",
    "1402CBA84CCDDF1A689CC194BC75010F": "Офицер по погружению",
    "725EEB36498E0825F76EC3848A837AF5": "Офицер по погружению",
    "D97EFDCD4552EE3ED3B6A991ACE82A3D": "Док",
    "5C24E6A14E2BFDCE0BBCB8865B328C00": "Доминирующая. Неуловимая. Ни одна армия в мире не сравнится с Колонистами из Мезеи. Когда северяне пошли маршем на наши границы, они разожгли пламя, которое отказывается гаснуть.\r\n\r\nЕсли они хотят испытать наши легионы, пусть попробуют.\r\n\r\nИбо слава - наша цель.",
    "5F377B0E4587CF0D14CE49A42F708DD0": "Дверной проем",
    "766FEE094141E47C6C9E68A8AC41D953": "Дверной проем",
    "7F7379344E3CC659790552B650A00C7A": "Дверной проем",
    "675C196D4FCEE900F74B3790B3DF0DCC": "Зубы Дракона",
    "1A400430493335EA1D65F3ABA2F6D63E": "Осушить трубы",
    "0A8060544364E325529ED892023A49CA": "Разводной мост",
    "195B6F454DE2CB4C019A3E927748B54B": "Разводной мост",
    "4BA99805416D455F85C8BE8B3DC6F82B": "Разводной мост",
    "5EF229AE4007E992CBE4068897EB1A87": "Разводной мост",
    "88C5F1A143250C1751311C9AE76B303C": "Разводной мост",
    "83A395F64258ECEC0802CFB6E5A04E1F": "Курс вождения",
    "88E7EE18441ECF287D89A9907F9AD571": "Курс вождения",
    "CB7DFFF54D1B73FA2E800E8A674E7CDD": "Курс вождения",
    "DC22351B42F5D04D010FCCBAE4F17155": "Школа вождения",
    "AB977EC5420C8827B93C4994C1735AF7": "Брошенные предметы",
    "7996F6FB4893D97468125E9DABF944D7": "Сухой док",
    "11F5FAA9454DCA4D27AF97B947756B7D": "Duncan’s Coin 20мм",
    "D1306F394665FBD1A787E483078A1562": "Самосвал Dunne Loadlugger 3c",
    "2AAFA04A4A217CE751F9DF8127D2A8FC": "Ранние версии этого пулемета были созданы для установки в бункерах и на палубах легковооруженных военных кораблей. Ratcatcher — первое свободно устанавливаемое пехотное оружие Харви Мэлоуна, предназначенное для использования в полевых условиях. Как и его предшественники, этот тяжелый пулемет способен вести огонь на подавление с непревзойденной эффективностью. ",
    "D3DB30354C5370C9C481C6B5CC705B6F": "Изменить выгрузку",
    "08091B354DE93829851FBEB3CB2ACACD": "Редактировать сообщение",
    "EA73E2A24E6D91BE59B3FA8D029F3F4A": "Редактировать Подразделение",
    "C976E1DD42FE9AF7787313AA5DB52927": "Изменить модификаторы сборки для выбранной в данный момент выгрузки.",
    "30D0433A44CA775D26EAD89FBFA2FA05": "Редактировать сообщение на табличке",
    "E39478D4433CB85DB6F0079E93577A5C": "Изменить название Подразделения и тег",
    "B4E3828C4A1B54EB6297D79DE7E90627": "Извлечь водителя",
    "7375A5424178BFE027BEED928F1638B8": "Высаживает текущего водителя из машины. Это действие доступно, если транспортное средство было зарезервировано отрядом. Только члены этого отряда могут высадить водителя, и только игроки, не входящие в этот отряд, могут быть высажены.",
    "5B7EEA1143A8752CD6692E8C421C1418": "Электрическая нефтяная скважина",
    "A11AEEA44D22738E845E61B13E8428D2": "Стационарное РПГ для стрельбы по навесной траектории (ARC)",
    "8B90A0E4478C66787FB941909ED30F42": "Стационарное противотанковое орудие",
    "389F95E44B2F5989B80332A13BECD486": "Тяжелая батарейная артиллерия",
    "7DFD2FBB4A590C07FAA369AFD838656E": "Тяжелая Батарейная Артиллерия",
    "868E97CE4747F87B5102F5A12A89B7A6": "Стационарное крупнокалиберное противотанковое орудие",
    "2E5B55924C95AB18310E89BE628C81BA": "Крупнокалиберное Батарейное Орудие",
    "1F56A18F4A1848A20528FC8178190A00": "Легкая Батарейная Артиллерия",
    "43C38BDB4DD4869B2639738994F26AD5": "Станковый пулемёт",
    "63C36A4046B3D0B9837B5AA08622E6AC": "Станковый Пулемёт",
    "69654C6D4CEA47D18E70DDAFF6830480": "Стационарная установка РСЗО",
    "B9002B7F4C84AAD7D3D369BCD817535A": "Минометный дом",
    "CCF681184F49E8DC1D3D45B7D61F582F": "Миномётный дом",
    "6F7AD3C94752591F17B8C69D3D4D8067": "Позволяет Гарнизонным Домам и Убежищам быть построенными в этом городе.",
    "10FC0F0547FAE13CC3F1A9B656B81148": "Позволяет строить дополнительные оборонительные сооружения, такие как Минометные дома и Береговые орудия.",
    "F7E804FA4A16CBB465B6239C61698EEA": "Позволяет восстановить логистические строения, такие как Фабрики, Перерабатывающие Заводы и Складские Помещения.",
    "77CF537E46DB75C26ED013B5B5901FF9": "Палатка",
    "801BE81D4B8E3BCC0A58F29C385A6C72": "Лагерь",
    "D11367964786D174715D918E175A3B25": "Генератор (Ур. 2)",
    "A046E43445FD734903AB2AAECAA8CBA1": "Генератор (Ур. 3)",
    "1F61C54A4810D57334074C91C42A7EEE": "Центр исследований",
    "B27C2F014F032FE4AE2FA39C368FA2EC": "Инженерная Станция",
    "8C1183A34EED68DB511D039030F4040C": "Инженеры - это костяк Mesean Republic. Они экипированы тяжелой сумкой и ремнями для легкого доступа к инструментам и подручным материалам.",
    "852FBF664CB60C909259479FD1C39313": "Обогащенное топливо",
    "6405A9C4437F95AE40A01E92E854D5BF": "Сесть в грузовую технику",
    "90CD31144FC19D0B388AF9B5A50AE486": "Сесть в грузовую технику",
    "677B173044BC914F0AC13FA55F44FA46": "Введите код запуска",
    "C643B4314C376A35063DE5BF256AF52D": "Введите код метеостанции",
    "A577485C43B2D6DB5FEB2F8B133B2FB3": "Введите 6-ти значный пароль для доступа на Резервный склад.",
    "0F82AD414B67440EDB133FAE27E72468": "Укрепленные бункеры для легкого вооружения и укомплектованные бойцами.",
    "D907D27F4E3CDBA224F6E88D6D0EF6FD": "Укрепление",
    "837817FD4C271A212BA53FA37F3C1AFC": "Экскавация (Без материалов)",
    "0B2745C840F5039E537869A1F1AE81E6": "Экстрактор",
    "610EC8D949E1E706DF9E9B8D8E03E8CD": "Экстрактор",
    "94C805FF4CC0EDB282209C93D05E6901": "Экстрактор",
    "B2BEA7C24561238F07A9969EB9582F95": "Экстрактор",
    "CDDE2AF043621F7FFE1D268AA8312A98": "Экстрактор",
    "27CC60CC484F7C544BFDE7A3369C56D8": "Взрывной",
    "6EC4EFBB467656EA5C0146BE84B8A3B7": "Взрывной",
    "99B2FE9A4C6126AEB39E79A364F12511": "Взрывной",
    "A953D201483DD72E1FFDA1A8ED0E8F7D": "Взрывной порох",
    "F69C80AE41E0C992851904AA92FF9C1B": "Тушение",
    "A5CE13FC47B409EEAC835CAC64554DA2": "Добывает топливо на нефтяных месторождениях. Должно быть построено поблизости.",
    "C43BF1774AACEB7B3125CDBAA140D417": "Рюкзак Fabri",
    "9F80977243AB342F6FF7919A55C8662E": "Заводы",
    "1212F89546473A760EEB0A8D92C1B70A": "Фабрики (Ур. 2)",
    "345E78214C324AACEE51C89D606B3140": "Фабрики (Уровень 2)",
    "3F54181D490D84B90BBA1B90C8F1AA75": "Заводы (Ур. 2)",
    "A5ED3CD24DF76BFC46962BA5A03E87FA": "Заводы (Ур. 3)",
    "D5A27FC1449B023F11B7F69677E344AA": "Заводы (Уровень 3)",
    "E703D5C3448DA71DE335A8BDEB84A763": "Заводы (Ур. 3)",
    "651DB38844D1AAB42DA08B9412829AC6": "Заводы - это построенные игроками промышленные базы, используемые для производства специализированных транспортных средств и оборудования.\r\n\r\nЧтобы начать, пройдите по линиям электропередач к электростанции и включите питание, нажав «{0}», чтобы открыть меню.\r\n\r\nЭкспериментируйте с производством предметов в различных строениях. Наведите курсор на вопросительный знак, чтобы узнать больше о каждом строении и предметах, которые оно может производить. Если строение не включается, наведите курсор на тумблер производства, чтобы получить информацию о том, чего не хватает.",
    "A7F2259B46F75EC6664B498E99A83D84": "Заводские ж/д рельсы",
    "B230DE254C8947C96A74CBB72EFD0FBB": "Производственное сооружение",
    "DE3E06C34622FE3CEDE99796FF41BAC8": "Производственное сооружение",
    "535A0D26489C245363453CA4CB67BD6A": "Тренировка для работяг",
    "6FFE08F9452458C9E3307290A90F606E": "Тренировка для работяг",
    "BEB686CB403ADB6C40A4C1905FF498FB": "Тренировка для работяг",
    "CC44135140FB86737BD520828BE3FCF1": "Тренировка для работяг",
    "186B9C994E28BD86151443AD2135BC44": "Фабричное производство техники и узкоколейных поездов",
    "1C6075E540F596B894E3BA966D66592E": "Фабрики используются для производства различных предметов. \r\n\r\nНе стесняйтесь использовать фабрику поблизости. \r\n\r\nЕсли вам нужны ресурсы, попробуйте переработать материалы, которые можно добыть в одной из различных кучек на острове. \r\n\r\nДля более подробного объяснения кликните на иконку \"?\" в верхнем правом углу меню Фабрики.",
    "21258B35439483DDBF4B77A6D928EB04": "Фабрика",
    "41D126A44DA0520ED5F340871B30C910": "Фабрика",
    "B987893A480C5A66FE7CB3A14605264E": "Флаг фестиваля",
    "72A344A24B0F050D239CBC989C9F8606": "Пистолет-пулемет Fiddler Model 868",
    "0E590422497597303D247DB4738E5940": "Полевое ПТ орудие",
    "5BE3900A4BC47B72BF09958D4998F59D": "Полевое ПТ орудие",
    "234479D3480F8D3D8624C99663750E12": "Полевое ПТ ружьё",
    "E22210AF44BD5C5E47C343A8E7B1CBAC": "Полевое ПТ ружье",
    "3C2E678C4DA8E9DD134C018311963D2F": "Полевая артиллерия",
    "AC38557546509C33A9011AA0D7C1EC63": "Полевая артиллерия",
    "D7E5D59A4D09EB59D62313A5641B0F83": "Полевая артиллерия",
    "CF340BB44E78DB2006B379B249A0B98A": "Полевая Артиллерия, в основном, работает так же, как и Стационарная Артиллерия.\r\n\r\nОбратитесь к Артиллерийскому Обучающему Курсу, чтобы узнать подробности.\r\n\r\nГлавное отличие Полевой Артиллерии в том, что она может самостоятельно передвигаться двумя игроками, которые управляют ею.\r\n\r\nПолевая Артиллерия не обладает выдающейся мощью и дальностью огня, но компенсирует это своей мобильностью.",
    "2CF00F5E4322527F4A59138F1E73CAAD": "Понтонный мост",
    "85214B6C4F89526FDAEF1DB46A35F5A5": "Полевое орудие",
    "239F672B4BA79C67D3C9CEBE5C420B2F": "Полевой госпиталь",
    "E6C9B72C47CEBDE3A65DA8BE9E5DDF58": "Тяжелый гранатомет",
    "79B77B524F98465C23C22D8CA433A6AE": "Полевой пулемет",
    "3A50260049F13414DA4C1487E7DD2861": "Полевой пулемет",
    "3BEE21A64768DA596100BEA3DB28E2BA": "Полевой пулемет",
    "2E5DE0834B30862D571B05855A4CBAC7": "Центр полевых модификаций",
    "1043728243CE18491248E0943BD6CFFE": "Полевой миномёт",
    "533F40F54A9071AC64ECAAB47310D6D1": "Полевой миномёт",
    "C2EF1B9746B24FF50700C1B95647A3E7": "Полевая дальность",
    "C32EF9B64E1DB95E4B60CD909E62C6EF": "Полевая станция",
    "1D69619142CC5934A19B5185E751222C": "Закопать",
    "1E3F86B849E45AAD4CF31EA4C8D144E4": "Закопать",
    "229DCA044477360060A61CBD4B317FE3": "Закопать",
    "2F964D3D4389D3736BE4388D4E045175": "Закопать",
    "3A06383E4980F00A6FF5C581A0ADCCFA": "Закопать",
    "83C2B3C246F4B4CFF97E02B118CEA45E": "Закопать",
    "8A99D2084476E3E799A0A092203C491E": "Закопать",
    "B10B65474010C1AA6BE2EAA9BCA5F80B": "Закопать",
    "BCFCA7234A083547AE2E77826AFC76B9": "Закопать",
    "D2A510C145EF70BF5AA01891F49DFC71": "Закопать",
    "DFF1431449484FA10AF26BBE74609724": "Закопать",
    "E297AE554DB2A7DF0E1B5EA1AD0C6B09": "Закопать",
    "FE7861B340CC5B1AED601487FE979569": "Закопать",
    "9252963C4AD30A7AA261E99F29D8B4A4": "Закопать этот Бункер, восстановив первоначальный ландшафт.",
    "9F4E81DD4A6BDBB414426E8E0A4D6656": "Закопать бункер, восстановив ландшафт вокруг.",
    "ABDCB2F54C4E16644CDDBE904B8B4507": "Закопать бункер, восстановив ландшафт вокруг.",
    "DB6EB8DD4E001F249E711F9CFD0F8871": "Закопать бункер, восстановив ландшафт вокруг.",
    "98682818476BCC5EF7A40C87B97A4D48": "Закопать воронку, восстанавив первоначальный ландшафт.",
    "BC6E7F2A417F27BDA0772A8D0FDD624F": "Закопать воронку, востановив ландшафт вокруг него.",
    "5AE781E14167E6E84C9705B68AF4A532": "Закапывает этот окоп, восстанавливая первоначальный ландшафт.",
    "0295F40B4438AB1A5F506E801EAEE664": "Закопать эту Траншею, восстановив Ландшафт вокруг неё.",
    "1205889C44351F8B31D31CBE1CBC59BA": "Закапывает эту траншею, восстанавливая ландшафт вокруг нее.",
    "4383994645B70DEC33898DBE4C92A08C": "Закапывает эту траншею, восстанавливая первоначальный ландшафт.",
    "579F7D7A489202AD79EDBDA26B7B34DB": "Закапывает этот траншею, восстанавливая первоначальный ландшафт.",
    "63AE3BE2463DF21E59AD6EB155709ADD": "Закапывает эту траншею, восстанавливая ландшафт вокруг нее.",
    "CF7920F64F99C5C566F9BDBA9DAF06DC": "Закапывает эту траншею, восстанавливая ландшафт вокруг нее.",
    "13CD5C9A47BA879FA87C62865697C904": "Пожарная машина",
    "C19E0D224B5919BEFAA077A102359788": "Пожарная машина",
    "A827BEFF47AEC0621FA9ABADA2393A4A": "Костёр",
    "AE84175D40D77F59902671A049614FF4": "Костёр",
    "318E28E849D5F10341C184B97B832951": "Торпеда Moray, запускаемая с подлодок, представляет собой самоходный подводный снаряд, который отлично работает на различных дистанциях и глубине. Предназначена для создания пробоин в корпусах больших кораблей, оставляя их уязвимыми для протечек.",
    "ABCF56064644F182E927C98DC9572DF9": "Бойница",
    "CE02A2D44A9C10F88D627AA84AD96CEF": "Санитарный вагон",
    "F9B540CD4BC1D59245B7E691EEFE85B3": "Набор Первой Помощи",
    "41DC5BB04EDDDE08A9E340B497FA2090": "Во-первых, выкопайте новую Траншею и присоедините к ней Бункер\r\n\r\nВозьмите молоток, затем подойдите к Бункеру. Смотря на его стену, нажмите \"{0}\". \r\n\r\nДолжно открыться меню с новыми опциями.\r\n\r\nВы можете улучшить свой бункер несколькими способами. Добавить защитные укрепления с ИИ, бойницы или другие полезные вещи.\r\n\r\nЧтобы войти в режим улучшения, возьмите в руки молоток и нажмите \"{1}\". Иконка в виде 'Молотка' указывает на то сооружение, которое вы будете улучшать. Нажмите \"{0}\" чтобы открыть меню улучшений.\r\n\r\nТраншеи и Бункеры можно укрепить прочной древесиной, и позднее - Бетоном.\r\n\r\nВозбмите материалы из ближайшего ящика. Добавьте дверной проём в бункер и улучшите Траншеи до второго уровня.",
    "EC0047B7405B350858FF23BD071C7028": "Снабженный мощной противотанковой пушкой, Blinder способен пробивать любые сплавы, даже самые закаленные.",
    "677F3D7F4F3EC78116002FA9DE6222C0": "Хайлэндер, оснащенный вездеходными гусеницами, обеспечивает значительную проходимость по бездорожью и особенно хорошо работает в заснеженных и горных условиях. ",
    "D91215074858A485C1A09C8661C768B4": "Оснащенный спаренной пусковой установкой РПГ, T8 может атаковать вражеские сооружения и огневые позиции методом «бей и беги».",
    "49E7314541C271CFD119489A5B71A408": "Пометить сооружение, как нарушающие порядок размещения",
    "4CF0F3774AF5DF3CCFB4DEB69818599D": "Пометить это строение как мешающее. Если строение будет помечено достаточным количеством разных игроков, оно станет уязвимым к дружественному урону.",
    "91724B794E1BCFC2D0D172A32C020F56": "Пламенные боеприпасы",
    "B777FC99442DB88B03A7ECB094119BF0": "Осветительный",
    "D6EFB89F46759391A4051292C45BC925": "Осветительный Минометный Снаряд",
    "1792CEF147D68089B641D3BC8CAA1387": "Бортовой вагон",
    "458F081C470EBD36BD654E8D14B86534": "Бортовой грузовик",
    "19160B414FA3540EB3F0E08526FB5D7A": "Следуй за мной",
    "0AF9B0C64ECCAB0D96434AB223799B95": "Эта форма для медиков Легиона имеет множество карманов и подсумков, предназначенных для удобной переноски и использования средств первой помощи.",
    "DD746F89475D20526DB12CB524E29926": "Для тренировочных целей в ближайших контейнерах для хранения хранятся различные виды огнестрельного оружия. Как правило, все оружие следует производить.\r\n\r\nЧтобы назначить оружие в соответствующий слот, откройте свой инвентарь с помощью «{0}» и нажмите на нужное оружие. \r\n\r\nПосле назначения закройте рюкзак и экипируйте оружие с помощью «{1}», если это первичное оружие, или «{2}», если второстепенное.\r\n\r\nПрицельтесь, удерживая кнопку «{3}» и, не отпуская ее, стреляйте, используя «{4}»\r\n\r\nПопробуйте потренироваться на этих мишенях.",
    "BBA10F004FF8DA0DEA069EBBA952B1F2": "В тренировочных целях, различный морской транспорт был предоставлен вам для освоения основных элементов управления и функционала техники.\r\n\r\nИспользуйте \"{0}\", \"{1}\", \"{2}\", \"{3}\" для управления вашей техникой, так же как и при передвижении на ногах. \r\n",
    "38AA2F854873950355FCCAB11415BB06": "Кузница",
    "0E1D2D8B463556152517EAA9DCDB096E": "Укрепления",
    "8CB26A0E490845A47C32D1841BA47A8E": "Укреплённый",
    "EDF80F4043F09B2A353609A04433D606": "Фундамент (1x1)",
    "F45E2F3B4CA544FBFDA6FDA5C67CB547": "Фундамент (1x2)",
    "E4FA32114D35A116E686A5A9A555FA7D": "Фундамент (2x2)",
    "2FD7C3F44DCC2C64B9EA03BC9D89F25B": "Угол фундамента (1x1)",
    "20C300D44111C0ADFAA707B524F40B27": "Основные элементы, необходимые для постройки корпусов крупных кораблей.",
    "2555CAA049962C34D8C25B8217AFE7E4": "Окоп",
    "C88D908B4B446C843247AAA168851E5A": "Фрекер",
    "3CA3BE5F40E4EB02AF87A9AC6626F775": "Топливо",
    "1F219F864DE728C7E1BDAF8D79552ACC": "Топливная башня",
    "888A355449B487EA21C567B94E9C5A34": "Бензовоз ",
    "3FBD45A24F877BDAF520A3B3EE3FCFF9": "Топливо может быть получено двумя способами: \r\n\r\n1. Переработать металлолом в Дизель. \r\n\r\n2. Заправить Дизелем Нефтяные Скважины, которые добудут нефть, чтобы после переработать её в Бензин. \r\n\r\nБензин также можно использовать для добычи Нефти с более высокой эффективностью.",
    "D37AC5CC4FB8C9EA5FA5BF9D8AD5E33C": "Заправка",
    "8194C7224AD3B4F2C11C23A8309947AE": "Полный ремонт",
    "F96CCD1E42EA9D965B0F3F9F4324E708": "Гараж",
    "0E35F8FE49AADCB93D10B785E7B3887B": "Гарнизон",
    "147D88DF4F4DEB259D18809FEC926EEB": "Гарнизонное здание",
    "87E7FB0949BA2A3A803D6FA4D61AE2CC": "Гарнизонное здание",
    "A4D7E4EB45CC614B3CEDB292ED3D36FA": "Гарнизонный дом",
    "738B8E6D43F6D46F58DF308483807C54": "Гарнизонная станция",
    "05B6A7E843290D9F54FAD698DAAF8E63": "Гарнизонный дом",
    "07C088CF4658C899D59A4DA11B4C1185": "Гарнизонное Строение",
    "0C9E7B9D4CAFC30F8AA3F296986D46D4": "Гарнизонный Дом",
    "15624C00420C72099D88098D8BE07A96": "Гарнизонный Дом",
    "1B8D4C8047EF5403E75A509C623A3AF2": "Гарнизонный дом",
    "1F28F2454C8D6ADA679D67A64F08DF41": "Гарнизонный дом",
    "300B0C3E43B337D2E5069B91EACEA441": "Гарнизонный дом",
    "33554B4D4A532E58A484D8BD5843DEE1": "Гарнизонный дом",
    "4A7D20EE4B1446612B17DA82F676532D": "Гарнизонный дом",
    "5116E7B64064AA9B4DBC4BB87BA3CEFD": "Гарнизонный дом",
    "570E66F64427D2FAAFC7C093CB49B636": "Гарнизонный дом",
    "5DFDF3F1403D4EA5228F99AA585EC21F": "Гарнизонный дом",
    "5FAAD2E2445137ECEB717B8FB5789913": "Гарнизонный дом",
    "6E530185404D69B28E538CBFC459325C": "Гарнизонный дом",
    "7894DAC2488EC4B1525D87973BF4EFDD": "Гарнизонный дом",
    "78C21E0247D30223F885D5B7C43D9A6A": "Гарнизонный дом",
    "7E370E254D2FC256783CD6B2F60B477F": "Гарнизонный дом",
    "8F5145264AD5949E39DE709D66407C8F": "Гарнизонный дом",
    "9C59052D48A56D4B209ABD9178D35165": "Гарнизонный дом",
    "A4B30AB7403E3D25F6426FA447C5488F": "Гарнизонный дом",
    "A85CC501406E34D03E89129A87589AC0": "Гарнизонный дом",
    "AF2561B3476AC14CA45ECFA477B1570D": "Гарнизонный дом",
    "BDBF38154039C63A314AC297011D3D7D": "Гарнизонный дом",
    "BFBDFFE94555AB2AF6DBBB8B367FF86A": "Гарнизонный дом",
    "DEF08A374CD6CE786CF41D954BC4D9FD": "Гарнизонный дом",
    "E43E5D6A4A964118B53D5B947E7C3DAC": "Гарнизонный дом",
    "E485A5E840EE7026518453B0F8CFDED0": "Гарнизонный дом",
    "EA56E5E84110E0B8849C2A9CE2F20D55": "Гарнизонный дом",
    "FDE2A6044916483C475099B262B3383C": "Гарнизонный Дом",
    "CD94F99F497B1785DDBCA5A4CE172A0B": "Противогаз",
    "D95780024FE7408BBF477792618FC619": "Фильтр для противогаза",
    "80762CBB45EF63A73AAB14B3CB2A1B65": "Ворота (Ур. 1)",
    "7A40C61448B3FABF060E369BB79F3A06": "Ворота (Ур. 2)",
    "4BAC9851464E59D977437285DF1586DC": "Ворота (Ур. 3)",
    "999C693D49CD6BA9C4054C97A3D31D84": "Гравий",
    "4413D3A34597B7499BC5B2AC8CF05C1D": "Газовая граната",
    "8739433E4A662267B70B43875E0D8FE9": "Green Ash - опасный газ, вдыхание которого, без специальных защитных средств, приведет к летальному исходу. Всегда берите с собой противогаз и несколько фильтров.",
    "0C04CA104B06B55A857BA697672F62B6": "Гранатомётная башня",
    "6E061CC544132319F99222ADCE170C42": "Башня с Гранатометом",
    "6F25C5494627639CBFC042B1DBA18F12": "Гранатометная турель",
    "436B65CB4E3CC44771E7999EB0B34911": "Гранаты",
    "4662E1F44473D9DADEE5FBBC41412A1C": "Гранаты экипируются из инвентаря, как и любое другое оружие, в слот для вспомогательного оружия. \r\n\r\nЭкипировать с помощью «{0}».\r\n\r\nГранаты бросаются по дуге, которую вы можете представить, прицелившись с помощью «{1}». \r\n\r\nУдерживайте кнопку «{2}», чтобы взвести гранату, и отпустите, когда будете готовы к броску.",
    "D0FDDA8F49CC5A0ABFECB3887E62D100": "Перевязь гренадера",
    "069C2F184DCB8877EC178EAF7B7600C2": "Стрельбище",
    "63EB9B6A4C36454FF0FBAB996BF11549": "Канонерка",
    "F9A269804162FA069E7C498D5426E537": "Канонерка",
    "04E322B3454ACD0A015A5B8280E12436": "Стрелок",
    "17A4191745D78A17F8D7D2B5F20B70B3": "Стрелок",
    "18CCCD67460DC50D723CD6B803F448D0": "Стрелок",
    "2163974847583327027B07B07C4ABCCB": "Стрелок",
    "2170751A4AFCC2E6E5CA8AB281E7767E": "Стрелок",
    "2ADB35E74AE7983E1B5088906153814B": "Стрелок",
    "2C4C24874EFDD80AAFA1B68886086912": "Стрелок",
    "2F49FFA546096D798AC247948AB3CF9B": "Стрелок",
    "31E1BFFF4D531B5A837F9782A7BCF0F9": "Стрелок",
    "334AD1E5415DEE4F90CC74AC8A5F3A98": "Стрелок",
    "3825ADD34E26B099AAC100ACE066FCB3": "Стрелок",
    "3B05BD29430E5752D02FAD8176CE935D": "Стрелок",
    "4C92DE6A40DB640F3E4E729A61E10A53": "Стрелок",
    "58965405402CF955256B5D882083CC8D": "Стрелок",
    "5B4CDB4345ACDAD082C6BEA6F7B85670": "Наводчик",
    "63C5DCCB46706B3286BD3E9F5BB0041E": "Стрелок",
    "6542FF2046B68CCE91FFC78F4C3C5C55": "Стрелок",
    "693D63FB444BE0D03C7A9CA25A6A93DF": "Наводчик",
    "6C4154E742C052BBCD6EC5892B665208": "Наводчик",
    "7E2C51E94E4CAD46522A70903F36C33D": "Стрелок",
    "80857B6048B21D9E48D3F9B22564CAA3": "Стрелок",
    "8A9DF13D4C127B3F3D682E95FA7FE289": "Стрелок",
    "9C5353B7423D2D4F160FB091CB3F8C3D": "Стрелок",
    "9DD3C5D149636362F37B2B91B5B83395": "Стрелок",
    "A168FD5841637EB559657FB4358DFE95": "Наводчик",
    "AFA79CF642CABF02048445B66613999F": "Наводчик",
    "B214B2F74F78E8A67627E58878C61121": "Стрелок",
    "B2D8D81F46C6AABB823ECBA220B0AE08": "Стрелок",
    "BCE0E2F74366B0FBE3FFA38F8EC62A48": "Стрелок",
    "C1BC8A9A48E8D2BEEAD23A8065CA54E4": "Наводчик",
    "C75B5EF64B5D207C142A7EA962A837C6": "Стрелок",
    "C9E214204CF62ED59440EAA55745641C": "Стрелок",
    "CA3022A7402DD35AE04F78BB761F10D0": "Наводчик",
    "CA71F11346288EAF1879E7BD7AAFEC9A": "Стрелок",
    "CB4956624707DB8429314A861C23591C": "Стрелок",
    "D0B6B72746CCD8EDF941B9B0E28B05E0": "Пулемётчик",
    "D4DB27214875F1A2C9D6B6B3C321C007": "Стрелок",
    "D81BEA084F166632A786C9911CD2C893": "Стрелок",
    "E439A8AA4862033B2E20D9B5C4855CE7": "Стрелок",
    "ED50F32049DEDC3A83266B901A9D8C18": "Стрелок",
    "F3CB25C540FE9AF9400999AECBC8C229": "Стрелок",
    "F72C09CA469B61E3BF7E028B8717CABD": "Стрелок",
    "00CD9B0242F5A4903A117FB4CEEDC514": "Стальная кираса",
    "DE3AEE72483623694B6B18A793378204": "ОФ реактивный снаряд",
    "2B7F04BD402638692572B284504F993E": "Полугусеничный бронетранспортер",
    "36DB40784E861D724CAFA8BED1BB69AA": "Полугусеничный бронетранспортёр",
    "426489BC4E90BAAFDAE138B53875FBF5": "Полугусеничный бронетранспортёр",
    "4C56245747E9E3F8335B688FF9B8F0A5": "Полугусеничный бронетранспортёр",
    "5B73999D47BE22579B0761855721A5FF": "Полугусеничный бронетранспортёр",
    "988B10484A3B004AE00E488E95B576A2": "Полугусеничный бронетранспортёр",
    "9D0F590B4A1333C26A2283A0D451557D": "Полугусеничный бронетранспортёр",
    "BE6DA0764FD4E2162BC7A8947D5DAAED": "Полугусеничный бронетранспортёр",
    "CDD85623466B9FE5030799B32B30AFCA": "Молоток",
    "E2006B7D4E0B3015E0EFC38BC74B205F": "Харвестер",
    "7A71FA6B447DF998CFFF7FB781D27EE5": "Хавок Заряд",
    "EA6F15844125D4DDF48729BFD92EEA37": "Хавок Заряд",
    "F8156AF3425DD053C3323784874A9FAA": "Детонатор Хавок Заряда",
    "A046CD18495C23B23CD3A8863D6DD9E9": "Теплозащитный металлический экран защищает даже самые летучие материалы от воздействия окружающей среды, предотвращая нежелательные взрывы. ",
    "062420D14E9268B73CFC129AD58E67C5": "Снаряд тяжелой артиллерии",
    "3801AADE494D7FFC440720A61F4DE336": "Тяжелый взрывной порох",
    "E950F999416631A8104F52B22B02052E": "Тяжёлая полевая пушка",
    "7B1E2CD54F1AD0EFE056B59A24ED7B0F": "Тяжелое полевое орудие",
    "1080BA904A042F251EA61B928680E5A1": "Тяжелый Бронетранспортер Пехоты",
    "94DAEF7443BC44A8C0AEC289D9BE6AA8": "Тяжелый кинетический",
    "E24867C443961776A33E09AB756A87F1": "Тяжелый кинетический",
    "AC28ADCD458ECD65CBE718957B59CE2E": "Литейный завод тяжёлых боеприпасов",
    "6C2143B442DC95C3B44CBA84529E8D6B": "Тяжелое топливо",
    "12B07EA44CEEAA75880070896ABC7F44": "Сборка Тяжёлых Танков",
    "95865B3E41469F28FE777F87287B69F7": "Утеплённая шинель",
    "0049463D43EA65CABE6B5D932462DDF3": "Тяжёлый грузовик",
    "ACC96D97471EC4ED459C9A992AB13C8C": "Помогите строить",
    "E36F7DEC4480A32785A9F4ABBF7453E4": "Полезно",
    "8634B6EF4ADD9D581723A78FBF14A597": "Скрыть Резервный Склад от других игроков.",
    "038892D84F27968BA112D1A00F5953BB": "Тяжелый взрывной",
    "217A29504EBD8ACEF16E498C5BA3F9D5": "Тяжелый взрывной",
    "84D7BB05492FD5B7DBFE31B7E34CD0EE": "Тяжелый Фугасный",
    "D01DA79049A89F048906738536AABDD0": "Высокий шанс вывести из строя гусеницы",
    "DE69DD724B8F89FAA24A3F9CA62E23BD": "Высокий шанс повредить ходовую часть",
    "2C908B5A48AB40D82570EA903501DF60": "Высокий шанс пробить броню",
    "BF2C15C14740C3AB71FB03B3D9B9DC3C": "Дополнительный шанс к пробитию бронированной техники",
    "DF6EEF584BFD5DA2CAF57E8AF4604A9D": "Высокий шанс пробить бронетехнику",
    "A6A35D25419F581F05548BB8BB896C9F": "Высокий шанс на пробитие бронированной техники.",
    "5DDD26B74D919F2F8E88F8B546717B0B": "Высококачественные стальные балки, укрепленные Тяжелым Топливом, которые необходимы для сборки современной техники и оборудования.",
    "F6127E66469ECD53E180559ABE2465EA": "Более высокий базовый шанс вывести из строя подсистемы транспортного средства",
    "05113C3540257453624FCDA145453B61": "Высокопрочное внешнее покрытие, используемое для защиты военных судов от повреждений и износа.",
    "25B252A547FDC2F0456CDCAED5F52CF2": "Держать позицию",
    "384D311440713FB3E4E188B57DF2CEA0": "Держать Оборону",
    "73AE8F2C486724FB3D149DAB8F627017": "Удерживайте более 60% всех территорий в какой-то момент войны",
    "D3C7AC92419EE873FCCB0C95987DDE26": "Удерживайте более 75% всех территорий в какой-то момент войны",
    "6E3FC4AA4BE95498353A3FAED66DF6A5": "Госпиталь",
    "3F73A30F4289C459C814B38F7A18EFE6": "Дом",
    "9AB609E04DB475C2CC5FAE98AFD42EE3": "Дом",
    "7F3FB6F741260A09733E61A4B849B932": "Гаубичный гарнизон",
    "C71733F740481AADE9029A85262DC54E": "Гаубичный гарнизон",
    "D09EBD9045ED1976D17EDB88A80D47D4": "Гаубичный гарнизон",
    "11C5C7D9495531D19ED6F0BED7A73D71": "Huber Lariat 120мм",
    "BBD3AA484ADFD961C6C7ECB03D083A6D": "Huber Starbreaker 94.5мм",
    "8462878046431C3E447044A39AC3F726": "Подвези меня",
    "478A7F734C8366128C497390E4817CD0": "Амфитеатр Ichorus",
    "2C9571954AF0EC526149B38CB1F3C551": "В Foxhole большинство предметов, ресурсов и снаряжения используются также тысячами игроков Вашей команды.\r\n\r\nКак правило, все ресурсы общие. Однако, некоторые сооружения, техника или снаряжение могут быть зарезервированы, что тем самым временно ограничивает доступ к ним посторонних, чтобы помочь работе больших групп. \r\n\r\nИмейте в виду, что через какое-то время даже зарезервированные объекты снова окажутся доступны для всех.",
    "90629C884E1BC4AD7B1B688D8879CA4F": "В последние годы жизни O’Brien чуть не погиб во время нападения на военный пассажирский поезд во время поездки на Whedon’s Row. В ответ он поручил своей команде разработать не только машину пехоты, которая обеспечивала бы мощную защиту любому локомотиву, но и такую, от одного вида которой отпугивались бы все, кроме самых преданных нападающих, а именно ее толстая броня и мощные сдвоенные башни. ",
    "6B04D2B44B0ECF5B46F531A9EBD45928": "Для того чтобы лучше использовать свои траншеи, вам нужно улучшить их до 3-го или же \"Бетонного\" уровня.\r\n\r\nДля этого вам понадобится Бетономешалка, которую можно построить на Строительной Площадке. \r\n\r\nДля того чтобы снабдить энергией Бункерные укрепления, вам понадобиться Машинный Зал.\r\n\r\nМашинные Залы требуют деревянных Бункеров. \r\n\r\nПотом, вы должны будете построить трубы для снабжения энергией выбранной постройки.",
    "00972195402DDCD3343067BE75BBBF22": "Созданный в ответ на агрессивное наступление Легиона на северном направлении, Firebrand может без труда выжигать гарнизоны противника. Вкупе с танковой поддержкой, Firebrand, построенный на усиленном шасси Widow, представляет собой пример сокрушительной мощи природной стихии.",
    "7362FAA74653E5863BF69AA53428206F": "Зажигательный",
    "F8B8718A42B8DF489309BBBE75C21732": "Зажигательный",
    "1BDC3A5C48CCD41A5E8E3F90FFDE15D0": "Зажигательный минометный снаряд",
    "477F4FB84B4CDDBEF2BCC1A3E429DDDA": "Зажигательные боеприпасы РСЗО",
    "A2AD546C48E0C349FF50E190004959B4": "Увеличение вероятности возникновения протечки.",
    "5CA555E84201DBA81236ACA6B2788426": "Увеличенный урон по полевым постройкам",
    "8E9C45DD4A934CD02821ACA922532232": "Увеличенный урон по полевым постройкам",
    "7D6CDD574431DF05CD67D7937C843885": "Промышленные трубопроводы, позволяющие автоматически транспортировать различные жидкости и топливо в сеть труб, которые соединяются с различными конструкциями объекта.",
    "012B35954F5CFCBD99DA58BE0B4DE6FA": "Индустриальные коммуникации которые позволяют производить автоматическую транспортировку различных жидкостей и топлива. Данные трубы могут быть построены над землёй, для соединения транспортной сети в зонах с напряжённым трафиком.",
    "8E3D49684068C965DC3796B3488D5075": "Промышленные трубопроводы, позволяющие автоматически транспортировать различные жидкости и топливо. Эти специализированные трубы могут быть проложены под землей для подключения к трубопроводным сетям в районах с интенсивным движением транспорта.",
    "0DF4235247A726CC903B14BC17F6C30B": "Промышленность",
    "358F097842F9EBA78C231881FA23567B": "Пехотная униформа",
    "907A8F2C40C8D4B207F52AB96C810454": "Пехотный Вагон",
    "5D21D00045492674DCF49CBEFAB1D4C5": "Пехотный гарнизон",
    "75BC79854544E53EA78DAD9295277534": "Завод пехотных комплектов",
    "8781ED474F9A299044BC9190688F3475": "Снаряд орудия поддержки пехоты",
    "B87D2C6849DA008E12681A94DED93880": "Изначально представлявший собой Loughcaster модифицированный в полевых условиях. Hawthorne имеет отпиленный ствол и гораздо более низкий профиль, чем его предшественник. За счет снижения точности стрельбы облегченная рама позволяет использовать Hawthorne в бою и носить его вместе с более тяжелым основным оружием.",
    "9C4AD1BE4D93664EBFDF3780DFB1AFE1": "Ракетная батарея T13 \"Deioneus\", изначально предназначенная для создания мобильной платформы для громоздкого полевого оружия, представляет собой легкую танкеттку, оснащенную девятиствольной реактивной артиллерийской установкой. Эта уникальная батарея предназначена для запуска зажигательных ракет на дальность, сохраняя при этом высокую маневренность между развертываниями.",
    "409B904C4F973C80DE39AB9CAB0A923A": "Разведывательный Центр",
    "65E7A40F4AFFB93B9A7BB5852FE98F53": "Разведывательный центр",
    "7D43D62949624B5D4E92E3A3A83890AF": "Внутренняя бойница",
    "713F895344604DCFFC2599B0B08B4F30": "Железо",
    "544383254C944A19EFE8AA98A6AF2657": "Железный сплав",
    "A5674AE743C58EE9F31A0286F4BFA673": "Железный сплав можно использовать для создания прототипов техники в инженерном центре.",
    "A8496B6F4577208DA9E8939EB017D387": "Железо может быть переработано в железные сплавы, которые используются для разработки нового транспорта.",
    "9A4F2B204D19BF49A45EA882DBD0C0A9": "Ящик",
    "018F3B91423A783B639B7FAEC003F268": "Как и для прыжка, нажмите \"{0}\" для того, чтобы взобраться по лестнице. \r\n\r\nНажмите \"{1}\" или \"{2}\"' для подъема или спуска соответственно.",
    "06CE98FD41666C3DB4F9B8B5E3341354": "Крепость",
    "626D70364203D4662E3933A3AE5B600B": "Следите за перекрестием вашего прицела. Когда он сведен, у вас гораздо больше шансов попасть в цель.\r\n\r\n\r\nКаждый выстрел снижает стабильность оружия.\r\n\r\nСуществует три способа повысить стабильность. \r\n\r\nПервый: стоять на месте, пока ведешь огонь.\r\n\r\nВторой: встать на колено на \"{0}\".\r\n\r\nТретий: лечь на \"{1}\"\r\n\r\nПозиция лежа дает наибольшую стабильность оружию, но за счет вашей подвижности.\r\n",
    "4DDDB91A4021DCF5988EE6A930E366A5": "Кухня",
    "CBFCB98C4279503AD9449899EDEECAD8": "Известный во всех колониях как Король рельсов, этот тяжелобронированный железнодорожный вагон предназначен для защиты и доминирования на оспариваемых железнодорожных линиях, особенно при транспортировке грузов на оспариваемую территорию, а также для безопасной транспортировки пехоты. Этот бронированный зверь может похвастаться пушкой, направленной вперед, а также тяжелыми боковыми орудиями.",
    "76224C6D40DE8F1D52AC6AB1FAD7EBE7": "Лестница",
    "1101872643C4610FEEA5D28FC5EA44D2": "Лестницы",
    "0390DF8543C71F69CAD325A43B34555F": "Фонарь",
    "4690646349F78B22181DDDB00749F8F1": "БТР-амфибия",
    "9E1DD4F34DCF42E1265060B5E076F9D3": "БТР-амфибия",
    "AD8A7686412CC5E89AA15FAEFCCF4A23": "БТР-амфибия",
    "DBF3935B44F68435BDB1DCBB8B794E56": "БТР-амфибия",
    "80CF1FBE4EC9A8B3F4001090CBA224A2": "Участок высадки",
    "0AB28E3B44E885C1C9DAFC8F1CBFE04C": "Десантный Корабль",
    "80128971487709E6C47F628F96EA064A": "Крупнокалиберные противотанковые боеприпасы",
    "60A888024ADA81D343D7E785AADA93A1": "Большая сборочная станция",
    "263EC4E146533F91D0B4239B36B7ACF5": "Боеприпасы крупнокалиберного орудия",
    "02F8B69A49495A42BBFD8FBD9F93E3C0": "Большой кран",
    "CAE2A5A44B727D02E924A6B3368E948E": "Большой кран",
    "1BEA91F4468C042AEB44E6B841157B14": "Тяжёлое полевое орудие",
    "E7FD55034602301A5FCCCEBE1FD5219A": "Большое полевое орудие",
    "21EBE6CE42874FCD5A99A9B892E6259A": "Большой Гарнизон",
    "ADFC63DC480F2DA8D073B0B8F0DEE17F": "Крупный Предмет",
    "D4E792724F704DDEF624C1B827C3A2E2": "Большой камень",
    "94882C3A447B8955381A79A240E1CF38": "Мастерская крупных снарядов",
    "2D9EDC76462AA2683886FB9556E17D03": "Большой корабль",
    "8249657A46A3EE8E9CA9A4823F4AD7BA": "Последний рубеж",
    "1C8591114E417E5B060003BF083ABF14": "Уборная",
    "0082C2554406CA8E47120E92D77E709B": "Узнайте больше о пожарах",
    "32032B8B42A16AE8EF602F819CDABFB0": "Узнайте больше о пожарах",
    "74EDDE43424848E1E23C17AB4EB64866": "узнать о видимости",
    "9E46F1564DBB211AF78473851483F7AB": "узнать о видимости",
    "FB9866074CC43BB3B2CD9E8E05AA91F0": "Leary Shellbore 68-мм",
    "D20EC1ED4E06085C2F0FF99DB9151CAC": "Покинуть подразделение",
    "670A03504B08D046AD0E638F8ED6B724": "Покинуть это подразделение",
    "1B1A814C4FC777A07904B1A347D9F8B2": "Флаг Колонистов",
    "8BC8303B4C84D9F6D5FDE98022488F7E": "Флаг Колонистов",
    "FFD4D9B642832CFABACDC391D68A34BD": "Разведчики Легиона отправляются на самые опасные миссии. Их снаряжение легкое, прочное и хорошо подходит для длительных операций в пересеченной местности.",
    "0FB7E02B4E914C5BD561FAA4040C76CD": "Одежда легионера",
    "651803D243D685B8B874B3A08B3A88EE": "Легионерский дождевик",
    "6A11A2CF453E9B42CB16A3A6D70CD5CE": "Освободить 1 логистический город в союзной стартовой территории, когда ваша фракция владеет менее 35% городов",
    "5EDF69BD461F13ABE71564B80B110EA1": "Отвоевать 20 уникальных городов на стартовой союзной территории",
    "4DCE50B74EFD9007E0C63EA0F0B90DD8": "Отвоевать 40 разных городов на стартовой союзной территории",
    "C33BD6644BAB32A6DD7B3FA6B2654163": "Освобождение",
    "8E5023BF40374008D15B929B10296CC9": "Снаряд легкой артиллерии",
    "D377C25B4BAA7CC2063E208BD257EAA9": "Легкий фрегат",
    "013AFA104C2289826AB5D48CF9187CC1": "Лёгкий Пехотный Танк",
    "48EC82B9455992D945AD6FA1BCD07350": "Легкий баллистический",
    "94E6C52748F974CFF96E8FA4523D63C4": "Легкий кинетический",
    "DEB3F7BF4AAEB54BBEAF81AADE011C24": "Легкий пулемет",
    "04CC125A442391864552348644139DDC": "Лёгкий Танк",
    "0B8A430C4177ADCB030D988089650B1B": "Лёгкий танк",
    "276EE0EB4F509FDFB7B2C280275641F6": "Лёгкий Танк",
    "2E06E5194C85864DBE6D4088CD60F9B4": "Лёгкий Танк",
    "4D91A6614EC93344D7E3E7A5962EC665": "Лёгкий Танк",
    "CB5ED66A430DE7B766771791DF9F5C85": "Лёгкий танк",
    "F689EE6F4FC29F81ADAAADB13398E6E8": "Лёгкий Танк",
    "A871879F492DCA0E83D8D18C6B8F200A": "Легкая машина общего назначения",
    "647FC4CD4205FD8BB6C92095D228B54A": "Жидкостный контейнер",
    "19652C2E4011FD8284C74F8C1208BC18": "Станция перекачки жидкостей",
    "0E0BCD994DBE7FA08EB7F3A6E3D86FF6": "Набор для прослушивания",
    "72BFCAE84FD18AE9A6734482B47ED091": "Набор для прослушивания",
    "F09918C5426DF9ABAAC458A157554256": "Заряжающий",
    "29DB96F34F0DB4211E0BAA96C99A19A7": "Закрыть",
    "EBF48BD949DDBE9AED1F86A38C54D484": "Шкафчики",
    "3CBC2E1C4ACF2344C8E33ABF5261FC58": "Блокирует этот транспорт для других игроков.",
    "C1D0A4E647117A03ECF77FBDD130B108": "Локомотив",
    "5C66CB85462BCBEC0403D1961A5C3582": "Обучение Логистике",
    "8CF54F7F4A4F75D458EF318B8EF669A9": "Обучение Логистике",
    "B4BA894F45D24A2F0A6378830AB09308": "Обучение Логистике",
    "EE32052E4F4FDA3E5913AC83AC3CA50C": "Обучение Логистике",
    "39B535BB4CA17D4F0689DABC704ED948": "Основы логистики - Нажмите \"E\", чтобы прочитать табличку.",
    "4DE529804B88FBF076B4AC8FD09149DF": "Артиллерийский вагон дальнего действия",
    "DD502CA34C3A8980D2B9ADAC816877AC": "В открытом море о линкорах класса-Titan говорят с большим почтением и осторожностью. Оснащенные широким арсеналом пушек и орудийных установок, враги Titan скоро почувствуют его сокрушительную глубину. Republic Coastal Legion держит Titans в качестве своих знаменосцев, а на их позиции сплачиваются целые флоты. Созданный по образцу флагмана прославленного флота Амброза Леона, Titan является маяком победы для Mesean народа.",
    "DAA7E763486A04D2A8CC8F8FE9BA0C0C": "Смотри сюда",
    "402840774A2023C9CDDEBD970E90CF05": "Lyle Rycker изначально построил прототип Wasp Nest для тестирования ракетных батарей, установленных в стойке, которые в конечном итоге попадут на бронетехнику. Способный стрелять двенадцать компактных ракет в быстрой последовательности Wasp Nest очень быстро стал фаворитом в Warden пехотных испытаниях, так что официальный дизайн был реквизирован.",
    "E81BCFC54D3036A22701E9A7262B7248": "Патроны для пулемёта",
    "87BCFBA74D68323232ADF4B7558FB7B0": "Пулемётный гарнизон",
    "5A3631E046C031B8D354ECB975C8A312": "Пулемётный гарнизон (Ур. 1)",
    "5CB174014ACA2C622B96D6B67F7925CC": "Пулемётный гарнизон (Ур. 2)",
    "6BEC07FF448FB9CF98BD24A6A3B1E75D": "Пулемётный гарнизон (Ур. 3)",
    "2ADF25464310AFAC96CECAB3329DA093": "Пулемётный дот",
    "3BCD84BB47BD5DB19865AA8AF93908D2": "Волшебный ящик",
    "AB77783644E9E79C8BBFA98C20F0F7E8": "управление цистерной главного балласта",
    "0C1369294C9CECDCA9A2A9BFF55D8377": "Припасы Обслуживания",
    "BE3131BD41E6F6A39447329C32917188": "Туннель техобслуживания",
    "13FF02AA490A8D7FCF87BE88A651CBCA": "Крупное наступление",
    "21B75FDD49E8283C5AE14BBAEDBB9872": "Сделать Публичным",
    "0BAA828B4103D201AAF356891DB432D4": "Скрыть Резервные Склады",
    "418CBBF34A74487571404EBA8AB243AC": "Сделать Резервные Склады Видимыми",
    "EBB6FF0340AB4B2D611ED0924892B700": "Убедитесь в том что вы пополнили Передовую Базу солдатскими припасами.\n\r\n\r\nДля учебных целей вы можете найти их в этих ящиках\n\r\n\r\nВы можете открыть ящики, нажав кнопку \"{0}\".\r\n\r\nНажмите \"{1}\" чтобы достать один предмет, ‘SHIFT+ ЛКМ’ чтобы достать стак.\r\n\r\nПри нажатии ‘ПКМ’ на предмете открывает контекстное меню.\r\n\r\nНажмите ‘CTRL’ + ‘ЛКМ’ чтобы разделить стак пополам.\r\n\r\nНажмите ‘ALT’ + ‘ЛКМ’ чтобы выбросить предмет.\r\n\r\nЭти кнопки и их комбинации помогут вам перемещать предметы между вашим рюкзаком и другими зданиями или контейнерами, что вам и нужно будет сделать с солдатскими припасами и Передовой Базой впереди.",
    "ED64C5C24077B959A3D447A88C243906": "Фабрика массового производства",
    "68D6C1E748A103D0A695CC863AAD7070": "Поддон для материалов",
    "82E83E844856E73FD44A93B16E956026": "Станция перегрузки материалов",
    "C776334E42EE0B3A70C7BCA08985DD60": "Завод материалов",
    "AA37CE1F49ACE3544BAE289BA4731877": "Меха",
    "3C489B0749F6DF4A3056FB95246871B5": "Медик",
    "8AEBE5904E3ED7D827D57DB87FD31B79": "Медико-санитарный костюм",
    "24F8AD7D4FDE265C6AF464A2D54D4711": "Медицина",
    "E2B0C7674DBC863F0E23E8A82D32B27E": "Медпункт (Ур. 1)",
    "A02D9C0147824BDEEFF78DBD16AC69AD": "Медпункт (Ур. 2)",
    "9CACCF434C602968AF451B80FE65F866": "Медпункт (Ур. 3)",
    "848B7DCE4B91187BAC764B966CEBE50E": "Металлическая балка",
    "A1A86EF042657683CB7010B6656CE2E3": "Металлический пресс",
    "AD66D050433091A7C8FDB2A1B361A353": "Металлические балки, необходимые для производства основных сооружений, техники и оборудования на заводах.",
    "C9D214BD494A1340BF6ACD90CE2DE718": "Металлические бочки, предназначенные для хранения разных видов топлива, которые могут быть перемещены в и из Завода. Склады являются общественными.",
    "3C412CD74E6A9264E9C0A684751CE311": "Металлургический завод",
    "565BE555409EA9717AFF8CB2BE11C4E8": "Тщательно спроектированные балки из сплава, необходимые для сборки современных транспортных средств и оборудования.",
    "1561FE44404A7191D9DB8A9A975D758C": "Шахты",
    "EAEB308E4F14046B1EB4B58AE7C44D63": "Памятник",
    "D19837E24EFB743598DB7BBCE352A64C": "Торпеда Moray",
    "408A4C3846145221877C3E87DDE43CD7": "Миномет",
    "6B93E3CE46F78BC0E497E5914B37E09A": "Минометный Снаряд",
    "1BAA4FC441A303A5879934A4F1E33F5B": "Самая обычная полевая форма Варденов, предназначенная для ведения боевых действий с применением стрелкового оружия: винтовок и пулеметов.",
    "D21852374C0B433C37CDD39F6FBB7279": "Автопарк",
    "06274E914F174833CFD85E951FE0B9EA": "Моторная лодка",
    "66757AE346443F370CBC3292858E142A": "Моторная лодка",
    "B734852642166FF8CC797192E3C20883": "Моторная лодка",
    "D0643368477BCA32F57B718BC51137DB": "Станковое Противотанковое РПГ",
    "83A1D52A4F7274E908B85686B3C5B5D3": "Станковая Противотанковая Винтовка",
    "1C90DF354FAD1196EE79099BEE5437DC": "Станковый Bonesaw MK.3",
    "55BFB5094F3A43DA9B04E2B5376871E0": "Монтируемый взрыватель",
    "082A52A34CD537E02CA62B8467CC77A4": "Станковый Fissura gd.I",
    "7B1D697448540D33D29832A602D24C96": "Боеприпасы для станкового огнемёта",
    "7C04A994408BD6FD9775599FC51FA245": "Станковый гранатомет",
    "EF9D8CEA4BF99F4E49F819A4D55F8E45": "Станковое орудие поддержки пехоты",
    "692C46D74E3DDE237B60668B506FDCFA": "РПГ на треноге",
    "31194C524128B94E3C903583FA559E9E": "Мистическое строение",
    "42AABD3147EC975BB10C86A114F8E216": "Названный в честь несчастных деревьев, пострадавших при разработке этого чрезвычайно разрушительного оружия, Willow's Bane использует легковоспламеняющиеся химикаты и выпускает их концентрированной струей через открытое пламя. Это жидкое пламя поджигает огневые точки Colonial и гарнизоны, чтобы направить пехоту, превращая их оборону в груду пепла.",
    "3D5C5E1F41D2106BED8F53974091D76E": "Фрегат класса « Blacksteele», названный так за неокрашенный вид раннего прототипа, является высокоманевренным, хотя и небольшим по размеру судном. В ответ на развертывание Республиканским береговым легионом подводных лодок « Trident» \nCaoivish военно-морское командование получило фрегат Blacksteele. Разработанный как эскорт для подводных охотников, «Блэкстил» отлично справляется с атаками подводных лодок на более крупные и громоздкие корабли. Главным кораблестроителем проекта был не кто иной, как лучший Conor O’Brien’s протеже, Rory Boyd, который в последние годы жизни стал известен как мастер-кораблестроитель и в значительной степени признан человеком, стоящим за репутацией Caoivish военно-морского командования мирового класса.",
    "9FF93FAD4D5B505F5CA208B8F7FC0A53": "Корабельный сегмент корпуса",
    "8327AFDA4620DBE34D0567BD323D4A2B": "Корабельная обшивка корпуса",
    "C7D6417747F4D15585A5A88A21F10EC2": "Компоненты морских турбин",
    "41EF26954903230764250F868ADB85D0": "Завод по производству морского оборудования",
    "AFE3EC3141AD90EADB4A609EA5ADDAD6": "Морской пирс",
    "831E469040F0CB2CBD98F7BB834AA50C": "управление цистерной балласта погружения",
    "47219DCA444620491F9F2E815C73C5DA": "Полугусеничный Бронетранспортер Niska Mk. I",
    "AEA3035D40B36D003D17A9AFFD9FE831": "Некого реанимировать...",
    "EADD53AC4D23AB75789765B76AED58AF": "Пистолет-пулемет No.1 “The Liar”",
    "E428C82742147B65A32BE383EDC73ED7": "Недопустимое место для раскопок",
    "C43A8475409CC002327759AB0441BDC2": "Бесполезно",
    "A1AE84AF44F3AA89CE991A934595AE15": "Чтобы не отставать от своих аналогов, 2a-1 “Ruptura” оснащена 75-мм пушкой. Разработанный для того, чтобы помочь удерживать позиции в течение более длительного времени, “Ruptura” является прочным и эффективным средством защиты от брони.",
    "D903D1344D34B8A7CA643A9718FDC26E": "Ничто не сравнится с эффективностью и разрушительной возможностью Colonial танковой дивизией. Экипаж танка обеспечен прочными комбинезонами и поясными ремнями для легкого доступа к основным инструментам, необходимым для обслуживания и эксплуатации танка.",
    "11322B8A4F07DE6381AAE8B7AF73CE2F": "Наблюдательный бункер (Ур. 2)",
    "9165FDDA453ECB943EB77788C065E4F8": "Наблюдательный бункер (Ур. 3)",
    "F62892A14508665628B6A9BDE279D2BF": "Дозорная башня",
    "BE55BE3542BA5C1156371F94959D0996": "Иногда при добыче ресурсов вы будете обнаруживать другие материалы, например, Железо или Алюминий.\r\n\r\nЭти материалы могут быть переработаны в Сплавы, которые затем могут быть переданы в Центр Исследований в ваших тыловых логистических городах для исследования нового оружия и техники.",
    "BE8C7AA34D4A75F9A617118735A9BBF6": "Оккупированный город",
    "A492C59241101AFA893911ABE85CD3D4": "Одна из самых выдающихся дивизий Легиона это гренадеры. Они экипированы специальными подсумками и карманами для максимальной переноски взрывчатки.",
    "D7D101254ED7D335A4B9D29FE885745A": "Наступление",
    "EB05984D441EF97815BA78BCBF6886E9": "Офицерская регалия",
    "844B4C914A5CF5D0CE0D59A2DF32210A": "Наряд чиновника",
    "7DC9E23F44237A766B3DB79D7C2C63B8": "Морская платформа",
    "222115714A24BD2DB20DEBB15557F2C8": "Морские платформы — строения для извлечения из недр океана различных видов топлива. Для определенных операций требуются постоянные поставки переработанного угля, поскольку добыча материалов со дна океана - сложный процесс.",
    "19640F8242B75CD52968AF91F2B06169": "Нефть",
    "663CE0194E91F6C0425769AB380A7DD3": "Нефтяное месторождение",
    "EE4F6EC04863D4B293FFAB8C17A20AAE": "Нефтеперерабатывающий завод",
    "2C355BC64C5D5D2FC051CC9C755B0B2F": "Нефтяная скважина",
    "CE9FA4504D244C1F45048597B5A976B0": "Масло, которое было очищено и обогащено в соответствии с передовыми технологическими процессами.",
    "EE12DA2B4EBF3A35C01EFD80EE885B8B": "Помимо защиты, использование укрытия повысит вашу устойчивость. \r\n\r\nСледите за щитом в нижней части экрана. В зависимости от того, насколько глубоко вы находитесь в укрытии, будет зависеть прибавка.\r\n\r\nЕсли по вам открыли огонь, вы станете подавленным, что уменьшит и в конечном итоге сведет на нет прибавку к стабильности. Если вы будете подавлены на открытой местности, это негативно скажется на вашей стабильности.\r\n\r\nВы можете подавлять строения, стреляя по ним, что замедлит или остановит их скорость стрельбы, а также не позволит игрокам внутри них стрелять наружу. \r\n\r\nПопробуйте использовать укрытия на разных участках стены перед вами. Попробуйте стрелять в дот, пока флаг не замигает белым, что означает, что он подавлен.",
    "AACD73E5404D68218A243AB39778B5B7": "После размещения первой траншеи или Бункера, остальные траншеи и бункеры будут привязываться с доступных сторон. \r\n\r\nПопробуйте присоединить несколько траншей к разным сторонам первого укрепления. \r\n\r\nЧтобы выкопать траншею в виде буквы \"Т\" - поверните её длинной стороной к себе до привязки. \r\n\r\nНовые бункеры автоматически соединятся с уже построенными при привязке. \r\n\r\nТраншеи также можно продлить из бункера \r\n\r\nЧтобы отключить привязку, удерживайте клавишу \"Shift\". \r\n\r\nСоединительная траншея поможет соединить укрепления на более коротких дистанциях, чем их стандартный размер.",
    "4CCC4E0A4D10CE052A75A8BE15E975A5": "Одной из лучших черт Conor O’Brien была его способность модернизировать и использовать старые технологии в своих проектах. V.190 Knave является прекрасным примером этой философии. Оснащенный модифицированной, устаревшей башней с двумя гранатометами, Knave представляет собой удивительное сочетание скорости и хитрости, которое быстро разгромляет врага, оставляя его в замешательстве.",
    "F50DE88D4A5FB04A6031F5B2BB6DAA12": "Один из самых легендарных локомотивов массового рынка 0-6-2, спроектированных Bassett Motor Society, этот двигатель промышленного поезда, работающий на угле, надежен, испытан и невероятно долговечен. Наследие Black Bolt не имеет себе равных, поскольку оно помогло Bassett Motor Society поставлять продукцию в страны по всему миру.",
    "E03783F243DC4FFB8F9D71AFB2F84CB5": "Открыть причальную зону",
    "3ED75B5C446190B15FEF75816C5BE9CB": "Открывает область дока.",
    "37ABEF14452D28933B416FA267B7065A": "Оператор",
    "3627FCE942A0EC4348F4D0B0F2E360F8": "Jester изначально создавался как макет для создания более сложных ракетных платформ и получил свое прозвище благодаря реакции на безрассудные ранние прототипы, создававшиеся на базе разобранных танков King Spires. Эта необычная техника может запускать специальные ракеты на большие расстояния. Его легкое шасси позволяет быстро менять позицию для стрельбы, но при этом делает его уязвимым для диверсий.",
    "DE0F057C4EC283B2D701F0A0C673783C": "Первоначально созданный в ответ на нарастающие угрозы мезеанской брони, Outlaw исключительный средний танк вооруженный дальнобойной 40мм турелью, а также встроенным штурмовым пулеметом.",
    "82DCBA4C4DA4BAEA6ABDE78DBFDF1A92": "Нет плазмы крови",
    "858246904EA9CB58D46AE1B303D3FE6C": "Дозорная мантия",
    "B1009FD94E96F33A56106C8F696CAB9E": "Дымовая граната PT-815",
    "A46EC4D2431C5B04200D19B3E5C87D5B": "Упаковать",
    "4694E54448F16D33A72F769C96940628": "Упаковать",
    "7336A0D849EE71D00D2444887982DC53": "Упаковать оборудование в зоне погрузки",
    "03936AFA4F1D5152A03D6E81539B7A70": "Упаковывает груз в зоне погрузки для его транспортировки определенной техникой.",
    "1AD811F8444E4C52150284A7A93E3755": "Упаковывает груз для его транспортировки определенной техникой.",
    "27A7676F4E6A3EBDDAED359E5E673784": "Упаковывает это для перевозки.",
    "E3AABA6F423A53A9336B29ABE7ECA304": "Стеганный Комбинезон",
    "75EE3E7E457290010840959DB6403915": "Кладовка",
    "41A1785D4CCADD24D847ABB5CE523DF2": "Пассажир",
    "90CBF9434D8C90F0DEC11B80AD7A99AD": "Пассажир",
    "5369E1A84F6B26908AA4A894CBD8E09A": "Патрульный мотоцикл",
    "01EFAF3D45DFE2603CAC7097851E6363": "Снаряд для тяжёлых артиллерийских орудий.",
    "B3E7F92F4F9B498D3E427685B143EBCC": "Снаряд для легкой артиллерии.",
    "EA9A9C904D8E35E69F1CCF8E2D27F2F0": "Оператор перископа",
    "0C739E1D4A83CEC5E85186A6C1AD7155": "Позволяет получить доступ в этот бункер с крыши.",
    "12478EAB4CE62A389910328226C940E2": "Нефтехимический Завод",
    "3D321D484BE5C1D46A7248B3F9546D6C": "Бензин",
    "D2B4D0444D59F5D54F0AAF9A1FF441F8": "Бензиновая Электростанция",
    "EB2352AE478EED61B230ACB7EEC07D06": "Врачи в Warden армии не имеют себе равных, эта униформа имеет множество карманов и сумок созданных для ношения медикаментов и быстрого оказания помощи.",
    "3DF6455A4B74CC03B5EB3ABF3A7EA2BC": "Куртка врача",
    "B36C1FF2420C91471FFE51992BB778AA": "Труба",
    "DC78D5364E0679EFE74112BA075B833A": "Подключенный водяной насос",
    "3BE043F04A70D573ADCFAFA52E535D4B": "Трубопровод",
    "C34C8BF84C3A03BC0F712DAD1A51FD7C": "Трубопровод (Подвесной)",
    "9C33490D44084C0CE861649F1A8B5E55": "Трубопровод (Подземный)",
    "1E0788EE4A2F52EE7ED3EF8EF6DC9EF7": "Вентиль",
    "45CC94BA4824B0C1EA8CA38819F0F8C1": "Трубы",
    "60FC918C46B8F7409445CA8651E887D0": "Трубы",
    "6C68927A481C931248CD8CA686610C7C": "Трубы",
    "FFD26F834BF5B6DE894D908993CFF4F1": "Трубы",
    "124818E1483DD291FCBCC387E4F7AC38": "Трубы и Нефтяные Скважины",
    "186B2167494C1FA2A88F6AA00873675F": "Патроны для пистолета",
    "254731D94200A388888EF6ACB0519A53": "Пожалуйста, выделите все объекты в сцене",
    "8D9EF6C54313E003A2525CA1B9B813E9": "Пожалуйста, выберите захват отражения сферы в сцене",
    "BFB6CA2C407C9265D039A893D3B5CE1B": "Отравляющий газовый",
    "6AC6CB4645972A3EB08D62857CF7C4D4": "Линия электропередачи",
    "379622544742EF557AD1F0A96130CE84": "Электрический столб",
    "4D50B52B48B956C73491CF967D25CFA7": "Электростанция",
    "FC75427A4FF4A66AAC70D68BAA62202B": "Выключатель питания",
    "80A8775D432A25ABB71DCEB4F685B149": "Электроэнергия, трубы и бетон.",
    "4B255F8543C9C3F3EAA4B4822EEB75AE": "Эта простая деревянная лодка, оснащенная легким двигателем Grouper компании Bassett Motor Society, идеально подходит для переправы небольших групп пехоты через реки и между островами.",
    "198D40AC4EAF3CF14B62DA9C3F94A99C": "Разметка минного поля",
    "A196727E40488AF3107A87951A16D84A": "Разметка минного поля",
    "666BA3394B49F1F45D0C8D99DEB50E60": "Нажмите \"{0}\", чтобы сесть в технику. \r\n\r\nВы должны стоять снаружи, чтобы сесть. \r\n\r\nВнутри техники, вы можете пересаживаться используя \"{1}\", \"{2}\", \"{3}\" и т. д. Пересаживание необязательно работает для всех посадочных мест в каждой технике. ",
    "60427A5F4BC426CEE371C688D55522BB": "Нажмите \"{0}\" для бега. \r\n\r\nЕсли вы потеряетесь, откройте карту на \"{1}\". Вы можете увеличивать масштаб карты с помощью 'Колёсика мыши' и зажать ЛКМ, чтобы её перетаскивать.",
    "836DAAAF4B7BA5693722999E2AED16D5": "Нажмите \"{0}\", чтобы перепрыгнуть через низкие укрытия, например, мешки с песком, или забраться на невысокие заборы и стены.",
    "BD7656634952E8147D8D62AB4032FF47": "Нажмите \"{0}\", держа молоток в руках, чтобы открыть меню строительства. \r\n\r\nПосле выбора строения, появится его макет. \r\n\r\nУдерживайте \"{1}\" при движении мыши, чтобы поворачивать макет и нажмите \"{2}\", чтобы разместить его.\r\n\r\nПосле размещения, жмите \"{2}\" с молотком в руках, чтобы строить (при этом будут использоваться материалы).\r\n\r\nПопробуйте построить Наблюдательную Вышку на земле перед Вами.\r\n\r\nНесколько человек могут строить вместе, ускоряя процесс. \r\n\r\nНекоторые поверхности, такие как гравий позади Вас или песок не подходят для строительства, однако некоторые постройки могут не иметь таких ограничений, например - мешки с песком.",
    "8510E6D94D838BE28E709BB15EE2D8CF": "Нажмите \"Е\" чтобы прочитать.",
    "9F5B16B3459DAF29AFAE5B91F6C242EB": "Предотвращает обветшание близлежащих сооружений при наличии припасов.",
    "77F811F14E7B168F64825D85B52CB85C": "Обработанные строительные материалы",
    "E3AAFF5E4CA5596CACB8C08647348BD4": "Перерабатывающие чаны, которые перерабатывают уголь в нефть.",
    "B3F8474B4C8254DD9CA773BFDA513167": "Производит снаряды большого калибра для использования с танками и артиллерией.",
    "41F71601424CF96B828D7A9D47E8E040": "Производит различные виды боеприпасов для ракетных машин и сооружений.",
    "2DCB8DDB48017DEAD95A5A937A75BE41": "Производит различные виды станкового вооружения.",
    "6E5DDF09409408E832AF3CBB62442397": "Защищает от ядовитого газа",
    "3CAB8CCE4CE4EBDF9DE04588423DD05C": "Комплект для изготовления прототипов",
    "A9A5EC724303F2184C6F47B9A20217F8": "Комплект для изготовления прототипов",
    "233714384EF32F65D260B4BB2B75F80E": "Части Прототипов, необходимые для производства новых видов снаряжения.",
    "863E62E54DCD9AE449D147BE06F9B7BA": "Предоставляет временное место для союзных сил. Дает возможность прямого развертывания на этой базе из домашнего региона.",
    "1F61B0004D61359DE18DEDA955506DEF": "Обеспечивает прикрытие от врагов, которые проникли в этот Бункер",
    "5F8D8E0D4B9700A47014F98555B0438E": "Обеспечивает укрытие от врагов, которые вошли в этот бункер",
    "D55060854349797457E63CAC4B5266B3": "Обеспечивает укрытие от врагов, которые вошли в этот бункер",
    "9CFA53A04AAB8F7D59D78A9065DF03E9": "Предоставляет быстрый доступ внутрь и наружу из этой траншеи.",
    "287E6E724D49CDDF62A27B893324AA9C": "Обеспечивает проход в этот Бункер.",
    "8B10170E4F33E86CBECDA687A7A67154": "Обеспечивает вход в этот Бункер.",
    "F64922064BB5F5EE7E927C88240BBD0B": "Обеспечивает вход в этот Бункер.",
    "0F5FC8624CF5095689907C94D93D30F4": "Обеспечивает подключение энергии от Генераторных Установок к Модернизациям Бункера.",
    "A201D9AE4EEE90021F37DE9410D12C54": "Обеспечивает подключение энергии от Генераторных Установок к Модернизациям Бункера.",
    "A66304F4432FEF55EB504DB62752CA1B": "Обеспечивает подключение электропитания от Генераторов к Модернизациям Бункера.",
    "E29FCE7848ADF3D460455B827EC3CDC2": "Обеспечивает подключение энергии от Генераторов к Модернизациям Бункера.",
    "8F45600C4A6DE4B169381380331AB9A1": "Временный Гарнизон",
    "A0CF09784A6FDF3703E0238FA6E5941B": "Временная дорога",
    "77A87BFB4656E13D28430D80699938EB": "Качает воду по трубам. Должен быть построен на поверхности воды.",
    "22559E0249F1D9A4B4F1E98492E04F15": "Тушение пожаров",
    "682A410049D9A602187B0F9C45E31028": "Дождевик в паре с плотными непромокаемыми ботинками - лучшее решение для влажного южного климата. Вам не будет страшен даже самый сильный ураган.",
    "CEEA736D4F63F93274F9F4B5652026DF": "Скорая помощь R-12 - “Salus”",
    "1FBCBCA34E539F85603E14976D9E0576": "Пожарный автомобиль R-12b - “Salva”",
    "32DC71B84E8A3699FDA27F9B8AFFD674": "РПГ",
    "A17DBC954D8472EB87663DBD963001C9": "РПГ",
    "1A0289614E9238A19A5EB6919A6BD55A": "Выстрел РПГ",
    "A02D90114437558DB0FFC2B1D0CD65C9": "Танкер RR-3 “Stolon”",
    "7882040A4E9DD011B5595396C7678DB9": "Рация",
    "203F155C462839AE5CE288857F52D683": "Радиорюкзак",
    "11B5651547E72A8A3D82DCAB82416054": "Радиостанция",
    "55525820404120F931A25FB3ED589AB7": "Радиостанция",
    "58AEFCE54F8E98F2E6AA65AB7604DF4C": "Железнодорожные пути",
    "35E8903B4FEE62FC2F42A8A286BE2253": "Железнодорожные пути (S-образные)",
    "4413370E406D5CD49703D48F1A25C186": "Железнодорожные Пути (Бидуга)",
    "90CE9F4447D926485D79C3B74325CC63": "Железнодорожные пути (фундамент)",
    "CB9BFB744A8A0E2CCA37BF89725F19B4": "Железнодорожный путь (Фундамент)",
    "F86480E64BFE40A6C69628B0D1C4584C": "Проливной Дождь",
    "B624938C40D0C8908A11598A62E21641": "Редкие Сплавы",
    "D09BE2244DF9D9BE4934C29DE427E2A6": "Редкий металл",
    "24E8024C42E83507ACBC9D966442C164": "Прочитать табличку",
    "61469E5549BF60D9BE0C0687A36E0B03": "Прочитать табличку",
    "89379DD942E913A7636BA3B45E7F1D2A": "Прочитать табличку",
    "B1367643468F5BD3334E01A278B08341": "Прочитать табличку",
    "7727A7E94F29E56EB088A6B7CFEE1F00": "Читательская доска",
    "8D0FCD114391BFE66FBBDE8CC22E34C7": "Восстание",
    "48EDBB7147EB5FE9076D49988AAFA9EB": "Получает разведданные на карте",
    "B53C95C64C4ACBD9FD9547AED07D8C8D": "Камуфляж разведчика",
    "B9290DB845F7BA537FFC7E85AFAF68F5": "Переработчик",
    "7B14805B4515430A6FC8B4B9CA1871A9": "Пониженный урон против траншей",
    "9B9CF76243BAC0B3EC597EBC7EB330CF": "Пониженный урон против траншей",
    "C0D4E8084AE9E5A1C4A490A4D7D4A42F": "Очищенный уголь, необходимый для различных производственных процессов.",
    "964344C74C8342461DA2C8B341121701": "Рафинированные материалы",
    "7C5055A34306F42B649CF29F6C0292A8": "Рафинированные металлические прутки, необходимые для производства продвинутых сооружений, техники и оборудования на заводах.",
    "BD756A6244CDA9F2EE9D38B4E428F2D8": "Станция переработки",
    "D2170AA740CF4177019D7598C7BAE7B7": "Станция переработки",
    "C5DD20C1472BECA1CABBAFBF2E87465B": "Реформер",
    "5EEE3A3B4EC1A7ED5D703F9FE5BAFAE3": "Обновить резервацию",
    "3B89366345C4FA458F38C59488BAAC90": "Обновить Резерируемые склады",
    "E2B48E9546C1B2B9D362A2B83DBC9B22": "Обновляет текущий Резерв на это строение. Также обновляет связанные Бункеры, Заводы и Фундаменты.\r\n\r\n<RichText.Regular12.Orange>Доступно только членам Отряда, зарезервировавшего это строение.</>",
    "8595AB4F4B9D205B7C8ECEBAC4DA4380": "Ссылка на подразделение",
    "F00954E5483B0E6983A01A94535E1055": "Укрепляет стены внешней части строения, предотвращая все повреждения выше определенного порога, если не затронута критическая часть строения.",
    "BA34A1504540E1C723EB278332599B0A": "Выгрузить резервируемый склад",
    "9939E62745B383B1EAE8F88AE69B05CF": "Выгрузить ваше снаряжение на публичный склад.",
    "26AE3CA94C1D9C8B101C4DA0B27B9542": "Реликтовый штурмовой танк",
    "3DFA137548BC3989A80FA1BE5C874960": "Реликтовая База",
    "BC080A664D772FF047FB29ABFC533C59": "Реликтовые материалы",
    "C6EB4A374C74BC8F9E47388F83F7BDBB": "Снять резервацию",
    "EF2885BD4BEA3FB4B63BB5A371B647F2": "Удалить всех членов Подразделения и распустить его навсегда. ВНИМАНИЕ: Эту операцию нельзя отменить.",
    "A3E7A1B94A9A46FBF3AACFA70276323F": "Снять треножное вооружение с транспорта.",
    "538987FB41DB7DA27AE04A86EB001B65": "Ремонт",
    "A00E5DE6442055A1DBEE2CB17FF2BBBC": "Сообщает о вражеских передвижениях игрокам с рациями",
    "0CA94AFC4D90B50CC3635F912B396CDB": "Переоборудованный Грузовик",
    "14734E1441AD3F2D3F5736B465F0B518": "Перепрофилированные с древних войн, эти доспехи очень эффективны против мелкокалиберного огня. Защита достается ценой тяжести: надевший будет ощущать себя довольно скованным и нагруженным. ",
    "564E30B04DD216CDF4637782A446A0E1": "Необходим для детонирования Хавок Заряда. Хавок Заряд должен быть установлен прежде чем будет возможно установить Детонатор.",
    "AF1B7A034F1EAD11DEEF83A57F596B1F": "Система бронирования",
    "9B77C6FB4FD38E4223DF3896281B11EE": "Зарезервировать на текущий Отряд",
    "DF6832A44E1855CECD701B93FDFB5726": "Зарезервировать на текущий Отряд",
    "375D7CD84DBF0AF587ADD1A480E2F311": "Зарезервировано Отрядом",
    "FA295505471D354F4C279F8C77046DE7": "Зарезервировано Отрядом",
    "B15400FD4480235C31383C88F57298D9": "Зарезервировать несколько",
    "FC2AA8E44F8A5EDDE408C491E93D9309": "Сбросить пароль",
    "A9FA41214C4940AA99B96D8C4C6841B2": "Обновляет время сброса всех доступных резервных складов.",
    "32B13E984EC7FD17460BC2846509EBBB": "Сбрасывает пароль от этого Резервного Склада, и аннулирует доступы.",
    "6D103E044CC5EA36B2862FAF0EBF6DBE": "Ящик с ресурсами",
    "645260194768CFE6B510E38EA6DEC620": "Контейнер для ресурсов",
    "F6FC895F40774A018359F9BC423990D2": "Сборщик ресурсов",
    "5E22DF22438E32BA5D1B28A564E722F3": "Ресурсная подготовка",
    "AA79F755487A6E61B35B1BA49AE433EF": "Ресурсная подготовка",
    "6147E0B3480979F73A3F85B922D685DD": "Станция перегрузки ресурсов",
    "0C4533A44DFA9CC271010CA96A95F9D1": "Ресурс, использующийся для строительства Дорог и Фундаментов.",
    "D506B5FD47C0B9A3B5D9C5B8361DE488": "Ресурс, используемый для строительства продвинутых сооружений и производства специальных предметов.",
    "63DAF590439D5D73B0C4C9B1B4F8CF43": "Ресурс используемый для постройки базовых сооружений, а также производства основных предметов.",
    "C19CCA2F41FDEFFC10683A890F0115FA": "Ресурс, используемый для производства взрывчатых боеприпасов.",
    "A504F8984C562CEC686E90B9263BB755": "Ресурс, используемый для производства тяжелой взрывчатки.",
    "1A74322C4B604CD5CC9082A7A329AA10": "Ресурсы используются для производства всего, от боеприпасов до медицины и танков.\r\n\r\nВозьмите в руки молоток и используйте \"{0}\" на кучах металлолома. Для добычи ресурсов также можно использовать Сборщики. Для сбора компонентов и серы требуется кувалда, которую можно найти в ящике неподалеку.\r\n\r\nДля производства каждого предмета нужны свои материалы; сначала их нужно переработать.\r\n\r\nДобудьте немного ресурсов, которые можно найти впереди, погрузите их в один из грузовиков, а затем отвезите на перерабатывающий завод рядом с вами.\r\n\r\nЗдесь вы также найдете завод, где сможете использовать переработанные вами ресурсы.",
    "ADEADD7841513BA9D876B987D8873E52": "Ресурсы могут быть получены также с помощью шахт.\r\n\r\nШахты требуют топливо для своей работы, и будут самостоятельно добывать ресурсы с течением времени. \r\n\r\nОт того, какой вид топлива вы используете, зависит эффективность работы шахты. \r\n\r\nДля ознакомления, топливо предоставлено в Ящиках неподалеку. \r\n\r\nДля получения дополнительной информации, нажмите на иконку '?' в углу меню Шахты. ",
    "69D02ADF41C00920BC8C55B4606006B7": "Извлечь пациента",
    "6F8704274D00A2A6C4CD0E93D4560945": "Извлечь припасы",
    "9DD10CBE4FB59CF1842847B34A87F181": "Верните уровень воды в норму, и остановите ремонт.",
    "2234EB4E4BD90C64BCF4D4BD5CA1091D": "Реанимирование...",
    "DC7EFD9F4A62F00641076BA1193CE08E": "Револьвер",
    "4EB0EE2E4B1492B5B6D9D3AE877A6EA3": "Патроны для револьвера",
    "10C68B5E4BB769968137B0BC408CD4A0": "Патроны для винтовки",
    "AF001371424A286E942DCC860760278C": "Стрелковый гарнизон (Ур. 1)",
    "075868EB4E94FD51FD380F8C381DBD37": "Стрелковый Гарнизон (Ур. 2)",
    "42EEA7854D28A34A1AF60E82A560C939": "Стрелковый Гарнизон (Ур. 3)",
    "D96BE66A4A0B3DCBD89C599748F59F5B": "Стрелковый дот",
    "60EE65154F4BCE6F74E6D6B493A64D58": "Винтовка О",
    "A87BF94843794987636CFCB63939103B": "Реактивный снаряд",
    "B585C67849600DA80772ACB071952CFB": "Мастерская ракетного вооружения",
    "C4080A27459B901F3D243EB3FA8099EE": "Центр ядерного взрыва",
    "861B180244AD7046A21D6DB790C5F8D3": "Ракетная фабрика",
    "8A45620B4F96D41204955FB73AA2C3FA": "Ракетная цель",
    "08151D0642DC1E8836613682BB961F4F": "Убежище",
    "39EA8D5F433B7A38700E7BB3C46862A5": "Убежище",
    "3CEAF83648F676DB8CB431B02451461E": "Убежище",
    "404334B8403C9E3A2287C1B00F64170C": "управление цистерной балласта безопасности",
    "988F4FAA476CA69FC27EFD9FB02DC6A7": "Металлолом",
    "94EA0585470D4FC455D802A36F5B4DA4": "Поле Металлолома",
    "9A3374E243514176D6E8C89DE671639B": "Шахта металлолома",
    "FFF91C3540533ECCF2D46EA90D1100F6": "Сырье, которое можно переработать в другие ресурсы на перерабатывающем заводе",
    "023A1A44419A8DCFE45230A0A9BB15A8": "Автоматическая винтовка Sampo 77",
    "E6DCD38B491324D8D006BA970DC00C70": "Мешок с песком",
    "442E5D434410A70B0829D39B1B23BA32": "Мешки с песком",
    "3277B2694BA3B6C9005989849F22FAC6": "Стена из мешков с песком",
    "1F8EF85844956D33889CD2A8CCA6F273": "Мешки с песком",
    "48B66EE041A2F7B1E8D9E4911C544F41": "Мешки с песком",
    "37B739C040326A295FBAD29A69980A24": "Песочница",
    "66B0E0E4463094D80CF8E18B6331D5B4": "Сапёрное снаряжение",
    "5BE2AA79466E620400AC6482093AD4A1": "Сохранить выкладку",
    "C6572999441BBB31A9B52AA5A8D3E687": "Сохранить надетые и хранимые в рюкзаке предметы.",
    "085EFC314A5ED7E6AE5689B0618A8C76": "Рассредоточьтесь",
    "0B3D2EA049369C0D3FD8F396D7B613F1": "Разведывательный танк",
    "F07C33B944902581150548A9AAF7F565": "Разведывательный танк",
    "FC650B6C4EF1535986D761B04AAF89FD": "Морская мина",
    "68D59DCE485CB775AEE12EB44299E838": "Морской порт",
    "FF73F38B42484E3E1D06C496753F7A0E": "Оператор сенсоров",
    "DFE2613E4B8ABE897743AEAC4ED2EA6F": "Будучи передовым отрядом Republic Coastal Legion, Conquerors давно оправдывают свое название. Эти \" бестии\" оснащены вооружением для борьбы с угрозами как сверху, так и снизу, включая специализированную гидролокационную станцию и пусковые установки глубинных бомб. Командовать Conqueror впервые стала молодая девушка Diana Geminus, которая быстро поднялась по служебной лестнице со свежими идеями по защите от бесчинств северян.",
    "06DBF90B4DD3240C1C40098DB1CFE015": "Установка вашей точки возрождения",
    "4F3E821E4FDA318CF08B058FD386F55C": "Стальные балки, необходимые для большинства продвинутых процессов на Заводах.",
    "B73B1D4D43DA9CB8DB0136BC11344A66": "Полки для хранения пайков, припасов и повседневных инструментов.",
    "AC70734C44CA3C54CA0560A8605501EA": "Запакованный",
    "445A7C634ED69D6D52C88E82EA77C058": "Транспортируемая бетономешалка",
    "A7F3B6EB4123CFC0FA416FA20171BF74": "Транспортировочный контейнер",
    "E262C6A942FB94C55F814B9105327EB9": "Запакованный материал",
    "02A51A4F4CB0A44DEB11619062590179": "Грузовой контейнер",
    "D058A4D446C86625165A51A257F46A11": "Верфь",
    "9D09A3A146AC3E155096D1A43D1F9208": "Стрельбище",
    "FCAFF62D41E098930CC6AC91EA1A0A5D": "Стрельбище",
    "FDC400AE4D0E84CEEB23E28CC3021174": "Стрельбище",
    "052BCF5841333D1C3CC377A057A52E4C": "Патроны для дробовика",
    "2DF761024848E3380A5A1186CE4EE625": "Лопата",
    "A923DB774DBB0E5B5AA872A38AE17DD4": "Осколочный",
    "82BF8D5B4E37F6DCABA5029156BC176F": "Осколочный минометный снаряд",
    "A13110FE4D0F08DE3EE819A4ED437CE1": "Осадный танк",
    "A197F0D64ADFF54553133EA38D4B2F89": "Осадный танк",
    "5A701006423EBFF956AC69A033696A12": "Табличку",
    "FE03995B40473603D6AAC885C356B6D3": "Зловещий камень души",
    "75BDCECF46934EAD9C0FF688FBA4A48E": "Кувалда",
    "01DACD804657A304B84552B0D7952670": "Замедляет вражескую пехоту, пытающуюся попасть в эту Траншею.",
    "E896C1614A3C0A02B95E33A55EE0E5DB": "Замедляет вражескую пехоту, пытающуюся попасть в эту Траншею.",
    "A72B74744C2626A4D64CD7A7477004CB": "Мастерская стрелкового оружия",
    "4FB16CB541D9FCA9974A1196EA097D00": "Малая сборочная станция",
    "BA5D14694F6EBC50DB9ACDA9841DB447": "Малый товарный вагон",
    "D72085A44C5EEA57347568B340632DAD": "Малый вагон-самосвал",
    "53787B52481BBFEF3FDCD2BD7563602F": "Малый бортовой вагон",
    "4B3C13F94BE2C8B3746692A339A67DC2": "Малый Гарнизон",
    "B0E0E1AA475B9C9CB80F739E843DF3AB": "Железнодорожная колея малой колеи",
    "AB54351A4B0E35D06E641984B743B607": "Железнодорожная колея малой колеи (Бидуга)",
    "0FF966ED4A82F7C75C3F3EAE4F88F3E7": "Железнодорожные пути малой колеи (Фундамент)",
    "781A583A4DC82C26C74B0ABB7841568C": "Малый вагон-цистерна",
    "96AB0C5C45F9E3D456FDAEABD0AF8C1C": "Малый локомотив",
    "A09F66644EAC732CBE1BA9B67F0FC537": "Плавильный завод",
    "BEC08E1949B113CF432AFC95233EE8A4": "Дым",
    "EFD138C94F4E6ACA0BAC20BABB58DDAA": "Присоединение Траншей",
    "08A2A0654E9646ADF476A3987B409B4A": "Снежная буря",
    "355D8D104EF58C36507C4DB1BC7EE9C0": "Солдатское снаряжение",
    "793748BA4CC8F2C2CB1751837CB12EF0": "Солдатское снаряжение",
    "CC8548A448DFF546A96E309678841337": "Армейский ранец",
    "2B8B7F1148548A936E6B2F94A562E096": "Некоторая техника обладает вооружением, которое можно использовать с Вашей командой для уничтожения противника. \r\n\r\nЧтобы перезарядить вооружение на месте стрелка/наводчика - нажмите \"{0}\", при этом необходимо иметь боеприпасы в инвентаре техники. Попробуйте использовать Бронеавтомобиль с напарником, чтобы опробовать роль стрелка. \r\n\r\nКаждая техника в Foxhole имеет разное предназначение. Если Вы в чём-то не уверены, не стесняйтесь спрашивать.",
    "43C9867E4E3B5B3D6E3588AC743681DD": "Специальная операция",
    "70003FDD4D67F7F978E61A9C5D8871AE": "Специальные ресурсы",
    "9CC9CAC645C2303647B9A49D7CC36702": "Мастерская стрелкового оружия специального назначения",
    "7F9002FE42143E7E4F63B0828656DC2E": "Шинель специалиста",
    "8CFFFD224396FD43CB02DB8F031218C5": "Специализированные металлические листы, выкованные с использованием угля, которые необходимы для сборки современных транспортных средств и оборудования.",
    "D56912E64A1A127922EAFDB69FD686BE": "Специализированные металлические стержни, обогащенные бензином, которые необходимы для сборки современных транспортных средств и оборудования.",
    "B4C7683A495ED66B32FCE8B1EBFF0B33": "Миномётный снаряд для Мортиры",
    "17C2335C49DB89EA0BD85A810EFEA909": "Устойчивость",
    "2858B95D477BE3616909268BA1A0170D": "Служебный автомобиль",
    "C34A2FB94857EC9D681AF892CC709B74": "Служебный автомобиль",
    "4C1C4A0B4F1B09604DBDF8A0A404000A": "Лестница",
    "A4220DDE4849335CD5B4C7A5F1EA43DB": "Ступеньки",
    "051641854BE178DDD204AF91A4B95291": "Лестница, соединяющаяся с Помостами для создания проходов над большими заводскими комплексами.",
    "9BBCA83C49AFD1EB1B2556AAF6B16DF6": "Стойки",
    "4A3D5405439242282D540AA77E2D234A": "Стандартные патроны для дробовиков.",
    "4AFE485746BDCB89EF2A16AE5CECF883": "Стандартные боеприпасы для штурмовых винтовок и бронемашин.",
    "BD8270B74380C56E45276E9E7E8F9426": "Стандартные боеприпасы для ПТ винтовок.",
    "D31A1FF745293A203BE77DA22EEBB595": "Стандартные боеприпасы для пулеметов.",
    "2C5595CA46B3170887D872B2F2F54571": "Стандартные боеприпасы для пистолетов.",
    "A9DA31444CE32A93710583973166EF10": "Стандартные патроны для револьверов.",
    "3ABC7EBC4B512555E3DBA8AD24347CCF": "Стандартные боеприпасы для винтовок.",
    "7158D09B4ED91F7E9216D89DAB7C0269": "Стандартные боеприпасы для пистолетов-пулеметов.",
    "D1548AD64E2FFE72656849ADCB43AFEB": "Ракета стандартного калибра с тяжелым взрывным зарядом. Вероятность воспламенения предметов при ударе.",
    "1DE572914DDA8E281BACD9915438413E": "Ракета стандартного калибра с воспламеняющимся зарядом. Поджигает объекты в зоне поражения.",
    "AD9FC2BE4173A0DB094CFCBE92D33101": "Стандартный разрывной снаряд, используемый в некоторых видах малогабаритной техники и пехотного оружия.",
    "0CB0AF234F9F31685BA8ADAC7E4D0B24": "Стандартный пистолет Варденов. Спроектированный оружейником из Невиша Ahti Model 2 представляет собой надежное личное оружие, которое должен с гордостью носить каждый солдат.",
    "9A6DA0AE460C590A50180B94CCA2E10D": "Стандартная униформа Colonial легиона, предназначена для ведения боевых действий с применением стрелкового оружия, такого как винтовки и пулеметы.",
    "B2358CD049AFFE980ED73C82A6BCE85F": "Стандартный снаряд для боевых танков.",
    "9B3A3BC74C32D661B1C839BD38B1B105": "Стандартный снаряд для малых пушек.",
    "F0DC8DD047EDA70763142A87D753AF81": "Стандартный снаряд, используемый в штурмовых орудиях.",
    "CBF9459943B64C6C8E11D4AA292255D0": "Стандартный снаряд для противотанкового вооружения.",
    "39355B634ECF285E119E119E05600D5F": "Общевойсковой Мезейский кинжал. Его длинное и тонкое лезвие отлично подходит как для ближнего боя, так и для различных бытовых нужд.",
    "F1CB945245AA1CEFC60420A168B3E5CE": "Стандартная винтовка Варденов. Это оружие c продольно-скользящим поворотным затвором такое же мощное как и столетие назад, используемое на поле боя.",
    "533D7D4245ED3B754C6389B8AD37C383": "Стационарный кран",
    "0B79039143E31337A3FE37B7C9CCB277": "Стационарный сборщик (Уголь)",
    "3193D7AD409492DA9D7E549048AC026A": "Стационарный сборщик (Компоненты)",
    "0866E2E4410561ACD0173EADA388F07C": "Стационарный сборщик (Металлолом)",
    "49F6320A42E76498200CDA99A782CABD": "Стационарный сборщик (Сера)",
    "899CCE394D1CD3C5FA6F6CABEBD9B621": "Сталь",
    "8B527792437A4243830FC29706A49A8D": "Остановить заправку от ближайшего источника.",
    "D2BA20A445410CFFC9C78B9F85ED8A31": "Ящик для хранения",
    "6DB4ABFC45B8FCD7F96B8BBEDA844760": "Складское помещение",
    "9900BC104072715445127597CB3B16B7": "Складской объект",
    "0B894BCC45D5553B2373019737947734": "Комната хранения (Ур. 2)",
    "903CBC5C4DB8775BEA393C85D1047486": "Комната хранения (Ур. 3)",
    "D51F160B4175A8C18D3098A35D5F41EC": "Судно-хранилище",
    "AFA2AC074EC14FF9C2B2958F9A3C0AEA": "Штурмовое орудие",
    "80FE424149FBDC1DC5458B8824C8A520": "Боеприпасы штурмового орудия",
    "7AC7D1C84ECA532598277C84B7B969EE": "Штурмовая винтовка ОВ",
    "8366FD1F48B499D05AEA7A980A5104BB": "Штурмовой танк",
    "57052C6B49A9A576E8768DA30903B338": "Стратегическая карта",
    "D88C1B644C2C0C27B896F980A1374438": "Ящик с сооружениями",
    "319613AA4E24F741FCCF55B58D253EAA": "Хранилище строения",
    "1D099E8045D6579643ECA5B095EBA317": "Строения и игроки могут быть охвачены огнем.\r\n\r\nПредотвратите распространение пожара на другие строения, поливая их водой. Экипируйте ведро и наполните его водой, стоя перед колодцем, затем нажмите «{0}».\r\n\r\nНаведите ведро с водой на горящее строение, нажав «{1}», и выплесните воду, нажав «{2}».",
    "2A211FBC4AFE19F017F33AA53AEE3A78": "Патроны для пистолета-пулемёта",
    "0B4B70F64D4072C42D87F190721BFC7B": "Подводная лодка",
    "CE7236AB46FB868883B90582D70DF74F": "Субмарина",
    "BD9BF6F94FA2065AC528F6B9C859F0CA": "Сдать крупный предмет",
    "2C5AFB1D4F92381ED13DD6ABC59E3BF4": "Сдать оборудование с зоны погрузки",
    "B07DBC4C4BE06930EA53C480A2EBC43E": "Сдать пациента",
    "EA1D54C04DA274D8BD5C118DF3850282": "Сдать Стартовый Набор",
    "0201D35240A1D38F7B6B889B754BB27F": "Переместить Вещи на Склад",
    "D64EF3BC44CE2FABAA4ECBB8EAF5B822": "Сдать транспорт",
    "854D88434F54C8F105B699913FE7744A": "Передать тяжелораненого солдата из инвентаря сооружения в госпиталь. Пациенты могут быть размещены только если доступны свободные койки.",
    "C4EB8C984A19BD1DD490CCAF9220B5C6": "Отправляет оборудование из зоны погрузки на склад.",
    "0146D004490AC3150D0A4A9F23D6F35F": "Передаёт предметы из инвентаря строения в этот склад.",
    "A97B377D4D65B419A582BEBD7D8EE8AA": "Складывает предметы, которые появляются в инвентаре игрока после возрождения.",
    "68876C9049BF21CDAA575DA9766993FC": "Сдает ваш текущий транспорт. Не должно иметь пассажиров кроме водителя, инвентарь обязан быть пуст.",
    "751850F4463C0223822544A4F3918231": "Сдать ваш экипированный большой предмет.",
    "F546B4DD4883E4AF4C7FF59D6533F5AD": "Сера",
    "7F451D4442D7EE1241C7E49D1CD718EA": "Месторождение Серы",
    "820AE531463912B16EAE5F976C2FC0DA": "Серная шахта",
    "80B758FE4E346EE2AC991085E2A8AE76": "Сера может быть переработана в тяжелый взрывной порох на перерабатывающем заводе",
    "FDF2D3094624CFB09EED95B3A0AEB9CA": "Металлические стержни, обогащенные серой, которые необходимы для сборки современных транспортных средств и оборудования.",
    "86C830CF475A1F7961779CBE4F8D8022": "Серный реактор",
    "8E2344B74E1F94020521D28B189DF9A8": "Супер Танк",
    "E67DC6294A30B98591EF8A9E28C95864": "Супер Танк",
    "26BE69E14476BAC566418FAEF5981A0E": "Расходные припасы для обслуживания сооружений. Храните на Базах или в Туннелях Обслуживания, чтобы предотвратить обветшание окружающих сооружений.",
    "E513F8D94DCFF5A1D572258D1216D2D5": "Бункеры поддержки",
    "925C5D6C49E62D09957BA488EDA21D50": "Подавляет технику противника",
    "821295C1473A530D7B78578A505EBE08": "Подавляющий огонь",
    "9B0706D84171E947C9329182248ED082": "Пережить 1 день, когда ваша фракция контролирует менее 25% всех территории",
    "1B17069946CA8573587B88BA39E29B1D": "Продержаться более 2 дней, когда ваша фракция владеет менее чем 25% всей территории",
    "564F2BAB42C15509140750B7041BF5F3": "Выжить более 4 дней, когда ваша фракция контролирует менее чем 40% всех территории",
    "308E98C54020C1B935B9A6951714C6D9": "Плавание",
    "8F4F84214641CBC48D256AAD8E439F72": "Реактивный миномет T13 “Deioneus”",
    "D393C239427216CFEE9B618853C651E4": "Танкетка T14 “Vesta”",
    "818B555748C17156BC71229A32F2E408": "Танкетка T20 “Ixion”",
    "B06CAE044DC4163948A50E87ECD326D8": "Танковый завод",
    "1122285143C897768611A1B57A27BE56": "Противотанковый ёж",
    "0EFFE2024D52CF05ECFBA3822DD4AD72": "Танкетка",
    "3FD16D2F41C76A05B19205A6976B4AFB": "Танкетка",
    "8BDBF35D46B0F9B1DF4F6FB0CD17586F": "Танкетка",
    "A56BC8D54A394F83C3F6D0B35CC01425": "Танкетка",
    "F1929C02492EE23B0E74E298A81B3B65": "Комбинезон танкиста",
    "03B7C25C48FF9FC5BA38F5801CB1CC7A": "Орудие Tempest RA-2",
    "59137A27421F416A8EB0B6B27FC1750B": "Курс Молодого Бойца",
    "86EF6C0D48C2CB0D740B7A9B6E1FC1FE": "Спасибо",
    "9A7E36B74B8178096CDFB38CC56CC567": "Acheron - это бронированный амфибийный транспорт, разработанный для перевозки пехоты по воде для помощи в морских высадках и фланговых обходах. ",
    "B85728FD47AB02CB9CE5BD9F71F1092F": "\"Battering Ram\" - это мобильное полевое противотанковое орудие, стреляющее 68-мм бронебойными снарядами.",
    "F7DC4D4349BBEA58C3D503A2C46B621C": "\"Talos\" - это Velian модификация 85-й серии, оснащенная увеличенной 75-мм пушкой. Зная, что такая тяжелая пушка, скорее всего, не подойдет, инженеры сконструировали ее специально для распределения веса, чтобы шасси 85-й серии могло выдержать ее.",
    "FB7C5ECC404CCE6802B43BA9EB96FBBC": "Полевая пушка 30-250 “Tisiphone” — это мобилизованное воплощение разрушения. Пехотное подразделение, вооруженное этими минометными пушками, подает сигнал о неизбежном разрушении вражеских сооружений и позиций.",
    "60AAF3CF47DB617613EA11B55CBEE9E3": "Орудийный корабль 74b-1 Ronan Gunship специализируется на перемещении между крупными судами на высоких скоростях и легко разрушает их корпуса. Он оснащен несколькими треногами для поддержки минометной пушки в средней части корабля.",
    "EDC1300845D4F76D0D84589AA2DE48DE": "Боеголовка A0E-9 - это разрушительное взрывчатое вещество, способное уничтожить городские кварталы и даже целые небольшие города. Она испепеляет ландшафт, затрудняя противнику восстановление в ближайшем будущем. ",
    "80F355904A74E81A1017958EFD7FEDEA": "Подводный корабль класса AC-b или «Trident» привнесет в ряды Republic Coastal Legion столь необходимую универсальность. Благодаря наличию быстрозагружаемого отсека для боеприпасов «Trident» способен быстро перевооружиться и вернуться к охоте. Combat Magister Curia поручил опытным инженерам из Dimiourg разработать подводный аппарат, чтобы противостоять быстро прогрессирующим военно-морским технологиям, применяемым Wardens и Nevish Alliance. Большая часть Сената критиковала Curia за это решение, поскольку, по их мнению, разумнее было бы вложить ресурсы в инновации воздушной войны. После возвращения и передислокации нескольких успешных пробных AC-b было нетрудно убедить Сенат.",
    "B0971D2F4F52F5CEC1827B91476D630C": "Ascension Mk. V Flood снаряжён удлинённым стволом и подогнан для боёв на дальних дистанциях. ",
    "0B79EDEA473AE6A3AB26E89639BA76D3": "Basset Motor Society's Class 2 - это мобильный автокран, используемый для подъема и перемещения транспорта и тяжелого снаряжения.",
    "F8699DEE463164BEABD1AC8A6A1BB549": "Bassett Motor Society’s класса Ironship судно для перевозки снаряжения, а также тяжелого транспорта.",
    "7CB2F5544301F83080E54BB7C53660EC": "Основное судно-база Bassett Motor Society - BMS - Longhook - это прочное, надежное судно, которое является отличным центром операций по строительству и обслуживанию небольших катеров для переправы персонала и оборудования. ",
    "0699A64A4BC0951810E4888500D73451": "Blakerow - более скорострельный карабин по сравнению со своим предшественником с продольно-скользящим затвором. Повышенная скорострельность достигается за счёт снижения поражающей способности, однако универсальность и малый вес более чем компенсируют любые возможные недостатки.",
    "A2188A324C95D58E8E160FAE3162D0E4": "Корабль-хранилище Bluefin - это массивная универсальная мобильная морская станция, способная хранить ящики с ресурсами, упакованные транспортные средства и боеприпасы для дальних перевозок и переброски оборудования с берега на берег. Компания Bassett Motor Society гордится тем, что поставляет такое современное и универсальное судно в различные страны Рака, Катома и Alliant Union. ",
    "442486104B75F9025ECC9C8A5C4BD5D0": "Bomastone — это осколочная граната в форме \"палки\", разработанная для облегчения метания на умеренные расстояния.",
    "7A06F99C4E33063B047084890EF18C19": "Букер — это Штурмовая Винтовка с очередью из трех выстрелов, для тех, кто любит стрелять первым.",
    "1B2BFAB349D78169CCC6B6A25BA62399": "\"Caoivish\" создали империю из холодного, коварного севера, но великие сражения подкосили нашу некогда гордую нацию. Эти южные дикари превратили наши земли в руины и пепел.\r\n\r\nОни угрожают не только нашему дому, но и нашей истории - нашему наследию.\r\n\r\nВернём же свое.",
    "6CFB3B86427F52AC29C9D68D64DBC191": "Caravaner - это транспортная машина, предназначенная для доставки личного состава на передовую.",
    "D38B33304A774C0437BB208CBD8CF035": "Chieftan - штурмовой танк, оснащенный асимметричным вооружением, включающим 250-мм минометное орудие и 12.7мм двухствольный пулемёт.",
    "1A9B737E4D83147FCF65518288F3C40B": "Clancy Cinder — классическая мощная длинноствольная винтовка, предназначенная для боя на средних и дальних дистанциях. Впервые была использована отрядом Hands во время опасной операции в Акритии.",
    "F6524B1C4152DE0DFC39E1B586166694": "Collins Cannon - мобильное полевое противотанковое орудие, стреляющее 68-мм бронебойными снарядами.",
    "01BEC28C47A801E21D57A085F66B4EFF": "Колонисты",
    "1346466449D3A6EB2C65CCAAE033B776": "Cometa Т2-9 может похвастаться высокими поражающими характеристиками, несвойственными обычным пистолетам. Этот Estrellan пользуется популярностью уже у нескольких поколений, благодаря своей надежности и дизайну.",
    "438F3CD74363F0AAEF56CB98AB2DCEAC": "Строительная Площадка используется для создания Транспортных Контейнеров. \r\n\r\nТранспортные Контейнеры могут наполняться грузами и перевозиться на большие расстояния бортовыми грузовиками. \r\n\r\nДля того чтобы передвинуть транспортные контейнеры, сначала они должны быть упакованы, а затем перемещены краном.",
    "3E60ABC94798611BD07C9BAAEB91230B": "Пусковая Установка Катлер способен стрелять неуправляемой реактивной гранатой на короткие расстояния с поразительной эффективностью. Его простая конструкция обеспечивает легкое развертывание и хранение.",
    "15972C7545B83E4A8EB741B5B2FAA94A": "DAE 3b-2 способна запускать ракеты на дальние дистанции с закрытой, безопасной позиции. Эта уникальная установка получила своё название во время первого развёртывания, из-за криков, раздававшихся на поле боя; некоторые прозвали обстрел из орудия \"паутиной смерти\"",
    "4E1022FE4EF72440780364BDF95AF505": "Пистолет-пулемет Fiddler - широко используемое оружие городского боя. Его высокая скорострельность и компактная рама делают его идеальным для ближнего боя.",
    "59DFACCF49AF5464C57237B93B8CC783": "Бригадир - это универсальный, без излишеств, простой в сборке кран. Идеально подходит для перевозки тяжелых грузов на объектах, где погрузка и разгрузка являются обычным делом.",
    "90B06FA44793502825A9689C013556F0": "Танкер «Fuelrunner» — представляет собой более массивную версию трака Dunne, предназначенную для перевозки и распределения больших объемов топлива.",
    "61DF2EDD494F2CC91D69C89AEDA640C7": "Gast - это смертоносный, но громоздкий тяжелый пулемет из Краунии. Лучше всего показывает себя при удержании и обороне фортификаций или гарнизонных строений против подкрадывающейся пехоты.",
    "A9B9DA9741EE501731CA1D9D64935983": "HC-Class “Ballista” - это тяжелый танк, предназначенный для уничтожения обороны противника с помощью 250-мм мортирного орудия Hades.",
    "433C5B094AC1C494D76EDAB28F5F76BC": "Хангман 757",
    "8779C9AA46D16F3160701EB9B5315BB5": "Interceptor PA-12 - это судно, предназначенное для транспортировки десанта и легкой техники через большие водоемы. ",
    "2423E72544842BCA2E0DBFB11E9291FD": "Легкий танк Ironhide похож на версию Mk. III, но армированный пластинами из тяжелой стали в ущерб скорости и маневренности.",
    "FFA1F3254EF42A1EB01FFE8BD174C464": "\"Juggernaut\" - это тяжелобронированный вариант Flood, оснащенный тяжелой огнеметной башней, которая стреляет усовершенствованным клеевым порохом. Его лопатообразные нити могут препятствовать максимальной скорости, но этот зверь вполне способен работать в экстремальных погодных условиях.",
    "3C09623B4FA6DDC05E463ABFDE8D2BAC": "Mineseeker, маленький локомотив типа 0-4-0, производства Bassett Motor Society, способен на перевозку нескольких тонн груза на короткие дистанции, с небольшими расходами. Отлично подходит для операций по добыче сырья, или для организации поставок снаряжения на небольшие расстояния. ",
    "E749786542A80E615EB016AD60BEABE8": "Десантный транспортер Mulloy – бронированная машина-амфибия, предназначенная для переброски войск через большие водоемы с целью оказания помощи в скоординированных высадках на берег и фланговых атаках.",
    "C19174CB40D6F3613874B7B1346F8545": "Neville 20мм ПТ ружье не имеющих себе равных в универсальности и портативности.",
    "D7BA015D4482D3DD4E09E2AB3B642485": "Ospreay",
    "D7D148314AAE5AE1F2DC71A2EB029626": "Rampart — это мощная полевая пушка, способная нанести сокрушительный урон любой бронетехнике, кроме самой тяжелой, и в то же время обеспечить экипаж всесторонней баллистической защитой.",
    "850F3CFF42260CE5F0A038986A127D9C": "Перерабатывающий завод перерабатывает металлолом и другие сырые ресурсы в материалы, которые могут быть использованы для производства предметов, техники и строительства сооружений. \r\n\r\nДля более подробного объяснения, кликните на иконку \"?\" в верхнем правом углу меню Перерабатывающего завода.",
    "F2596A28473784B9B4EE0D87323D3527": "Машина Скорой Помощи Responder предназначена для перевозки тяжелораненых солдат и медикаментов.",
    "A4D3755B41A9F39ACA9074BAC74B3B5B": "Scrap Hauler, разработанный Bassett Motor Society, представляет собой сверхмощную машину, предназначенную для измельчения металлолома и других материалов в пригодные для переработки сырые ресурсы. Scrap Haulers часто используются для добычи ресурсов на бывших полях сражений после стычек.",
    "B82355164AD3C111D9BB5281DDA2D279": "Shorerunner - это крупное судно, переправляющее войска и легкую технику для штурма отдаленных берегов.",
    "3CAB58034B77E4113A601DA182C623FC": "Штурмовой танк Silverhand оснащен разрушительным парным вооружением и усиленной лобовой и задней броней. Его 68-мм фронтальная пушка делит корпус с более легкой 40-мм пушкой, установленной в башне. ",
    "85D2FD8A406336C041573A8F3842271D": "Snare Trap - это перепрофилированная зенитная пушка, используемая для укрепления позиций спаренными противопехотными пулеметами.",
    "E72E497544109ADFC3642B85BDBFB596": "Складское помещение - это, как следует из его названия, сооружение для хранения предметов и транспортных средств для последующего использования. \r\n\r\nВы можете отправлять ящики с товарами, транспортные средства или транспортные контейнеры. \r\n\r\nДля более подробного объяснения нажмите на значок \"?\" в правом верхнем углу меню хранилища.",
    "61C42C5947C2AFB915981DB8BFBD3815": "Тиндербокс — это простая вагонетка, используемая для перевозки жидкостей между фабриками.",
    "2C2BCDB4483B75B4E508C78B75B207A9": "РПГ Venom стреляет противотанковыми снарядами. Простая конструкция делает его удобным в использовании даже во время рискованных операций.",
    "3006E04A4C3219689DAB6BB79BE3CC65": "Флаг Варденов — смертельная метка для врагов Каоивы. Те, кто решит проигнорировать наше предупреждение, обнаружат, что их храбрость была напрасной.",
    "A39DC435465027E4B57484A26FC3B41E": "Флаг Варденов — смертельная метка для врагов Каоивы. Те, кто решит проигнорировать наше предупреждение, обнаружат, что их храбрость была напрасной.",
    "75BFB22744B204E1D95020A42DE5259C": "Warden армия полагается на outriders, которые передают и получают важную разведывательную информацию. Их снаряжение прочно и хорошо приспособлено для длительных операций в условиях пересеченной местности и непогоды.",
    "32CC66094EC863747269CBB41F09B000": "Вардены",
    "37EB16184665B74CFE1F8FADC68453A1": "В корпусе A0E-9 хранится топливо и приборы, необходимые для доставки боеголовки на большие расстояния.",
    "7A2EDF464686598F27A02389597E2DC6": "Коляска этого мотоцикла оснащена ручным пулеметом для быстрого реагирования и тактики \"бей и беги\".",
    "6D1768DD43D82B3F03D0EEA78D76D72C": "Управляющие элементы, топливопроводы и двигатели, необходимые для запуска, размещены в системе ускорителя A0E-9.",
    "3FE2286D465132CE9080E1A8636ED174": "Курс вождения предназначен для отработки основных навыков вождения. Для целей обучения мы предоставили несколько видов техники.\r\n\r\nИспользуйте \"{0}\", \"{1}\", \"{2}\", \"{3}\" для управления техникой.\r\n\r\nНажмите \"{4}\" для ручного тормоза.\r\n\r\nВнимательно следите за скоростью и плавно нажимайте на газ при входе в поворот.\r\n\r\nПо всей трассе разбросаны мишени для тренировки меткости стрельбы из Бронемашины или коляски мотоцикла. Прицеливание в транспортном средстве не имеет отличий.\r\n\r\nБудучи стрелком/наводчиком, удерживайте \"{5}\" для прицеливания и \"{6}\" для стрельбы. ",
    "815659DC48C8D296E4AB8B809187CB4E": "Первая танкетка Т-класса с более прочной рамой и универсальными гусеницами Vesta также представляет первое знакомство Велианов с огненными оружиями. Vesta может похвастаться легким огнеметом и достаточным местом для хранения необходимого дополнительного запаса топлива.",
    "9D3C842946A5960FE262A296D2643836": "Первый средний танк, разработанный Colm Gallagher - Brigand - настоящий варвар на поле боя. Не такой прочный, как его младшие братья, танк обладает повышенной маневренностью, скорострельным 30-миллиметровым орудием и башенным пулемётом, что делает его серьезным аргументом в любом танковом дивизионе. Увидев свой город в огне после стычки на границе незадолго до войны Boreal, Gallagher вырос, зациклившись на мысле о создании универсального, но прочного танка. Brigand явился плодом его навязчивой идеи.",
    "24EB8470474C85C204FA16A6F17CEDF8": "Эта простая печь является ключевым элементом любого бункера и, если построена на крепком фундаменте, служит одновременно и печкой, и очагом, обогревая приличную площадь вокруг даже в самую суровую погоду.",
    "9688E2684A7D074F7706E191E9B1BBDE": "Эта простая печь, является краеугольным камнем любого бункера, служит одновременно и духовкой, и теплом в самую холодную погоду, обогревая изрядную площадь вокруг себя, если он построен на прочном фундаменте.",
    "B1E9D8EA40AB241797F94EA444DC0819": "Эта простая печь, является краеугольным камнем любого бункера, служит одновременно и духовкой, и теплом в самую холодную погоду, обогревая изрядную площадь вокруг себя, если он построен на прочном фундаменте.",
    "7721733F48656E5E67F9319F10C8F1DB": "Пароль для Резервного Склада будет скопирован в буфер обмена, чтобы его можно было вставить куда-нибудь.",
    "A6809E4A4CDC018329BB9D801439BE26": "Пароль для этого Резервного склада будет виден в течение нескольких секунд.",
    "37E8AA9A49160F5C0BB65F8182B46B2F": "Предшественник Storm Rifle, новая Sampo автоматическая винтовка, является шедевром своего времени. Имея одиночный и автоматический режим стрельбы, эта универсальная винтовка не имеет высокой скорострельности, но с лихвой компенсирует это своей практичностью.",
    "93ABBB9F4AC1D651143243A65F44A2E8": "Гордость противотанкового арсенала Варденов, у Bonesaw MK.3 одна работа: прорезать насквозь тяжелую броню колонистких танков.",
    "17B0C0F54DEBC4AB8643AF8BAD16DD9B": "Основная винтовка пехоты Колониального Легиона. Ее предшественница, Вольта Репитер, была прочной и надежной, но имела множество ограничений, в частности, скорострельность. Аргенти лишилась этого недостатка, оказавшись еще и более компактной и легкой.",
    "115CF636401D8116087368B4F058FD86": "Звезда арсенала военной строительной техники BMS, Overseer Sky-Hauler способен переносить грузы весом в несколько тонн, словно пушинки, и отличается прекрасной маневренностью при работе на загруженных железнодорожных линиях.",
    "9295B2ED4880B5F5FE72A3AAC076A630": "Главный гарант качества военного снаряжения BMS, Overseer Sky-Hauler за свой вес, в какие-то несколько тонн, предоставляет высокий уровень мобильности на Ж/Д путях большой грузоподъёмности.",
    "FFE8175A4A9B9AD53B3265AF06D3E1CC": "Третий вариант Niska Motor Carriage оснащен спаренными пулеметамив ущерб снижению защищенности пассажиров и общей огневой мощи. Эта простая модификация первоначально была сделана инженерами на скорую руку, но быстро стала востребована бронетанковыми полками на Caoiva-Veli линии фронта.",
    "4AF095F948FB27C90642DA81420D1E42": "Оружие пиратов и контрабандистов пользуется заслуженной славой. Обладая невероятно высокой убойной силой и уникальным револьверным механизмом, Hangman часто выступает в роли судьи, присяжного и палача.",
    "9AFF016F40CE0959551A75AE28C5C9AA": "\"Chariot\" это транспорт для переброски пехоты на линию фронта.",
    "D78E1F4C4C2D5620465BA694A619F496": "Боевой танк “Halberd” усилен мешками с песком и металлическими протекторами, повышающими общую устойчивость к повреждениям. ",
    "BE1BFA70437F1D8BF9FAAA9C3DCEE46D": "Лёгкий танк “Kranesca” оснащён мощным двигателем и усиленным шасси, способным увеличить максимальную скорость за счёт общего ускорения и маневренности.",
    "BF2C21334B0DD34E51202CAADB695F6E": "“Pelekys” H-класс - это модифицированная версия лёгкого танка, имеет шасси с открытым верхом и оснащен разрушительным дальнобойным противотанковым орудием.",
    "99CB4B3F4DACA8B158FCF49B87B63479": "Скорая помощь \"Salus\" эффективна при транспортировке тяжелораненых солдат и медикаментов.",
    "A13BAC034B2297951C46C8A5E6FC5AD0": "Танк класса HC «Scorpion» представляет собой бронированную машину поддержки пехоты с двумя мощными крупнокалиберными пулеметами и радиостанцией для проведения разведки. Кроме того, для пехоты доступны сидения на внешней части корпуса. ",
    "AF3964A2441E144027F8BD83C1F986D1": "Штурмовой танк \"Spatha\" оснащён уникальной и разрушительной 40мм пушкой, стреляющей высокоскоростными снарядами. Эта специализированная башня не так хорошо подходит для серийного производства, как ее более совершенный аналог \"Falchion.\"",
    "38267B8C45DB3CCD445ED19929A2F122": "Танкер «Stolon» представляет собой более тяжелую версию шасси R-серии, созданную для перевозки и распределения больших объемов топлива.",
    "E1D7657546240C5031F6E0BAC3D9B99F": "Тяжелая полевая пушка \"Stygian Bolt\" вооружена ужасающей своей мощью 94.5мм орудием, установленном на хорошо защищенном лафете. Вдохновленные рядами узких каньонов на своей родине в Lacrista province, Mesean инженеры разработали это полевое орудие, чтобы максимально обезопасить экипаж от бокового огня, сохраняя при этом скорость движения.",
    "33A737734A491EB9964D31AF80D98C44": "Существует три типа медицинского снаряжения.\r\n\r\nЭкипируйте бинты в инвентаре и нажмите «{2}», чтобы выбрать их. Используйте Бинты на себе, чтобы остановить кровотечение. Бинт при этом расходуется.\r\n\r\nАптечки первой помощи лечат раны и требуют Бинтов.\r\n\r\nРеанимационные наборы лечат критические ранения, но требуют Плазму крови.\r\n\r\nЭкипируйте и используйте их так же, как и оружие.\r\n\r\nРеанимационные наборы и Аптечки первой помощи могут быть использованы только для лечения других игроков.\r\n\r\nВы можете помочь раненому товарищу, даже не имея при себе медикаментов. Нажмите \"{0}\" рядом с раненым, чтобы поднять и перенести его в безопасное место. Нажмите \"{1}, чтобы положить его перед медиком.\r\n\r\nТяжелораненые солдаты могут быть подняты на \"{0}\", а затем погружены в машину скорой помощи или вылечены в Госпитале или Полевом госпитале.",
    "51D3CD60463C81D302122E9B7586BBA4": "Теплозащитные экраны",
    "1D683EAB4982225ACCBB0980C5FB277F": "Эти личные шкафчики просты и удобны. ",
    "5B1EB0054208D30F4F698E9179336AD1": "Это судно BMS, Bowhead, специально разработано для перевозки большого количества ресурсных контейнеров и харвестеров. Названное в честь большого кита, судно Bassett Motor Society обеспечивает доставку ресурсов на передовую туда, где они нужны, и тогда, когда они нужны, благодаря эффективной конструкции погрузочной платформы и прочной раме.",
    "342DA28B4C4A3029FBB5F99D1C0C98CA": "Этот легкий внедорожник с ручным пулеметом представляет собой сверхтяжёлую оружейную платформу с превосходной скоростью. Идеально подходит для поддержки фланговой пехоты или танкового штурма.",
    "C56715944D01D0E14051489137350ECD": "Этот Nevish корабль превосходно справляется с задачей проделывания пробоин в корпусах Colonial флота. Вооруженный торпедами \"Moray\" и современными гидролокаторами, \"Nakki\" - бесшумный убийца. Известен случай, когда три \"Nakki\" ночью подкрались к колониальному флоту и перебили его одного за другим, что заставило префекта Эвандера объявить отступление. Их \"Легион\" оказался совершенно не готов к атаки из-под воды.",
    "C59ADBAA4C4BEFD92701E991CA0A57EC": "Этот легкий внедорожник с РПГ установкой представляет сверхмощную оружейную платформу с превосходной скоростью. Идеально подходит для поддержки фланговой пехоты или танкового штурма.",
    "BD7CD69B45945AFF7AB118ABB7F2760E": "Этот разведывательный транспорт амфибия была сильно модифицирована, чтобы с легкостью пересекать реки и озера. Выход в открытые воды нежелателен.",
    "B400D533415C222C56574C9FA19153D2": "Эта противопехотная осколочная граната разработана с использованием чеки и взрывателя с таймером для безопасности пользователя. Зубцы на корпусе обеспечивают лучший захват и повышают эффективность осколков.",
    "48932BD946AB6FDE083E5B92EC999903": "Это установит Вашу точку возрождения в этом здании. Вы можете задать по одной точке возрождения в каждом из следующих типов Базы: Домашняя, Передовая и Медицинская. Солдатское снаряжение должно присутствовать на складе строения, чтобы Вы смогли в нём возродиться.",
    "3D8515CF482C4AAD3A5D798766060897": "Этот классический пистолет-пулемет надежен и незаменим в качестве основного инструмента для ближнего боя. Pitch Gun получил свое название от Mesean моряков, которые преуспели в использовании этого оружия для защиты от ночного рейда в доках Geraston. ",
    "62EB2C6E4A48A437C7C2BAB1AF591D9E": "Это капитальная модернизация бронеавтомобиля T3 с усиленной танковой броней. В то время как эта дополнительная защита снижает общую скорость и манёвренность T12, добавление грунтозацепов обеспечивает повышенную проходимость по бездорожью.",
    "562007C64C8855278B7D439C1DD11117": "Этот курс создан для проверки вас. \r\n\r\nВозьмите друга и попросите его стрелять в вас, пока вы двигаетесь от укрытия к укрытию. Параллельно с этим стреляйте по нему в ответ. \r\n\r\nПосмотрите, сможете ли вы поразить все мишени на своем пути.",
    "5FF4998C41288C50E8A0319DDD57BF72": "Этот смертоносный танк превращает охотника в добычу. Истребитель танков Noble Widow специализируется на засадных тактиках, ожидая свою добычу и разрывая ее разрушающими скоростными снарядами.",
    "704EA4B74AD642B5CDCE20A02A87F4E0": "Плотноупакованная взрывчатая граната для уничтожения сооружений и транспорта. ",
    "32A37722413D285B62E5BE8741D607F5": "Эта разрушительная пушка ближнего действия предназначена для прямого поражения вражеских укреплений. «Wolfhound» имеет усиленную защиту и ствол диаметром 40 мм. ",
    "CCA8B7024C61056D854896AFFACF1112": "Этот ранний вариант O’Brien, V.101 Freeman оснащен 360-градусной баллистической пушкой в ущерб максимальной скорости.",
    "D5F4545E44CC54D27B13158991085715": "Этот простой в изготовлении очаг идеально подходит для поддержания тепла в холодное время года и при этом более прочен, чем простой костёр.",
    "17889A604F86533E991EEAA1F68EF899": "Дальнейшее развитие танка Bardiche; оснащен четырьмя гранатомётами и тяжёлым пулемётом калибра 12.7мм. Ranseur указывает на прогресс краунианской инженерии, продолжающей модернизацию устаревшей техники для создания смертоносного, современного вооружения.",
    "0197038F4C7A5B8632F0A4A7A0CF7EBB": "Это здание используется для хранения ящиков со снаряжением, произведенным на ближайших заводах.",
    "E366B9564B3EF37C3D682CA2F6CDBA88": "Полевая пушка - способное, хотя и несколько хлипкое противотанковое орудие, созданное из дешевых материалов, с использованием устаревших технологий. Установленная на ней 20-мм пушка может показаться древней по современным меркам, но будьте уверены, она без проблем пробивает современную броню.",
    "4014E36D487D4FBCE39BD7AC9A41D5D6": "Этот воистину колоссальный зверь - порождение ума человека по имени Gray Cullen. Дизайн танка Predator, ранее считавшийся невозможным, является представлением господина Cullen о том, как боевой корабль мог бы действовать на суше. Снаряжённый двумя четырёхствольными гранатомётами и мощнейшим фиксированным орудием калибра 94.5 мм. И несмотря на сложности в передвижении по земле накладывали определённые ограничения на проект в целом, Cullen не отступил и сделал необходимые правки для воплощения его видения идеального сухопутного корабля.",
    "5C98C2CE4BF49E1FB1FF05877CB5DE6F": "Этот тяжело бронированный ДОТ позволяет размещенным войскам с ПТ ружьями стрелять в наступающую вражескую броню из безопасных позиций.",
    "13BC4C234178F376823DC6B83C56BF19": "Это тяжелое артиллерийское орудие предназначено для уничтожения вражеских укреплений с закрытых позиций. Длинный и мощный ствол придает «Thunderbolt» выдающуюся дальность стрельбы.",
    "3DE65FF44A5B93C779BE0ABB51397AA0": "Для устойчивости этой тяжелой пехотной пушке требуется тренога. Daucus предназначен для того, чтобы дать пехоте плацдарм против вражеской техники и легких укреплений или установленных укрепленных гарнизонов.",
    "88DE9A454C873522710799A27410DA32": "Этот крупнокалиберный пулемет достаточно громоздок, чтобы для поддержания устойчивости требовалась устойчивая поверхность. Пулеметы серии Malone - непревзойденные защитники на поле боя.",
    "90D4AA2540DFD8CC95F799AF32C3B0D0": "Это сверхмощное взрывное устройство предназначено для нанесения значительного урона укрепленным сооружениям и стационарной технике. ",
    "633F232149DF0FF7181D46834EC83E7F": "Этот тяжелый грузовик с усиленными шинами изначально предназначался для перевозки крупных запасов ресурсов и тяжелого вооружения по скалистым утесам Sorovia.",
    "5920BD764CF99DB4CED8A1851C694B2E": "Эта мощная мобильная артиллерийская платформа опирается на прочные механические ноги, чтобы выдержать мощь выстрела 150-мм пушки. Вариант Lance \"Sarissa\" представляет собой нестандартное и оригинальное использование шасси Lance, обеспечивающее универсальность бронетанковых операций и снижающее значительную часть накладных расходов при транспортировке и развертывании стационарных артиллерийских батарей. ",
    "13DA94084D18594CC80AB3A9C181D9F9": "Это доступно только Автору данной постройки.\r\n\r\n<RichText.Regular12.Orange> Доступно Автору данной постройки.</>",
    "F47FB4AA4949EA79B9FF5AA1A7A301E5": "Этот модифицированный “Hatchet” оснащен усиленным топливным элементом, закрепленным сзади рядом с огнеметной башней. Этот легкий танк может выбрасывать литры горящего топлива на значительное расстояние, в то время как его экипаж остается защищенным легкой броней.",
    "3DF1B35D47B9CE4B59046D800F0D9889": "Это станковое противотанковое ружье может похвастаться высокой точностью, превосходя тем самым своих конкурентов. Обладая специальной амортизационной системой, Typhon может вести быстрый и продолжительный огонь.",
    "C84F81124E13B14FD56F39B119191D5C": "Это построенное игроком сооружение соединено с несколькими ресурсными шахтами. Нефтяная скважина соединена с трубой, по которой нефть будет автоматически поступать на нефтеперерабатывающий завод, а затем на электростанцию.\r\n\r\nНачните с посещения Нефтяной скважины и создания заказа на нефть. Установите заказ на \"Публичный\", используя выпадающее меню в левом верхнем углу. Таким образом, нефть попадет прямо в трубу, ведущую к нефтеперерабатывающему заводу.\r\n\r\nПопробуйте придумать, как перерабатывать нефть и отправлять ее по трубе на электростанцию.",
    "E0F1A98441E920DF8691F5A2A81CBFD4": "Эта надежная полевая пушка не только позволяет пехоте с легкостью стрелять тяжелыми 75-мм снарядами, но и обеспечивает современную изогнутую взрывозащиту для максимальной защиты от перекрестного огня.",
    "B26890C24C95E023BB20F4B870E107F8": "Это орудие малой дальности разработано для бомбардировки вражеской пехоты непрямыми ударами.",
    "F25F8A7A4097A9BE49ADDA98C025BA82": "Эта переносная тяжелая пусковая установка является первой в своем роде. Её особенность в наличии защитного экрана от пороховых газов, образующихся при выстреле, а также возможность запускать противотанковые снаряды на относительно большие дистанции. ",
    "61093A12400E33498D91E3A332D234F3": "Эта табличка была полезной",
    "E19BBD174F48F50EE6D0CBB3F40D91DC": "Эта табличка была бесполезной",
    "9FF2ABDF4C581B9D7BDEB4A866238209": "Этот простой вариант машины скорой помощи “Salus” оснащен мощным шлангом, предназначенным для тушения лесных пожаров.",
    "A1CD91CF4A350FD680590FA848BFA652": "Это простое двуствольное полевое ружье малой дальности обладает мощным зарядом. Экономичная конструкция обеспечивает достаточно простую сборку за счет снижения долговечности. Предназначенный для противотанковой поддержки, Cestus лучше всего использовать в тактике засады или между линиями более тяжелой брони.",
    "0E64E9AE41E3064701D69F9F30B7E9DF": "Этот простой модифицированный внедорожник оснащен армированным люком, обеспечивающим одному члену экипажа улучшенный обзор для интенсивных разведывательных операций.",
    "CCE57F0A43666D639EA4D793746C078A": "Однозарядная ракета малой дальности. Ignifist - это превосходный инструмент для пехоты, позволяющий эффективно сражаться против бронированной техники противника. ",
    "049277874CA7CF1F1F546E86F5E560E6": "Этот маленький танк вновь поступил на вооружение Варденов. Он может похвастаться высокой маневренностью и антенной, обеспечивающей связь на большие расстояния во время проведения высокорисковых разведывательных операций.",
    "5B043B4442B6B6E25CAFA0B996F519E3": "Это обычный Грузовик, оснащенный Легким Пулеметом, расположенным над пассажирским сиденьем. Предназначен для сопровождения конвоев или небольших операций.",
    "49D1A20E444A51680987CDBBCF2AF826": "Этот типовой грузовик оснащен кузовом для необработанных ресурсов, вместо стандартного тента. Это обеспечивает большую вместимость для груза, за счет увеличения кузова.",
    "CA9D64FC4F7A36C81344CAA19107CD67": "Этот стандартный грузовик оснащен ресурсным отсеком вместо стандартного грузового отсека. Это позволяет увеличить вместимость ресурсов за счет уменьшения грузового пространства. ",
    "566BD0554C6E2781BCFE47AF86AA07DB": "Это стандартный грузовик, оборудованный прочными и внедорожными гусеницами, позволяющие успешно преодолевать пересеченную местность в ущерб максимальной скорости.",
    "2D47D4064DE790F771F759A9562F1853": "Этот урезанный легкий внедорожник предоставляет дополнительные места для небольшого экипажа, чтобы использовать тактику «бей и беги».",
    "9D4DB74540030159144ED58C39288A18": "Эта униформа, хоть и не практична в бою, но выделяет главу полка. Соответствующим образом одетые офицеры могут свободно наказывать своих подчиненных. Древние Mesean офицеры были ключом к организованности Легиона. Этот современный мундир отдает должное их долгосрочному наследию.",
    "99BFB4DB4B93D2BF0AFB8FA91B6DCA60": "Эта универсальная штурмовая винтовка включает в себя барабанный магазин для ведения продолжительного быстрого огня.",
    "102C44154CF1D9B99D1C4D80F9C0175F": "Этот уникальный инструмент для разрушения представляет собой длинную металлическую трубку, начиненную взрывчаткой. Hydra’s Whisper предназначен для уничтожения структур, препятствующих движению, и подрыва любых мин по всей длине трубы.",
    "8D11C42F444FE99A9760A28D28A3C4EA": "Эта уникальная спаренная РПГ установка может выстреливать два РПГ снаряда с относительно высокой последовательностью. Это увеличение огневой мощи делает практически невозможным использование одним солдатом без прочной опоры.",
    "6F03A66044D0E60A6827568086CA30FB": "Эта уникальная винтовка производит три выстрела в быстрой последовательности. Fuscina — первая в своем роде, предназначенная для подавляющего огня во время штурма укрепленных позиций противника.",
    "E8FF49EE4B17E8AFC3F8818B69550D65": "Это уникальное вспомогательное оружие стреляет очередями по три патрона. Cascadier, возможно, не обладает останавливающей силой своих братьев, но он более чем компенсирует это своим легким весом, скрытностью и скорострельностью.",
    "22CED31B452D226343441E8A3E22814C": "Уникальный вагон, оборудованный под медпункт со станковым пулемётом, является отличным средством транспортировки тяжелораненых бойцов с поля боя в безопасный госпиталь. Когда вагон не движется, он может быть использован, как пункт Первой Помощи для лечения солдат, если в нём достаточно припасов.",
    "1F21E6DD4BFA703C3302BDAA1D3A24F6": "Этот уникальный, сверхмощный пистолет-пулемет не очень полезен если стрелять на бегу, но при тщательном прицеливании и подходящем укрытии он становится лезвием бритвы в ночи.",
    "BC78409F4C0ECAC44A3231A6A42A9711": "Вариант Bonesaw MK.3 специально сконструированный для использования с треногой. Обладает повышенной стабильностью и максимальной потенциальной дальностью.",
    "3CE22F2F4F3A747CBCDCA884C44E4B2A": "Это другой вариант стандартного R-5 Hauler который оснащён улучшенной системой управления. Однако, эти улучшения не действуют во время плохой погоды.",
    "A0ADCD954C88D93A356468B1F6FC351A": "Это удалит всю жидкость того типа, которая хранится в этой трубе, из подключенной сети, позволяя новым жидкостям течь по ней.\r\n\r\n<RichText.Regular12.Orange>Будут осушены только трубы с активным резервированием.</>",
    "FA8728E842024F1437E355AA07BCE19D": "Эта пристройка открывает возможность производства гранат и снарядов для пехоты, а также различных боеприпасов к стрелковому вооружению.",
    "5C6C2EEA4A1AF55FC3A47A9C7248BA3A": "Вариант Javelin с 360 градусной минометной платформой, разработанный для поддержки пехоты в прифронтовых операциях.",
    "399F6DCE4F5CBA8474C1508C4AB13293": "Этот вариант «Xiphos» оснащен довольно мощной противотанковой пушкой вместо спаренного пулемета.",
    "1B93331345BB6FF3A35BFB903534EABF": "Приведите себя в порядок перед едой, постирайте одежду или помойте посуду с помощью крана. Гигиена жизненно важна, чтобы избежать инфекций и болезней.",
    "4DE251764E2E9CB98C51928771111482": "Чтобы бороться с изобретательностью Caoivish, Meseans разработали свою собственную двигательную установку непрямого действия для РПГ. Сдвоенные пусковые установки устанавливаются на большой огневой платформе для максимального охвата установленной позиции, вместо того, чтобы превращаются в средство ведения партизанской войны.",
    "E65DB2424DF830078402629E7B020C22": "Для заправки техники сначала переработайте или раздобудьте дизель, или бензин. Для тренировки вы можете найти несколько канистр в ящике рядом с соседним домом. \r\n\r\nНажмите \"{0}\", чтобы открыть ваш инвентарь и кликните \"{1}\" по топливу, чтобы взять канистру в руки. \r\n\r\nПосле этого, закройте инвентарь; подойдите к технике и зажмите \"{1}\", пока у вас не закончится топливо в канистре.",
    "052DB1574987024F202489B1FEAE4546": "Установить флаг Колонистов — значит провозгласить победу Месейской республики. Ибо конец, это наша слава.",
    "8147B09D47A3391112C181AE2A6AE90E": "Установить флаг Колонистов — значит провозгласить победу Месейской республики. Ибо конец, это наша слава.",
    "D4FB33DF4C4840AF16DF0DAB116A02D0": "Для вращения камеры, удерживайте \"{0}\", пока двигаете мышку влево и вправо.",
    "CA00BF9B4DFD3ADD3A738A835C2E6EC5": "Для того чтобы выкопать траншею, сначала вам потребуется лопата. Вы найдете их в ближайшем ящике. \r\n\r\nС лопатой в руках, нажмите \"{0}\" для вызова меню строительства.\r\n\r\nВыберите строение, и когда начнете копать новую траншею, разместите выкапываемый участок так же как и любую другую постройку. \r\n\r\nПосле размещения участка, зажмите \"{1}\" чтобы начать рыть. \r\n\r\nЭто займет некоторое время, но рытьё траншей станет легче, если кто-то вам поможет.",
    "893A70814DA3AA6879BF3BB21D9FA0B9": "Переключить дополнительный режим",
    "5BB77FC346A1FA4BCB6831BBACA656C3": "Торпеда",
    "102EE32A4E97880745819385B4913327": "Город",
    "61E0F27C4EE3E93AFE0E509D4A1D310B": "Ратуша",
    "99DFC1CE459067F35E36F2A2ACF9EFA9": "Ратуша",
    "EC5440CA43513ABE394C23BBCD530C82": "Ратуша",
    "1440F4934D50CF78270BE498F0AE0479": "Прицеп",
    "14BE7BEF426146EF3128E78A44636C22": "Прицеп",
    "ECC459C14F0CE48CD3022991CF7CC1CD": "Сборка поезда",
    "44347BB848F32F07DF9580B5C674B41C": "Перенос торпеды",
    "6111A794412124E77DB764BDC5E764B7": "Перенос торпеды",
    "1D919EAF4CA41E718E1921A15807C122": "Автобус",
    "F21967B14A7EC84736BA428D37F5FA81": "Реанимационный набор",
    "45AE3BE947CAC2B2C6723C9C57D1549C": "Граната Tremola Gpb-1",
    "13A39CAB4683E6DCD140EF817D27B233": "Траншея (Ур. 1)",
    "90B803D9436F08A222133CA646C4ED14": "Траншея (Ур. 1)",
    "74E989B744FF24AB38B10AAE0F9C5B02": "Траншея (Ур. 2)",
    "84A7B5704DB2E61F06E91F819C52C317": "Траншея (Ур. 3)",
    "37D5017B45C28CAEB3966B87673330F1": "Окопная подготовка",
    "499F47EC45F69015EDF724A392D57999": "Соединительная траншея (Ур. 1)",
    "4F3155ED443FDFA70F754CB199E4AAAF": "Соединительная траншея (Ур. 2)",
    "C3A55C1546C54FACCFF7CEA671BFB545": "Соединительная траншея (Ур. 3)",
    "2EAB70C34E3EBB05E07D58A1A6D6638B": "Место копания соединительного окопа",
    "A201A9224AF73E0339266C937179F807": "Полигон для Рытья Траншей",
    "AEE1E844448E5BDD0B82DEA9791C0CB3": "Орудийная Траншея (Ур. 1)",
    "6510FCE04BBFE9D922B27A832E1D6971": "Орудийная Траншея (Ур. 2)",
    "67668840461C54A7F1420F813820A754": "Орудийная Траншея (Ур. 3)",
    "C76CD2F44CF8F03DE31A7C91D757D976": "Полигон для рытья Орудийных Траншей",
    "366CF5134202DE6C16973BAAA1FD4318": "Крыша траншеи",
    "4644E1894D3140B8737D43A0CE835F1F": "Траншейная крыша",
    "4C7D4017497B23EE9166D79AAAADF2C0": "Окопная подготовка",
    "9B3EF5104E40259744989DAC7045AAA9": "Окопная подготовка",
    "A4C117564AE6190AB53CFC8710D3AEA7": "Окопная подготовка",
    "A56BFFF74B9CA30EAB6B24ABAB803187": "Окопная подготовка",
    "F2855D994844C80CA22211B006CFACC3": "Тренога",
    "542900CE4499CCF909016A876BBE29A6": "Мастерская треножного вооружения",
    "CE3A76B545B5269AE2FE84B0A85F712F": "Треножный Станок",
    "D70C348540A1FD5F04D53A9DB446A468": "Грузовик",
    "40FEEB8C494A469902EF7A87FCEB8813": "Переломный момент",
    "0DF5EE9B47D23BA89BD8BDBAFE42246C": "Башня",
    "1213DA5A4B0BDF537953448F4D2F8694": "Башня",
    "27BFB08849208F3358852D9667D6546F": "Башня",
    "3B3A09084AB6A72C9508359B478D8EDE": "Башня",
    "3FEF6CF946193B406D9350945AEEA37B": "Башня",
    "4B0724064D1EEDC7A9D5488E52AA09D2": "Башня",
    "598E5B8340153EFCA7A6D3BB161131C8": "Башня",
    "60E8089045422DA1B1A2E5A3E544A778": "Башня",
    "8A81FBEC4F4AB329D4717BA0F51E2E4E": "Башня",
    "8C2159F0443676232F901EBB7B834510": "Башня",
    "9E00642A4E6B8A6C389472A678A7D255": "Башня",
    "A5FC1C564F1C3401609CBEA238365CD9": "Башня",
    "B0FAEB69483CE85A6384A7BBA65EA685": "Башня",
    "CAD26D5E4649E9F5D210FE939D6D929C": "Башня",
    "D3F91CED4CCDE27002DA5DBFA845EFAD": "Башня",
    "DD79EF02455A441AFFEB53A5810F988F": "Башня",
    "F296A32340E52BB50A173DA89FCCC9AD": "Башня",
    "048FF53C4C19BCF7426D3799BEA2905F": "Руководство",
    "0801268348B2957F03516AAEBE236126": "Руководство",
    "0AD7DC1D48722FFE20FC00AF20785988": "Руководство",
    "0C6FEE2F4B4B53CD8FF70D82F98D082E": "Руководство",
    "11F31E7F48003D492817CAA508C4959D": "Руководство",
    "1401BA61410E2D6FD348EDB1FC20946D": "Руководство",
    "16106CD9415ED283576A299CFE0D373E": "Руководство",
    "16F080AA4D7C2AEB55F839B5D5914B9F": "Руководство",
    "223B4F0B4549B3AF3EEAB8AB4C204ACC": "Руководство",
    "22D6D23E4AFB1AB02B6C9C8F31DD4B2A": "Руководство",
    "3078C430418B433A4D4668B31D80800C": "Руководство",
    "37FB8E894E3440A7E91289B581678404": "Руководство",
    "3AB3CB4D4DB121BD83A806BE326D8365": "Руководство",
    "3DBE3C244A6511E5F691119F04A98672": "Руководство",
    "3F221BE047BBE4812FCB2E93DA6835AA": "Руководство",
    "47D4CDF04CB43741C6036A834A87BF76": "Руководство",
    "4F05D1984A8561ABFC7881918057E045": "Руководство",
    "52BE80B74684DA4D40AFB2A89A4DDE77": "Руководство",
    "572B9CD14758B158C623CEAA87F8525D": "Руководство",
    "5FD023894EDD58242992AF98C7CCDE10": "Руководство",
    "718A184F45BAD4371C3574A431BB731D": "Руководство",
    "72113C7442D995643546F2AC1CA6B5D6": "Руководство",
    "7657C9614DE00B19B17B0880BCB44658": "Руководство",
    "7AF8CE7D4ED24F0E14B4D79E947EE9C1": "Руководство",
    "99AC17C84B64AD83934955B7DEB7B8A2": "Руководство",
    "9E7BAB2C443323C51411288EB2928436": "Руководство",
    "9EC92899484C2749A800D89AB4807B95": "Руководство",
    "A97702CF43CE1D9A8E05879927E55D64": "Руководство",
    "AC1C657642B83E91B43B6DA620F6BA1A": "Руководство",
    "B058C8C64F6A47DDBCDECB893B092CC7": "Руководство",
    "B2A0445A40555BE301A105B2B407673C": "Руководство",
    "B6B44ADB4B679713D7FEB9ABC49E432C": "Руководство",
    "CECDD4C647749F542A0B29BB0F880D68": "Руководство",
    "CFC464D0480353B30E31569CCF26EA87": "Руководство",
    "D2C4358349A6BA2AAEAF82BF8FD48AC0": "Руководство",
    "D47FF5644EA67E85547DC4B393F704F7": "Руководство",
    "D9EF56CB4B5633104DE16CB278201BC2": "Руководство",
    "DEC4ED1245F83739D887AABD6677E2F3": "Руководство",
    "E7CBE61F494897B35D5B7597BB7297C9": "Руководство",
    "F7BA4BC64E22DB0C500069A115E5540B": "Руководство",
    "FB277A0D497AC9C3F6F4649DAF6B0B6D": "Руководство",
    "FBF716CC42659C37691EDD84411823F5": "Руководство",
    "FE9EBE5E4E7AD4124BFB99BA94A7B364": "Руководство",
    "FF3FCC274138DBEA320F239AE9399879": "Руководство",
    "675ED7F84DF98FD6BD2E9AAB03EA4BED": "Непривыкшие к холоду легионеры всегда должны приспосабливаться. Эта тяжелая верхняя одежда предназначена для смягчения воздействия холода, при этом обеспечивая оптимальную мобильность и боевую эффективность.",
    "EE118DA84850EE1C3792A4A747CF7174": "Неразорвавшийся снаряд",
    "C042C76744695DF15DF744815E609F89": "Униформа",
    "F01F202E419CB6695A4B519C5F6067F5": "В отличие от 85-ой серии, Bardiche имеет более тяжелую, прочную броню и спаренный тяжелый пулемет вместе с мощным, короткоствольным орудием калибра 68-мм, установленным в башне. Современная Краунианская инженерия позволяет быстро перезаряжать орудие, делая его идеальным инструментом для борьбы с вражеской бронетехникой.",
    "75AB8FE84A86F6D4277D48B7ACF8B6C4": "Открыть",
    "7EB9C9D944A4229BC78D8DBADF5A6ED0": "Откроет это транспортное средство для использования любым игроком.",
    "390C066E4C2FA2F6C2E3D38BBB687C2E": "Распаковать",
    "97D3273D4EEB0CD842F7EFAAF4A917E0": "Разложить оборудование в зоне погрузки",
    "C572EB50426026BC88591DB9307C44AD": "Распаковывает груз в зоне погрузки.",
    "A900FC5D41B661D32B0BF6B4AAD68C60": "Распаковывает груз чтобы его можно было снова использовать.",
    "EA7E8F024DB199250BE79BA08DC92610": "Нестабильные материалы",
    "D4B956C346CA1E5642177289D323532D": "Улучшение и Модифицирование Траншей",
    "1A369228461BEFED3E331880C8F35514": "Используйте колесо мыши, чтобы поднять железнодорожные пути",
    "A075E56945A48EB182E37B92490E117E": "Используйте колесико мыши, чтобы поднять пути",
    "98D8E4BA4632C629A811DEAB3787192A": "Используйте камень, чтобы принять на себя смертельное проклятие и стать хозяином проклятого духа Авартаха.",
    "8F545E0048426B7F3E9299B3EE48F5BF": "Используйте этот камень, чтобы принять слабое проклятие и стать носителем духа, давно умершего.",
    "11F3C4D84BA7C71A4D3501AC9BB423B3": "Используйте камень, чтобы принять на себя первобытное проклятие и стать носителем злобного духа отродья Балора.",
    "53F3B85D45EA88DE3E055A87AA7D07AE": "Используйте этот, построенный игроками завод, чтобы произвести маленький поезд и переместить его на рельсы с помощью крана. В качестве топлива используйте Уголь.\r\n\r\nВы можете соединять вагоны подогнав их близко друг к другу и нажав \"{0}\" или \"{1}\", чтобы открыть контекстное меню. Чтобы расцепить вагоны - используйте гаечный ключ.\r\n\r\nПопробуйте произвести поезд, который сможет доставить Бензин до Стационарных Сборщиков, чтобы запустить их, а также доставить обратно добытый ими металлолом.",
    "8E82923E4335B05159E475AD5ADF4C61": "Используйте этот полигон, что бы потренироваться с Артиллерией. Внутри ближайших контейнеров вы найдете боеприпасы и бинокль. Прочтите таблички для дополнительной информации.",
    "F17D729E4F340088340D20A5D33A4BA1": "Используйте этот полигон, что бы поупражняться с Артиллерией. Внутри ближайших контейнеров вы найдете боеприпасы и бинокль. Прочтите таблички для дополнительной информации.",
    "5DD8ADCB4CB3A226F190A1AA1DB58A1F": "Используется медиками, чтобы лечить других солдат.",
    "B34EDE9E464113E9D2727D8F515BE792": "Используется медиками для поднятия раненных солдат.",
    "9A407F074260034D38B3A3910AB1F582": "Используется для создания современных транспортных средств.",
    "6A8A96BF4BFA6BF5A1D36FAAF6D3F982": "Используется для подключения Линий Электропередачи. К одному столбу можно подключить до 4 линий электропередач.",
    "84E9996949F3F9A11ABCADA4EF3ECEB3": "Используется для возведения укрытий из колючий проволоки.",
    "FAF8B2D74AA8A6AB2CE540907D2E30FA": "Использованный для создания защиты из металлических балок.",
    "49B8A1CF43181E9825221AA0B060DE83": "Используется для строительства укрытия из мешков с песком.",
    "AFDBDBB445543513C7DD549D7E397910": "Используется для строительства различных типов трубопроводов для транспортировки жидкостей.",
    "EC925A914580E90ADB6568904B743699": "Используется для предотвращения перемещений пехоты. Эту структуру сложно уничтожить обычным оружием и ее необходимо демонтировать с помощью Ключа.",
    "292BF39646EB298A64B12AA92E865556": "Используется для замедления пехоты противника. Может быть демонтирована при помощи Ключа.",
    "EBB791414DBF7EED5D7129B9D59B93F8": "Используется для остановки кровотечения.",
    "022C953248AF6ED5FEF83FA8F2E86696": "Используя смертоносную смесь горючих газов и химических соединений, “Molten Wind” является самым разрушительным оружием пехоты Колониального Легиона. Используя древние методы, Мезейские химики нашли способ стабилизировать и превратить жидкое пламя в оружие, которое быстро превращает любую горючую конструкцию в бушующий ад.",
    "A71DF305443FCA5170FED896D5AC982D": "Прыжки",
    "17E4C14547F7A71AAA51BB86BEF12BB9": "Транспортная и Артиллерийская подготовка",
    "20F447FC4BDF66099EC70097CA9F4369": "Транспортная и артиллерийская подготовка",
    "BE46601E4365581494C9AEA56425C932": "Бои на Технике",
    "459EEE8541430DE62B269381AE88F9E2": "Строительство транспортных средств",
    "72D954B54F5FEB3A119A8EBFD74B5EB8": "Ящик с техникой",
    "B70E5E1546EA67EA21D02AAAB032BFCD": "Транспортный склад",
    "0A06D02F4F1C6AA36F1E72983602B77C": "Обучение управлением техникой",
    "7A08F5DA42AB4991EB99F5B8A111E030": "Обучение управлением транспортом",
    "60BCB3404D4EB0A4C301C79852BE1596": "Транспортная подготовка - нажмите \"Е\" чтобы прочитать табличку.",
    "62CC261E4E964EC0D6C093B9FB735CDF": "Базовая тренировка - нажмите \"Е\" чтобы прочитать таблички.",
    "0A8A828945E1DA4C991466A5C1D6A104": "Обучение владением техникой и артиллерией",
    "AD7A3A644ABD866DB2F32C8FA46C5A28": "Детали транспортных средств, используемые для сборки реликтовой техники.",
    "B95F48F444B13FD8D00E719ED5AC27ED": "Транспорт",
    "E3061F75450C77B4E60E299E6D59B962": "Велианский бронежилет",
    "D38017A043AE35CFEB2F05BFFEE7CF5E": "Просмотр журнала действий",
    "2F4842DD437179837A5AEFBB97554DD7": "Посмотреть состояния двигателя",
    "303E6BAF46672F827D298F89D541090F": "Посмотреть состояние двигателя",
    "C279E6CE4BDE62C945649786FAE6A4F9": "Просмотр журнала глобальных событий",
    "B3F3C92A465C4140F42E8CAA25C11785": "Посмотреть пароль",
    "039F9BB6447E1116D611818272C9FFC2": "Просмотреть журнал событий в регионе",
    "18AFFBEC4AB3882672067FB09EE390B0": "Просмотр журнала действий с резервируемом складе",
    "486DDFBE41947322EC68068E52A0A271": "Просмотр журнала действий на складе",
    "0E12E2E24E1CFB7B0A277BA2D4FD48B4": "Показать Дерево Технологий",
    "E8ED3E5E4457413CE9AB36AC83258442": "Просмотреть журнал действий для текущего резервируемого склада.",
    "D7AC356C496F19916B50C0950DAC467A": "Просмотреть журнал действий для публичного склада",
    "929135D14764A4DE4D1D758BBEA86003": "Просмотреть журнал взаимодействий этой постройки.",
    "8D764ECC436284BB0A5A10B746C7447A": "Просмотреть лог потенциально опасных действий игроков во всех регионах.",
    "1F621C1648CD0F6F797ABA8BD26C451C": "Просмотреть лог потенциально опасных действий игроков в этом регионе.",
    "00EABA4949026D59CBFC278A8C37F1E6": "Видимость",
    "EC98CEBB478918935CE7DDB5D34E879B": "Видимость является важным фактором при передвижении на поле боя. \r\n\r\nВсё что ваш персонаж не видит, не будет отображаться на экране. \r\n\r\nСпрятаться в траве, за стенами и кустами может быть полезно для скрытного подхода. Передвижение разоблачит вас, и если вы прячетесь рядом с вражеским солдатом в том же кусте или в дыму, вы все равно сможете увидеть друг друга. \r\n\r\nПроверьте результаты с другими солдатами в траве спереди.",
    "918C049D42456C9C70DD2092396AC802": "Стена (Ур. 1)",
    "DC034AAE488D643B6B1597A56C68D2CF": "Стена (Ур. 1)",
    "2722AC8F406D98EB1286028B6A7AA2A1": "Стена (Ур. 2)",
    "477869B14534F0ECCC356B81E835BC25": "Стена (Ур. 2)",
    "235F30394CED001CF6916696D97B5DDC": "Стена (Ур. 3)",
    "AD1A583646C7176663CD2E91E344D554": "Стена (Ур. 3)",
    "036F7BF040A93855689455A324717E7A": "Флаг Варденов",
    "B771F26C4772777CF3F2618EE3609A33": "Флаг Варденов",
    "C436707642C26FC615E3158ECFD09DF5": "Бронированная форма Варденов",
    "00CA251B463F135BBF3EDDA4EAF8746F": "Бронеавтомобиль Варденов — быстрая бронированая машина для ведения городских боев. Этот противопехотный автомобиль оснащен спаренным пулемётом.",
    "EA2128214680435E3B4BBEA83D4E4C9E": "Инженерная форма Варденов",
    "4D0AC5244B13A47C8941009C85BCB6F5": "Форма для тяжёлых боеприпасов Варденов",
    "694BDF4449C49C96C5B048A3438DE700": "Домашний регион Варденов",
    "424D68304F36C7F3F293E69FBDFE04BD": "Форма медика Варденов",
    "6D98174942355A95E6AD3BA2F8222859": "Офицерская форма Варденов",
    "833AD3274528861D543C7FB14E4720ED": "Форма разведчика Варденов",
    "6F0900EA48A8B58CDB6E828B2AA8D91E": "Утеплённая форма Варденов",
    "AE2B8CB44BD34A19BB744581D8135EEE": "Солдатская форма Варденов",
    "E6E31CA445C3C6B7EB325191EA4894C2": "Точка возрождения Варденов",
    "B8FE7D614032796029CC4FBF1422EEEA": "Форма танкиста Варденов",
    "F616DCD34EB02F5E46FD6BA918A8AC18": "Варденская униформа",
    "05281AB24E21E26A705DBE9AAC46DBB8": "Специалистам Варденов необходима форма, улучшающая возможности по перемещению различного тяжёлого вооружения.",
    "1764606E426FEC81B69305B4734DE38A": "Душевая",
    "BF346DD64665AECE25CA7A99F559900A": "Наблюдательная вышка",
    "824288EE43F33BA537D0A898D74027D6": "Вода",
    "FF730C1E469AE4A99D457F886B7631C9": "Ведро для воды",
    "9E06F53144AC52789E387B86072A8BC9": "Водяной насос",
    "1035CEFF4BE551D6496A9E9C6D9F8094": "Обучение водному транспорту",
    "428EB85A4F85F55F5EB752BABEBBE174": "Обучение водному транспорту",
    "8433448C4D683BCAA53DFF8E67BE580D": "Вода... в банке!",
    "07C5D94D4BBEBF8187110AB4DBABB7BB": "Морская академия",
    "6D84A2D54B59F48498F7D99A884CFD10": "Морская академия",
    "B811505D48BE6582F67DB1AFB593784C": "Стойка для оружия",
    "371422D246DF0EFF137498AE1508E008": "Оружие",
    "AC69DB27422EDABB3D96D39974DFD8FC": "Оружейная Платформа",
    "315186DE41216D8FFEDA299279385EDA": "Метеостанция",
    "FB726F6049EE79E99E8FC4A14DBA35AF": "Добро пожаловать на базовое обучение по логистике. \r\n\r\nЗдесь вы сможете взаимодействовать с различными сооружениями в игре. \r\n\r\nНажмите \"{0}\", чтобы взаимодействовать с каждым сооружением. Это откроет их уникальное меню, а также их инвентарь. \r\n\r\nЕсли вы не знаете, как использовать сооружение, нажмите на \"?\" в правом верхнем углу панели меню для получения дополнительной информации. Не бойтесь расспрашивать окружающих!",
    "51FD8B2E4DFBBFDF4D56D9B36BC4C1F8": "Добро пожаловать на курс молодого бойца. \r\n\r\nЗдесь, вы ознакомитесь с различными базовыми предметами, необходимыми для успеха на передовой. \r\n\"{0}\", \"{1}\", \"{2}\", \"{3}\"\r\nЧтобы начать, пройдите вперед. Знаки по пути следования объяснят основные элементы управления и функционал игры.\r\n\r\nЕсли у вас есть вопросы о чем-либо, не стесняйтесь спрашивать в чате.",
    "12FF44B542E14ECC02F8269D9734EEFD": "Добро пожаловать на стрельбище",
    "E9B503F942ED2A2ADAC8F79B0D77053F": "Добро пожаловать на стрельбище",
    "0B8DC5AA4943CB768A61BAAD3F1EABBA": "Добро пожаловать на стрельбище. \r\n\r\nЗдесь вы можете попрактиковаться в основах перестрелки и боя.",
    "B401AA914B004B5937511A9BF775A69C": "Экипированный фильтр исключает возможность попадания опасных веществ в легкие.",
    "22D8AB584B5470EB43C7FFB73C3C7BAA": "Используя Артиллерию, вы можете контролировать её азимут и расстояние выстрела.\r\n\r\nПримечание: Для поворота орудия требуются два игрока.\r\n\r\nНажмите \"{0}\" чтобы сесть за орудие.\r\n\r\nЕсли вы справа, используйте \"{1}\", чтобы менять расстояние, если вы слева, используйте \"{2}\" и \"{3}\" чтобы менять азимут.\r\n\r\nЕсли вы справа и ваша цель выбрана, нажмите \"{4}\" для выстрела.\r\n\r\nВажно помнить, что для успешной стрельбы нужен наводчик с биноклем. Радиус обзора бинокля\nменьше, чем дальность стрельбы орудий, так что вам может понадобиться координация с фронтовым наблюдателем.\r\n\r\nОтправьте корректировщика вперед и переговаривайтесь с ним, чтобы узнать о попадании по цели.\r\n\r\nВ целях тренировки, бинокли были помещены в ближайший ящик.",
    "5A2593F2474A8350890231AB87E6E934": "В то время как величественный Firebrand Mk. XVII - смертоносный огнеметный танк, требовалось более эффективное средство применения огнеметного оружия. Войдите в Дикого Джека. Названный в честь огненных идолов, созданных детьми для Жатвы Смерти, Дикий Джек является разновидностью Highlander.",
    "4F210CDF415775E7538C53839AF2171B": "Satterley - противотанковое ружье с режимом стрельбы с отсечкой по 2 выстрела, которое несмотря на свой громоздкий размер и сильную отдачу рассчитано на использование одним человеком. Оно отлично подходит для засады на технику, с легкостью пробивая сталь, однако ввиду своего размера, не предназначено для стычек с пехотой противника.",
    "8957B70144F68175D0FA9CAB7D1B1F21": "Считающийся первой штурмовой винтовкой, Aalto является чудом Caoivish инженерной мысли. С двумя режимами стрельбы, он может быть использован как скорострельный автомат, или же как винтовка для средних дистанций.",
    "0027C25143C7C3CFA1A9B390BC088D5B": "Топливо Willow's Bane",
    "8743966042226481CA97D2AC0A86BE4D": "Ветрозащитный носок",
    "AF7B30484B84F7CB3B281FB4EC8DDD28": "Ветрозащитный носок",
    "F8A3D28742D634ECEC6163ADACD70588": "Со всем этим снаряжением, плаванье усложняется и будет забирать у вас уйму сил. \r\n\r\nВы не сможете проплыть очень далеко, не утонув, поэтому следите за своей выносливостью. Как только она закончится, вы погибните. \r\n\r\nС полным запасом выносливости, попробуйте доплыть к лестницам на другой стороне, и нажмите \"{0}\", чтобы взобраться на причал.",
    "6E1DA30B41402E67A0E14EBE1E9ABDE6": "90T-v \"Nemesis\" обладает прекрасной внедорожной проходимостью и представляет собой универсальную бронетехнику, хоть и не обладающую выдающейся защитой. 68-миллиметровая пушка и спаренный гранатомёт отлично разбивают вражеский строй. Эта уникальная машина получила свое имя при первой высадки во время экспедиции в Alliant Union. Группа танков 90T-v перехватила Вооруженный конвой Альянса Nevish, когда тот пересекал болотистую местность между камышом и топью.",
    "9CAE023F4D6042AF4DACB4AC7370BC80": "С установленным на нем пулеметом \"Doru\" является идеальным дополнением к любому штурму береговой линии. ",
    "54D8167245B1B50D9CE74B9F8C8E00A7": "Обладая усиленной броней за счет скорости, \"Hoplite\" представляет собой грозную силу в пылу боя.",
    "1A0B19764918FEB377779D9985BC3B4E": "Извлечь Тяжелораненого Солдата из койки. Пациент может быть извлечён только до его полного восстановления.",
    "B8AEACB148375A119C80A3838F06BD14": "Верстак",
    "AA602FB24C71152B3EE62896715959FD": "Карта мира",
    "74F1E8D84EEC202C23F02F959E1E4183": "Раненый игрок",
    "7FB58D0147267F48E9CF2D8FA1AB33EB": "Раненый игрок",
    "979F348E476AB09C06619CBF2E6995C2": "Обломки",
    "69F2D0974F432FDCE56A81BDE1DD86DF": "Гаечный ключ",
    "2E4B840B4AED4B87E6D74CA93E5D98FA": "основы управления транспортом",
    "3AE507584369FD2FC1DDB8A4B8737DE8": "основы управления транспортом",
    "52A39AEC4BA7A075D47F82A76AF30FD7": "основы управления транспортом",
    "8DC17D5049D5C53800E416A5849A23AE": "основы управления транспортом",
    "E46F446B4FB93483B329D6B781BE29AB": "огневой",
    "D2FFEB7A4DDFF3E02982FFB82938DAD5": "узнать о боеприпасах",
    "E9C2441C44E9328C21405B9ECD8A5B4E": "узнать о боеприпасах",
    "E747912D4465E130809C94B5A1180DED": "узнать о строительной площадке",
    "FE16BB5A4178EBDDC9BB86A2F3350916": "узнать о строительной площадке",
    "A2B07D6D44094B7CA842C5A93A04D408": "узнать о заводах",
    "DE5DAC9C4B5F7FD886D106B6C843C494": "узнать о заводах",
    "ED00BAF94AF2C27F68EC4BBF640E134D": "узнать о заводах",
    "05052DAD41CF9D748271B8BC61E763A4": "узнать больше о Фабричном производстве техники и узкоколейных поездах",
    "B15766254CBE636492CB0080D846985F": "узнать о заводском производстве транспортных средств и узкоколейных поездах",
    "C91E1797417390787B3FB59436DB01CB": "узнать о заводском производстве транспортных средств и узкоколейных поездах",
    "0AE4C8F34A5F6212CCAE4A976607CBB6": "узнать о фабриках",
    "FEC11FD847A9C6DD31D197AD6D46AAB3": "узнать о фабриках",
    "A309E0B0403AF0804C7ACCB0DD9E0035": "узнайть о трубах и нефтяных скважинах",
    "DAA0AF194D3AA860AB0664AF00C27B6B": "узнайть о трубах и нефтяных скважинах",
    "E5A7A1B84B050EB4165EE88DB78AF4F0": "узнайть о трубах и нефтяных скважинах",
    "30B855D14F4AEFBDE1676CBE54F4ACC6": "Узнайте об основных элементах управления",
    "97E0A56A40BFC7F65568AFBAF40C5D42": "узнать про основы управления",
    "EC63965742494F58F11D309A1FCCE8A9": "узнать про основы управления",
    "C368E4ED4CA40114892452977F45DD4F": "узнать об основах логистики",
    "E24061E84F11225974EB8DB0D111F6A2": "узнать об основах логистики",
    "7EE1C3A44047C1B57E37529CA65790BA": "узнать о базовой подготовке",
    "86CBA7F8444C4B7B43BE3DBFE39A9E50": "узнать о базовой подготовке",
    "8EF9CA7642541BE5AB6FB99009B8745C": "узнать о строительстве",
    "DB2FB8054A66961C6F0B7CB7C1D33F20": "узнать о строительстве",
    "7AD262E44C3C77920290DD835E1B8883": "узнать об управлении камерой",
    "8334DA784C51F1050F20668B66F70035": "узнать про управление камерой",
    "15CBAAAF444E8BB14B0225A8B9C2A8A3": "узнать о сборке техники",
    "B8F903D64635261730FDE9985CBE4555": "узнать о создании техники",
    "0088363B4641F06AFB1B6D8434D8CC45": "узнать об эффектах укрытия и подавления",
    "596A4C18475A884A349DA89C998F9125": "узнать об эффектах укрытия и подавления",
    "1648D9CB40AD089B019BACB7367D558F": "узнать о топливе",
    "3D0704E24CCF2CB9AA1235A8F65C5221": "узнать о топливе",
    "4083E87C4DAC28C312D348ADCB9AAA2C": "узнать о топливе",
    "45C660634250266DDC004084FB427F4E": "узнать о топливе",
    "7ECC25004268E3CA76406683EA80A357": "узнать о топливе",
    "A744CD30491C9AF5983FAF8851351001": "узнать о топливе",
    "C29878954260D69AF4656BABB040DB3B": "узнать о топливе",
    "038D3B2148F31508E344E6A50EEF5FC5": "узнать о гранатах",
    "43E16D3848F8183807D6488C68464915": "узнать о гранатах",
    "3D0B5D1744B51D052CAB7E9AD792C289": "узнать о лестницах",
    "E68E55A5481559D0EA824D98657DDB89": "узнать о лестницах",
    "338AAFAE4F262FAE27EF109D9A92EBAD": "узнать о медицине",
    "D698F1D7470753ED87798BBF8912B018": "узнать о медицине",
    "A0C195214C9186376B85B8A0E07D22C1": "узнать о шахтах",
    "C4ADEC65428F7683E98259ADCEB9AD1B": "узнать о шахтах",
    "020540A545F5F426A471F79933DB5F7B": "узнайте больше об энергии, трубах и бетоне",
    "44A907C8455E25A7FB9296ADA6F28752": "узнать об энергии, трубах и цементе",
    "3BB992D54076D3702B06E4BEEE604E47": "узнать о ресурсах",
    "B2F15C704927A49523FB22837FE94AF0": "узнать о ресурсах",
    "A403145C4DAD6312956840BC2F94429D": "узнать про точку возрождения",
    "D07A2DCF4E4FA1966CF19883A74152C1": "узнать про точку возрождения",
    "200F5D2948953AF1D5561B8CB45FF3EE": "узнать о сведении",
    "8C7B95FD4724AE91E4DAC983B46270ED": "узнать о стабильности",
    "1D0CDFFA404E58CDEB32A4992CC9E736": "узнать про стойки",
    "F0BD5D1A4908CF32CE87979297B8A204": "узнать про стойки",
    "D506A6924D602B067A7AF2BFA3E1B355": "узнать о плавании",
    "EF97D9524BD64CBDA61469BDEEA094C2": "узнать о плавании",
    "2B32EA074E6A4EE1C11EC39FC4A4C81F": "узнать о тестовом курсе",
    "BE91DB20459FAC26A3E71A9CA3E03203": "узнать о тестовом курсе",
    "293C49F74943881F631C7A8C056B9A50": "узнать о станции переработки",
    "51A7B2794418A064FD3D1385BE4AA6F9": "узнать о станции переработки",
    "A142E4034F175C32125BDA9DFC2FD53B": "узнать о станции переработки",
    "E1F7024F4B3A52DC2F7768BB2049A147": "узнать о станции переработки",
    "760780A44F68536E8D769D8806B5D6D6": "узнать о складских объектах",
    "970418F24E274F2DF6140AA674E73BE4": "узнать о складских объектах",
    "4E714FF343F9AFF20F76DE97DDF061E3": "узнать о радиусе артиллерии",
    "E2014FD546985D97B8AE4F8805CE855B": "узнать о радиусе артиллерии",
    "780E80A946C193372A5B86BDEEE9295B": "узнать об основах траншей",
    "A5C5B02249EC3A683756709DA8330671": "узнать об основах траншей",
    "641312794ECF05A52229039F2435C4D3": "узнать про соединения траншей",
    "EB61E5F2412949DE0C54FF9558134CC3": "узнать о прилипании траншей",
    "03763D2E47A40D779BFE48ABBD891653": "Узнайте больше об улучшениях и модификациях траншей",
    "BEF99AB346278DA350703EAFACFE8CB7": "узнать об улучшении и модификации траншей",
    "D9C68AA04C9DB47E51A7609C4C168ECA": "узнать о прыжках",
    "EB4565C64FAE40B37F19A2AB01A61057": "узнать о прыжках",
    "21C52C1445DDE46224F6D28133B8651A": "узнать об оружии",
    "47E331D448BD5876C983D48C5C614B76": "узнать об оружии",
    "7ABF21D94A081CBA5F8428A1C4C2F3B6": "открыть Карту высадки",
    "AE6DA3D94266574B76FE289A4466D6B5": "прочитать про боеприпасы",
    "FCC34A374DDE1BDF144E1E997F81B7C6": "прочитать про артиллерийские боеприпасы",
    "08EC3C104782AC39BB860CBF5AAA8944": "прочитать про артиллерийскую подготовку",
    "E9266B2B49708818A1A8DABB3CECCAEC": "прочитать про основы управления",
    "711202284F51E5F3F67B94A259957C3C": "прочитать про основы добычи",
    "82BD7AD141DF7DBCA3B8848E052BFC5C": "прочитать про базовую подготовку",
    "94A7480045AF0BD426D06787C4151763": "прочитать про строительство",
    "6A1F48124732AF8FBC4EDE96CE1BBEF5": "прочитать про управелние камерой",
    "2448B8A2473A60B402825293DD660F91": "прочитать про строительные площадки",
    "9CFE905D411686EEFBE935B8220D5129": "прочитать про укрытия и подавление",
    "09E3A48C44768734DAB94DB43F236534": "узнать больше про Фабрики",
    "8F4E011C4B9907EF624E4D84180F54D0": "прочитать про полевую артиллерию",
    "03F2BD49496DBDCC7CE2EF87EE87FBF5": "узнайте больше о пожарах и вёдрах с водой",
    "9EC484BD418FBBAAA81B13B38C51768E": "прочитать про топливо",
    "CC221D66405D5D937DDB2DBBD0013109": "узнать про Гранаты",
    "3DAFC1904E06A0330CD543AEE9AAC5C4": "прочитать про лестницы",
    "03FF59AD481859B5D3F03AAA464ADEB6": "узнать больше о Медицине",
    "CCB9F7174B8EF9603CA88C9CFFD31F4F": "прочитать про Шахты",
    "B0FC1C6D436D73B8A215069514BCE298": "прочитать про Энергию, Трубы и Бетон.",
    "A15E50C842D13938A888D394C57FC648": "прочитать про перерабатывающие заводы",
    "DBD70EAD498C06984D4D73A6412BACA8": "прочитать про точку возрождения",
    "158EA3EE4EAFD6DE2ACE90BB0EAEBBF2": "узнать больше про Присоединение Траншей",
    "42C9953244A2E547E724F2A084B337F8": "прочитать про солдатское снаряжение",
    "5152A8C6472718ADDFC3BB899B8870C4": "прочитать про специальные ресурсы",
    "BAC568854E21F76ECC6090815A03DFF6": "прочитать про устойчивость стрельбы",
    "5CDFA67D4CEF0F8585D92AA362482EC1": "узнать про Стойки",
    "5A0BE9F04E26D36AEFCFCEBA55A0EF20": "прочитать про складские объекты",
    "524C9CA04B1BEF52EFF8568BFC714EE1": "прочитать о плавании",
    "7A792E304FA050FDE3A54EA1EE886F10": "прочитать про основы строительства траншей",
    "DE6588614A4C91A7B8394E9BC978C669": "прочитать про Улучшение и Модификацию Траншей",
    "A0D11951442BED25FC916B8748F62176": "прочитать про прыжки",
    "5B8CB6644F96A5432014D6BBA080C9FC": "прочитать про видимость",
    "0A3063974DD6BA50E078B592865444DC": "узнать больше об управлении водным транспортом",
    "1F03C87A46C06A8A42506E82B683ED93": "узнать больше об оружии",
    "48353CF944B23C3C2137BABC530388F6": "прочитать о ветре",
    "F86E47C7459AA8988ACC359EDE768A70": "узнать об основах вождения",
    "0280D14E4BEDB25E13AF72B8205F922E": "прочитать про базовое обучение логистике",
    "BE048D3844ECFB09ECA443ABC68D59F0": "прочитать про заправку топливом",
    "527191D34969B0CE333D1F95180ADD22": "прочитать о стрельбище",
    "DF72F2B3479ED64AC290BA86B06B7A0C": "читайте о системе бронирования",
    "75E3D7774784307D86886AB075C41FCE": "узнать про Курс Молодого Бойца",
    "97F028E942F5E6E8605FB08AF2CE03AF": "прочитать про бои на технике",
    "39DABAB1465FEE3E79767AABA724E8CC": "прочитать про создание техники",
    "6450546E4CB6BC314CE09BB057DDA3E8": "прочитать про транспортные средства",
    "712D0E064A2AB3A2651E44BB5316562A": "прочитать отчёт",
    "67E77A2A424BF07EF7C82ABF5819F808": "прочитать табличку",
    "51C18A614140C992A0A56AB2E32D7B2D": "посмотреть ход войны",
    "082F996F443450ADAA53759564EB09F6": "узнать об артиллерии",
    "28A0B67A47D6A5005E69C69E81990A9C": "узнать об артиллерии",
    "B9116999448514474BF020A8533216B0": "узнать об артиллерии",
    "71E8568F4C38101A2F23159D46A04EBE": "узнать о вооружении транспорта",
    "E0BA5C464F90932280B594B962D17DEA": "узнать о вооружении машины",
    "011B5AEE44AE74D7485D56B68B3CB9AF": "узнать о транспортных средствах",
    "11D5F20A432A71B07E745F8FC7D0DF1E": "узнать о технике",
    "887539864C80B1027E005581B6F575E3": "узнать о транспорте",
    "E8E840F348003C254669E98F8A4FF38F": "узнать о транспорте",
    "22136F9849FE26E3CB5B679431A1B0FB": "осмотреть Мемориал",
    "DC49F557408D54D58463F3B9A504E112": "Топливо “Molten Wind” v.II",
    "1B1D7EE34D1F9D18ABDAE0AB42CAAF45": "Огнемет “Molten Wind” v.II"
  },
  "STActions": {
    "ActionAim": "Прицеливание",
    "ActionAimToggle": "Переключатель прицеливания",
    "ActionAppendMapCoordinates": "Добавить координаты карты",
    "ActionBuild": "Строить",
    "ActionCenterMapOnPlayer": "Центр карты на игроке",
    "ActionChangeChatTab": "Сменить вкладку чата",
    "ActionChangeGear": "Сменить передачу",
    "ActionEmoteCheer": "Радоваться",
    "ActionCameraZoom": "Приближение камеры",
    "ActionClimb": "Лезть",
    "ActionCycleTabBackward": "Переключить вкладку влево",
    "ActionCycleTabForward": "Переключить вкладку вправо",
    "ActionEmbarkContextMenu": "Перейти в контекстное меню",
    "ActionEquipPrimary": "Выбрать основной предмет",
    "ActionEquipSecondary": "Выбрать вспомогательный предмет",
    "ActionEquipTertiary": "Выбрать третичный предмет",
    "ActionFire": "Стрельба",
    "ActionForceDropLargeItem": "Выбросить Крупный Предмет",
    "ActionEmoteGoForward": "Вперёд!",
    "ActionEmoteHalt": "Стой!",
    "ActionHandbrake": "Ручной тормоз",
    "ActionInteractContextMenu": "Контекстное меню взаимодействия",
    "ActionInventory": "Инвентарь",
    "ActionLockVehicle": "Закрыть транспорт",
    "ActionMount": "Установить",
    "ActionMoveBack": "Двигаться назад",
    "ActionMoveForward": "Двигаться вперёд",
    "ActionMoveLeft": "Двигаться влево",
    "ActionMoveRight": "Двигаться направо",
    "ActionInteractLargeItem": "Поднять/Положить/Внести Крупный Предмет",
    "ActionPlaceCallout": "Разместить выноску",
    "ActionPlaceStructure": "Разместить сооружение",
    "ActionPlayerInteractMode": "Режим взаимодействия с игроком",
    "ActionPushToTalkSquad": "Нажми-чтобы-говорить голосового чата отряда",
    "ActionPushToTalkLocal": "Нажми-чтобы-говорить локального голосового чата",
    "ActionRadioBackpackTransmit": "Радиоприемник для передачи",
    "ActionEmoteRallyPoint": "Точка сбора",
    "ActionReload": "Перезарядка",
    "ActionReply": "Ответить",
    "ActionRotateCamera": "Вращать камеру",
    "ActionRotateCameraLeft": "Повернуть Камеру Налево",
    "ActionRotateCameraRight": "Повернуть Камеру Направо",
    "ActionRotateStructure": "Вращать сооружение",
    "ActionEmoteSalute": "Отдать честь",
    "ActionSpectateNextPlayer": "Наблюдать за следующим игроком",
    "ActionSpectatePreviousPlayer": "Наблюдать за предыдущим игроком",
    "ActionSprint": "Бег",
    "ActionEmoteSurrender": "Сдаться",
    "ActionSwitchSeats": "Сменить места",
    "ActionSwitchToSeat01": "Пересесть на место 01",
    "ActionSwitchToSeat02": "Пересесть на место 02",
    "ActionSwitchToSeat03": "Пересесть на место 03",
    "ActionSwitchToSeat04": "Пересесть на место 04",
    "ActionSwitchToSeat05": "Пересесть на место 05",
    "ActionSwitchToSeat06": "Пересесть на место 06",
    "ActionSwitchToSeat07": "Пересесть на место 07",
    "ActionSwitchToSeat08": "Пересесть на место 08",
    "ActionSwitchToSeat09": "Пересесть на место 09",
    "ActionSwitchToSeat10": "Пересесть на место 10",
    "ActionTakeScreenshot": "Сделать скриншот",
    "ActionTextChat": "Текстовый чат",
    "ActionToggleAlerts": "Переключить оповещения",
    "ActionCalloutsMenu": "Переключение меню выноски",
    "ActionToggleCrouch": "Переключить приседание",
    "ActionToggleInterface": "Переключить интерфейс",
    "ActionMap": "Переключить карту",
    "ActionToggleMode": "Переключить режим",
    "ActionPlayerScreen": "Переключение экрана проигрывателя",
    "ActionToggleProne": "Переключить лежа",
    "ActionSecureMap": "Переключение защищенной карты",
    "ActionToggleVoiceChat": "Переключить голосовой чат",
    "ActionToggleVoiceChatLocal": "Включить/Выключить локальный голосовой чат",
    "ActionToggleVoiceChatSquad": "Включить/Выключить голосовой чат отряда",
    "ActionUse": "Использовать",
    "ActionViewRoofs": "Просмотр крыши Бункера",
    "ActionEmoteWave": "Помахать рукой"
  },
  "STChassis": {
    "ChassisATGrenade": "Противотанковая граната",
    "ChassisATRPG": "Противотанковый РПГ",
    "ChassisATRifle": "Противотанковое ружьё",
    "ChassisAssaultRifle": "Штурмовая винтовка",
    "ChassisEntrenchment": "Укрепление",
    "ChassisExplosiveCharge": "Взрывной заряд",
    "ChassisFoundation": "Фундамент завода",
    "ChassisRailwayTrack": "Ж/д путь завода",
    "ChassisFacility": "Сооружение завода",
    "ChassisFortification": "Полевое укрепление",
    "ChassisFieldGear": "Полевое снаряжение",
    "ChassisFieldTool": "Полевой инструмент",
    "ChassisFlameThrower": "Огнемёт",
    "ChassisFlameThrowerAmmo": "Боеприпасы для огнемёта",
    "ChassisGarrison": "Гарнизонный дом",
    "ChassisGrenade": "Граната",
    "ChassisGrenadeLauncher": "Гранатомёт",
    "ChassisRifleHeavy": "Тяжёлая винтовка",
    "ChassisLargeMaterial": "Крупный материал",
    "ChassisRifleLong": "Длинноствольная винтовка",
    "ChassisLore": "Предмет лора",
    "ChassisMG": "Пулемет",
    "ChassisMedical": "Медицинское снаряжение",
    "ChassisMelee": "Оружие ближнего боя",
    "ChassisMinefield": "Минное поле",
    "ChassisMortarAmmo": "Боеприпасы для миномёта",
    "ChassisMountedEquipment": "Устанавливаемое оборудование",
    "ChassisMountedMG": "Станковый пулемёт",
    "ChassisPistol": "Пистолет",
    "ChassisRawMaterial": "Сырьё",
    "ChassisRefinedMaterial": "Рафинированный материал",
    "ChassisHarvester": "Сборщик ресурсов",
    "ChassisRifle": "Винтовка",
    "ChassisShippable": "Грузовой контейнер",
    "ChassisShippableMaterial": "Транспортируемый материал",
    "ChassisShotgun": "Дробовик",
    "ChassisSniper": "Снайперская винтовка",
    "ChassisSMG": "Пистолет-пулемет",
    "ChassisSupplies": "Припасы",
    "ChassisUtility": "Вспомогательное сооружение"
  },
  "STStructures": {
    "ImodStrategicMapDesc": "Доска с картами различных регионов и схемами. Тщательное планирование и навигация являются ключом к любой успешной операции.",
    "ImodSandbagsDesc": "Защитный барьер, препятствующий продвижению противника и обеспечивающий укрытие в бою.",
    "ImodRadioStationDesc": "Радиостанция дальнего радиуса действия, предназначенная для передачи приказов в критической ситуации. Иногда нет времени передавать сообщения вручную.  ",
    "ImodLatrineDesc": "Безопасное место для важных дел. В конце концов, всем пригодится.",
    "ImodKitchenDesc": "Чистое и безопасное место для приготовления продуктов питания. ",
    "ImodChalkBoardDesc": "Простая доска для планирования операций.",
    "ImodWorkstationDesc": "Рабочий стол пригождается во множестве ситуаций. Написать письмо любимым. Провести инвентаризацию оставшихся рационов питания. Каждый может использовать этот крепкий стол.",
    "ImodStairsBunkerDesc": "Обеспечивает легкий доступ на крышу Бункера",
    "ImodFiringPortDesc": "Позволяет безопасно стрелять из личного оружия изнутри этого Бункера.",
    "ImodBridgeDesc": "Позволяет технике переезжать через эту Траншею.",
    "PipeModInsulationDesc": "Изолирующий материал для предотвращения труб от замерзания при суровых погодных условиях.",
    "ImodBarbedWire": "Колючая проволока",
    "ImodBunksDesc": "Двухэтажная кровать не самая удобная, но после тяжелого дня, для солдата она как второй дом.",
    "ImodBridge": "Мост",
    "ImodBunks": "Спальные койки",
    "ImodChalkBoard": "Меловая доска",
    "ImodComputerModule": "Вычислительный модуль",
    "ImodComputerModuleDesc": "Для расшифровки закодированных сообщений иногда требуется больше, чем просто рабочая сила. Эти современные компьютерные модули могут оказаться как раз кстати. ",
    "ImodDoorway": "Дверной проем",
    "ImodFiringPort": "Бойница",
    "PipeModInsulation": "Изолированная труба",
    "ImodInteriorFiringPort": "Внутренняя бойница",
    "ImodKitchen": "Кухня",
    "ImodLadder": "Лестница",
    "ImodLatrine": "Уборная",
    "ImodLockers": "Шкафчики",
    "ImodPantry": "Кладовка",
    "ImodLadderDesc": "Позволяет получить доступ в этот бункер с крыши.",
    "ImodPipes": "Трубы",
    "ImodInteriorFiringPortDesc": "Обеспечивает укрытие от врагов, которые смогли проникнуть в этот Бункер",
    "ImodTrenchRoofDesc": "Обеспечивает укрытие от врагов, которые вошли в этот бункер",
    "ImodStairsDesc": "Обеспечивает легкий доступ в эту траншею и из нее.",
    "ImodDoorwayDesc": "Обеспечивает вход в этот Бункер.",
    "ImodPipesDesc": "Обеспечивает подключение электропитания от генераторов к улучшениям бункера.",
    "ImodRadioStation": "Радиостанция",
    "ImodSandbags": "Мешки с песком",
    "ImodPantryDesc": "Полки для хранения пайков, припасов и повседневных инструментов.",
    "ImodBarbedWireDesc": "Замедляет вражескую пехоту, пытающуюся прорваться в эту Траншею.",
    "ImodStairs": "Ступеньки",
    "ImodStrategicMap": "Стратегическая карта",
    "ImodLockersDesc": "Эти личные шкафчики просты и удобны. ",
    "ImodWashStationDesc": "Привести себя в порядок перед едой, постирать одежду или помыть посуду в умывальнике. Гигиена жизненно важна, чтобы избежать инфекций и болезней.",
    "ImodTrenchRoof": "Крыша траншеи",
    "ImodWashStation": "Душевая",
    "ImodWorkstation": "Верстак"
  },
  "STTutorial": {
    "TutorialActionHoldCamera": "(Удерживайте)\r\nПовернуть камеру\r\n\r\n(Ctrl+Scroll)\r\nКинематографическое приближение",
    "TutorialActionHoldRotateStructure": "(Удерживайте)\r\nПовернуть сооружение",
    "TutorialActionHoldAim": "(Удерживайте) Целиться",
    "TutorialActionCycleWeapons": "Велосипедное оружие",
    "TutorialActionEnterVehicle": "Сесть в транспортное средство",
    "TutorialActionLocalVoiceChat": "Локальный голосовой чат",
    "TutorialActionMove": "Двигайтесь"
  },
  "War": {
    "LightUtilityVehicle": "Внедорожник",
    "Turret": "Башня"
  }
}