{
  "": {
    "F7B3E3134BDFD4D9A7D52692CDFF720D": "12,7mm",
    "45D2C1E8485F1B0D876989BAAC564C0C": "Canon de campagne 120-68 \"Koronides\"",
    "916138E445876798C80845824CF00F8A": "Canon de campagne 120-68 \"Koronides\"",
    "D4FB1A104B695DEAF462B295B8B01D45": "120 mm",
    "7F4B7CCF453614C47E0C3ABE06CE93EA": "150 mm",
    "70E8F99F481D13F68E84B0B73F53CEC8": "Fusil Antichar Neville 20",
    "060FC4A347CAEAEB15F415A78AC7EFFA": "20 mm",
    "18569AA2442755B30417B9A79CDF9929": "250 mm",
    "D5872EE8494F4594FD185584E6E3E67F": "300 mm",
    "1C3C7C114F19674C49FF358B0FB80411": "30 mm",
    "CAB09D624FC3C44F8E72E784DB49B0FA": "Roquette Explosif Lourd 3C",
    "7E3073EC411445DBF7B3D6A82C80B65F": "40 mm",
    "207EFC4040D06114E7C593BE1A96F7A4": "Roquette incendiaire 4C",
    "2823BCF6486F7BA780DFB9B648E03CA5": "68 mm",
    "7208C0F2499AF0909F6934B938937C44": "7,62 mm",
    "64C33C4C4C5AD7FD90EBBA97A012B49A": "7,92 mm",
    "7B8F6445416315A78090889C40EE2C62": "75 mm",
    "79B37B824E0331C52F18A094D5938A33": "8 mm",
    "D8750ABC4423022DBF1E25BD003F2F54": "94,5 mm",
    "8C27A8594CFAC77BC2ED14A335E43F3A": "9 mm",
    "ABE92E8B41355AF0EF2BF89C9F6AE45D": "Un véhicule colonial de combat urbain anti-infanterie. Il utilise des munitions de 7,92 mm et est vulnérable à l'arrière.",
    "DB42CDE2472CDA9F938C8EB6E78BCF2A": "Un véhicule colonial utilisé pour mobiliser des troupes et des fournitures.",
    "6E22A7064B8B01616C97DCACB5358CA7": "Un fusil Kraunian modifié pour les engagements à longue distance. Il n'a pas la portée ou la puissance d'arrêt des autres fusils de précision, mais il compense largement cette lacune par une fiabilité inégalée dans divers environnements et une cadence de tir supérieure.",
    "E8DF220F4C61FFF4E87167BDB240E8F5": "Une Grande Garnison connecte de façon permanente cette base aux structures défensives à proximité.\r\n\r\nUne Grande Garnison est requise pour améliorer la base au Niveau 3.",
    "D0B5C6594E1D21848FCBB3B8F4B5BA31": "Une Garnison Provisoire relie cette base aux structures défensives voisines. Les structures défensives se désactivent si l'activité des joueurs est trop faible.\r\n\r\nCela permet également de revendiquer des Villes pour la condition de victoire.",
    "2E97128843820EB35C9F7594653DE298": "Une Raffinerie pour convertir les ressources brutes en matériaux.",
    "DB8F146845B3D2707EEE4FAA7E9F3FB0": "Une Petite Garnison connecte de façon permanente cette base aux structures défensives à proximité.\r\n\r\nUne Petite Garnison est requise pour améliorer la base au Niveau 2.",
    "9BC06F1F45F3DFB47E850090FE338208": "Une moto Warden utilisée dans les patrouilles et équipée d'un side-car. La Kivela Power Wheel peut également augmenter momentanément sa vitesse au prix d'une consommation plus élevée.",
    "E67197AD45F7368F5E843F85DB73B7C6": "Un véhicule warden de combat urbain anti-infanterie. Il utilise des munitions de 7,92 mm et est vulnérable à l'arrière.",
    "C1ADB43947CBF8A0166097B86CEA58D5": "Un véhicule Warden utilisé pour mobiliser des troupes et du ravitaillement.",
    "0810394D4C98AC57B6375A9556ADFDAF": "Une barrière utilisée pour interdire le passage.",
    "CB0B50A44DDC10BE211DC4B4B7381153": "Une barrière utilisée pour interdire le passage.",
    "42F6EE1B42458373F5AD0FACFAB8D199": "Une barrière basique utilisée pour interdire le passage.",
    "849F766947B123B6F7AC2B9B46735242": "Un haut-fourneau raffinant le Pétrole Lourd en Pétrole Enrichi, requis pour de procédés avancés.",
    "1B9EA5094C9510ADD875C682CD9695E1": "Le Plasma est utilisé pour traiter les soldats blessés sur le champ de bataille.",
    "071146C64F45BB20DC7F9097F2927408": "Un tableau équipé de diverses cartes de la région et de statistiques utiles. Une planification et une navigation soignées sont les clés de toute opération réussie.",
    "79E7DF2446C683B4A4C5BBBF7E6F0F00": "Une variante explosive de la Chenillette T12, l'\"Ixion\" offre à son équipage plus de soutien et un Canon de Soutien d'Infanterie. Le poids supplémentaire du blindage entraîne une réduction de la vitesse globale.",
    "1D3E7E0B40AD5A10BA91D0A502DFCD97": "Un seau pouvant contenir de l'eau. Jetez de l'eau sur les feux pour les éteindre.",
    "3374580C4828A038F890F0865E7A4404": "Un composé de métaux extrêmement rares utilisé dans la production des véhicules et armes les plus avancés.",
    "7E40D2154CE6CB3C3E6061949B00885E": "Un composé de béton qui est utilisé pour construire des structures fortement fortifiées.",
    "9DF94D654A1A4D7A9594109BDFF73675": "Un wagon conteneur pour transporter le charbon pour ravitailler les trains sur de longues distances. ",
    "5E7A0E644EAC8007BB97D79FC018D9C2": "Un conteneur pour l'expédition de très grandes quantités de caisses à l'aide de véhicules chargés par une grue. Ce type de conteneur ne peut être déchargé que dans les Dépôts et Ports.",
    "E23C94E74E90656A4646E4B76C1064A2": "Un conteneur pour stocker de grande quantité de liquides. Les structures et véhicules à proximité peuvent se ravitailler directement depuis ce conteneur. ",
    "0940EACD44FCACF5968E3D973AC19D10": "Un conteneur qui peut transporter de grandes quantités de ressources et qui peut être transporté par certains véhicules.",
    "ABE5635E4960DF03209C51B702D6B9A4": "Une caisse d'objets. Celles-ci doivent être soumis à un stock avant que les objets contenus puissent être récupérés.",
    "ACF04FFB45D3815A46FBA8A4817BAB49": "Une caisse de structures empaquetées.",
    "92413FCE410B5FD33CC7E7BECF7DFEEB": "Une caisse de véhicules.",
    "E41316F941B33903879094BC79330D6A": "Une variante allégée du Char d'Assaut Silverhand qui sacrifie blindage et protection en faveur d'un puissant canon de 94,5 mm. Cette plateforme d'armement à toit ouvert est conçu de façon unique pour interception les blindés ennemis avant qu'ils n'aient le temps de riposter. Son surnom est un hommage à la mutilation du grand roi qui donne son nom au Silverhand; bien que son titre lui ait été retiré, et son orgueil blessé, sa rage ne fut jamais jugulée.",
    "0670B3AB41061136BDA48382F2BA1F64": "Une barrière défensive qui entrave le mouvement de l'ennemi et fournit une couverture pendant le combat.",
    "41E8BDBD43A5DBAA714F13BB9B8F345F": "Une barrière défensive qui entrave le mouvement de l'ennemi et fournit une couverture pendant le combat.",
    "A8CDA9DA405A9520FCAB96A5C7E7CCEE": "Un emplacement défensif avec un canon antichar de 68 mm. Cette arme rudimentaire fut jadis construite pour être installée sur la coque de navires de guerre, mais fut progressivement supprimée et reconvertie.",
    "00358E364B11C747248F818F086B46CD": "Un mur défensif qui entrave le mouvement ennemi et fournit une couverture durant le combat.",
    "3105F0534A0D724D774462A341DAA801": "Un mur défensif qui entrave le mouvement de l'ennemi et fournit une couverture pendant le combat.",
    "99C132674FFD45DF7D2E56B3BC711991": "Une tranchée d'emplacement détruite.",
    "BE5E36F541B479B4216542B5A6ADFC4B": "Une tranchée d'emplacement détruite.",
    "D66C394A48367596582750A9659F5C0C": "Une tranchée d'emplacement détruite.",
    "68092C204DF23054102EA1AA67500C02": "Un connecteur de tranchée détruit.",
    "91F78F5F4497E20D3A4795993359477D": "Un connecteur de tranchée détruit.",
    "BD1F34F343EC150E2863888593CE9063": "Un connecteur de tranchée détruit.",
    "2C46569947371E295E55CE9C92500740": "Une tranchée détruite.",
    "594A7EAA47FD9AAE46EBE090CB2A4429": "Une tranchée détruite.",
    "EB7366454EC479B9AD5D1C98A9730D2A": "Une tranchée détruite.",
    "4E49999842287992ED3A1386617B3BB1": "Un dispositif utilisé pour intercepter les émissions radio de l'ennemi transmises depuis une source proche.",
    "F19A102C4321B3F939D887A4CABACDA7": "Un dispositif utilisé pour intercepter les émissions radio de l'ennemi transmises depuis une source proche.",
    "662029924BA10BE1FE3BBCA7285337B9": "Un baril contenant du carburant pour les armes lance-flammes.",
    "AED06A8142D5D69B92B9BEA908FCFCE2": "Une mitrailleuse anti-infanterie à double canon et de haut calibre. La Swallowtail est équipée d'un blindage orienté vers l'avant et est excellente pour la suppression. ",
    "412F9B3C4C78EE64DA2A659E761946AE": "Une mitrailleuse anti-infanterie à double canon et de gros calibre. Le \"Sagittarii\" est équipé d'un blindage frontal et est excellent pour la suppression. ",
    "07E2E2DF4A18549BA72607ABD8CE60D9": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres tranchées et bunkers.",
    "BC51F6BD4705B2E3B4FBCEAB125A1A82": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres tranchées et bunkers.",
    "DD2AB37D4FA6E5A48AD411916356CE29": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres tranchées et bunkers.",
    "76B16A824CBCB1A33968A6BFE11AD03F": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres tranchées et bunkers. Il s'agit d'une variante spéciale de tranchée qui peut être redimensionnée dynamiquement et qui peut être construite sous les routes.",
    "DFFC4C2D4A663BFF702B08BAB37B7C5A": "Une trenchée servant de couverture et de passage entre les bunkers. Se connecte aux autres tranchées et bunkers. Cette variante spéciale de la tranchée peut être redimensionnée dynamiquement et être construite sous les routes.",
    "FF9A406C41A2FA315015A38BC88B91CB": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres tranchées et bunkers. Il s'agit d'une variante spéciale de tranchée qui peut être redimensionnée dynamiquement et qui peut être construite sous les routes.",
    "2F7B619D405D508DFA5DEF94AA028D8C": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres Tranchées. Cette variante peut également servir d'emplacement pour des défenses maniables.",
    "A320DFC84F9F465BBF6EDAB03B974770": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres Tranchées. Cette variante peut également servir d'emplacement pour des défenses occupables.",
    "FA81A3C548714C37F5F2258FB1420749": "Un abri qui sert de couverture et de passage entre les bunkers. Se connecte à d'autres Tranchées. Cette variante peut également servir d'emplacement pour des défenses maniables.",
    "D8EDFE25412F16F3D52F71B321EB90C9": "Une installation d'ingénierie qui alimente en électricité les structures du bunker à l'aide de raccords de tuyauterie.",
    "DF6685414ACEF01A0812CE95BB5B0BFD": "Une installation d'ingénierie qui alimente en électricité les structures du bunker à l'aide de raccords de tuyauterie.",
    "23E6D64B495A0A6B46E711BCD9D03A93": "Une installation qui stocke les équipements et munitions pour l'artillerie. La récupération est très rapide pour cette structure.",
    "3B196CD540FB62AD3622579FBF626BFE": "Une installation qui stocke les équipements et munitions pour l'artillerie. La récupération est très rapide pour cette structure.",
    "BB7C28194487CA425C4DF98A61D4FE2C": "Une usine pour produire des types de munition avancée comme les obus de gros calibre, les roquettes et les munitions incendiaires.",
    "BE177EE4441C5F046CC8049B97050210": "Une usine pour raffiner des ressources brutes en Matériaux de Construction Traités. Des modifications additionnelles peuvent permettre le raffinage de matériaux additionnels nécessaires pour des opérations d'installations avancées.",
    "77F7A5C245872D31C6810B8DFAFF6296": "Une usine qui raffine des ressources brutes en Matériaux de Construction pour des Installations avancées. Des modifications additionnelles permettent le développement d'une variété de matériaux différents.",
    "87312142472EB68405C143887E747795": "Un projectile explosif rapide utilisé pour les lanceurs de RPG.",
    "D80FAAA943B11E8EE5B1FD8917D0EB63": "Un hôpital de campagne servant à traiter les soldats grièvement blessés sur la ligne de front. ",
    "DACD4BF34D13FA3410AFD4B1ADE16D36": "Premier du genre, le Skycaller est une modification du Niska Motor Carriage, équipé d'une batterie de roquettes conçue par Rycker et placée à l'arrière de l'engin. Ce véhicule blindé unique en son genre tire rapidement des roquettes sur de longues distances avec efficacité, et peut être réarmé et repositionné en un clin d'œil. Le Skycaller est le parfait résultat de l'ingénierie combinée des Nevish et des Caoivish.",
    "BD812A6742F1D60A2CA2E09E408378F3": "Un wagon plat pour transporter ressources et munitions, par train, sur de longues distances. ",
    "13D9448B439D377ACF804D9C57381E7C": "Un bassin inondable et plateforme de construction qui facilite l'assemblage et la réparation des plus grands navires militaires.",
    "0C71638A4003A5349C54ECAF3E566645": "Un uniforme officiel qui désigne l'officier supérieur d'un régiment. Bien que peu pratique, l'officier de service peut utiliser son autorité pour discipliner ses subordonnés sans compensation. Les officiers jouent un rôle important dans l'armée des Warden, qui remonte aux temps anciens où Caoiva était gouvernée par une douzaine de rois.",
    "CDDD81B84541976034E1D6BA163C62BB": "Une fondation qui fournit une surface adaptée pour construire des Installations.",
    "8DA8488E4CCE724BE7D96595F1312DAE": "Un garage qui facilite les modifications et améliorations de véhicules.",
    "44C193C343183902EC1598A00A0E7236": "Un bâtiment central garnisonné vital pour la défense d'une ville. Les joueurs peuvent y réapparaître et y stocker des objets.",
    "6FBF40EC4148F845D6E9838CCE86CE5E": "Un bâtiment central garnisonné vital pour la défense d'une ville. Les joueurs peuvent y réapparaître et y stocker des objets.",
    "BEAB2C24421E9FFAC1FD26B28C0F991B": "Un bâtiment central garnisonné vital pour la défense d'une ville. Les joueurs peuvent y réapparaître et y stocker des objets.",
    "F85BCBE9434061E78F8BBBA1F83C0D89": "Une position fortifiée garnisonnée utilisée dans la défense d'une ville. Les joueurs peuvent y réapparaître et y stocker des objets.",
    "75C05BD74EA44B3459F6DD9AE7D7477F": "Un portail qui donne accès à une zone clôturée.",
    "F40945DD48E7FE4C35DD0188F1295FE7": "Un portail qui donne accès à une zone clôturée.",
    "FCF631C147D5FEC5ECAAEABFBEF23D0E": "Un portail qui donne accès à une zone clôturée.",
    "C123BDFD4EAF70CBDB604F8DBA641B22": "Un générateur qui brûle du charbon pour générer de l'électricité.",
    "798C0A354153FA97DF4B9EA6536829E6": "Un générateur qui brûle de l'essence pour générer plus d'énergie.",
    "2F41A7A64A16C1223014DE81956F79B9": "Un générateur qui utilise de l'électricité pour pomper du pétrole dans des tuyaux attachés.",
    "BD0BCA3543C3C29E448EE9A8A07A0E05": "Variante moderne et plus lourde du Pitch Gun, le Lionclaw est un pistolet-mitrailleur de bonne qualité, conçu comme armement principale pour les opérations de combat urbain et rapproché.",
    "4D00771B4B5B472A271215A91FDC3430": "Variante lourdement blindée du King Spire, le Gallant Mk. II est doté d'un lourd canon de 30 mm, au détriment de sa vitesse de pointe.",
    "4C3B15ED42125D7480A52F9BC253DD30": "Un gilet lourdement renforcé conçu pour protéger les grenadiers des souffles arrière. En tant que tel, le gilet réduit les éclats et échardes en plus d'amortir les impacts des balles. ",
    "2A8BE1C34C0526F79ACF6D91681CC82B": "Une variante lourde du Lance, le 25, ou \"Hasta\", a été utilisée lors du premier siège de Brightwall, une ville aujourd'hui familièrement appelée \"The Blemish\". Bombardés par une forte opposition blindée dans le nord de Veli, les régiments de chars Colonial ont alors demandé un véhicule lourd doté d'une capacité de recherche et de destruction plus efficace. Équipé d'un canon de 94,5 mm frontal, le \"Hasta\" est un destructeur de chars plus que compétent.",
    "9116C94743283A454087F4ACE0D29789": "Un obus antichar lourd.",
    "46724B5540021ABA9BCBB096CCD52C7E": "Une presse lourde automatique qui raffine des matériaux dans une forme plus dense.",
    "A26D7B604F08AA4B21D755B90489E34E": "Un canon lourd conçu pour briser les garnisons et les fortifications des forces qui avancent. L'Exalt est mieux utilisé lorsqu'il est placé dans une position défensive pour profiter de son impressionnante portée.",
    "B30E60B44B6340C80E9B3CBA1C235AAF": "Un camion de transport industriel conçu par Bassett Motor Society. Il est conçu pour transporter sans problème les matériels les plus lourds sur de longues distances. ",
    "7312CF5F420C4840C1D6F8B7AB84AAC2": "Une pièce d'artillerie lourde en position fixe qui peut libérer une puissance de feu dévastatrice sur des cibles ennemies éloignées.",
    "A040D2D145966F1A2E0D22B32ACB68AD": "Grue mobile lourde utilisée pour lever des véhicules et des équipements très lourds.",
    "344B222241D96C2B5647BCB4CE9DDD88": "Plate-forme de mortier mobile lourde équipée d'un épais bouclier frontal pour l'assaut de sites fortifiés.",
    "3C9D234C4A0EFD3161554E8A42C845F0": "Un lourd camion Dunne renforcé. Doté d'un armature plus lourde, le Leatherback peut résister à davantage de chocs, mais au détriment de son accélération au départ. ",
    "B8101D7F4ABFB0076157E78860DFD2DB": "Un Char de Bataille robuste doté d'un épais blindage et d'une puissance de feu destructrice. Le Flood est équipé d'une tourelle de 75 mm et d'une mitrailleuse de 12,7 mm orientée vers l'avant. Le blindage lourd limite sa vitesse, mais en échange, il peut encaisser de nombreux coups.",
    "557888F2425D443A3754D38FF3E68F46": "Un Char de Bataille robuste doté d'un épais blindage et d'une puissance de feu destructrice. Le Lance est équipé d'une tourelle de 75 mm et d'une mitrailleuse de 12,7 mm orientée vers l'avant. Le blindage lourd limite sa vitesse, mais en échange, il peut encaisser de nombreux coups.",
    "6BCE5705403F3D8062BC3D983238B63B": "Camion Colonial lourd utilisé pour transporter troupes et matériels.",
    "9BC20CBD4F82B56B829926AAB0EFFFD9": "Un camion lourd Warden utilisé pour transporter troupes et matériels.",
    "340573BC403E8059BF8EA7A91BFC2D18": "Un fusil de tireur d'élite à longue portée. Le Clancy-Raca a un sacré recul mais est équipé d'une puissante lunette de visée, permettant à l'infanterie de surveiller le champ de bataille et d'apporter des tirs d'appui depuis un endroit sûr.",
    "1994D61046CF0C62DCDBA8B98CE3EED0": "Un canon anti-infanterie de gros calibre. Excellent pour la suppression.",
    "08390D0C46412A24EF34288CAA71FC09": "Un carburant haute gamme raffiné à partir de Pétrole. Utilisé dans une variété d'applications dans des Installations.",
    "CCBBD74C4EB9271DBBECA0B96391FAC3": "Un fourneau de haute puissance qui porte le Charbon à haute température pour séparer le Coke non-volatile.",
    "DF0E3525485D81F6072D3C84FA8F3497": "Un fourneau à haute température qui catalyse le pétrole brute en Pétrole Lourd raffiné.",
    "0E47C84B4819C0B2C1C2E0B22660C5F8": "Une charge explosive de grande puissance qui nécessite d'être accompagné d'un détonateur. La Charge Havoc est très efficace pour démolir les grandes structures. La charge doit être déclenchée par un coup de feu. Le vrai potentiel de la Charge Havoc se déchaîne lors de l'éxecution de démolitions stratégiques à des distances sûres.",
    "7D8FA1B34320EA7C8774D89576D22C1A": "Un poste d'écoute de haute technologie conçu pour intercepter et décoder les transmissions ennemies. Le Centre de Renseignement peut cibler des endroits éloignés et continuer à déchiffrer des transmissions sensibles pendant une période prolongée.",
    "63CA92E04D0FE15E13FC298EDF912E3C": "Un module météorologique de pointe construit sur de solides fondations à l'intérieur d'un réseau de bunker. Ces stations aident les opérateurs à prédire les conditions météos. Plusieurs modules de Station Météo peuvent être reliés ensemble pour faire des prédictions plus précises, permettant aux armées de se préparer même aux pires conditions.",
    "97678A9F4AE94DBACE6C1B8F000042E9": "Un char léger et très maniable. Conçu pour les environnements urbains, le Devitt est équipé d'un canon de 40 mm.",
    "891DFDAC45CBDAD6EB7D39B2B7A58F5B": "Un char léger et très maniable. Conçu pour les environnements urbains, le \"Hatchet\" est équipé d'un canon de 40 mm.",
    "5EEBA409482F1AD6C7AE7E85C975002F": "Une grande Station d'Assemblage pour la production de véhicules et équipements avancés, comme les chars et trains. La construction prendra du temps et peut être interrompue si les ressources sont épuisées.",
    "EC62CC58412440D4E23C7CBA9AC21CFF": "Un grand bâtiment utilisé pour stocker des caisses, des véhicules et des structures expédiables.",
    "2E7E0DB244163440077CE7A62C37E0D4": "Un grand bâtiment utilisé pour stocker des caisses, des véhicules, des bateaux, et des structures expédiables.",
    "06A4877C416917417F9ACBA44DB999B0": "Une grande base d'opération avancée. Les joueurs peuvent y réapparaître et stocker des objets.",
    "1999FECB40FF4DE9FF6E91A65B0004F0": "Une grande base d'opération avancée. Les joueurs peuvent y réapparaître et stocker des objets.",
    "B572582B475475CC0EAC4396606C91DA": "Une grande base d'opération avancée. Les joueurs peuvent y réapparaître et stocker des objets.",
    "ECF915A74AF418023D2351A1CB61F605": "Grand chaudron industriel servant à liquéfier les métaux pour éliminer les impuretés des matériaux avancés.",
    "985FCAC54A7A91242513AB92B016817E": "Une grande installation médicale pour traiter les soldats grièvement blessés revenant du champ de bataille.",
    "21DC32A84CC9B1B06A33D0B902E7E975": "Un grand baril de traitement qui permet l'introduction contrôlée d'hydrogène pour produire une quantité similaire d'Essence pour moins de Pétrole brut. ",
    "A71A14434198515B2130449921B346AD": "Grand navire de transport, l'Aquatipper est utilisé pour transporter des véhicules, des équipements et du personnel sur de grandes étendues d'eau.",
    "94B578314EBB3B9E7F4F24A53ED1ED57": "Un véhicule mécanisé légèrement blindé observé pour la première fois lors des premières escarmouches entre Caoiva et Veli. Avec son châssis peu épais, il était déployé en formations larges, débordant souvent les forces ennemies.",
    "ADE614A6470D0CB66831B2A910D3D874": "Un canon d'artillerie légère conçu pour être une pièce maîtresse des fortifications défensives. Le Lariat est doté d'un formidable canon de 120 mm à longue portée, conçu pour exercer une pression énorme sur l'infanterie ennemie.",
    "F00BFEEC43676E5CE6440DB3D2B5BE81": "Une lampe qui illumine les alentours. Nécessite au moins un minimum d'électricité pour fonctionner.",
    "0863B6A543ECCD93995DD2AC4968D4C9": "Un emplacement qui est activement ciblé par une Fusée.",
    "310C20A047D44550CB384F8FDAF5226A": "Une artillerie mobile Coloniale à longue portée utilisée pour assiéger les positions fortifiées.",
    "79122FD246C033F537757FA0D88CF3AA": "Une artillerie mobile Coloniale à longue portée utilisée pour assiéger les positions fortifiées.",
    "40DD8C8E4A58BB0AA2E145AD0DFDF9A3": "Une fusée à combustion longue qui s'enflamme en plein vol pour illuminer une large zone et révèle les cibles ennemies.",
    "906435B8438E53184E6B5CA9EA7AE97A": "Une installation radio à longue portée conçue pour transmettre des ordres en cas de besoin. Parfois, il n'y a pas le temps de délivrer un message à la main.  ",
    "3CF4A6404018F2698D30D1BFA541252C": "Un wagonnet plate-forme à profil bas utilisé pour le transport de ressources et de munitions encombrantes sur de courtes distances sur petites voies ferroviaires.",
    "75BE38574144D6EE1C1F1085D925297F": "Une machine qui fracture le sol en injectant de l'eau à haute pression pour augmenter la production de Pétrole Brut.",
    "5134C9D844FBDCE85A83E29BF38D7C00": "Une boîte magique qui duplique l'objet contenu dans son premier emplacement d'inventaire.",
    "F16C032A4356D6B5945DD1AD7C5D07E9": "Un pont de fortune pour transporter du matériel léger sur une courte distance. Subit des dégâts quand les véhicules traversent.",
    "AF5E0C7B4953A4E92C6C48836B169E7E": "Une usine de fabrication pour la production d'équipements militaires à grande échelle.",
    "57EB5012423821DF377391A599C0C6FE": "Une usine de fabrication d'équipements militaires.",
    "35DC470B411457F604EDC78818A6EF99": "Une palette de matériaux.",
    "B8E16A6F4322F73241A86B8E99FBBDCD": "Un carburant de moyenne qualité qui est raffiné à partir de Pétrole. Utilisé comme carburant plus haut de gamme pour des véhicules et dans diverses applications à des Installations.",
    "52F819C94A4FB7D68080FEA14921C197": "Un Devitt modifié, équipé d'une tourelle porte-mortier spécialisée Caine, au détriment de la vitesse de pointe.",
    "3729EE67488A5DDA39955096FCC3346C": "Une moto et un side-car utilisés pour patrouiller dans de vastes zones. La vitesse peut être augmentée au prix d'une consommation accrue.",
    "EB42FEA34CE79F8CAB36C0A8DF52C365": "Un bateau motorisé conçu pour déplacer des petits groupes d'infanterie à travers les rivières et entre les îles.",
    "095F90EA4DBE1E287F589E95E8303BC7": "Point de montage pour les armes et équipements d'infanterie déployables.",
    "53E5E9F6485E6A05C7AAB5AA17F64602": "Un char de bataille polyvalent doté d'un blindage composite renforcé, d'une grande puissance de feu et d'une faible mobilité. Il est équipé d'une tourelle à canon de gros calibre et d'une mitrailleuse montée à l'avant qui peut éliminer l'infanterie. Il utilise les munitions de 75 mm.",
    "4A725EBD4FD3211B67054EB4E0551E0A": "Un véhicule Colonial tout-terrain et polyvalent qui permet de repérer les cibles proches.",
    "12F425DF4BB2CA39EB0D76BC2FF4B033": "Un véhicule tout-terrain polyvalent Warden qui peut explorer les cibles proches.",
    "329A5E954C449A6D068FE3B014FE2303": "Un outil polyvalent. Peut être utilisé pour démanteler les mines/clôtures barbelées et déverrouiller les véhicules.",
    "81B26A394866F839029F09AB4976253E": "Une boîte mystérieuse contenant une réserve inépuisable de ressources",
    "9A3557304EF64924F26FBDB3CB19F583": "Un drapeau particulièrement festif.",
    "B427B38E4B6A375CB9664590C5B78984": "Pistolet importé d'Estrella, à l'est, le Ferro 879 est présent sur de nombreux champs de bataille.",
    "67D734954C830181A4C42BA3CCB28371": "Un feu de camp utilisé pour garder les soldats au chaud pendant les Tempêtes de Neige. Nécessite du Diesel comme combustible.",
    "898522CC4AC93FBD1DE535896836D8CF": "Un dispositif portable qui mélange divers matériaux pour former du béton, qui est utilisé pour construire des structures lourdement fortifiées.",
    "02C98F7147B981B0F235D890FB98C008": "Une interface électrique conçue pour manuellement arrêter le courant dans un circuit.",
    "6C4EC81A4984D707E50FBFAD4AB329B9": "Une centrale qui génère une grande quantité d'électricité en utilisant du Pétrole ou du Charbon.",
    "AF36B46549B82B8327C173B20E6E0342": "Une usine de traitement qui raffine le Charbon en matériaux utiles utilisés dans la production et la génération d'électricité à des Installations.",
    "42490F284579F2525B717597767F805B": "Un ratelier utilisé pour entreposer différentes armes.",
    "952D2A4746C7A202922E04831AD73301": "Un bunker radio qui fournit des renseignements sur la zone environnante aux unités alliées. Construit en béton solide, cette structure fiable peut pousser sa portée effective au-delà des structures radios fortifiées inférieures.",
    "C08F59AF40C5D83D647E19B12B194312": "Un bunker radio qui fournit des informations aux unités amies sur la zone environnante. Renforcé par du bois, il peut résister à davantage de dommages qu'une tour radio standard, et est donc capable d'une efficacité accrue.",
    "98FDD84247786AD3619A06A7C390649A": "Une tempête de pluie est active dans la région.",
    "2041E1E94A36F25C11F23DBC6B1E7491": "Une passerelle surélevée pour créer des passages par-dessus des Installations complexes.",
    "601D72B24860CDD8206351BEE71FC3AC": "Une passerelle surélevée pour créer des passages par-dessus des Installations complexes.",
    "9C356F4C482A99F34DB28891873D9290": "Une rampe qui permet d'accéder aux bunkers souterrains.",
    "A548DAAE458E69AB6A32C39E233CBD17": "Une rampe qui permet d'accéder aux bunkers souterrains.",
    "F1F91A014F23A3D3B484BDBD771E25E6": "Une rampe qui permet d'accéder aux bunkers souterrains.",
    "548DACD345555EDD93D43DB8A81C5327": "Un liquide brut visqueux qui doit être raffiné en carburant dans des Installations.",
    "4F428A6749B2C8811BE67A9F3B7F53B6": "Un réacteur qui combine de l'Eau avec du Pétrole Lourd ou du Coke raffiné, donnant un gaz naturel plus pure, qui est plus efficace pour générer de l'électricité. Des morceaux de Soufre brut sont créés comme sous-produit.",
    "4E219CEF49D98D8D1D97558D22BB0462": "Prototype colonial récupéré, autrefois utilisé dans les premières guerres mécanisées. Construit sur le châssis d'un puissant tracteur, ce véhicule blindé était utilisé pour escorter des soldats ou, plus tard, pour soutenir des forces blindées plus importantes.",
    "15C63D144D30014F7685FBBE9A21A092": "Une raffinerie qui transforme le pétrole en d'autres matériaux utiles à des fins de production et de génération d'énergie.",
    "F3EE5685426B24F5F00A219BF984F928": "Un baril renforcé de substances extrêmement explosives nécessaire pour les ogives les plus meurtrières.",
    "3FC569FC40B27F9AD9E26FA03F50CF7F": "Un abri renforcé qui donne à la garnison de fusiliers une position défensive fortifiée pour tirer sur les ennemis approchant.",
    "A620ADF748599DC11DAF30B347F2F263": "Un centre de recherche où les joueurs peuvent contribuer à la recherche de l'Arbre Technologique de leur faction.",
    "6B158AB149C22B70F67B998F1FFCA739": "Un champ de ressource pour récolter du Charbon afin d'être utilisé comme carburant, pour la production à des Installations ou pour être amené à une Raffinerie.",
    "925DFE2241AE18D5525CF7BEE32DC272": "Un champ de ressource pour récolter des Composants à amener à une Raffinerie.",
    "420703524C55DF6F7802A69F8F0653DB": "Un champ de ressource pour récolter de la Ferraille à amener à une Raffinerie.",
    "932ED7584D5AE02116EC9A85FB19086B": "Un champ de ressource pour récolter du Soufre à amener à une Raffinerie.",
    "A341B03B40416F682A8BAD8F317DC096": "Un accessoire de fusil qui tire des grenades avec une force pneumatique. En plus des grenades spécialisées, il peut lancer des grenades standard.",
    "FF4760F8403753E1A1C0949DBEE74515": "Un endroit sûr pour faire ses affaires. Après tout, tout le monde doit le faire.",
    "3D7398FD48AFD855E42AD1A4F4C1D058": "Un espace sûr et propre pour préparer des rations ou des aliments récupérés. ",
    "EAE29E5647F210251BF383AE3E9DC1A3": "Un tronçon de rail pour grues lourdes. Ce type de voie ferrée peut seulement être construit sur des Fondations.",
    "666A59564F4699BB4E6CA99411AEF1E5": "Un tronçon de rail pour wagonnets. Les rails peuvent s'attacher ou bifurquer de rails existants pour former des réseaux complexes.",
    "2D40CD2B4A4B36D17C5712BB6E3CB22F": "Un tronçon de rail pour wagonnets. Les rails peuvent s'attacher ou bifurquer de rails existants pour former des réseaux complexes. Ce type de voie peut être construite sur des Fondations.",
    "DE5BB7E34093B270F67BB082224C6468": "Un tronçon de rail pour wagons. Les rails peuvent s'attacher ou bifurquer de rails existants pour former des réseaux complexes.",
    "85B5B9A141B0C6C44DE9C88D80A2D134": "Un tronçon de rail pour wagons. Les rails peuvent s'attacher ou bifurquer de rails existants pour former des réseaux complexes. Ce type de rail peut uniquement être construit sur des Fondations.",
    "AA586EEF445B20AAE11822A26C111DC1": "Un tronçon de rail pour wagons. Les rails peuvent s'attacher ou bifurquer de rails existants pour former des réseaux complexes. Ce type de rail peut uniquement être construit sur des Fondations.",
    "AD9F111648BB9B389954B98DDC0C4432": "Une série d'engrenages, turbines et moteurs complexes utilisée dans les grands navires militaires.",
    "3B08756B4852B8ED7C3FD7AC8B91AE8F": "Un conteneur de stockage partagé qui peut être utilisé pour stocker des objets.",
    "88817B5A41231C3D9AF60BA8CF7DDD58": "Une munition lancée sur une courte distance par un mortier.",
    "F5E727A94E4FFA6FF5986B9BF90B3B98": "Un panneau utilisé pour transmettre des informations aux autres soldats.",
    "4382DC1C459106E7D4EC86B558E25BB4": "Un fourgon de queue simple qui permet aux personnels ferroviaires d'entretenir les rails plus efficacement.",
    "B8181E7A409FB5D4F6BC258955103FC3": "Un simple tableau noir pour la planification des opérations.",
    "47495A0C4687DB7DCC18089FA7AC8A29": "Un simple trou creusé dans le sol pour fournir à l'infanterie un couvert de fortune contre le feu ennemi.",
    "829BDD544B22530FE8108C8A745F4A5C": "Une mine basique qui est placée sous le sol et dotée d'une plaque de pression sensible qui détonne sous le poids de véhicules lourds. Les mines sont visibles pour les alliés et l'infanterie ennemie.",
    "621C6B76445FF0C1B3E58CAA5E2BFFFB": "Une remorque simple qui peut contenir des ressources de construction communes.",
    "70A1D7C5400E99CB22061FB7326EB7DA": "Une remorque simple qui peut contenir des matériaux de construction plus lourds.",
    "387EE7D644BFC53C67D46695ED2F8C9B": "Une remorque simple qui peut contenir diverses sources de carburant et peut être utilisée pour ravitailler des véhicules.",
    "9260EFD245AA11C91000E6ABB873E77F": "Une simple variante du Dunne Responder 3e équipée d'une pompe conçu pour éteindre les flammes les plus violentes.",
    "50E2CE4A4EECAC54805254885A49251D": "Une bicyclette Blumfield simple, de style ancien. Il s'agit d'un modèle de loisir plus petit, conçu pour les sprints sur de courtes distances.",
    "87E4796C4FADEA341965F8A90D6EBB00": "Une légère variation du V.110, le \"Gravekeeper\" est équipé d'un lance-roquette \"Bonesaw\" embarqué, transformant cette humble voiture blindée en un véhicule anti-char efficace.",
    "B39230E34DF8620213AAB5A3D3915EB0": "Une petite base utilisée comme point de départ pour envahir des régions ennemies. Les joueurs peuvent y réapparaître et y stocker des objets.",
    "F015AA4645293B138218E495E7B7249E": "Un petit wagon conteneur pour le transport de matériaux bruts. ",
    "ADC8DAA54AF942CE0633EFA3CA951C55": "Un centre de production de bateau à petite échelle.",
    "284764E84E6F56F282D64AB6F0CC51D5": "Un centre de production de véhicule à petite échelle.",
    "FD14B135475379B5D33DF282DBC4664C": "Une tempête de neige est active dans la région. La visibilité est réduite et l'exposition prolongée entrainera un gel mortel.",
    "408E42104C80C3FA7E9A56ADE1A96D78": "Un soldat qui a été grièvement blessé sur le champ de bataille. Portez-le jusqu'à un hôpital pour récupèrer des Fournitures de soldat.",
    "0D5F6D114B77905CE4E6CBB90E199C7E": "Un espace utilisé pour stocker des matériaux raffinés qui peuvent être transférés vers ou depuis des Installations. Les stocks peuvent être publics ou réservés.",
    "4CB8EE134B6F11F903323BA00CA8A395": "Une plateforme de lancement spécialisée conçue pour faciliter l'assemblage et le tir de Missile Balistique A0E-9 dévastateur, appelé familièrement Fusée AEON.",
    "8F2967214915F8C861BA64A936304D0F": "Véhicule spécialisé conçu par Bassett Motor Society et utilisé pour la construction de grandes structures.",
    "2BDB948D435DD27C5479A7959D65F110": "Un portail stabilisé vers le monde souterrain. Présentez des offrandes pour piéger les esprits mortels dans des pierres d'obsidienne.",
    "D92FBE734BC50E5AC519F486000C41E1": "Une Station d'Assemblage standard pour La production de véhicules et équipements essentiels. La construction prendra du temps et peut être interrompue si les ressources sont épuisées. Certains projets requièrent qu'un véhicule de base soit présent sur la Station d'Assemblage avant que la production puisse commencer.",
    "01536C904F6D50E1B42797A2ECD5B7D4": "Un ensemble standard de fournitures pour les fantassins. Les bases doivent être remplies de Fournitures de Soldat afin que les joueurs puissent y apparaître.",
    "09A680CE484174FB7CE2DDBA5ED8E8DD": "Une grenade fumigène standard conçue pour dissimuler les mouvements des alliés ou masquer la vision de l'ennemi.",
    "C2DFA4FA46E8A09787B1659EA8E31291": "Une moissonneuse fixe qui récolte automatiquement du Charbon en utilisant de l'Essence comme carburant.",
    "D009E8D7439C6813523AF6AB85D0B356": "Une moissonneuse fixe qui récolte automatiquement des Composants en utilisant de l'Essence comme carburant.",
    "2AE345534F3FE5E044BA468C3161D541": "Une moissonneuse fixe qui récolte automatiquement de la Ferraille en utilisant de l'Essence comme carburant.",
    "2977A856416985D34C006287876745D2": "Une moissonneuse fixe qui récolte automatiquement du Soufre en utilisant Pétrole Lourd comme carburant.",
    "86B356284D94A0657FBF0FBCE81FDC6D": "Une structure qui génère de l'électricité en brûlant du Diesel.",
    "211790B44F306BEEAB795C8AEB7DDB3E": "Un cylindre en tissu résistant monté sur un trépied qui est conçu pour aider les opérateurs à proximité à déterminer la vitesse et la direction du vent.",
    "E816135B4A66E8C1220F92AAD576D712": "Un cylindre en tissu résistant monté sur un trépied qui est conçu pour aider les opérateurs à proximité à déterminer la vitesse et la direction du vent.",
    "8C89D3EB468817667A734CA49548F3F6": "Un vieux camion de ferme robuste qui a été renforcé pour un usage militaire.",
    "FECDF12F4384E339D35524ACE682D1B6": "Une base d'opération avancée temporaire. Les joueurs peuvent y réapparaître et stocker des objets.",
    "36651F93494A7EA89C15F888D9B041B3": "Un quai temporaire qui facilite le déplacement des objets et des troupes sur les grands navires militaires depuis le rivage.",
    "335505CA4DD2B6823A4271A26234435C": "Une route temporaire utilisée pour permettre l'accès des véhicules entre les routes principales et les bases éloignés.",
    "D581ABBD48D282A6772C6687B3F2E5A7": "Léger, redoutable, capable de briser les lignes d'infanterie avec facilité, le fusil-mitrailleur Catara est une arme moderne pour le Colonial d'aujourd'hui.",
    "28E25751432CAFB28FB0F5AE61E7AB14": "Un outil pour creuser des tranchées et autres structures enterrées.",
    "DED233DD427B065FCD3D17BD30D6F2E9": "Un outil utilisé pour construire des structures et assembler des matériaux.",
    "E74EC0C648B4F38DAD740FA18DA68158": "Un outil utilisé pour récupérer les composants sur les restes de vieux véhicules et d'équipements.",
    "8C5D9CF3428C79BC7BAC86AA4F1AED0E": "Un camion équipé d'un râtelier à propulsion de roquettes avancé, le \"Retiarius\" remplit le ciel de roquettes mortelles hurlantes tirées à un rythme élevé sur de longues distances. Contient 16 roquettes.",
    "B30AA138497437782A4300886DD21F45": "Une usine unique pour forger des pièces de machinerie requises pour construire des véhicules. Nécessite du Coke ou de l'Essence.",
    "4D6A78FB4ABDE01432FC6DB3FD4A8A69": "Un véhicule autrefois utilisé par les officiers pour surveiller le champ de bataille, ou pour livrer des fournitures et des ordres en urgence.",
    "D644BDC44EBC4A4720D92596F71A1003": "Un véhicule qui excelle dans la destruction des fortifications ennemies.",
    "4805B3D04DA9C8D7B0D77AB7CFE23D7D": "Un véhicule uitlisé pour construire de grandes structures.",
    "2CBCB7104DE035A60695DAB71E567A5F": "Un char léger polyvalent, capable de manœuvrer dans des espaces restreints. Il peut tirer des obus de 40 mm.",
    "F03BE70D45AE1B67DFC7A6B84E626420": "Une arme conçue pour lancer des grenades spéciales sur de longues distances. Cette arme moderne kraunienne utilise une propulsion avancée conçue pour une efficacité accrue en raison du poids global de l'arme et des projectiles. ",
    "1134F3234A5F463AE53A268D4DBF6B52": "Une valve pondérée contrôlant le débit dans un pipeline. Nécessite une Clef à molette.",
    "959786D541061EB81BE0BAAA89BE5E9B": "Casemate fortifiée équipée d'une mitrailleuse. La garnison déclenche un feu nourri sur les ennemis qui s'approchent de l'angle de tir.",
    "B46BADA6427C7B4029B045A8DE9B9F96": "Une plateforme atelier pour l'assemblage de missiles balistiques en plusieurs parties comme la Fusée A0E-9, ou AEON.",
    "110E6A2C4A6292DA195009B6B22305F9": "Un poste de travail qui répond à divers besoins. Écrire une lettre à ses proches. Répertorier un inventaire des rations restantes. Tout le monde peut utiliser un bureau solide.",
    "0977932E4101EB7BA35DE7B25A2EE0AE": "Un joueur blessé{0}. Déposez ce soldat à un endroit sécurisé afin qu'il puisse recevoir une aide médicale.",
    "05D8FCE14C1B2295EB11CE89E8C6DA24": "Fusée A0E-9",
    "085BFDBE41391E9BA23112AB03491C2C": "Corps de Fusée A0E-9",
    "91105C03499C3F1BE6BE4DB856E5B0F8": "Propulseur de Fusée A0E-9",
    "3038291E4F4394EB893544B9BBDE8664": "Plateforme de Fusée A0E-9",
    "3A9D0CE146319179E0B675B8853E617F": "Plateforme de Fusée A0E-9 & Fusée A0E-9",
    "5AF494EB493CBF37E6E7B7B62DCA4D55": "Plateforme de Fusée A0E-9 & Fusée A0E-9",
    "8467BD9F497428290845D4B6490D2764": "Plateforme de Fusée A0E-9 & Fusée A0E-9",
    "0D4AD0F8419784E10400D89AFACEF068": "Ogive de Fusée A0E-9",
    "D3FBCCB84F1965C600B7309A9D140B4F": "Grenade à Fragmentation A3 Harpa",
    "A0DC06784DFE2350A318C0ADE5D1233C": "Garnison de Canon Antichar",
    "DC94FD1A4F04C9345DCF44AC5D776051": "Garnison de Canon Antichar (Niveau 2)",
    "452C02DC44682EA5ED964781258A5910": "Garnison de Canon Antichar (Niveau 3)",
    "B17D8640441F07CF889D20B79C0FE262": "Fusil d'Assaut Aalto 24",
    "5C8CD8E14CB58B8E050860B05C668E40": "Armurerie abandonnée",
    "1A5343D24EF1242FED4038B6AEE5B624": "Accéder à un stock réservé",
    "10FBAC1C42EA44693A3D079F99BB9049": "Accéder au lien vers le serveur Discord de ce régiment",
    "13E260D342466EC4C7BA899ACA57FB6A": "Accéder à l'arbre des technologies.",
    "299EE0114E937B661974C38629F1DB42": "100% de chances supplémentaires de pénétrer les véhicules blindés.",
    "3748D06A4CF0E1CD9651E7BF1B716D7B": "Ajoute une pompe pour pressuriser un tuyau pour l'eau. Ajoute un port de sortie pour un tuyau.",
    "4CA02B2448DF735B8D722D8848020E1D": "Avancez à la position",
    "4F9290BD4F6302937D8F129F7752839D": "Bunkers avancés",
    "404395D5452B7AB804E20A8002ABE71F": "Liquéfacteur Avancé de Charbon",
    "00DC251C418EAE33D484529CE31D12B2": "Véhicule de Construction Avancée",
    "1E0FBF114D54147462F29E80BEE129CC": "Formation Avancée",
    "EBC7C18745F760E825037881F5F017B4": "Formation Avancée",
    "421C15994938A964D86582AA9EA01082": "Des cuves de traitement avancées qui raffinent de grande quantité de charbon en Pétrole Lourd.",
    "F3C429E744EF3DCA6D577FAEE0AF046E": "Machine de triage avancée qui examine des piles de débris métalliques pour y trouver des matériaux utiles.",
    "2E0DB61849B0CB28D43254924C986178": "Toute la puissance d'un Canon Tempête stationnaire, mais aisément relocalisé par rails. Ce canon dévastateur est capable de raser des fortifications ennemies à de grenades distances.",
    "C1473BF745CF7EE5418F0CB724254A6E": "Tous les véhicules sont produits par les joueurs. Pour les besoins de la formation, tout ce dont vous avez besoin pour construire un camion de transport vous est fournis dans les coffres à proximité. \r\n\r\nAppuyez sur ‘{0}’ à l'intérieur du Garage pour ouvrir le menu de production et sélectionnez ‘Transport’.\r\n\r\nUn plan apparaîtra.\r\n\r\nAvec des Matériaux Basiques dans votre inventaire et votre marteau équipé (appuyez sur ‘{1}’) approchez-vous du plan et appuyez sur ‘{2}’. Cela contribuera un matériaux au projet. Répétez jusqu'à ce que le camion soit construit.",
    "BCA32FE64613C72EAFE9ABBF703FDA5D": "Permettre aux autres joueurs de voir ce Stock Réservé et d'y stocker des objets.",
    "4B7A9A9944CC88C79313BEA8758EE3A6": "Permet de construire des structures en béton dans ce réseau.",
    "3F51D1E242EE95695571389D924BB51B": "Permet de construire des Bunkers d'Observation dans ce réseau.",
    "A4538C06460D98B2A6BC65923E2F3357": "Permets la construction de Canons Tempête, Centres de Renseignements, et Stations Météos dans ce réseau.",
    "20ADE92945A533482C8C2DB147EE0579": "Permet à tout joueur de verrouiller/déverrouiller cette structure/ce véhicule.",
    "3FE159FD4A1B21E847106BA1E627CB1F": "Permet d'accéder facilement au toit de ce Bunker",
    "6E54502B466D07F2D90679BEFDC66ECA": "Permet la construction d'Installations avancées.",
    "980899F241BB51BB958708973B66D0BA": "Permet la construction d'Installations avancées.",
    "A13BE7FE468697F92836E58F1788F22C": "Permet la construction d'Installations avancées.",
    "21EB240942BDDA7DD7796093DE1E3CA6": "Permet la construction d'Installations spécialisées.",
    "2666CC914A81BA338AA9B1A0DB20A2CF": "Permet la construction d'Installations spécialisées.",
    "4CB9CB2C42C092D9A66F438B181D4B0C": "Permet la construction d'Installations spécialisées.",
    "7D6F6EB64F68531718A733A81EC1418C": "Permet la construction de la Plateforme de Fusée A0E-9 et la Fusée A0E-9.",
    "9E4796A947D48A9E06F0B1A311B18FAF": "Permet la construction de la Plateforme de Fusée A0E-9 et la Fusée A0E-9.",
    "AC67792C499B7966C2A74B9D86A2E5E1": "Permet la construction de la Plateforme de Fusée A0E-9 et la Fusée A0E-9.",
    "538B62F341F334A5CA837BA831FA63C0": "Permet le tir d'armes d'infanterie depuis l'intérieur de ce bunker.",
    "230F4A96430DC4B88DA4F8A3C9F13B21": "Permet aux membres de l'équipe de verrouiller/déverrouiller cette structure/ce véhicule et d'y accéder à tout moment.",
    "8BC98A3C4F41647812F1EFA0276BF98D": "Permet aux membres de l'escouade de verrouiller/déverrouiller cette structure/ce véhicule et d'y accéder à tout moment.",
    "397653894046CE62685644B9A017BEA5": "Permet à cette structure de fournir des renseignements sur la carte.",
    "803F34C244FFCA727C342E982D37A100": "Permet aux véhicules de traverser cette tranchée.",
    "1020D6A7418CD1D8CC71AF82029D5B90": "Permet d'annuler un lancement initialisé.  Cela doit être réalisé par plusieurs soldats.",
    "24BB1904401D5F96B9FFE7B008C73C32": "Vous permet de connecter à une autre Station Météo en soumettant le Code de la Station Météo cible.\r\n\r\n<RichText.Regular12.Orange>Doit être inactive.</>",
    "E0881685464D545BEB93A0B60BC2FFBE": "Vous permet d'entrer un code de lancement à 4 chiffres pour lancer la séquence de lancement de la fusée. Cela doit être fait par plusieurs soldats.",
    "2E5ACDEA4438E2F950C1CDB635352352": "Aluminium",
    "25479D654A5B62650D03918F90C80C78": "Alliage d'Aluminium",
    "7B423C2F4346D3306680DDBA6690A3D4": "L'Alliage d'Aluminium peut être utilisé pour produire des prototypes d'objets au Centre d'Ingénierie.",
    "4333024F454F5914F0C770BC54248A10": "L'Aluminium peut être raffiné en Alliage d'Aluminium, qui est utilisé dans le processus de prototypage d'objets.",
    "9CB69A3C4427264B80F202A1C4E8EAE4": "Désactive systématiquement le sous-système des chenilles",
    "969561C94645A423173ACDB0D8FEDA5D": "Munitions",
    "B5A0F44D4F1548AD58DCBF9D9A2E6048": "Munition pour Willow’s Bane Model 845",
    "2B47BB6A40FB28BC50D80D874FA2C301": "Munition pour la Torche \"Molten Wind\" v.II",
    "573A0901430DAC42F31B1DA2869B8D97": "Les munitions sont compartimentées en chargeurs individuels. \r\n\r\nAttention à ne pas en porter trop, cela peut devenir lourd et, si vous ne faites pas attention, gaspilleur. \r\n\r\nAprès avoir rechargé avec '{0}', vous jetez votre ancien chargeur, donc recharger seulement si c'est absolument nécessaire.",
    "6B3F590A435AB55946EC4291BD9DBB64": "Usine de Munitions",
    "287EACEA4FA5B040658F949D3114043E": "Une Tour d'Observation qui fournit des renseignements sur les forces alliées et ennemies dans une zone.",
    "BB9C41C34BE95CF524D9A68ADB7BD364": "Un Champ de Pétrole qui peut produire du Pétrole pour être raffiné ou pour produire de l'électricité.",
    "359C0BBD41434663D2210BAE34FE0A3B": "Un bâtiment abandonné dans le monde qui a été fortifié et mis en garnison.",
    "520E40A4465897CB6909AB982EF89947": "Un bâtiment abandonné dans le monde, qui a été fortifié et occupé.",
    "6925715A41430C49B7133BA0ED9E7CCC": "Un bâtiment abandonné dans le monde qui a été fortifié et mis en garnison.",
    "7287B08A4554E0A48253F18A141CCF13": "Un bâtiment abandonné dans le monde, qui a été fortifié et occupé.",
    "C403C1CE4EC2D6BC384A2598C81413F0": "Une grenade collante conçue pour pénétrer le blindage des chars lourds. La Bombe Collante ne peut être lancée que sur une courte distance et est inefficace contre les structures.",
    "E6753E7042D00FBC1FE9F18B965519E0": "Variante améliorée du Universal Assembly Rig, le BMS - Fabricator est conçu pour réaliser des travaux de construction et d'excavation avancés ou spécialisés.",
    "CF5CA88E4B25F8D5D333F8BD457CA68E": "Un obstacle antichar qui empêche l'accès des véhicules à une zone et est résistant à la plupart des types de dégâts.",
    "BCB57CE24277EE614493D3870232C97D": "Un obstacle antichar qui empêche l'accès des véhicules à une zone. Peut être démonté avec une clé à molette.",
    "3E767BF54AD3C8CD8C5794A295366BBC": "Une zone qui a été dévasté par l'explosion d'une Fusée.",
    "4FF9AEB9471E5F32F05AD0978CD2E4D9": "Une zone où certaines structures peuvent être construites et préparées pour l'expédition.",
    "DAECD1FE49B2986E11E4C7A1F87F053C": "Un véhicule colonial tout terrain blindé utilisé pour soutenir l'infanterie lors des assauts.",
    "A8D45D054678B1E87811FD92753189FC": "Un véhicule blindé tout terrain Warden utilisé pour soutenir l'infanterie lors des assauts.",
    "0C110267401A61E4812700A5D1D9DA5F": "Un véhicule blindé amphibie colonial utilisé pour transporter l'infanterie sur terre et sur mer.",
    "3B508C464E0D71999AEA6C865D3FD3E3": "Un véhicule blindé amphibie Warden utilisé pour transporter l'infanterie sur terre et sur mer.",
    "38210D904CEC56EA82684A81ED481C39": "Un projectile perforant utilisé avec les lanceurs indirects de RPG.",
    "6128D3124DA308F4F754EA9A04B8934C": "Un projectile perforant utilisé avec des lanceurs RPG spécialisés.",
    "D46DC87D4F9D8BD90738F395045E66A1": "Un vaisseau terrestre blindé renforcé par un alliage aujourd'hui disparu. Cette bête presque indestructible peut transporter jusqu'à 8 passagers. Les rumeurs de son existence remontent à la première brèche.",
    "089A31E0489395AADF4E83B5605D23C8": "Un wagon de train blindé avec une position de mitrailleuse montée conçu pour transporter des soldats d'infanterie en sécurité sur de longues distances.",
    "CAF0D5B94820FA9927F5CFA48CA6FC91": "Une aire d'assemblage avec équipement spécialisé pour rapidement construire et paqueter des matériaux nécessaires sur la ligne de front.",
    "F98FB64E41B0B50D3D2C3596A50D8578": "Un assemblage construit pour fabriquer des pièces utilisées dans la construction de navires militaires à une Cale Sèche.",
    "C2DBF65D49CC8B89D774859A5C7BC1D2": "Une station d'assemblage pour produire des plateformes d'armement fixes et des chars spécialisés.",
    "2F254DC44891E6535C6201B4724A13AA": "Une station d'assemblage pour produire des armes de campagne et des véhicules utilitaires comme les Moissonneuses.",
    "88E1FE324B36D19DE98FB996E0ABC39B": "Une station d'assemblage pour la production de semi-chenillés et de véhicules lance-roquettes.",
    "20A1C3664007D85568E78E8244AFA21D": "Une station d'assemblage pour la production de véhicules de type char lourd.",
    "DDED53D149082D9F5D73E1AE4022BB86": "Une station d'assemblage pour produire des véhicules logistiques légers comme des camions.",
    "EAE40080413B1A736D3E658ADE6ED717": "Une station d'assemblage pour produire des véhicules de type char.",
    "D1C3541147558B79B9EEA9B8BFF91822": "Une station d'assemblage pour produire des wagons.",
    "4A3D896B46DE138A5BBDB79697293EC7": "Un fusil automatique qui a joué un rôle essentiel dans le maintien des intérêts Mesean sur le continent Katoman. Il n'a pas la cadence de tir des fusils d'assaut, mais de nombreux soldats parlent avec enthousiasme du Catena comme d'une arme à feu solide, facile d'utilisation et fiable. Il ne brille pas dans un domaine particulier, mais fait admirablement l'affaire en tant que fusil polyvalent.",
    "30F9241E45E138237EF27388086D76A0": "Un canon antichar retranché, manœuvré par des troupes stationnées.",
    "8548255244214F885F3BC987D43CFF8B": "Un canon antichar retranché, manœuvré par des troupes stationnées.",
    "1EA65A55461E4B0A7920AFB286ED6FF8": "Une Garnison d'Howitzer retranchée tenue par des troupes stationnées.",
    "524FA7AF44764FE15E06C597B35BFA23": "Un bunker retranché défendu par des troupes stationnées armées de Fusils.",
    "D67BCCE842BCDAE460EF34AC5925EB38": "Un bunker retranché défendu par des troupes stationnées armées de Fusils.",
    "DD627D894CBEF4FA7B6F74AAC132C532": "Un bunker retranché défendu par des troupes stationnées armées de Fusils.",
    "2AEC4FD94C92D931CA73709E1A0E95FE": "Une mitrailleuse retranchée tenue par des troupes stationnées.",
    "5D4F55AB45C4585A9C3174B3FC6E4BFE": "Une mitrailleuse retranchée tenue par des troupes stationnées.",
    "3FB2C8014B36DA15F18FDA8096AC97AA": "Un excavateur qui permet le minage de Composants Endommagés lorsqu'un Champ de Composants est épuisé",
    "2C2D160A428EC77DFC0529BF2BF56353": "Un atelier élargi pour le traitement manuel de matériaux délicats.",
    "44636ACF41EB1B2E747168901D8D90B3": "Une grenade explosive Estrellane spécialement conçue pour être utilisée avec des lance-grenades portatifs. Cette grenade moderne possède une plus grande charge utile et est mortelle pour l'infanterie et les supports structurels.",
    "C2B0FD2F4A9ECDEB98F6F49A2C15ED2C": "Charge explosive qui explose à une profondeur donnée. Ces munitions anti-sous-marines sont tirées depuis le pont des navires de guerre à l'aide de lanceurs dédiés.",
    "1A4965A840057F1C18D592AEA3A3425E": "Une fiole explosive utilisée pour faire fondre les blindages ennemis. Cette bombe liquide soigneusement conçue explose en un flash éblouissant de débris en fusion à l'impact.",
    "E3283173491194AADB200889AEC23823": "Une munition explosive utilisée avec des mortiers.",
    "2FFC493745AD336FA09A7C918F944E58": "Un silo industriel pour stocker différents types de Carburant.",
    "9412D2F44236A4C90F19698CC2B4C79F": "Une fonderie industrielle pour faire fondre la Ferraille pour enlever les impuretés. Nécessite du Coke.",
    "B7EA2E194514BD75337954991CF58FD2": "Une vieille Place Forte. Les joueurs peuvent y réapparaître et y stocker des objets.",
    "7D6629B140F3E6A721CA529CD155C39B": "Un vieux canon de défense côtière qui a été réutilisé pour la défense d'endroits stratégiques contre les bombardements navals.",
    "A505DB14475E021CA9ED6EB028A9F393": "Un vieux fort. Les joueurs peuvent y réapparaître et y stocker des objets.",
    "7D4855DD49E6C9200A910E8BBB8FE967": "Une vieille mine qui récolte automatiquement des Composants en utilisant du Carburant.",
    "2C5C40C644F89632A8A528B61C30E352": "Une vieille mine qui récolte automatiquement de la Ferraille en utilisant du Carburant.",
    "ADC9868E4290EDFEE4D2A99BCE350C68": "Une ancienne mine qui recueille automatiquement du Soufre en utilisant du carburant.",
    "438238C8412EFBC68EFBC6ACB6E9269D": "Un vieux fusil de guerre Mesean. Il possède une grande puissance d'arrêt, mais n'est pas aussi précis que sa variante moderne. Une arme de légende, les Howling Lions l'ont utilisé lors de leur raid sur les plages de Fisherman's Row.",
    "7EEE189E4C3E6C2D5DA07688D313B0C8": "Un vieil obus d'artillerie qui n'a pas explosé. Les marques sur le côté indiquent qu'il s'agit d'un obus puissant et devant être manipulé avec précautions.",
    "3994813743F8239B38E1719DA4C69A36": "Un modèle ancien mais fiable de fusil long Kraunien. L'Omen est une arme simple et robuste, utilisée de préférence dans les escarmouches à longue distance.",
    "BA343B0D481CD54B81AEC9B1B7EB3C94": "Un conteneur ouvert utilisé pour stocker des ressources brutes qui peuvent être transférés vers ou depuis des Installations. Les stocks sont publics.",
    "3061273B45958F0419EEBC903979244B": "Un instrument optique utilisé pour observer des objets éloignés.",
    "E0713BDF41E80039FBB40F860B7372AF": "Un obus rempli de projectiles à éclat, utilisée par les mortiers. Dévastateur pour l'infanterie à proximité.",
    "146E3BC4493F5187B80261B519E61AD8": "Un abri souterrain qui sert de base à des fortifications permanentes. Se connecte à d'autres bunkers et tranchées.",
    "1B8A795C4346BF4910F771A9CC959AE0": "Un abri souterrain qui sert de base à des fortifications permanentes. Se connecte à d'autres bunkers et tranchées.",
    "462C2AAC458B967E79A89CB1E96F900E": "Un abri souterrain qui sert de base à des fortifications permanentes. Se connecte à d'autres bunkers et tranchées.",
    "96AEF3EE49134BE9CA3562BFF39C8172": "Un abri souterrain qui sert de base à des fortifications permanentes. Se connecte à d'autres bunkers et tranchées.",
    "CBE454CA4DE3742BC66CDC902E39708C": "Un abri souterrain qui sert de base à des fortifications permanentes. Se connecte à d'autres bunkers et tranchées.",
    "D74CA7D0448C72B0FBAB39AA6E10FDB2": "Un abri souterrain servant de base à des fortifications permanentes. Se connecte à d'autres bunkers et tranchées.",
    "AA2D0B2444A7325577C78395E4C05967": "Ancien par rapport aux normes modernes, ce Char d'Assaut Colonial fortement blindé de première génération est équipé d'un blindage complet et de deux canons en sabord.",
    "7D63A5EF4E99E0E2A4609396B116AD60": "Explosif Antichar",
    "E34A663C4D6E568183406BB35FC6DC99": "Explosif Antichar",
    "5A46915A45815F648E76D5B15E42D7E8": "Grenade Antichar",
    "E7733BFE47422A5611A7F1969000571C": "Cinétique Antichar",
    "6F622E7C4ECBCCFD937090A9D714B516": "Casemate Antichar",
    "0E81F8184420E52AF987BD986FB141A4": "Lanceur de RPG antichar",
    "24F2C7C6451FF1CEFC9D27BAD50DD344": "Lanceur de RPG antichar",
    "62CF12984D72C537677948A56CF26831": "Lanceur de RPG antichar",
    "8096C964450D09D71E53F1920124E819": "Lanceur de RPG antichar",
    "6FD3271E4C2FB2E080106997F21A1866": "Fusil antichar",
    "6A5752A9482F81ADD20B5D83F37BF45F": "Bombe Collante Antichar",
    "E466A11F42816813A2355989C908791C": "Fusil Argenti r.II",
    "3B4A004742F4396225D37A89EDA41387": "Armé d'un double canon de 75 mm, le \"Arès\" fait plus que compenser pour manque en vitesse et en polyvalence avec de la puissance destructive brute. La création de l'Arès a été chargée de conflits, et son histoire est entrelacée par de nombreuses périodes d'émeutes éclatant dans les rues de Dimiourg. Les rebelles ont réquisitionné le premier prototype de l'\"Arès\", le O-75a, et l'ont utilisé contre les forces armées Coloniales dans la région, ce qui a ultimement mené a sa destruction—bien que les force Coloniales ait effectué un grand effort pour y parvenir. Cet évènement a tissé l'histoire de ce colossal monstre dans l'immense tapisserie des légendes Coloniales.",
    "09284D09449218360DF41C8EAE3F7314": "Armé d'un râtelier de lanceurs de Bonesaw mortar, le Thornfall est conçu pour lancer un assaut mécanisé indirect sur des blindés ennemis. Ce véhicule unique soutient un assaut allié et ne peut pas résister à beaucoup de dégâts.",
    "4FE32C9E48BEBECA05618A818A15338B": "Armé d'obus explosifs de 40 mm, le Smelter est parfait pour attaquer les blindés ennemis. Le bouclier anti-souffle frontal offre aux opérateurs une large couverture lors des escarmouches.",
    "B57E02DC42C110B1165928AC9F308126": "Voiture blindée",
    "16FE3B95486836B5A7DC768871429B86": "Anti-Blindage",
    "7BC3E3594AF707EE486D10A8B882D85A": "Anti-Blindage",
    "89E1D86C4E0DF0898E165DB38396C7AB": "Anti-Blindage",
    "1499A7DD45E0DC3A5C297B9525DE06AF": "Voiture Blindée",
    "1906CDA343887D8C2561EBA7FDA6D151": "Voiture blindée",
    "1AD8DA2A4295C17CF19B62998F4D7FF0": "Voiture blindée",
    "5B382CCC4E70061B9FE1BE9A62C6EFB1": "Voiture blindée",
    "75C3D21B4CD91A107EB544B34B8AD4A8": "Voiture blindée",
    "7D2B50D64A9252C72E56A8897E440D3B": "Voiture Blindée",
    "84459BF049B049D1A6CE95B5BB1D6465": "Voiture blindée",
    "ADF89343477EB10E23A2258BA9CCEA44": "Voiture Blindée",
    "EDE3E0F345E08F07B7651CA9908F645B": "Voiture blindée",
    "9CC33CDA47786D2C118E63BF964B5B53": "Tracteur blindé de combat",
    "D8C713AD495BBBD6D083FBB673EBE6B3": "Munitions d'artillerie",
    "032310524326921E393FEC9576A20049": "Les munitions d'artillerie sont de grands objets et doivent être portés physiquement jusqu'à l'Artillerie pour recharger. \r\n\r\nAppuyez sur '{0}' pour charger l'obus lorsque vous êtes à côté de l'Artillerie.\r\n\r\nVous saurez quand vous serez assez près lorsque la commande apparaîtra en bas à gauche.\r\n\r\nLes obus d'Artillerie sont fournis dans le coffre à proximité.",
    "1D7D3FF9464EF8F4DBBB77BB5574E183": "Les bases de l'artillerie",
    "E04D38FD4B4F1EE489829484ED764CF9": "Polygone de Tir",
    "E7095F264A0F3999B5E535895E442F36": "Polygone de Tir",
    "BEF308A743681EB0357FAFA43962E180": "Abri Anti-Artillerie",
    "306201AC44F6AA3A4EB10A892ED86CB7": "Formation à l'artillerie",
    "768D1A844FAF003406F20DB9811742DD": "Formation à l'artillerie",
    "80B30B2E4AD9708143AAF882A43E9A6D": "Formation à l'artillerie",
    "D15DC121499F8111965E4F862889D146": "Formation à l'Artillerie",
    "4BECA10D446F2DBF7A4C318D0F1ED81A": "Artillerie et vent",
    "684E41AA4722C781B8AB0D98F71A8F92": "L'artillerie et toutes les armes à tir indirect sont affectées par le vent.\r\n\r\nLa puissance et la direction du vent affectera la trajectoire et la dispersion de chaque tir.\r\n\r\nVous pouvez déterminer la direction du vent grâce aux drapeaux sur les structures, comme les tours radio près d'ici, ou grâce à un Manche à Air déployé par un joueur. \r\n\r\nLa vitesse du Vent peut être déterminée par la force avec laquelle le drapeau bouge ou par l'élévation du Manche à Air.\r\n\r\nDes tirs de test peuvent être important pour déterminer l'impact actuel du vent sur vos bombardements.",
    "29D51F9B45A364ACF11B27A1879A268F": "Fusil d'assaut",
    "7D6C68A7498074E1BC64ABA586E26830": "Fusil d'assaut",
    "B98E97D8418EB19A4D2DCFBE7E2796B5": "Fusil d'assaut",
    "44D43340487F92751E665C999A14A61E": "Char d'assaut",
    "647966CE498AE39FB76178B6BB05C490": "Char d'assaut",
    "C01E254C43ECE1C45AC4F0B4BBB00D69": "Char d'assaut",
    "C10C3B9149C8AE06FBC2E1A2D23F9706": "Char d'assaut",
    "962993C94EEE298FB2DB74AA6ACCFAE7": "Aire d'Assemblage",
    "9F351F9844C8E89BC33C2682E291A71D": "Matériaux d'Assemblage I",
    "7FEADAB14DDDB46315E04FB48249A768": "Matériaux d'Assemblage II",
    "73092B1B41455FB70F8E3AA5225DEF3B": "Matériaux d'Assemblage III",
    "B8DA40AC47EEBC6838E97E82C92B738D": "Matériaux d'Assemblage IV",
    "4BF3ADB2426347104A372CB3ABD2ECDA": "Matériaux d'Assemblage V",
    "59AA1F294227A46FD442FEB0E31101CE": "Attribuer un point d'apparition",
    "DC4D892841B6D810A02AD1A140CDD38D": "Attachée au canon d'un fusil, cette lame courte peut transpercer les ennemis lors de combats rapprochés.",
    "E240EA5F4021348EB53395BDE9D1DC3D": "Récolte automatiquement des renseignements de façon régulière lorsque équipé.",
    "49AE335D4D6E6A2555F6A99FAB791AFC": "Grue Mobile BMS de Classe 2",
    "0671D7C7434E205636B487A770356A25": "Camion à plateau BMS - Packmule",
    "A652FDF2436E1C3E5A60DEABF3FE15E4": "Balfour Rampart 68 mm",
    "D23195CE47C3C7F9FC9AB687FEBCB432": "Balfour Stockade 75 mm",
    "51EF2ACC4A46A94B876D79A2A5CA914F": "Balfour Wolfhound 40 mm",
    "15EC16AC4525900296BA8F849C873642": "Fil Barbelé",
    "40DCC52641A2BEA2C8781AA76FBECD01": "Fil Barbelé",
    "9C8F3E3F49EED660C7DC1DB0EAB48C4B": "Fil Barbelé",
    "AFE26FC442A8A44A6E07078C446F6052": "Fil Barbelé",
    "DEFFEB1542F16098DE717CBBC9E0E224": "Clôture de barbelés",
    "85C257DD4DE800F5B4A03BB06195F8DC": "Barres de matériaux extrêmement rares, utilisées dans certaines des constructions les plus avancées et les plus complexes, telles que les grands navires et les Fusées AEON.",
    "DEE926084933FAF21E74388FF496CB28": "Vaisseau-mère",
    "85FCF46649BD8A17654F6099EE1B3A62": "Contrôles de base",
    "56E9AB08437B2C3F07B9B6B9A4A97425": "Matériaux Basiques",
    "4486854546BDD8408DB1399DF426B84B": "Minage basique",
    "14F93A8E4DA52E1721BB0AA5C8074B5F": "Formation de base",
    "426491D64B0EB5D503D2D7AAF74335CA": "Formation de base",
    "428D0601449BEADA5FD30E8732DF8104": "Formation de base",
    "48A20D94443D0403F04A3EB845A2E254": "Formation de base",
    "C551885241F0829D95C2F7B476F7E6A5": "Formation de Base - Appuyez sur 'E' pour lire les panneaux",
    "A21D89EB4DB45C22C77CE8800B557A8C": "Formation de Base - Appuyer sur 'E' pour lire les panneaux.",
    "2D728244461A766747E2B1AF999FFE26": "Cours de formation de base",
    "918C96D94CD5A98C33932CBEC80273F7": "Commandes de conduite basiques",
    "8B342E6D4B748A0311B35BB746956FB7": "Contrôle de base des bateaux",
    "CA569B7A4E573693319FA2877ABD5F24": "Ligne de Batterie",
    "B1A4A34B4DABDBE0A1807FA3B600FA74": "Char de Bataille",
    "BADC9CAC45AA98419BBFECBC07730579": "Char de Bataille",
    "C9B6FAED4D6A9649507A529FCA2214AC": "Char de Bataille",
    "D0CFDF384D7C6540501C4E9D29B19C40": "Char de Bataille",
    "E2584992471875960E5AC9831A1C360D": "Char de Bataille",
    "EB73DAF04735416C9EDC1CA057B3BF59": "Char de Bataille",
    "27CD79F64AD124F90E5DA58C89D0D5BA": "Cuirassé",
    "FB6901DF4B521D17E3DB058C29943DD8": "Cuirassé",
    "2D231692474A10B835AD15987C4261A9": "Baïonnette",
    "384007324813AFE2835C288261F1C85C": "Des lits empilés les uns sur les autres. Cela n'a peut-être pas l'air très confortable, mais quand il est temps de se reposer, la couchette d'un soldat est sa maison.",
    "46FF81A846392084A21528B050609541": "Avant de continuer votre entraînement, veillez à mettre votre point d'apparition à la Base Avancée devant vous. \r\n\r\nAppuyez sur ‘{0}’ pour interagir avec la Base. Ici vous verrez son inventaire et différentes options pour améliorer/gérer la base. Ignorez celles-ci pour le moment.\r\n\r\nCliquez l'icône de ‘maison’ qui clignote et dit, ‘Attribuer un point d'apparition.’\r\n\r\nPour plus d'information, cliquez sur l'icône ‘?’ dans le coin du menu de l'Avant-poste.",
    "13E8607E4B11E966FF383C866DBA439E": "Bicyclette",
    "3D0C540D469746133D2B58BDF7720455": "Jumelles",
    "2858687F4D89CC7A45C0969296E6B424": "Haut Fourneau",
    "E52E575F4B007AA26F9B53B54681749C": "Plasma Sanguin",
    "1553632448AAEF6CB6590F92A1807877": "Grenade Bomastone",
    "8BB336F4459740A6ADA7B28B2D91748B": "Fusil d'Assaut Booker Model 838",
    "3ACD511F4912CB4948C7A6A84A50D586": "Base Frontalière",
    "DAB76DD8460B940642C70183B489D8D3": "Base Frontalière",
    "9F0F65CD4302C4CE3921109029A92512": "Née et élevée dans le froid nordique, cette parka épaisse protège l'infanterie Warden de tous les blizzards, sauf les pires.",
    "E133B1F84BF4829072F91D9C9E334F57": "Fusil à Pompe Brasa",
    "EE33C96F43870BE6829717B79B9424E3": "Pont",
    "F622BED543979E2D93843895A998A5FB": "Chevrotines",
    "35255C004C2A84C0BEA2D0BA1076D91C": "Construction",
    "B2F0A8094EEF74E899DDF0AECCFEC187": "Construite comme une lame de scie, l'arme fixe DAE 1b-2 est équipée de trois tourelles mitrailleuses en cascade. Ce qui manque en puissance au \"Serra\", elle le compense en pure vitesse de tir pour une arme de cette taille.",
    "67E6082943E82F1416ED919ECF796D27": "Construit sur un châssis Flood inversé, le Mk. IX Stain est une plateforme d'artillerie mobile. Une fois déployée, le Stain permet le tir indirect d'un canon de 150 mm sur de longues distances afin de pilonner les positions ennemies.",
    "060499444E1A1AC48E7009A0B0100C41": "Construite sur les bases des premières armes automatiques introduites dans la Légion, la mitrailleuse \"Lamentum\" mm.IV demeure une arme intimidante sur le champ de bataille. Dotée d'un grand chargeur et d'une portée de tir impressionnante, cette mitrailleuse montée excelle dans les tirs de suppression.",
    "129723254F4FA3055EC075AEF8F9EC9D": "Construit pour braver les collines des provinces occidentales d'Alliant Union, le Taurine Rigger est une variante modifiée Vélienne qui se spécialise dans le remorquage d'équipements lourds et le transport de fournitures sur terrain hostile. Employé par la Légion Coloniale depuis près de trois siècles, le A150 est devenu un outil indispensable aux opérations Colonial. Il n'est donc pas étonnant qu'il a souvent été imité, mais jamais répliqué jusqu'à présent.",
    "E37CF3AA40FC2B92AE19B2BFFA3DCDAD": "Construit pour complémenter des pièces d'artilleries autonomes, le Huber Starbreaker fixe tire des obus de 94,5 mm sur de très longues distances. Un outil nécessaire à l'infanterie pour contrer les avancées blindées Colonial.",
    "484B31D44BF6AC36F3681B9D05164FBA": "Bunker (Niveau 1)",
    "7FD22BA74AFB35B58402159E4950E71C": "Bunker (Niveau 1)",
    "3C75FB8E4DA1AA89618AABB37738C340": "Bunker (Niveau 2)",
    "CD7E6AEE4109788F963DBCA9042D8073": "Bunker (Niveau 2)",
    "614680D946C3DF5953C2F5B27950E7D6": "Bunker (Niveau 3)",
    "B0AB88974820ED53D2F323BC11B8F8D8": "Bunker (Niveau 3)",
    "0BE2018C4E7600273BBFB0926A3368F1": "Base Bunker",
    "2C90B2094C515F967A530F9FF3B5FD04": "Base Bunker",
    "58359C304D7483C5FE2CABB93B9C5565": "Base Bunker",
    "89EFC7894E13A4336D3FBBAF5EFF7081": "Base Bunker",
    "95E04A1F4A578E6639A4F9A7893B5230": "Base Bunker",
    "DE8F6CF34B47D27A97D26498470A0E83": "Base Bunker",
    "B79388114A649658BD9B7392F34E3002": "Bunker d'angle (Niveau 1)",
    "E06894BE4FC768070961C6BA1A7C05F1": "Bunker d'Angle (Niveau 1)",
    "6C5CD6914591DE85BFE23B9B2FF95899": "Bunker d'angle (Niveau 2)",
    "6D6C0D57456CD5906C50B0BF7C0E6EBC": "Bunker d'Angle (Niveau 2)",
    "2CE3A9FD4C0F548DFC0FA9AA6B4F4A58": "Bunker d'angle (Niveau 3)",
    "EB8DAEE74DCD07A4DCD890893212EE02": "Bunker d'Angle (Niveau 3)",
    "F1141BC044BBDD2ACFC965938DE0E90C": "Site de construction de Bunker d'angle",
    "774B74BC480322205AF8DF942CF274AA": "Site de construction de Bunker",
    "9D7C4C6C49C6FE229B83C28E0019262D": "Foyer de Bunker (Niveau 1)",
    "E32D1103404DCC185BA296A48AA5CA61": "Foyer de Bunker (Niveau 2)",
    "3CE9D0C346D032C3B85F41BBD98CBC67": "Foyer de Bunker (Niveau 3)",
    "58C77B2041868E44E07CB7BF59DED5C6": "Rampe de bunker (Niveau 1)",
    "AB0323BD4B2E183A2A6BE18947017318": "Rampe de bunker (Niveau 2)",
    "3527915849504828A54D32B292A55897": "Rampe de bunker (Niveau 3)",
    "7441C17F4DFCF19400DA0E8F44B14AEC": "Fournitures de Bunker",
    "6069A42B46A68A3CF4911BB9A0524B6F": "Couchettes",
    "8D0564AE4A7D162B63E36CAF21525D17": "Fourgon de Queue",
    "1E76100A4B41EAD50B1903917C499955": "Les cuirassés de classe Callahan sont des bases mobiles massives et complètes. Ils disposent d'une puissance de feu suffisante pour anéantir les navires ennemis et leur équipage, ou pour faire pleuvoir la mort sur les côtes voisines, tout en résistant aux coups grâce à leur coque renforcée. Ils portent le nom du fondateur de Caoiva et premier Archonte, qui a tenu bon lors d'un conflit avec des clans rivaux qui voulaient sa tête. Plusieurs Callahan demeurent ancrés au port de Whedon's Row.",
    "47AE8B944AE9D9ACA5401BA9F2C4B00A": "Caméra",
    "BF6D42B547FDE7EE6A4D469D64FEB21F": "Annuler le Lancement",
    "773539C34D3E0E6009BBC5BBE7B1FFA3": "Annuler le ravitaillement en carburant",
    "29A6FC6346783BE4E720D7B5B355FAAF": "Annuler la réparation",
    "0E6FD8764B655005ECD2B5B4A82764AC": "Canonnier",
    "2861CB11481E565228DFC7A6993E92E4": "Canonnier",
    "2B1C7FD440AB516560C5BB9332E2E878": "Canonnier",
    "4890FFF94F782254756387816D6C0B41": "Canonnier",
    "48BE62C24A52FC1F686B1BA1FD330D14": "Canonnier",
    "4B9EF3A5491D8379E3032B9994F297DB": "Canonnier",
    "51ECB3244FDFF6B8431B9A87093FD7AC": "Canonnier",
    "5C12DF1D4EC4105A66013791A1AF6965": "Canonnier",
    "5CD267614E1A95C8E1C127B005B056B5": "Canonnier",
    "640A9E654294E08A39785C9DE9CC1CAD": "Canonnier",
    "640BE1EE4F6FB1DFDE25238D0A58AB96": "Canonnier",
    "7079246F46B9D85C365C7B916684743A": "Canonnier",
    "756DDD5043ED88F6751E309A05CAB156": "Canonnier",
    "81398FE44552F779D3E7F1B03557195E": "Canonnier",
    "8315C78749C81A289F7AA0AF8EFEC7A6": "Canonnier",
    "8DE3C12B44176B3B9975789CC2F52953": "Canonnier",
    "94BE70E9424A233044C1C2AD1D90A283": "Canonnier",
    "9C87895D4E4F3558EC8AAF8BE01EB827": "Canonnier",
    "9E7AF3424BCB2AF117A041B821666EF6": "Canonnier",
    "A50FD36443E4E23540742B94117A935C": "Canonnier",
    "ADBEAD9F4915E80CBADEAB8546C3460D": "Canonnier",
    "AE91F5844E90DD848834E990B00F96DB": "Canonnier",
    "B2344A2A451F110AC694C2969B536FB3": "Canonnier",
    "B5AEC7DF4951DEFC301CC8AD9B6D791D": "Canonnier",
    "B62DE30642D7AA30A9E817AA5F8B5ADF": "Canonnier",
    "C1C6E730449313C219642FBF75D977C0": "Canonnier",
    "C1EEF8D34895CAC21D787789FD5E92AC": "Canonnier",
    "C2329B84497869D276459891BC0071A4": "Canonnier",
    "C2C799C441879E3849B3D6A00F47F4E6": "Canonnier",
    "C731333E4348DD99535FBC8F99BEAF98": "Canonnier",
    "C79801EE4B6B5C469E9E26A7645D11DC": "Canonnier",
    "D536BC564C4C527E040FAF9C839B0840": "Canonnier",
    "D6A9E89D444DA7F5A8465D850B119AD5": "Canonnier",
    "F84F78494A08049A8BFC2691C9B914F3": "Canonnier",
    "FE33F17647EC0E8F67C91F8089A9D034": "Canonnier",
    "9826FEAA4ADCCBC769AD49B5DB1E3832": "Parka Caoivienne",
    "8B21386A469DEF1ED9EB18ABCCEB5485": "Les blindés Caoiviens sont inégalés dans leur conception et leur résilience. Tous les équipages sont équipés d'une combinaison robuste et de ceintures à sacoche pour accéder aux outils essentiels à l'entretien et au fonctionnement des chars.",
    "53DBD4A2463DC1D888364B8F47E1D32C": "Les ingénieurs Caoiviens sont légendaires par leurs chants et leur stature. Ils portent des uniformes spécialisés, équipés de ceintures et de sacs pour faciliter l'accès aux outils et aux matériaux portatifs.",
    "95AA7C9F4FE4BDCF0FDCCB9469598AB2": "Capable de tirer différentes grenades, rapidement et à longue distance, le Fissura gd.I est assez mobile pour être aisément transporté, tout en augmentant l'efficacité de l'équipement d'infanterie. ",
    "F87E18FD4755B4CB776A3EB320EE4892": "Capable de tirer différentes grenades, rapidement et à longue distance, le Fissura gd.I est assez mobile pour être aisément transporté, tout en augmentant l'efficacité de l'équipement d'infanterie. ",
    "038C70F64E276B0BC5124CA96B12234B": "Fusil Auto Catena rt.IV",
    "A0304AB148E77AF71F6BB183D703BBF4": "Pont de Passerelle",
    "D85BBEEB45FD4DAEC608A489B4EC006B": "Plate-forme Passerelle",
    "E27BBDD245BCB9327A6B968A5B6C416A": "Escalier de Passerelle",
    "B4F14CE84B8BECD58981A58064C4FAC7": "Produit des dégâts sur la durée",
    "17227DAE4C39D298FD77349E325BF4F2": "Tableau noir",
    "5DA7887C4258C3E2CB39189DCBFC40BA": "Changer de carburant",
    "011CA5F541D075F50B492CABA5EBFEDD": "Accroupissez-vous ‘{0}’ ou allongez-vous ‘{1}’ pour réduire votre silhouette et accroître votre stabilité. \r\n\r\nEntraînez-vous à vous déplacer accroupis ou allongé dans le parcours suivant.",
    "CA95D7E34CCB1C1AAB7B16AE8F5BE756": "Changez le type de carburant de ce véhicule entre Diesel et Essence. Les véhicules fonctionnant à l'essence ont un couple moteur plus important.",
    "B3DE06B64E0BA3E8F1F93DB181593D80": "Des morceaux de Charbon brut qui peuvent être raffinés en matériaux requis pour la production et la génération d'électricité dans des Installations.",
    "C1E6A0284B37E5E5B582D8BD3DED6AEF": "Capturer 1 ville logistique en territoire de départ enemi quand votre faction possède moins de 35% de toutes les villes",
    "D5ABF0594143D621FFB66B9FA5C0F068": "Supprimer la Connexion Entrante",
    "3D8441594CCA8971F9EBA6A5B5831BF7": "Supprimer la Connexion Sortante",
    "F560374A4D6E1F382A29348CA4D28987": "Supprimer la connexion entrante venant d'une autre Station Météo.\r\n\r\n<RichText.Regular12.Orange>Doit être inactive.</>",
    "486231D94731D5A1C73C108F85618CE4": "Supprimer la connexion sortante allant à une autre Station Météo.\r\n\r\n<RichText.Regular12.Orange>Doit être inactive.</>",
    "C47DCC72479A6F1DD6307B919D1F32A7": "Grimper",
    "5BA2187146CEB825CB4228AA35F47B70": "Fermer la Cale",
    "E45EDB8F4F9D682155319D8CEF73C968": "Ferme la cale pour permettre la construction ou réparation de navires.",
    "D9546E22416383B1AABF059FC045B64E": "Charbon",
    "08AA3BCC4623C87DB4E661A4F8A676CD": "Champ de Charbon",
    "7FAF2CEE488B1E9D22282F9DD0A4D416": "Liquéfacteur de Charbon",
    "D79F7FC64BBDB3720DE384B1A449391D": "Centrale à Charbon",
    "C82D1D704AFAF5F82D9090A61417B3E3": "Raffinerie de Charbon",
    "05FB560543B6B5D7FB760A932DDF2596": "Canon Côtier",
    "D18901BE48F54CD90D61ABB39940BE7E": "Fourneau à Coke",
    "B80277BE489804CA7459B39FBB06B7FE": "Canon Collins de 68 mm",
    "335CC5A441994402460A2DA1C6B02C77": "Les ingénieurs de Colm Gallagher ont conçu une variante de l'Outlaw dotée d'une mitrailleuse dans un tourelleau indépendant, située au-dessus de l'armement principal composé de deux canons antichars. S'il manque de puissance de feu brute par rapport à son aîné, le Highwayman le compense par sa polyvalence.",
    "94F1CEFF4227509BE33B1989F55C6DAE": "Uniforme d'Armure Colonial",
    "CE22DA364D75F47BFC847E811CB9DDC2": "Les Voitures Blindées Coloniales sont des véhicules de combat urbain rapides et équilibrés. Ces modèles anti-infanterie sont munis de mitrailleuses jumelées.",
    "06209EF04AC1AF6314401B9F8225E5A8": "Uniforme d'ingénieur Colonial",
    "CB181E6349AB3EF12388D088EE90B285": "Uniforme de Grenadier Colonial",
    "B4E25007455E19F7C46FA1B02479FFC8": "Région d'Origine Colonial",
    "CB7C260743140BD84D36BF86EDE1C785": "Uniforme de Médecin Colonial",
    "970015384E151C88F0FD219FB6D53F4C": "Uniforme d'Officier Colonial",
    "33C6E9B1418286BEB4216094FB644868": "Tenue de Pluie Colonial",
    "D8DB9DFC4336C5ED55C9A990F246E78C": "Uniforme d'Éclaireur Colonial",
    "29AC5303429354A56648F583E51FF6A4": "Uniforme Hivernal Colonial",
    "12DB89BF4E72823287073CA4DF328868": "Uniforme de soldat Colonial",
    "3531DF4F4548B0DA79CC23A10FAA95A6": "Point d'Apparition des coloniaux",
    "DC42649544472E4A5C5CA7A9D1F4C78D": "Uniforme de Tankiste Colonial",
    "17E625BF4F67CA1B168D2E90D6F48427": "Wagon de combat",
    "901E2C834747895953A856A5DC67E063": "Wagon de combat",
    "21E762044E8DE112BAE0F9B2643DDF11": "Commandement",
    "A6C9A53541B0C0D17A1767BC6731ADF4": "Combustible commun utilisé pour alimenter tous les véhicules et les mines de ressources.",
    "CFAB025E43945DD5A675929EA1B8735B": "Champ de Composants",
    "B6CE90A5448C96D16CD38A8E7B2BA03A": "Mine de Composants",
    "3C4F4A45409283D939A56AB732B3108C": "Composants",
    "7385160042574D376AF15594840C9138": "Composants qui peuvent être transformés en Matériaux Raffinés à une Raffinerie",
    "8267F866424460C045FF40A62D7EA10D": "Module d'ordinateur",
    "92D1428F428EE050351557832DB379BC": "Pont en béton",
    "2E1BAFC24875F569598C04B027102999": "Fondation en béton (1x1)",
    "AC7C340A401CF179EBF08A8F2EA37431": "Fondation Béton (1x2)",
    "AE8BCA6D423E26FD2BB2A788298B8526": "Fondation Béton (2x2)",
    "62BAABFB4D334D702542EB91C34E9FEB": "Fondation Béton en Coin (1x1)",
    "BBA3E405402547B83D4C3FA9A95AD67C": "Béton",
    "D5B404CF40D1E05BD342BEA46DF35623": "Bétonnière",
    "AE1573994B153ED04FD89CAA3717AE1C": "Ouvrages en béton",
    "CAF19C714CA9B02DA6B44DB5394C60A6": "Conduit l'électricité entre un Poteau Électrique et une autre structure.",
    "1ACF7DFF490EA4BF1F420C9FF3860726": "Matériaux de Construction",
    "36C1BF36454836BB112D9480C2E468A2": "Véhicule de Construction",
    "6B24FD3749D698B926AB4EB742380547": "Véhicule de construction",
    "12C895724DA8D5DA673FBCAE80A77FA3": "Chantier de Construction",
    "4CC605274C43052D3B206AB2A4E0DCE8": "Chantier de Construction",
    "054DE0FF4483D71499703B9B68B5D811": "Wagon Conteneur",
    "C5029282468709AF7937B7BBF877B266": "Cuivre",
    "EAB24E7045D7FBD285D8B59E05492E76": "Alliage de Cuivre",
    "C6E827854959790FFB6DB8A3EA6480F9": "L'Alliage de Cuivre peut être utilisé pour produire des prototypes de véhicules au Centre d'Ingénierie.",
    "9867C9B54B91DB2156CF34B791B1B1D1": "Le Cuivre peut être raffiné en Alliage de Cuivre, qui est utilisé dans le processus de prototypage des véhicules.",
    "38273AFC4AACFA88F89A3C9A2D3B2679": "Copier le mot de passe",
    "9480EECC44D191EB108306ACBFCEF534": "Couvrez-Moi",
    "DA7A88824AE3F151D0B26ABF1745EE60": "Couverture et Suppression",
    "0F3ADBAF4570F287492A76B98060113F": "Unité de craquage",
    "60D70F564358A0AA1EB9379D93A0FE66": "Grue",
    "63CC9B4A469EEC8F696C6EA020432AED": "Grue",
    "35503F8748DDFD0502021BBFC576911F": "Voie Ferroviaire pour Grue",
    "8B875CD6417482DAFF18E2AE309567B0": "Caisse",
    "1D9661814728CC3654250D99AABD5C71": "Cratère",
    "770167924C272500D86179992E951FC9": "Cratère",
    "F15745E8462830CC9AB858ADC6A24C9E": "Créer un Stock Réservé",
    "DA61CC4345AE336D97C22BA9FE2E2062": "Créez un stock pour stocker vos équipements en toute sécurité pendant une durée limitée. Les stocks réservés servent de stockage temporaire d'équipements et non d'entrepôt privé. L'accès peut être partagé avec d'autres joueurs via un code d'accès.",
    "DF9D586046D58FFD050037A54776F41D": "Mortier Cremari",
    "DD97C63C4237E34D2D418785502C209C": "Soldat Grièvement Blessé",
    "44CDCA2942B6EAB83A8B009F07B96CF7": "Char de Cavalerie",
    "CF181019476265E687412D8E123DECEF": "Char de cavalerie",
    "DC44C1C144DFB2BA01D9BFB0DE19E7AF": "Chars de Cavalerie",
    "901AE71547491F493E627791F4BD21D3": "Changer le Filtre de Liquide",
    "680338D649C87C7AEAD96C92174E29E3": "Passer à l'Onglet Précédent",
    "F670876845A76AB26C4D7897F9CE3EB5": "Passer à l'Onglet Suivant",
    "CDDDC92F42A69E0F488D088F3B490226": "Changer le filtre de liquide pour que cette structure n'accepte qu'un liquide spécifique.\r\n\r\n<RichText.Regular12.Orange>Doit être vide.</>",
    "A2923020423029BE99C15C933B982858": "Composants Endommagés",
    "3AB241504786F95F4CCA999EB9244219": "Composants endommagés qui peuvent être recyclés en Composants.",
    "8BA2A8B243CD4CD2EA33C78734DECDC7": "Inflige de dégâts à Explosifs Lourds à l'impact",
    "A759CE2B4F59026953934D86CB982420": "Le déchiffrage de messages codés nécessite parfois plus que la seule main d'œuvre. Ces modules informatiques de pointe pourraient bien faire l'affaire. ",
    "33F864FA494AC77C7470509A269616B8": "Démolir",
    "F7F2EAA84112598BD8BB21838CE54349": "Démolis ce véhicule, le supprimant complètement du monde.",
    "0E47402D497FB3B729F523B31EA42356": "Démolition",
    "3D783BCB4F9168F145609AB5CCCB68E1": "Se Déployer",
    "4C7EC533469CB299847A67A869AA0AD1": "Se Déployer",
    "4D0D72D0452D2DB7E4B2DBA743A63E0B": "Déployer",
    "5A25BD694237EBA2AFAEBC965B2386BC": "Déployer",
    "5EC6C3764E3A9055DF183EA607BB7670": "Se Déployer",
    "D292E9D04BCF39FE9F157699A38220E7": "Se Déployer",
    "E1C74DB944F2AC7206FBC999F49ACA70": "Fusil Antichar Monté",
    "4E4DB2B344BB158A9C0B56829C85122D": "Charge Havoc Déployée",
    "B65ECBC1481C3213858453A08B6FB4DE": "Canon d'Appui d'Infanterie Déployé",
    "B6F3A3A745AEB338C211239D034879B4": "Mitrailleuse Déployée",
    "C90EB41E442883C0502BCD86C596E9DA": "Mitrailleuse Déployée",
    "0EDCD2F044E7D1BABCF65F87D05D2AEB": "R.P.G. déployé",
    "B584DAC0494452860D7C50B075DD1BF3": "Lance-Roquette déployé",
    "DA7DF8C74D9859AE0E5BE08B5C2AFD1A": "Trépied déployé",
    "F36D2ACC43944973C83DBAB1FFCE6CB0": "Carte de déploiement",
    "0264CF904E70D8C4F8186E8195DA4F16": "Point de déploiement",
    "383B402E474BADFE7252DC83B28F1773": "Grenade Sous-Marine",
    "3F86B586405A3BE3C77456B0F2ADF819": "Grenade Sous-Marine",
    "908BF3B743992D354B6F789E3E8F1634": "Grenade Sous-Marine",
    "9BAF48A647EBE059B00714BC83AF8500": "Conçu pour les missions d'escorte et pour soutenir les opérations d'infanterie, le Semi-Chenillé \"Javelin\" de classe HH-a est un véhicule tout-terrain blindé et polyvalent qui peut être équipé de diverses armes montées.",
    "498585524403BA7F3832B5A1EC4824BD": "Conçu pour les missions d'escorte et d'appui aux opérations d'infanterie, le semi-chenillé Niska Gun Motor Carriage est un véhicule tout-terrain blindé et polyvalent qui peut être équipé d'une variété d'armes montées.",
    "26ED399A44B866863CC3E58124AABB22": "Conçu pour la production de masse en Kraunia, ce char d'assaut est doté d'un système de tourelle modulaire pour une polyvalence maximale. La classe \"Falchion\" est équipée d'un canon de 40 mm, classique mais puissant.",
    "79B1AA8344606FF1D0AA3DAC3B0BBDA6": "Conçu pour les patrouilles fluviales, le Charon Type-C est équipé d'une paire de trépieds, et un canon mortier central conçu pour mettre en pièce toute résistance blindée sur le rivage ou en pleine mer.",
    "99CCB6584F3388BD2B4B9BB0AE9CAB57": "Conçu dans le seul but de combattre les morts-vivants maudits, le véhicule utilitaire mécanisé \"Centurion\" est équipé de deux mitrailleuses lourdes de forte puissance et d'un canon frontal mortel.",
    "AD94AB834E437227E2D2AFBB61FEB2D9": "Conçues pour être déployées sous l'eau, les Mines Marines explosent au contact des navires ennemis.",
    "BFA4A55D4B3C01FA9114FFA50DD0A9DA": "Détruisez la Structure",
    "7565C1BB4A349596B1A9C0B64F6C1BBB": "Plateforme de Fusée A0E-9 Détruite",
    "EB1079FF433990E4027BDA9CF19D3268": "Usine de Munitions Détruite",
    "C1D7DFB54213CB3D075A6A858DC72929": "Raffinerie de Charbon Détruite",
    "A0262E4B402C015853F8B18B07BCF8F2": "Canon côtier détruit",
    "8A683CEA40456FF93C9975B833F71755": "Centrale Électrique Diesel Détruite",
    "5D7846154C0EAB3905ED519CFBCF7D42": "Cale Sèche Détruite",
    "FC157C4B49D0310646094086775F97BA": "Maison équipée de mortier détruite",
    "B3282BFA4B54C7FA73DF7C92C499662F": "Centre de Modification de Campagne Détruit",
    "02BBF10B4E6E5BAE4B4815BE9C0B1EC3": "Silo à Carburant Détruit",
    "5B6CE9C34D1A721D353FEDAD3EE53991": "Maison en garnison détruite",
    "04C2A66849571C27BC0A0590F8537CA8": "Maison Fortifiée Détruite",
    "05D64E054A9AEA6A8870F992BC39ACA6": "Maison Fortifiée Détruite",
    "0E9B84204D91D666F0475384F315B414": "Maison Fortifiée Détruite",
    "183577D245A711D2CFE030B0DEC62619": "Maison Fortifiée Détruite",
    "23C52A394A2C6DDA9B3CF38ABEC83C0C": "Maison Fortifiée Détruite",
    "25D1C5EC44C45A256B39A381329E8C8A": "Maison Fortifiée Détruite",
    "31041A6A4E8329B1B3EC5C88450E6D46": "Maison Fortifiée Détruite",
    "386474574D25E11C900DE89108207B60": "Maison Fortifiée Détruite",
    "527049E64919167DA8E4BEA55760BC4C": "Maison Fortifiée Détruite",
    "65C02B3443756C3882875A849A10F302": "Maison Fortifiée Détruite",
    "6BA4DC11486E7E7A06AA56AA0ECE0C38": "Maison Fortifiée Détruite",
    "6C854D8640A267DD19812A9CCF072CE2": "Maison Fortifiée Détruite",
    "72554D834F54109F83271E8E8E300636": "Maison Fortifiée Détruite",
    "8EA2BE9C45F46EC3660013B96D260F8C": "Maison Fortifiée détruite",
    "9ADFE6B84DD7DD2F34116A93280EB67A": "Maison Fortifiée Détruite",
    "9B71AC5241BBE1A347E0C9A6DAC9F2EE": "Maison Fortifiée Détruite",
    "9DE304714C744B9FC9793E804505DCC1": "Maison Fortifiée Détruite",
    "A2D3D33E47F97B26DDA7F28EC1F6708D": "Maison Fortifiée Détruite",
    "B084281A4E0464D5D4A61BA45383CB1B": "Maison Fortifiée Détruite",
    "B7E6BA4B42B66B9794C64FB59CFF8668": "Maison Fortifiée Détruite",
    "BAFD0E7841FD707C0FC3E8927B60FC68": "Maison Fortifiée Détruite",
    "D1CB22D14B682590F9FF4E80F16D66C7": "Maison Fortifiée Détruite",
    "D46726DC44584F50975574BB27C55C1F": "Maison Fortifiée Détruite",
    "DCEFE81246CFD944F515D79886950C25": "Maison Fortifiée détruite",
    "E591AB8B44D7049016441EA7BF90F2E3": "Maison Fortifiée Détruite",
    "E6C4199C43014DB9737BD8B66FBC2035": "Maison Fortifiée Détruite",
    "FD701455480BB3FDD30B44AD4C324CE4": "Maison Fortifiée Détruite",
    "49144AF243740726C3ACE0B854ADC61A": "Grande Station d'Assemblage Détruite",
    "23C305AB44A71DB4EB17BB9A9E08FF21": "Station de Transfert de Liquide Détruite",
    "B72FA1B84F426DF6AC51208297986EC4": "Station de Transfert de Matériaux Détruite",
    "BF97A0E0425EA6C7DE97B582813372B2": "Usine de Matériaux Détruite",
    "9ED578D946035C24AD0E7C825925A9B9": "Usine de Métallurgie Détruite",
    "AC342D774AC4FBAE785BB3B9FD48542B": "Raffinerie de Pétrole Détruite",
    "EB0E0508430999CC19ED9B923BE9B3EB": "Puits de Pétrole Détruit",
    "EE0B16BA442F876A6C64F9841D8112F0": "Centrale Électrique Détruite",
    "A10D31C94C380E975371FB81ABF64A35": "Station de Transfert de Ressource Détruite",
    "16A1282044DF6055D326AABEAF636E42": "Planque Détruite",
    "5FA6E8054562B139B530ABAA7B65547B": "Planque Détruite",
    "B4BFE1684FFA4084504FEABFA47D7D81": "Planque Détruite",
    "C44366554C8FDB5773027BBDC06F7CB0": "Petite Station d'Assemblage Détruite",
    "B7AB672A4B1C0A1708E1208FAC70D517": "Grue Fixe Détruite",
    "65E27155458C3491E8324199D1A5BDA9": "Moissonneuse Fixe (Charbon) Détruite",
    "2C247A0146DD5C342256BEA146202A35": "Moissonneuse Fixe (Composants) Détruite",
    "15B71A74488D43F90DFA84A53E0B6173": "Moissonneuse Fixe (Ferraille) Détruite",
    "92DAFFA448C36DF3920431AA3D9B4052": "Moissonneuse Fixe (Soufre) Détruite",
    "0C76AEF743C765A6E38EF6A58F6CF09A": "Quartier Général Détruit",
    "3478C25C4B7D33B34B7217ACBCED00DD": "Quartier Général Détruit",
    "E8B4F22842C789E1E3B0DBB10DEF2492": "Quartier Général Détruit",
    "06F1BCF74DEDC31BDF53F8B1878F911F": "Tranchée détruite (Niveau 1)",
    "3F7E7DAE4538B9C70B62D695495177AC": "Tranchée détruite (Niveau 1)",
    "F634D667469C9D1AE38CC28384E1023C": "Tranchée détruite (Niveau 2)",
    "FDED509B4BFD4A8CDB70138372C05A4F": "Tranchée détruite (Niveau 2)",
    "24FD22CB4DC74792791565BE4DE2A339": "Tranchée détruite (Niveau 3)",
    "EA743F984C22A662B4AC4FBDC38F6CC1": "Tranchée détruite (Niveau 3)",
    "73B11259426A9E4FB490988B33137570": "Connecteur de tranchée détruit (Niveau 1)",
    "E29A87864B41D8E59FA3B5A0558BBCF4": "Connecteur de tranchée détruit (Niveau 2)",
    "FF99FCCD4E189A2E15D964A726148AEB": "Connecteur de tranchée détruit (Niveau 3)",
    "B6E2C2DA4B64EF7B228846A010627C89": "Pompe à Eau Détruite",
    "27B7124540F562B36200BB91E0F1118C": "Équipement détruit récupéré sur le champ de bataille. Il peut être trié en ressources utiles dans une Raffinerie (en utilisant le menu contextuel du clic droit)",
    "55D048084C2C90E1F05340B4247D7C43": "Chasseur de Chars",
    "65F03D9E4801817E140093806CC2F7FB": "Détruit les obstacles qui, autrement, ne peuvent être démantelés qu'avec des clés à molettes",
    "CAC7B220492912DC61A5F48E7B4EADDC": "Démonter l'arme sur trépied",
    "BCE01A144C827D095F363D88D960D305": "Centrale Électrique Diesel",
    "BE3F665C4C470BA0F86D529576402594": "Dissoudre le Régiment",
    "601D7FFB46841A19D0802DA9D0E4FDFB": "Tout Déconnecter",
    "D124284B4C8C0841B3B25B9D9341CBB4": "Déconnecter toutes les lignes électriques de cette structure.",
    "1402CBA84CCDDF1A689CC194BC75010F": "Officier de Plongée",
    "725EEB36498E0825F76EC3848A837AF5": "Officier de Plongée",
    "D97EFDCD4552EE3ED3B6A991ACE82A3D": "Quai",
    "5C24E6A14E2BFDCE0BBCB8865B328C00": "Supérieurs. Implacables. Nulle armée au monde n'arrive à la cheville des Coloniaux de Mesea. Alors, quand les gens du nord marchèrent sur nos frontières, ils allumèrent une flamme que nul ne pourrait éteindre.\r\n\r\nS'ils veulent se mesurer à nos légions, qu'ils essaient.\r\n\r\nCar la fin est notre gloire.",
    "5F377B0E4587CF0D14CE49A42F708DD0": "Porte d'entrée",
    "766FEE094141E47C6C9E68A8AC41D953": "Porte d'entrée",
    "7F7379344E3CC659790552B650A00C7A": "Porte d'entrée",
    "675C196D4FCEE900F74B3790B3DF0DCC": "Dents de Dragon",
    "1A400430493335EA1D65F3ABA2F6D63E": "Vider les tuyaux",
    "0A8060544364E325529ED892023A49CA": "Pont-levis",
    "195B6F454DE2CB4C019A3E927748B54B": "Pont-levis",
    "4BA99805416D455F85C8BE8B3DC6F82B": "Pont-levis",
    "5EF229AE4007E992CBE4068897EB1A87": "Pont-levis",
    "88C5F1A143250C1751311C9AE76B303C": "Pont-levis",
    "83A395F64258ECEC0802CFB6E5A04E1F": "Cours de conduite",
    "88E7EE18441ECF287D89A9907F9AD571": "Terrain d'entrainement à la conduite",
    "CB7DFFF54D1B73FA2E800E8A674E7CDD": "Terrain d'entrainement à la conduite",
    "DC22351B42F5D04D010FCCBAE4F17155": "Terrain d'entrainement à la conduite",
    "AB977EC5420C8827B93C4994C1735AF7": "Objets lâchés",
    "7996F6FB4893D97468125E9DABF944D7": "Cale Sèche",
    "11F5FAA9454DCA4D27AF97B947756B7D": "Duncan’s Coin 20 mm",
    "2AAFA04A4A217CE751F9DF8127D2A8FC": "Les premières itérations de cette mitrailleuse étaient conçues pour être placées dans des bunkers et sur les ponts de navires de guerre légèrement armés. Le Ratcatcher est la première arme d'infanterie sur trépied de Harvey Malone conçue pour être utilisée sur le terrain. Tout comme ses prédécesseurs, cette arme lourde repousse les soldats ennemis avec une efficacité inégalée. ",
    "08091B354DE93829851FBEB3CB2ACACD": "Modifier le message",
    "EA73E2A24E6D91BE59B3FA8D029F3F4A": "Éditer le régiment",
    "30D0433A44CA775D26EAD89FBFA2FA05": "Modifier le message affiché par le panneau de signalisation",
    "E39478D4433CB85DB6F0079E93577A5C": "Modifier le nom et le tag de ce régiment",
    "B4E3828C4A1B54EB6297D79DE7E90627": "Éjecter le Conducteur",
    "7375A5424178BFE027BEED928F1638B8": "Éjecte du véhicule le conducteur actuel. Cette action est disponible si le véhicule a été revendiqué par une Escouade. Seul les membres de cette Escouade peuvent éjecter les conducteurs et seul les joueurs qui ne font pas partie de l'Escouade peuvent être éjectés.",
    "5B7EEA1143A8752CD6692E8C421C1418": "Puits de Pétrole Électrique",
    "5AE32C83458629A923D0A0ACE0C852CC": "Maison équipée de mortier",
    "B9002B7F4C84AAD7D3D369BCD817535A": "Maison équipée de mortier",
    "6F7AD3C94752591F17B8C69D3D4D8067": "Permet de construire des Maisons Fortifiées et des Planques dans cette ville.",
    "10FC0F0547FAE13CC3F1A9B656B81148": "Permet de construire des défenses supplémentaires, telles que les Maisons Mortiers et Canons Côtiers.",
    "F7E804FA4A16CBB465B6239C61698EEA": "Permet la construction de structures logistiques telles que les Usines, Raffineries et Dépôts.",
    "77CF537E46DB75C26ED013B5B5901FF9": "Campement",
    "801BE81D4B8E3BCC0A58F29C385A6C72": "Campement",
    "D11367964786D174715D918E175A3B25": "Générateur (Niveau 2)",
    "A046E43445FD734903AB2AAECAA8CBA1": "Générateur (Niveau 3)",
    "1F61C54A4810D57334074C91C42A7EEE": "Centre d'ingénierie",
    "B27C2F014F032FE4AE2FA39C368FA2EC": "Station d'Ingénierie",
    "8C1183A34EED68DB511D039030F4040C": "Les ingénieurs sont l'ossature de la République Meseane. Ils sont équipés d'un sac lourd et de ceintures pour un accès facile aux outils et aux matériaux portatifs.",
    "852FBF664CB60C909259479FD1C39313": "Pétrole Enrichie",
    "6405A9C4437F95AE40A01E92E854D5BF": "Entrez dans le véhicule cargo",
    "90CD31144FC19D0B388AF9B5A50AE486": "Entrez dans le véhicule cargo",
    "677B173044BC914F0AC13FA55F44FA46": "Entrer le code de lancement",
    "C643B4314C376A35063DE5BF256AF52D": "Saisir le Code de la Station Météo",
    "A577485C43B2D6DB5FEB2F8B133B2FB3": "Entrez un code d'accès à 6 chiffres pour accéder à un stock réservé.",
    "0F82AD414B67440EDB133FAE27E72468": "Des bunkers retranchés avec armes légères, tenus par des troupes stationnées.",
    "07B5544541C637F54A9A91BDADAB6C0E": "Équipement",
    "3D1898C74F31E888ED53F6989B925A6E": "Équipement",
    "837817FD4C271A212BA53FA37F3C1AFC": "Excavation (Aucun Matériaux)",
    "610EC8D949E1E706DF9E9B8D8E03E8CD": "Excavateur",
    "27CC60CC484F7C544BFDE7A3369C56D8": "Explosif",
    "6EC4EFBB467656EA5C0146BE84B8A3B7": "Explosif",
    "99B2FE9A4C6126AEB39E79A364F12511": "Explosif",
    "03FBC6B44B4194FA5E88BA8820F42152": "Charge Explosive",
    "3ED26AAB488A5A5C7F6A07BEEC12B3AD": "Charge explosive",
    "55BFB5094F3A43DA9B04E2B5376871E0": "Charge Explosive",
    "AA5C90F940A4FC5E410D3781804EE0B6": "Charge explosive",
    "A953D201483DD72E1FFDA1A8ED0E8F7D": "Poudre Explosive",
    "F69C80AE41E0C992851904AA92FF9C1B": "Éteignant",
    "A5CE13FC47B409EEAC835CAC64554DA2": "Extrait du carburant des Champs de Pétrole. Doit être construit à proximité.",
    "C43BF1774AACEB7B3125CDBAA140D417": "Sac à dos Fabri",
    "9F80977243AB342F6FF7919A55C8662E": "Installations",
    "1212F89546473A760EEB0A8D92C1B70A": "Installations (Niveau 2)",
    "345E78214C324AACEE51C89D606B3140": "Installations (Niveau 2)",
    "3F54181D490D84B90BBA1B90C8F1AA75": "Installations (Niveau 2)",
    "A5ED3CD24DF76BFC46962BA5A03E87FA": "Installations (Niveau 3)",
    "D5A27FC1449B023F11B7F69677E344AA": "Installations (Niveau 3)",
    "E703D5C3448DA71DE335A8BDEB84A763": "Installations (Niveau 3)",
    "651DB38844D1AAB42DA08B9412829AC6": "Les Installations sont des bases industrielles construites par les joueurs conçues pour produire des équipements et véhicules spécialisés.\r\n\r\nPour commencer, suivez les Lignes Électriques jusqu'à la Centrale Électrique et mettez l'électricité en marche en appuyant sur '{0}' pour ouvrir le menu.\r\n\r\nExpérimentez avec la production d'objets dans les différentes structures. Mettez votre souris sur le point d'interrogation pour en apprendre plus sur chaque structure et les objets qu'elle peut produire. Si une structure n'est pas allumé, essayez de mettre votre souris sur l'interrupteur de la production pour obtenir des informations sur ce qui manque.",
    "535A0D26489C245363453CA4CB67BD6A": "Formation aux Installations",
    "6FFE08F9452458C9E3307290A90F606E": "Formation aux Installations",
    "BEB686CB403ADB6C40A4C1905FF498FB": "Formation aux Installations",
    "CC44135140FB86737BD520828BE3FCF1": "Formation aux Installations",
    "186B9C994E28BD86151443AD2135BC44": "Production de Véhicule dans les Installations et Petits Trains",
    "1C6075E540F596B894E3BA966D66592E": "Les usines sont utilisées pour produire différents objets. \r\n\r\nN'hésitez pas à utiliser l'usine à proximité. \r\n\r\nSi vous avez besoin de ressources, essayez de raffiner des matériaux qui peuvent être collectés à l'un des différents nœuds sur l'île. \r\n\r\nPour une explication plus détaillée cliquez l'icône \"?\" en haut à droite dans le menu de l'usine.",
    "21258B35439483DDBF4B77A6D928EB04": "Usine",
    "41D126A44DA0520ED5F340871B30C910": "Usine",
    "72A344A24B0F050D239CBC989C9F8606": "Pistolet-mitrailleur Fiddler Model 868",
    "0E590422497597303D247DB4738E5940": "Canon antichar de campagne",
    "5BE3900A4BC47B72BF09958D4998F59D": "Canon Antichar de Campagne",
    "234479D3480F8D3D8624C99663750E12": "Fusil Antichar de Campagne",
    "E22210AF44BD5C5E47C343A8E7B1CBAC": "Fusil Antichar de Campagne",
    "3C2E678C4DA8E9DD134C018311963D2F": "Artillerie de campagne",
    "AC38557546509C33A9011AA0D7C1EC63": "Artillerie de Campagne",
    "D7E5D59A4D09EB59D62313A5641B0F83": "Artillerie de Campagne",
    "CF340BB44E78DB2006B379B249A0B98A": "L'artillerie de campagne fonctionne sensiblement comme l'artillerie stationnaire\r\n\r\nRéférez-vous au tutoriel sur les bases de l'artillerie pour plus de détails.\r\n\r\nLa principale différence est que l'artillerie de campagne peut être bougée manuellement lorsque deux joueurs sont dessus.\r\n\r\nL'artillerie de campagne n'aura pas autant de portée et de puissance, mais compense par plus de mobilité.",
    "2CF00F5E4322527F4A59138F1E73CAAD": "Ponton",
    "85214B6C4F89526FDAEF1DB46A35F5A5": "Canon de Campagne",
    "239F672B4BA79C67D3C9CEBE5C420B2F": "Hôpital de campagne",
    "E6C9B72C47CEBDE3A65DA8BE9E5DDF58": "Lance-Roquettes de Campagne",
    "79B77B524F98465C23C22D8CA433A6AE": "Mitrailleuse de campagne",
    "3A50260049F13414DA4C1487E7DD2861": "Mitrailleuse de Campagne",
    "3BEE21A64768DA596100BEA3DB28E2BA": "Mitrailleuse de Campagne",
    "2E5DE0834B30862D571B05855A4CBAC7": "Centre de Modification de campagne",
    "C59C329548265373EEF4548DEDCFFE7E": "Mortier de Campagne",
    "C2EF1B9746B24FF50700C1B95647A3E7": "Poêle",
    "C32EF9B64E1DB95E4B60CD909E62C6EF": "Station de Terrain",
    "1D69619142CC5934A19B5185E751222C": "Remplir",
    "1E3F86B849E45AAD4CF31EA4C8D144E4": "Remplir",
    "229DCA044477360060A61CBD4B317FE3": "Remplir",
    "2F964D3D4389D3736BE4388D4E045175": "Remplir",
    "3A06383E4980F00A6FF5C581A0ADCCFA": "Remplir",
    "83C2B3C246F4B4CFF97E02B118CEA45E": "Remplir",
    "8A99D2084476E3E799A0A092203C491E": "Remplir",
    "B10B65474010C1AA6BE2EAA9BCA5F80B": "Remplir",
    "BCFCA7234A083547AE2E77826AFC76B9": "Remplir",
    "D2A510C145EF70BF5AA01891F49DFC71": "Remplir",
    "DFF1431449484FA10AF26BBE74609724": "Remplir",
    "E297AE554DB2A7DF0E1B5EA1AD0C6B09": "Remplir",
    "FE7861B340CC5B1AED601487FE979569": "Remplir",
    "9252963C4AD30A7AA261E99F29D8B4A4": "Remplis ce bunker, restaurant le paysage autour.",
    "9F4E81DD4A6BDBB414426E8E0A4D6656": "Remplit ce Bunker, restaurant le paysage autour.",
    "ABDCB2F54C4E16644CDDBE904B8B4507": "Remplis ce bunker, restaurant le paysage autour.",
    "DB6EB8DD4E001F249E711F9CFD0F8871": "Remplit ce Bunker, restaurant le paysage autour.",
    "98682818476BCC5EF7A40C87B97A4D48": "Remplit ce cratère, restaurant le paysage autour.",
    "BC6E7F2A417F27BDA0772A8D0FDD624F": "Remplit ce cratère, restaurant le paysage autour.",
    "5AE781E14167E6E84C9705B68AF4A532": "Remplis cette tranchée, restaurant le paysage autour d'elle.",
    "0295F40B4438AB1A5F506E801EAEE664": "Remplis cette tranchée, restaurant le terrain autour d'elle.",
    "1205889C44351F8B31D31CBE1CBC59BA": "Remplit cette tranchée, restaurant le paysage autour.",
    "4383994645B70DEC33898DBE4C92A08C": "Rebouche cette tranchée.",
    "579F7D7A489202AD79EDBDA26B7B34DB": "Reboucher cette tranchée, restaurer le paysage autour d'elle.",
    "63AE3BE2463DF21E59AD6EB155709ADD": "Remplit cette tranchée, restaurant le paysage autour.",
    "CF7920F64F99C5C566F9BDBA9DAF06DC": "Remplit cette Tranchée, restaurant le paysage autour.",
    "13CD5C9A47BA879FA87C62865697C904": "Camion de pompiers",
    "C19E0D224B5919BEFAA077A102359788": "Camion de pompiers",
    "AE84175D40D77F59902671A049614FF4": "Feu de Camp",
    "318E28E849D5F10341C184B97B832951": "Tirée depuis des submersibles, la torpille Moray est un engin sous-marin autopropulsé qui peut être utilisé à différentes distances et profondeurs. Elle est conçue pour percer la coque des grands navires, créant ainsi des voies d'eau.",
    "ABCF56064644F182E927C98DC9572DF9": "Port de tir",
    "F9B540CD4BC1D59245B7E691EEFE85B3": "Trousse de Premiers Soins",
    "41DC5BB04EDDDE08A9E340B497FA2090": "D'abord, construisez une nouvelle Tranchée et attachez un Bunker.\r\n\r\nÉquipez un marteau, puis approchez-vous du Bunker. En faisant face au mur, appuyez sur ‘{0}’. \r\n\r\nVous devriez voir un menu avec de nouvelles options.\r\n\r\nVous pouvez améliorer votre Bunker de diverses façons. Le convertir en défenses IA, ajouter des postes de tir, ou divers autres outils utiles.\r\n\r\nPour passer en mode amélioration, avec le Marteau équipé, appuyez sur ‘{1}’. Un icône de ‘Marteau’ au dessus d'une structure indique quelle structure vous allez améliorer. Appuyez sur ‘{0}’ pour ouvrir le menu d'amélioration.\r\n\r\nLes Tranchées et les Bunkers peuvent être améliorés avec du bois renforcé, et ultimement, du Béton.\r\n\r\nPrenez des matériaux dans le coffre à proximité. Ajoutez une porte au Bunker et améliorer vos tranchées au niveau 2.",
    "EC0047B7405B350858FF23BD071C7028": "Équipé d'un canon antichar robuste, le Blinder est capable de percer tous les blindages, à l'exception des plus résistants.",
    "677F3D7F4F3EC78116002FA9DE6222C0": "Équipé de bandes de roulement tout-terrain, le Highlander apporte une grande mobilité tout-terrain et se comporte particulièrement bien dans les environnements enneigés et montagneux. ",
    "D91215074858A485C1A09C8661C768B4": "Équipé d'un double lanceur RPG, le T8 excelle dans les attaques éclairs contre les structures et les emplacements ennemis.",
    "49E7314541C271CFD119489A5B71A408": "Signaler un placement gênant",
    "4CF0F3774AF5DF3CCFB4DEB69818599D": "Signale cette structure comme étant gênante. Si une structure a été signalée par suffisamment de joueurs, elle devient vulnérable aux dégâts des tirs alliés.",
    "91724B794E1BCFC2D0D172A32C020F56": "Munitions Incendiaires",
    "6DF8B79A485E7315519C4BAC40ABA2D0": "Lance-flammes",
    "BFE4D2A646B0D62612233980A81359B6": "Lance-flammes",
    "30EF5CE9458DB363F55CCF87331C9C40": "Munition de Lance-flammes",
    "35CB3AAF48032CC381F4D5B75DC9E300": "Munition de Lance-flammes",
    "B777FC99442DB88B03A7ECB094119BF0": "Fusée éclairante",
    "D6EFB89F46759391A4051292C45BC925": "Obus de Mortier Éclairant",
    "1792CEF147D68089B641D3BC8CAA1387": "Wagon Plat",
    "458F081C470EBD36BD654E8D14B86534": "Camion Plateau",
    "19160B414FA3540EB3F0E08526FB5D7A": "Suivez-Moi",
    "0AF9B0C64ECCAB0D96434AB223799B95": "Pour les secouristes de la Légion, cet uniforme comporte une pléthore de poches et de sacs conçus pour transporter et déployer facilement le matériel de premiers secours.",
    "DD746F89475D20526DB12CB524E29926": "Pour la formation, une variété d'armes à feu vous sont fournies dans les Coffres à côté. Normalement, toutes les armes doivent être fabriquées.\r\n\r\nPour assigner une arme dans son emplacement correspondant, ouvrez votre inventaire avec ‘{0}’ et cliquez sur l'arme désirée. \r\n\r\nUne fois assignée, fermez votre sac à dos et équipez l'arme avec ‘{1}’ si c'est une arme principale ou ‘{2}’ si c'est une arme secondaire. \r\n\r\nVisez en maintenant ‘{3}’ et tout en le maintenant, tirez avec ‘{4}’.\r\n\r\nEntraînez-vous sur ces cibles.",
    "BBA10F004FF8DA0DEA069EBBA952B1F2": "Pour les besoins de la formation, différents véhicules nautiques vous sont fournis pour tester les contrôles et fonctionnalité de base. \r\n\r\nUtilisez '{0}', '{1}', '{2}', '{3}' pour contrôler le véhicule de la même manière que pour vous déplacer à pied. \r\n",
    "8CB26A0E490845A47C32D1841BA47A8E": "Fortifié",
    "EDF80F4043F09B2A353609A04433D606": "Fondation (1x1)",
    "F45E2F3B4CA544FBFDA6FDA5C67CB547": "Fondation (1x2)",
    "E4FA32114D35A116E686A5A9A555FA7D": "Fondation (2x2)",
    "2FD7C3F44DCC2C64B9EA03BC9D89F25B": "Fondation en Coin (1x1)",
    "20C300D44111C0ADFAA707B524F40B27": "Éléments fondamentaux nécessaires pour construire les coques des grands navires.",
    "2555CAA049962C34D8C25B8217AFE7E4": "Abri de Combat",
    "C88D908B4B446C843247AAA168851E5A": "Fractureur",
    "3CA3BE5F40E4EB02AF87A9AC6626F775": "Carburant",
    "1F219F864DE728C7E1BDAF8D79552ACC": "Silo à Carburant",
    "888A355449B487EA21C567B94E9C5A34": "Camion Citerne",
    "3FBD45A24F877BDAF520A3B3EE3FCFF9": "Le carburant peut être obtenu de deux façons. \r\n\r\nSoit en raffinant de la ferraille en Diesel.\r\n\r\nSoit en ravitaillant des puits de pétrole avec du Diesel, qui produiront des barils de pétrole brut. Les barils peuvent être alors raffiné en Pétrole. \r\n\r\nLe Pétrole peut aussi être utilisé pour produire des barils avec un rendement plus élevé.",
    "D37AC5CC4FB8C9EA5FA5BF9D8AD5E33C": "Ravitaillement en carburant",
    "8194C7224AD3B4F2C11C23A8309947AE": "Réparation complète",
    "0E35F8FE49AADCB93D10B785E7B3887B": "Garnison",
    "147D88DF4F4DEB259D18809FEC926EEB": "Bâtiment mis en garnison",
    "87E7FB0949BA2A3A803D6FA4D61AE2CC": "Bâtiment mis en Garnison",
    "A4D7E4EB45CC614B3CEDB292ED3D36FA": "Bâtiment de garnison",
    "738B8E6D43F6D46F58DF308483807C54": "Station de garnison",
    "05B6A7E843290D9F54FAD698DAAF8E63": "Maison Fortifiée",
    "07C088CF4658C899D59A4DA11B4C1185": "Maison fortifiée",
    "0C9E7B9D4CAFC30F8AA3F296986D46D4": "Maison Fortifiée",
    "15624C00420C72099D88098D8BE07A96": "Maison fortifiée",
    "1B8D4C8047EF5403E75A509C623A3AF2": "Maison Fortifiée",
    "1F28F2454C8D6ADA679D67A64F08DF41": "Maison Fortifiée",
    "300B0C3E43B337D2E5069B91EACEA441": "Maison fortifiée",
    "33554B4D4A532E58A484D8BD5843DEE1": "Maison Fortifiée",
    "4A7D20EE4B1446612B17DA82F676532D": "Maison Fortifiée",
    "5116E7B64064AA9B4DBC4BB87BA3CEFD": "Maison Fortifiée",
    "570E66F64427D2FAAFC7C093CB49B636": "Maison Fortifiée",
    "5DFDF3F1403D4EA5228F99AA585EC21F": "Maison Fortifiée",
    "5FAAD2E2445137ECEB717B8FB5789913": "Maison Fortifiée",
    "6E530185404D69B28E538CBFC459325C": "Maison Fortifiée",
    "7894DAC2488EC4B1525D87973BF4EFDD": "Maison Fortifiée",
    "78C21E0247D30223F885D5B7C43D9A6A": "Maison Fortifiée",
    "7E370E254D2FC256783CD6B2F60B477F": "Maison Fortifiée",
    "8F5145264AD5949E39DE709D66407C8F": "Maison Fortifiée",
    "9C59052D48A56D4B209ABD9178D35165": "Maison Fortifiée",
    "A4B30AB7403E3D25F6426FA447C5488F": "Maison fortifiée",
    "A85CC501406E34D03E89129A87589AC0": "Maison Fortifiée",
    "AF2561B3476AC14CA45ECFA477B1570D": "Maison Fortifiée",
    "BFBDFFE94555AB2AF6DBBB8B367FF86A": "Maison Fortifiée",
    "DEF08A374CD6CE786CF41D954BC4D9FD": "Maison Fortifiée",
    "E43E5D6A4A964118B53D5B947E7C3DAC": "Maison Fortifiée",
    "E485A5E840EE7026518453B0F8CFDED0": "Maison fortifiée",
    "EA56E5E84110E0B8849C2A9CE2F20D55": "Maison Fortifiée",
    "FDE2A6044916483C475099B262B3383C": "Maison Fortifiée",
    "B06B92FF4C8F48F1B7A300856E9EC69E": "Grenade à Gaz",
    "CD94F99F497B1785DDBCA5A4CE172A0B": "Masque à gaz",
    "D95780024FE7408BBF477792618FC619": "Filtre de Masque à Gaz",
    "80762CBB45EF63A73AAB14B3CB2A1B65": "Portail (Niveau 1)",
    "7A40C61448B3FABF060E369BB79F3A06": "Portail (Niveau 2)",
    "4BAC9851464E59D977437285DF1586DC": "Portail (Niveau 3)",
    "999C693D49CD6BA9C4054C97A3D31D84": "Gravier",
    "4413D3A34597B7499BC5B2AC8CF05C1D": "Grenade Green Ash",
    "8739433E4A662267B70B43875E0D8FE9": "La Green Ash est une toxine asphyxiante. L'inhaler sans protection entraîne une mort rapide. Veillez à porter un masque à gaz avec des filtres neufs lorsque vous manipulez de la Green Ash.",
    "A32285A542723BFF482D4A8F4F0CF563": "Lance-grenades",
    "E34F0CF34DEDCC557E9F2F82261903AA": "Lance-grenades",
    "0C04CA104B06B55A857BA697672F62B6": "Tourelle lance-grenades",
    "6E061CC544132319F99222ADCE170C42": "Tourelle lance-grenades",
    "6F25C5494627639CBFC042B1DBA18F12": "Tourelle lance-grenades",
    "4662E1F44473D9DADEE5FBBC41412A1C": "Les Grenades sont équipées depuis votre inventaire, comme tout autre arme, dans l'emplacement d'arme tertiaire. \r\n\r\n Équipez avec ‘{0}’.\r\n\r\nLes grenades se lancent en arc, que vous pouvez visualiser lorsque vous visez avec ‘{1}’. \r\n\r\nMaintenez ‘{2}’ pour cuire votre grenade, et relâchez quand vous êtes près à lancer.",
    "D0FDDA8F49CC5A0ABFECB3887E62D100": "Baudrier de Grenadiers",
    "069C2F184DCB8877EC178EAF7B7600C2": "Stand de tir",
    "63EB9B6A4C36454FF0FBAB996BF11549": "Canonnière",
    "F9A269804162FA069E7C498D5426E537": "Canonnière",
    "04E322B3454ACD0A015A5B8280E12436": "Tireur",
    "17A4191745D78A17F8D7D2B5F20B70B3": "Tireur",
    "18CCCD67460DC50D723CD6B803F448D0": "Tireur",
    "2163974847583327027B07B07C4ABCCB": "Tireur",
    "2170751A4AFCC2E6E5CA8AB281E7767E": "Tireur",
    "2ADB35E74AE7983E1B5088906153814B": "Tireur",
    "2C4C24874EFDD80AAFA1B68886086912": "Tireur",
    "2F49FFA546096D798AC247948AB3CF9B": "Tireur",
    "31E1BFFF4D531B5A837F9782A7BCF0F9": "Tireur",
    "334AD1E5415DEE4F90CC74AC8A5F3A98": "Tireur",
    "3825ADD34E26B099AAC100ACE066FCB3": "Tireur",
    "3B05BD29430E5752D02FAD8176CE935D": "Tireur",
    "4C92DE6A40DB640F3E4E729A61E10A53": "Tireur",
    "58965405402CF955256B5D882083CC8D": "Tireur",
    "63C5DCCB46706B3286BD3E9F5BB0041E": "Tireur",
    "6542FF2046B68CCE91FFC78F4C3C5C55": "Tireur",
    "693D63FB444BE0D03C7A9CA25A6A93DF": "Tireur",
    "6C4154E742C052BBCD6EC5892B665208": "Tireur",
    "7E2C51E94E4CAD46522A70903F36C33D": "Tireur",
    "80857B6048B21D9E48D3F9B22564CAA3": "Tireur",
    "8A9DF13D4C127B3F3D682E95FA7FE289": "Tireur",
    "9C5353B7423D2D4F160FB091CB3F8C3D": "Tireur",
    "9DD3C5D149636362F37B2B91B5B83395": "Tireur",
    "AFA79CF642CABF02048445B66613999F": "Tireur",
    "B214B2F74F78E8A67627E58878C61121": "Tireur",
    "B2D8D81F46C6AABB823ECBA220B0AE08": "Tireur",
    "BCE0E2F74366B0FBE3FFA38F8EC62A48": "Tireur",
    "C1BC8A9A48E8D2BEEAD23A8065CA54E4": "Tireur",
    "C75B5EF64B5D207C142A7EA962A837C6": "Tireur",
    "C9E214204CF62ED59440EAA55745641C": "Tireur",
    "CA3022A7402DD35AE04F78BB761F10D0": "Tireur",
    "CA71F11346288EAF1879E7BD7AAFEC9A": "Tireur",
    "CB4956624707DB8429314A861C23591C": "Tireur",
    "D4DB27214875F1A2C9D6B6B3C321C007": "Tireur",
    "D81BEA084F166632A786C9911CD2C893": "Tireur",
    "E439A8AA4862033B2E20D9B5C4855CE7": "Tireur",
    "ED50F32049DEDC3A83266B901A9D8C18": "Tireur",
    "F3CB25C540FE9AF9400999AECBC8C229": "Tireur",
    "F72C09CA469B61E3BF7E028B8717CABD": "Tireur",
    "00CD9B0242F5A4903A117FB4CEEDC514": "Cuirasse",
    "723CA04A4430A7F6E1C20298DA1CFA22": "Grenade HE",
    "8505355D496C4A6C1C869BB684947B6E": "Grenade HE",
    "2B7F04BD402638692572B284504F993E": "Semi-chenillé",
    "36DB40784E861D724CAFA8BED1BB69AA": "Semi-chenillé",
    "426489BC4E90BAAFDAE138B53875FBF5": "Semi-Chenillé",
    "4C56245747E9E3F8335B688FF9B8F0A5": "Semi-chenillé",
    "5B73999D47BE22579B0761855721A5FF": "Semi-Chenillé",
    "988B10484A3B004AE00E488E95B576A2": "Semi-chenillé",
    "9D0F590B4A1333C26A2283A0D451557D": "Semi-Chenillé",
    "BE6DA0764FD4E2162BC7A8947D5DAAED": "Semi-chenillé",
    "CDD85623466B9FE5030799B32B30AFCA": "Marteau",
    "E2006B7D4E0B3015E0EFC38BC74B205F": "Moissonneuse",
    "7A71FA6B447DF998CFFF7FB781D27EE5": "Charge Havoc",
    "EA6F15844125D4DDF48729BFD92EEA37": "Charge Havoc",
    "F8156AF3425DD053C3323784874A9FAA": "Détonateur de Charge Havoc",
    "A046CD18495C23B23CD3A8863D6DD9E9": "Blindage métallique thermo-absorbant qui protège même les matériaux les plus volatiles contre les éléments, évitant des explosions non désirées. ",
    "3801AADE494D7FFC440720A61F4DE336": "Poudre Explosive Lourde",
    "E950F999416631A8104F52B22B02052E": "Canon de Campagne Lourd",
    "7B1E2CD54F1AD0EFE056B59A24ED7B0F": "Canon de campagne lourd",
    "1080BA904A042F251EA61B928680E5A1": "Transport de Troupe Lourd",
    "94DAEF7443BC44A8C0AEC289D9BE6AA8": "Cinétique lourd",
    "E24867C443961776A33E09AB756A87F1": "Cinétique lourd",
    "6C2143B442DC95C3B44CBA84529E8D6B": "Pétrole Lourd",
    "23B88C0A4A266AA2AFB1F58ED6CCF1D9": "Fusil lourd",
    "7A0B292E487205F09A713FAB552004F2": "Fusil Lourd",
    "12B07EA44CEEAA75880070896ABC7F44": "Assemblage de Char Lourd",
    "95865B3E41469F28FE777F87287B69F7": "Pardessus Épais",
    "0049463D43EA65CABE6B5D932462DDF3": "Camion lourd",
    "ACC96D97471EC4ED459C9A992AB13C8C": "Aidez-Moi à Construire",
    "E36F7DEC4480A32785A9F4ABBF7453E4": "Utile",
    "8634B6EF4ADD9D581723A78FBF14A597": "Cachez ce Stock Réservé aux autres joueurs.",
    "038892D84F27968BA112D1A00F5953BB": "Explosif lourd",
    "217A29504EBD8ACEF16E498C5BA3F9D5": "Explosif Lourd",
    "84D7BB05492FD5B7DBFE31B7E34CD0EE": "Explosif Lourd",
    "DE69DD724B8F89FAA24A3F9CA62E23BD": "Forte chance de décheniller",
    "2C908B5A48AB40D82570EA903501DF60": "Grande chance de pénétrer les véhicules blindés",
    "BF2C15C14740C3AB71FB03B3D9B9DC3C": "Grande chance de pénétrer le blindage des véhicules",
    "DF6EEF584BFD5DA2CAF57E8AF4604A9D": "Grande chance de pénétrer les véhicules blindés",
    "A6A35D25419F581F05548BB8BB896C9F": "Grande chance de pénétrer les véhicules blindés.",
    "5DDD26B74D919F2F8E88F8B546717B0B": "Des barres d'acier haut de gamme, fortifiées par du Pétrole Lourd, qui sont requises pour assembler des véhicules et de l'équipement avancés.",
    "F6127E66469ECD53E180559ABE2465EA": "Meilleure chance de base pour désactiver les sous-systèmes des véhicules",
    "05113C3540257453624FCDA145453B61": "Blindage externe très résistant utilisé pour protéger un navire des dégâts et de l'usure.",
    "25B252A547FDC2F0456CDCAED5F52CF2": "Tenez la position",
    "384D311440713FB3E4E188B57DF2CEA0": "Tenez la ligne",
    "73AE8F2C486724FB3D149DAB8F627017": "Posséder plus de 60% des territoires à un moment de la guerre",
    "D3C7AC92419EE873FCCB0C95987DDE26": "Posséder plus de 75% des territoires à un moment de la guerre",
    "6E3FC4AA4BE95498353A3FAED66DF6A5": "Hôpital",
    "3F73A30F4289C459C814B38F7A18EFE6": "Maison",
    "9AB609E04DB475C2CC5FAE98AFD42EE3": "Maison",
    "7F3FB6F741260A09733E61A4B849B932": "Garnison d'Howitzer",
    "11C5C7D9495531D19ED6F0BED7A73D71": "Huber Lariat 120 mm",
    "BBD3AA484ADFD961C6C7ECB03D083A6D": "Huber Starbreaker 94,5 mm",
    "8462878046431C3E447044A39AC3F726": "J'ai besoin d'un Véhicule",
    "2C9571954AF0EC526149B38CB1F3C551": "Dans Foxhole, la plupart des objets, ressources et équipements sont partagés par des milliers d'autres joueurs dans votre équipe.\r\n\r\nPar défaut, tout est public. Cependant, pour aider les groupes plus nombreux à planifier, certains véhicules, structures et équipements spécifiques peuvent être réservé ce qui empêche temporairerment les autres d'y accéder. \r\n\r\nSoyez conscient que même les choses réservées redeviennent tôt ou tard publiques avec le temps.",
    "90629C884E1BC4AD7B1B688D8879CA4F": "Dans ses dernières années, O’Brien faillit mourir dans une attaque contre un train de passager militaire alors qu'il voyageait dans Whedon’s Row. En réponse, il mit sont équipe au travail pour concevoir non seulement un wagon d'infanterie qui offrirait une puissante protection à toute locomotive, mais un wagon qui à sa seul vue ferait fuir tous les attaquants excepté les plus déterminés—À savoir son blindage épais et ses puissante tourelles jumelles. ",
    "6B04D2B44B0ECF5B46F531A9EBD45928": "Afin de faire un meilleur usage de vos tranchées, vous aurez besoin de les améliorer au niveau 3 ou tranchées \"Béton\". \r\n\r\nCela nécessite une Bétonnière, qui doit d'abord être construite à un Chantier de Construction. \r\n\r\nPour alimenter les défenses de Bunker, vous aurez besoin d'un Générateur.\r\n\r\nLes Générateurs nécessitent des Bunkers en bois. \r\n\r\nVous devez ensuite construire des tuyaux pour soutenir la structure désirée.",
    "00972195402DDCD3343067BE75BBBF22": "En réponse aux offensives agressives de la Légion vers le nord, le Firebrand a été conçu pour incendier et éliminer facilement leurs garnisons. Reprenant le châssis offensif du Widow, le Firebrand est une arme puissante lorsqu'il est accompagné d'une escorte blindée.",
    "7362FAA74653E5863BF69AA53428206F": "Incendiaire",
    "F8B8718A42B8DF489309BBBE75C21732": "Incendiaire",
    "A2AD546C48E0C349FF50E190004959B4": "Chance accrue de causer une fuite.",
    "5CA555E84201DBA81236ACA6B2788426": "Dégâts accrus contre les Structures de Terrain",
    "8E9C45DD4A934CD02821ACA922532232": "Dégâts accrus contre les Structures de Terrain",
    "7D6CDD574431DF05CD67D7937C843885": "Tuyauterie industrielle qui permet le transport automatique d'une variété de liquides et carburants dans un réseau de tuyaux qui connecte diverses installations.",
    "012B35954F5CFCBD99DA58BE0B4DE6FA": "Tuyauterie industrielle qui permet le transport automatique d'une variété de liquides et carburants. Ces tuyaux spécialisés sont surélevés pour connecter des réseaux de tuyaux de l'autre côté de zones très fréquentées.",
    "8E3D49684068C965DC3796B3488D5075": "Tuyauterie industrielle qui permet le transport automatique d'une variété de liquides et carburants. Ces tuyaux spécialisés sont construit sous terre pour connecter des réseaux de tuyaux de l'autre côté de zones très fréquentées.",
    "0DF4235247A726CC903B14BC17F6C30B": "Industrie",
    "358F097842F9EBA78C231881FA23567B": "Tenue d'infanterie",
    "907A8F2C40C8D4B207F52AB96C810454": "Wagon d'infanterie",
    "5D21D00045492674DCF49CBEFAB1D4C5": "Garnison d'infanterie",
    "B87D2C6849DA008E12681A94DED93880": "Initialement un Loughcaster modifié par la troupe elle-même, le Hawthorne est doté d'un canon scié et d'un profil beaucoup plus bas que celui de son ancêtre. Tout en sacrifiant la précision, sa légéreté permet au Hawthorne d'être beaucoup plus flexible au combat et de pouvoir être porté avec une arme à feu principale plus lourde.",
    "9C4AD1BE4D93664EBFDF3780DFB1AFE1": "Initialement conçu pour fournir une plateforme mobile pour les armes de campagne encombrantes, la Batterie de Roquettes T13 \"Deioneus\" est une chenillette légère équipée d'une artillerie roquette à 9 canons. Cette batterie unique est configurée pour que des roquettes incendiaires soient lancées à portée tout en conservant une grande maniabilité entre les déploiements.",
    "409B904C4F973C80DE39AB9CAB0A923A": "Centre de renseignement",
    "65E7A40F4AFFB93B9A7BB5852FE98F53": "Centre de renseignement",
    "7D43D62949624B5D4E92E3A3A83890AF": "Port de tir intérieur",
    "713F895344604DCFFC2599B0B08B4F30": "Fer",
    "544383254C944A19EFE8AA98A6AF2657": "Alliage de Fer",
    "A5674AE743C58EE9F31A0286F4BFA673": "L'Alliage de Fer peut être utilisé pour produire des prototypes de véhicules au Centre d'Ingénierie.",
    "A8496B6F4577208DA9E8939EB017D387": "Le Fer peut être raffiné en Alliage de Fer, qui est utilisé dans le processus de prototypage des véhicules.",
    "018F3B91423A783B639B7FAEC003F268": "Comme pour sauter, appuyez sur '{0}' pour utiliser une échelle. \r\n\r\nAppuyez sur '{1}' ou '{2}' pour monter ou descendre.",
    "06CE98FD41666C3DB4F9B8B5E3341354": "Place Forte",
    "626D70364203D4662E3933A3AE5B600B": "Gardez un œil sur vos pointeurs en croix. Lorsqu'ils sont rapprochés, vous avez une bien plus grande chance de toucher votre cible. \r\n\r\nChaque tir réduira votre stabilité.\r\n\r\nIl y a trois façons d'augmenter la stabilité. \r\n\r\nUn, rester immobile lorsque vous tirer.\r\n\r\nDeux, vous accroupir avec ‘{0}’.\r\n\r\nTrois, vous allonger avec ‘{1}’\r\n\r\nÊtre allongé vous donne la meilleure stabilité, mais au prix de votre mobilité.\r\n",
    "4DDDB91A4021DCF5988EE6A930E366A5": "Cuisine",
    "CBFCB98C4279503AD9449899EDEECAD8": "Connu à travers les colonies comme le Roi du Rail, ce wagon lourdement blindé est conçu pour protéger et exercer une dominance sur les lignes ferroviaires contestées, particulièrement lors du transport de matériel dans des territoires contestés ainsi que le transport sécurisé d'infanterie. Ce monstre blindé revendique un canon frontal ainsi que des armes lourdes latérales.",
    "76224C6D40DE8F1D52AC6AB1FAD7EBE7": "Échelle",
    "1101872643C4610FEEA5D28FC5EA44D2": "Échelles",
    "0390DF8543C71F69CAD325A43B34555F": "Lampe",
    "4690646349F78B22181DDDB00749F8F1": "APC de Débarquement",
    "9E1DD4F34DCF42E1265060B5E076F9D3": "APC de Débarquement",
    "AD8A7686412CC5E89AA15FAEFCCF4A23": "APC de Débarquement",
    "DBF3935B44F68435BDB1DCBB8B794E56": "APC de Débarquement",
    "80CF1FBE4EC9A8B3F4001090CBA224A2": "Plage de débarquement",
    "0AB28E3B44E885C1C9DAFC8F1CBFE04C": "Navire de Débarquement",
    "60A888024ADA81D343D7E785AADA93A1": "Grande Station d'Assemblage",
    "02F8B69A49495A42BBFD8FBD9F93E3C0": "Grande Grue",
    "1BEA91F4468C042AEB44E6B841157B14": "Grand Canon de Campagne",
    "E7FD55034602301A5FCCCEBE1FD5219A": "Grand Canon de Campagne",
    "21EBE6CE42874FCD5A99A9B892E6259A": "Grande Garnison",
    "04AEECAD4ACEC99C5197C7B72285BA09": "Grand Matériau",
    "079B4A0D4DF554E5C70BA08E04978795": "Grand Matériau",
    "0823C51F47F12B89897430A0C241BDEE": "Grand Matériau",
    "08300A3A4C56ABC74209C5926A9C69C4": "Grand Matériau",
    "3184D8124074F742A2BFE9954310637D": "Grand Matériau",
    "584FE16345AEEE289C44119A605B1D79": "Grand Matériau",
    "5C312B6644ECBBA3F95E1B843DD47E4E": "Grand Matériau",
    "646A9B7D44D38378C45262B835067A19": "Grand Matériau",
    "93CC7D704A415162784BB1A275473C54": "Grand Matériau",
    "942E93CF476CF7108C347C85DE0B6278": "Grand Matériau",
    "B572A4B544F27B74048E1DB454D567C8": "Grand Matériau",
    "B9E50A2B4A9D4B03F532ABA0A35138B0": "Grand Matériau",
    "BA48EFA04D49D7C3A8D976B17EDFFFF6": "Grand Matériau",
    "CFADC00249B8F9167A1A4B9FB75BB0AE": "Grand Matériau",
    "D4E792724F704DDEF624C1B827C3A2E2": "Grand rocher",
    "94882C3A447B8955381A79A240E1CF38": "Usine à Obus Lourds",
    "2D9EDC76462AA2683886FB9556E17D03": "Navire de Ressource",
    "8249657A46A3EE8E9CA9A4823F4AD7BA": "Baroud d'honneur",
    "0082C2554406CA8E47120E92D77E709B": "En apprendre plus à propos des feux",
    "32032B8B42A16AE8EF602F819CDABFB0": "En apprendre plus à propos des feux",
    "74EDDE43424848E1E23C17AB4EB64866": "en savoir plus sur la Visibilité",
    "9E46F1564DBB211AF78473851483F7AB": "En apprendre plus à propos de la visibilité",
    "FB9866074CC43BB3B2CD9E8E05AA91F0": "Leary Shellbore 68 mm",
    "D20EC1ED4E06085C2F0FF99DB9151CAC": "Quitter le Régiment",
    "670A03504B08D046AD0E638F8ED6B724": "Quitter ce régiment",
    "FFD4D9B642832CFABACDC391D68A34BD": "Les éclaireurs de la Légion sont déployés sur les missions les plus dangereuses. Leur équipement est léger, robuste et bien adapté aux opérations prolongées en terrain accidenté.",
    "0FB7E02B4E914C5BD561FAA4040C76CD": "Uniforme de légionnaire",
    "651803D243D685B8B874B3A08B3A88EE": "Ciré du Légionnaire",
    "6A11A2CF453E9B42CB16A3A6D70CD5CE": "Libérer 1 ville logistique en territoire de départ allié quand votre faction possède moins de 35% de toutes les villes",
    "5EDF69BD461F13ABE71564B80B110EA1": "Libérer 20 villes uniques dans les territoires alliés en début de guerre",
    "4DCE50B74EFD9007E0C63EA0F0B90DD8": "Libérer 40 villes uniques dans les territoires alliés en début de guerre",
    "C33BD6644BAB32A6DD7B3FA6B2654163": "Libération",
    "D377C25B4BAA7CC2063E208BD257EAA9": "Frégate Légère",
    "013AFA104C2289826AB5D48CF9187CC1": "Char d'Infanterie Léger",
    "48EC82B9455992D945AD6FA1BCD07350": "Cinétique léger",
    "DEB3F7BF4AAEB54BBEAF81AADE011C24": "Mitrailleuse Légère",
    "04CC125A442391864552348644139DDC": "Char Léger",
    "0B8A430C4177ADCB030D988089650B1B": "Char léger",
    "276EE0EB4F509FDFB7B2C280275641F6": "Char Léger",
    "2E06E5194C85864DBE6D4088CD60F9B4": "Char léger",
    "4D91A6614EC93344D7E3E7A5962EC665": "Char léger",
    "CB5ED66A430DE7B766771791DF9F5C85": "Char léger",
    "F689EE6F4FC29F81ADAAADB13398E6E8": "Char Léger",
    "A871879F492DCA0E83D8D18C6B8F200A": "Véhicule utilitaire léger",
    "647FC4CD4205FD8BB6C92095D228B54A": "Conteneur de Liquide",
    "19652C2E4011FD8284C74F8C1208BC18": "Station de Transfert de Liquide",
    "0E0BCD994DBE7FA08EB7F3A6E3D86FF6": "Kit d'écoute",
    "72BFCAE84FD18AE9A6734482B47ED091": "Kit d'écoute",
    "F09918C5426DF9ABAAC458A157554256": "Chargeur",
    "29DB96F34F0DB4211E0BAA96C99A19A7": "Verrouiller",
    "EBF48BD949DDBE9AED1F86A38C54D484": "Casiers",
    "3CBC2E1C4ACF2344C8E33ABF5261FC58": "Verrouille le véhicule afin que les autres joueurs ne puissent pas y accéder.",
    "5C66CB85462BCBEC0403D1961A5C3582": "Formation à la logistique",
    "8CF54F7F4A4F75D458EF318B8EF669A9": "Formation à la Logistique",
    "B4BA894F45D24A2F0A6378830AB09308": "Formation à la logistique",
    "EE32052E4F4FDA3E5913AC83AC3CA50C": "Formation à la logistique",
    "39B535BB4CA17D4F0689DABC704ED948": "Formation à la logistique - Appuyer sur 'E' pour lire les panneaux.",
    "3FBA89B045E8BEF3C9BB17B12C69E0B8": "Fusil Long",
    "BFF29363428BB97E41A98D8C14F2B33C": "Fusil Long",
    "4DE529804B88FBF076B4AC8FD09149DF": "Wagon d'Artillerie Longue Portée",
    "DD502CA34C3A8980D2B9ADAC816877AC": "Craint depuis longtemps en haute mer, les cuirassés de classe Titan sont évoqués à voix basse et avec respect. Équipés d'un vaste arsenal de canons et de pièces d'artillerie, les ennemis du Titan ne tarderont pas à être envoyés par le fond. La Republic Coastal Legion considère les Titans comme ses pièces maitresses et des flottes entières se rallient à leur position. Inspiré du vaisseau amiral de la célèbre flotte d'Ambrose Leon, le Titan est un symbole de victoire pour le peuple Mesean.",
    "DAA7E763486A04D2A8CC8F8FE9BA0C0C": "Regardez Ici",
    "402840774A2023C9CDDEBD970E90CF05": "Lyle Rycker a d'abord construit un prototype du Wasp Nest comme appareil de test pour ses batteries de roquettes montées sur rail, qui devaient un jour trouver leur place sur les véhicules blindés. Capable de tirer rapidement douze roquettes compactes, le Wasp Nest est rapidement devenu un équipement favori de l'infanterie Warden qui le testait, si bien qu'un modèle officiel fut réquisitionné.",
    "6A1726BB461EEBB529A3E680FFCD56EC": "Mitrailleuse",
    "87BCFBA74D68323232ADF4B7558FB7B0": "Garnison de mitrailleuse",
    "5A3631E046C031B8D354ECB975C8A312": "Garnison de Mitrailleuses (Niveau 1)",
    "5CB174014ACA2C622B96D6B67F7925CC": "Garnison de Mitrailleuses (Niveau 2)",
    "6BEC07FF448FB9CF98BD24A6A3B1E75D": "Garnison de Mitrailleuses (Niveau 3)",
    "2ADF25464310AFAC96CECAB3329DA093": "Nid de Mitrailleuse",
    "3BCD84BB47BD5DB19865AA8AF93908D2": "Boîte magique",
    "AB77783644E9E79C8BBFA98C20F0F7E8": "Contrôle du Ballast Principal",
    "0C1369294C9CECDCA9A2A9BFF55D8377": "Fournitures de Maintenance",
    "BE3131BD41E6F6A39447329C32917188": "Tunnel de Maintenance",
    "13FF02AA490A8D7FCF87BE88A651CBCA": "Offensive majeure",
    "21B75FDD49E8283C5AE14BBAEDBB9872": "Rendre public",
    "0BAA828B4103D201AAF356891DB432D4": "Cacher le stock réservé",
    "418CBBF34A74487571404EBA8AB243AC": "Rendre le stock réservé visible",
    "EBB6FF0340AB4B2D611ED0924892B700": "Assurez-vous de mettre des fournitures de soldat dans la Base Avancée. \r\n\r\n Pour les besoins de la formation, vous pouvez en trouver dans ces coffres. \r\n\r\nVous pouvez ouvrir les contenants en appuyant sur '{0}'.\r\n\r\n'{1}' pour récupérer un seul objet, 'Shift+Clic Gauche' pour en retirer une pile entière.\r\n\r\n'Clic Droit' ouvre un menu contextuel.\r\n\r\n'CTRL' + 'Clic Gauche' pour diviser une pile en deux.\r\n\r\n'ALT' + 'Clic Gauche' pour laisser tomber un objet.\r\n\r\nCeux sont les mêmes contrôles pour mettre des objets de votre sac à dos dans une autre structure ou contenant, ce que vous allez devoir faire avec ces fournitures de soldat dans la Base Avancée devant.",
    "ED64C5C24077B959A3D447A88C243906": "Usine de Production de Masse",
    "68D6C1E748A103D0A695CC863AAD7070": "Palette de matériaux",
    "82E83E844856E73FD44A93B16E956026": "Station de transfert de Matériaux",
    "C776334E42EE0B3A70C7BCA08985DD60": "Usine de Matériaux",
    "AA37CE1F49ACE3544BAE289BA4731877": "Mecha",
    "3C489B0749F6DF4A3056FB95246871B5": "Médecin",
    "8AEBE5904E3ED7D827D57DB87FD31B79": "Tenue de Médecin",
    "24F8AD7D4FDE265C6AF464A2D54D4711": "Médical",
    "848B7DCE4B91187BAC764B966CEBE50E": "Poutrelle Métallique",
    "A1A86EF042657683CB7010B6656CE2E3": "Presse à Métaux",
    "AD66D050433091A7C8FDB2A1B361A353": "Des barres en métal nécessaires pour produire des structures et véhicules basiques à des Installations.",
    "C9D214BD494A1340BF6ACD90CE2DE718": "Des barils de métal pour stocker divers carburants qui peuvent être transférés vers ou depuis des Installations. Les stocks sont publics.",
    "3C412CD74E6A9264E9C0A684751CE311": "Usine de Métallurgie",
    "565BE555409EA9717AFF8CB2BE11C4E8": "Des poutres en alliage conçues méticuleusement qui sont requises pour assembler des véhicules et équipements avancés.",
    "D19837E24EFB743598DB7BBCE352A64C": "Torpille Moray",
    "408A4C3846145221877C3E87DDE43CD7": "Mortier",
    "6B93E3CE46F78BC0E497E5914B37E09A": "Obus de Mortier",
    "1BAA4FC441A303A5879934A4F1E33F5B": "L'uniforme le plus courant de l'infanterie Warden, conçu pour la guerre générale de première ligne avec des armes balistiques telles que les fusils et les mitrailleuses.",
    "D21852374C0B433C37CDD39F6FBB7279": "Parc de Véhicules",
    "06274E914F174833CFD85E951FE0B9EA": "Bateau à moteur",
    "66757AE346443F370CBC3292858E142A": "Bateau à moteur",
    "D0643368477BCA32F57B718BC51137DB": "Lance-Roquette Antichar Monté",
    "83A1D52A4F7274E908B85686B3C5B5D3": "Fusil Antichar Monté",
    "1C90DF354FAD1196EE79099BEE5437DC": "Bonesaw MK.3 Monté",
    "082A52A34CD537E02CA62B8467CC77A4": "Fissura gd.I monté",
    "7C04A994408BD6FD9775599FC51FA245": "Lance-Grenades Monté",
    "EF9D8CEA4BF99F4E49F819A4D55F8E45": "Canon de Soutien d'Infanterie Montée",
    "063843E94D1CD8E3BD848EA040BDFE32": "Mitrailleuse Montée",
    "A807C2AF486FE054D91DB5A57F180B34": "Mitrailleuse Montée",
    "692C46D74E3DDE237B60668B506FDCFA": "Lanceur de RPG monté",
    "42AABD3147EC975BB10C86A114F8E216": "Nommé d'après les arbres victimes du développement de cette arme hautement destructrice, le Willow's Bane utilise des produits chimiques inflammables et les projette en un flux concentré au travers d'une flamme nue. Ce liquide brûle les emplacements et garnisons ennemis pour déloger l'infanterie tout en réduisant leurs défenses en cendres.",
    "3D5C5E1F41D2106BED8F53974091D76E": "Nommée d'après l'aspect non peint d'un premier prototype, la frégate de classe Blacksteele est un navire très manœuvrant, bien que de petite taille. Le déploiement des sous-marins \"Trident\" par la \"Republic Coastal Legion\" a conduit le Commandement de la marine Caoivish à répondre en retour avec le Blacksteele. Conçu comme un escorteur chasseur de sous-marins, le Blacksteele excelle à déjouer les assauts des submersibles contre les navires plus grands et moins maniables. Le concepteur naval en chef du projet n'était autre que le poulain de Conor O'Brien, Rory Boyd, qui, à la fin de sa vie, était considéré comme un concepteur hors pair, et reconnu comme étant l'homme à l'origine de la réputation de classe mondiale de la marine Caoivish.",
    "9FF93FAD4D5B505F5CA208B8F7FC0A53": "Sections de Coque Navale",
    "8327AFDA4620DBE34D0567BD323D4A2B": "Placage de Coque Navale",
    "C7D6417747F4D15585A5A88A21F10EC2": "Composants de Turbines Navales",
    "41EF26954903230764250F868ADB85D0": "Travaux Navals",
    "AFE3EC3141AD90EADB4A609EA5ADDAD6": "Quai Maritime",
    "831E469040F0CB2CBD98F7BB834AA50C": "Contrôle du Ballast Négatif",
    "47219DCA444620491F9F2E815C73C5DA": "Semi-chenillé Niska Mk. I",
    "AEA3035D40B36D003D17A9AFFD9FE831": "Personne à réanimer...",
    "EADD53AC4D23AB75789765B76AED58AF": "Pistolet-mitrailleur No.1 \"The Liar\"",
    "E428C82742147B65A32BE383EDC73ED7": "Ce n'est pas un emplacement valide pour creuser",
    "C43A8475409CC002327759AB0441BDC2": "Pas utile",
    "A1AE84AF44F3AA89CE991A934595AE15": "Pour ne pas être en reste par rapport à son homologue, le 2a-1 \"Ruptura\" est équipé d'un canon de 75 mm. Conçu pour aider à tenir du terrain pour de plus longues durées, le \"Ruptura\" est un outil anti-blindé puissant et efficace.",
    "D903D1344D34B8A7CA643A9718FDC26E": "Rien n'est comparable à l'efficacité et aux capacités de destruction de la division blindée Coloniale. Les membres de l'équipage des chars sont équipés de combinaisons robustes et de sacoches de ceinture pour accéder facilement aux outils essentiels à l'entretien et au fonctionnement des chars.",
    "11322B8A4F07DE6381AAE8B7AF73CE2F": "Bunker d'observation (Niveau 2)",
    "9165FDDA453ECB943EB77788C065E4F8": "Bunker d'Observation (Niveau 3)",
    "E513F8D94DCFF5A1D572258D1216D2D5": "Bunker d'observation",
    "F62892A14508665628B6A9BDE279D2BF": "Tour d'observation",
    "BE55BE3542BA5C1156371F94959D0996": "Occasionnellement, lorsque vous minez des ressources vous découvrirez d'autres matériaux, comme le Fer ou l'Aluminium.\r\n\r\nCes ressources peuvent être raffinées en alliages, qui peuvent être soumis à un Centre d'ingénierie dans vos villes logistiques arrière pour la recherche de nouvelles armes et véhicules.",
    "BE8C7AA34D4A75F9A617118735A9BBF6": "Ville occupée",
    "A492C59241101AFA893911ABE85CD3D4": "Parmi les divisions les plus distinguées de la Légion figurent les Grenadiers. Ils sont équipés de sacoches et de poches spécialisées pour maximiser leur capacité à transporter des explosifs.",
    "EB05984D441EF97815BA78BCBF6886E9": "Parure d'Officier",
    "844B4C914A5CF5D0CE0D59A2DF32210A": "Tenue d'Officialis",
    "7DC9E23F44237A766B3DB79D7C2C63B8": "Plateforme Offshore",
    "222115714A24BD2DB20DEBB15557F2C8": "Les Plateformes Offshore sont des installations d'extraction en pleine mer utilisées pour extraire divers pétroles. Un approvisionnement constant de Charbon traité est nécessaire pour certaines opérations, puisque l'extraction de matériaux du fond de l'océan est un procédé complexe.",
    "19640F8242B75CD52968AF91F2B06169": "Pétrole",
    "663CE0194E91F6C0425769AB380A7DD3": "Champ de Pétrole",
    "EE4F6EC04863D4B293FFAB8C17A20AAE": "Raffinerie de Pétrole",
    "2C355BC64C5D5D2FC051CC9C755B0B2F": "Puits de Pétrole",
    "CE9FA4504D244C1F45048597B5A976B0": "Pétrole qui a été purifié et enrichie pour des procédés d'Installations avancées.",
    "EE12DA2B4EBF3A35C01EFD80EE885B8B": "En plus de vous fournir une protection, utiliser une couverture donnera un bonus à votre stabilité. \r\n\r\nGardez un oeil sur le bouclier en bas de votre écran. La profondeur de votre couverture déterminera le bonus.\r\n\r\nSi on vous tire dessus, vous serez tôt ou tard sous Suppression, ce qui réduira et finalement annuelra le bonus de stabilité. Être sous suppression à découvert impactera négativement votre stabilité.\r\n\r\nVous pouvez mettre sous Suppression les structures en leur tirant dessus ce qui ralentira ou stoppera leur cadence de tirs, et empêchera aussi les joueurs à l'intérieur de celles-ci de tirer. \r\n\r\nTestez la couverture sur les différents endroits du mur devant vous. Essayez de tirez sur la casemate jusqu'à ce que le drapeau clignote en blanc, indiquant qu'elle est sous suppression.",
    "AACD73E5404D68218A243AB39778B5B7": "Une fois que vous avez une tranchée ou bunker initial en place, les tranchées et bunkers suivants s'attacheront à différentes sections. \r\n\r\nEssayez d'attacher de nouvelles tranchées aux différents côtés de la tranchée initiale. \r\n\r\nPour faire une tranchée en \"T\", tournez votre plan sur le côté long de la tranchée. \r\n\r\nConnectez de nouveaux bunkers en attachant simplement de nouvelles sections.\r\n\r\nLes tranchées peuvent aussi s'attacher aux bunkers. \r\n\r\nMaintenez \"Maj\" pour désactiver l'attachement automatique.\r\n\r\nDes lignes de tranchée séparées peuvent être connectées avec des connecteurs de tranchée.",
    "4CCC4E0A4D10CE052A75A8BE15E975A5": "Une des meilleures qualité de Conor O’Brien était sa capacité à moderniser et faire usage d'anciennes technologies dans ses conceptions. Le V.190 Knave est le parfait exemple de cette philisophie. Équipé d'une tourelle lance-grenades jumelé archaïque, le Knave est une combinaison surprenant de vitesse et subterfuge qui met rapidement en déroute l'ennemie, le laissant confus.",
    "F50DE88D4A5FB04A6031F5B2BB6DAA12": "L'une des locomotives 0-6-2 les plus célèbres conçues par Bassett Motor Society, cette locomotive industrielle alimentée au charbon est fiable, éprouvée et incroyablement robuste. L'héritage de la Black Bolt est inégalé, car elle a aidé Bassett Motor Society à équiper des pays du monde entier.",
    "E03783F243DC4FFB8F9D71AFB2F84CB5": "Ouvrir la Cale",
    "3ED75B5C446190B15FEF75816C5BE9CB": "Ouvre la cale.",
    "37ABEF14452D28933B416FA267B7065A": "Opérateur",
    "3627FCE942A0EC4348F4D0B0F2E360F8": "Conçu à l'origine comme une ébauche pour de futures plate-formes plus sophistiquées, le Jester tire son nom de la réaction aux tout premiers prototypes montés sur des King Spire dépouillés. Ce véhicule inhabituel peut tirer des roquettes spécialisées sur de longues distances. Son châssis léger le rend facile à repositionner, mais le rend vulnérable au sabotage.",
    "DE0F057C4EC283B2D701F0A0C673783C": "Conçu à l'origine pour répondre à l'augmentation du nombre d'armadas de blindés Meséens, l'Outlaw est un char moyen remarquable, équipé d'une tourelle 40 mm longue portée et inclus une position de soutien grâce à un fusil d'assaut intégré.",
    "82DCBA4C4DA4BAEA6ABDE78DBFDF1A92": "À court de plasma sanguin",
    "858246904EA9CB58D46AE1B303D3FE6C": "Manteau d'Éclaireur",
    "B1009FD94E96F33A56106C8F696CAB9E": "Grenade Fumigène PT-815",
    "A46EC4D2431C5B04200D19B3E5C87D5B": "Démonter",
    "4694E54448F16D33A72F769C96940628": "Emballer",
    "7336A0D849EE71D00D2444887982DC53": "Empaqueter l'équipement en zone de chargement",
    "1AD811F8444E4C52150284A7A93E3755": "Emballe l'objet à expédier pour qu'il puisse être déplacé par certains véhicules.",
    "03936AFA4F1D5152A03D6E81539B7A70": "Emballe le produit livrable pour qu'il puisse être déplacé par certains véhicules. Cette fonction n'est disponible que si l'on accède à ce bâtiment à partir d'une grue qui a déployé un équipement sur la zone de chargement.",
    "27A7676F4E6A3EBDDAED359E5E673784": "Emballe ça pour le transport.",
    "E3AABA6F423A53A9336B29ABE7ECA304": "Combinaison Rembourrée",
    "75EE3E7E457290010840959DB6403915": "Garde-manger",
    "41A1785D4CCADD24D847ABB5CE523DF2": "Passager",
    "90CBF9434D8C90F0DEC11B80AD7A99AD": "Passager",
    "5369E1A84F6B26908AA4A894CBD8E09A": "Moto de patrouille",
    "01EFAF3D45DFE2603CAC7097851E6363": "Obus d'artillerie lourde.",
    "B3E7F92F4F9B498D3E427685B143EBCC": "Charge utile pour les armes d'artillerie légère.",
    "EA9A9C904D8E35E69F1CCF8E2D27F2F0": "Opérateur Périscope",
    "0C739E1D4A83CEC5E85186A6C1AD7155": "Permet d'accéder à ce bunker depuis le toit.",
    "12478EAB4CE62A389910328226C940E2": "Usine Pétrochimique",
    "3D321D484BE5C1D46A7248B3F9546D6C": "Essence",
    "D2B4D0444D59F5D54F0AAF9A1FF441F8": "Centrale Électrique Essence",
    "EB2352AE478EED61B230ACB7EEC07D06": "Les médecins de l'armée Warden sont inégalés et cet uniforme comporte une pléthore de poches et de sacs conçus pour transporter et déployer facilement le matériel de premiers secours.",
    "3DF6455A4B74CC03B5EB3ABF3A7EA2BC": "Veste de Médecin",
    "B36C1FF2420C91471FFE51992BB778AA": "Tuyau",
    "DC78D5364E0679EFE74112BA075B833A": "Pompe à Eau Tuyautée",
    "C34C8BF84C3A03BC0F712DAD1A51FD7C": "Pipeline (Aérien)",
    "9C33490D44084C0CE861649F1A8B5E55": "Pipeline (Souterrain)",
    "1E0788EE4A2F52EE7ED3EF8EF6DC9EF7": "Valve de Pipeline",
    "45CC94BA4824B0C1EA8CA38819F0F8C1": "Tuyaux",
    "60FC918C46B8F7409445CA8651E887D0": "Tuyaux",
    "6C68927A481C931248CD8CA686610C7C": "Tuyaux",
    "FFD26F834BF5B6DE894D908993CFF4F1": "Tuyaux",
    "124818E1483DD291FCBCC387E4F7AC38": "Pipelines et Puits de Pétrole",
    "4C6E8FFF47D1AE69B6602EBC79E32955": "Pistolet",
    "8D014C60464731904E7CD08ECDCC98E6": "Pistolet",
    "D920E07C43955C026355E1960D6AD9EF": "Pistolet",
    "254731D94200A388888EF6ACB0519A53": "Veuillez sélectionner tous les acteurs de la scène",
    "8D9EF6C54313E003A2525CA1B9B813E9": "Merci de séléctionner la spherereflectioncapture dans la scène",
    "BFB6CA2C407C9265D039A893D3B5CE1B": "Gaz toxique",
    "6AC6CB4645972A3EB08D62857CF7C4D4": "Ligne Électrique",
    "379622544742EF557AD1F0A96130CE84": "Poteau Électrique",
    "4D50B52B48B956C73491CF967D25CFA7": "Centrale Électrique",
    "FC75427A4FF4A66AAC70D68BAA62202B": "Interrupteur",
    "80A8775D432A25ABB71DCEB4F685B149": "Énergie, Tuyaux et Béton.",
    "4B255F8543C9C3F3EAA4B4822EEB75AE": "Propulsé par le moteur léger Grouper de la Bassett Motor Society, ce simple bateau en bois est idéal pour transporter de petits groupes d'infanterie à travers les rivières et entre les îles.",
    "666BA3394B49F1F45D0C8D99DEB50E60": "Appuyez sur '{0}' pour monter dans un véhicule. \r\n\r\nVous devez être debout à l'extérieur de la place que vous voulez pour y monter. \r\n\r\nDepuis l'intérieur du véhicule vous pouvez changer de place en appuyant sur '{1}', '{2}', '{3}' etc. Changer de place ne marche pas nécessairement pour toutes les places dans tous les véhicules. ",
    "60427A5F4BC426CEE371C688D55522BB": "Appuyez sur '{0}' pour sprinter. \r\n\r\nSi vous êtes perdu, ouvrez la carte avec '{1}'. Sur l'écran de la carte, zoomez avec la 'Molette Souris' et cliquez pour déplacer la carte.",
    "836DAAAF4B7BA5693722999E2AED16D5": "Appuyez sur '{0}' pour sauter par-dessus de petits obstacles, comme des sacs de sable ou pour franchir les clôtures et murs bas.",
    "BD7656634952E8147D8D62AB4032FF47": "Appuyez sur '{0}' avec votre marteau équipé pour ouvrir le menu de construction.\r\n\r\nAprès avoir sélectionné une structure, un plan apparaîtra sur votre curseur. \r\n\r\nMaintenez '{1}' tout en bougeant votre souris pour tourner le plan, et '{2}' pour placer le plan.\r\n\r\nUne fois placé, utilisez '{2}' avec votre marteau pour déposer des matériaux jusqu'à ce que la structure soit finie. \r\n\r\nEssayez de construire une Tour de Guet sur la terre devant vous. \r\n\r\nPlusieurs soldat peuvent collaborer à la construction de n'importe quel plan. \r\n\r\nCertaines surfaces, comme le gravier derrière vous, ou le sable, ne permettent pas la construction, mais certaines structures ont moins de restrictions, comme les sacs de sable.",
    "8510E6D94D838BE28E709BB15EE2D8CF": "Appuyer sur 'E' pour lire.",
    "9F5B16B3459DAF29AFAE5B91F6C242EB": "Empêche la dégradation des structures environnantes lorsque approvisionné.",
    "77F811F14E7B168F64825D85B52CB85C": "Matériaux de Construction Traités",
    "E3AAFF5E4CA5596CACB8C08647348BD4": "Cuves de traitement qui raffinent le Charbon en Pétrole.",
    "B3F8474B4C8254DD9CA773BFDA513167": "Produit des obus de gros calibre pour les chars et l'artillerie.",
    "41F71601424CF96B828D7A9D47E8E040": "Produit divers types de munitions pour les véhicules et structures à roquettes.",
    "2DCB8DDB48017DEAD95A5A937A75BE41": "Produit différent type d'armes sur trépied.",
    "6E5DDF09409408E832AF3CBB62442397": "Protège contre les gaz toxiques",
    "3CAB8CCE4CE4EBDF9DE04588423DD05C": "Kit de Prototype",
    "233714384EF32F65D260B4BB2B75F80E": "Pièces prototypes pour produire de nouveaux types d'équipements.",
    "863E62E54DCD9AE449D147BE06F9B7BA": "Fournit un point de rassemblement pour les forces amies. Permet aux soldats de se déployer directement sur cette base depuis la région d'origine.",
    "1F61B0004D61359DE18DEDA955506DEF": "Fournit une couverture contre les ennemis qui sont entrés dans ce Bunker",
    "5F8D8E0D4B9700A47014F98555B0438E": "Fournit une couverture contre les ennemis qui sont entrés dans ce Bunker",
    "D55060854349797457E63CAC4B5266B3": "Fournit une couverture contre les ennemis qui ont pénétré ce Bunker",
    "9CFA53A04AAB8F7D59D78A9065DF03E9": "Permet un accès facile pour entrer et sortir de cette tranchée.",
    "287E6E724D49CDDF62A27B893324AA9C": "Permet l'accès à ce bunker.",
    "8B10170E4F33E86CBECDA687A7A67154": "Permet l'accès à ce bunker.",
    "F64922064BB5F5EE7E927C88240BBD0B": "Permet l'accès à ce bunker.",
    "0F5FC8624CF5095689907C94D93D30F4": "Fournit les connexions électriques des Générateurs aux améliorations de Bunker.",
    "A201D9AE4EEE90021F37DE9410D12C54": "Fournit les connexions électriques des Générateurs aux améliorations de Bunker.",
    "A66304F4432FEF55EB504DB62752CA1B": "Fournit les connexions électriques des Générateurs aux améliorations de Bunker.",
    "E29FCE7848ADF3D460455B827EC3CDC2": "Fournit les connexions électriques des Générateurs aux améliorations de Bunker.",
    "8F45600C4A6DE4B169381380331AB9A1": "Garnison provisoire",
    "A0CF09784A6FDF3703E0238FA6E5941B": "Route Provisoire",
    "77A87BFB4656E13D28430D80699938EB": "Pompe de l'eau dans des tuyaux. Doit être bâti sur une étendue d'eau.",
    "22559E0249F1D9A4B4F1E98492E04F15": "Éteindre les Feux",
    "682A410049D9A602187B0F9C45E31028": "Accoutumés aux climats tempérés du sud, les Colonials portent cette veste imperméable associée à des bottes épaisses. Elles sont d'une grande efficacité lors des tempêtes, sauf les plus violentes.",
    "CEEA736D4F63F93274F9F4B5652026DF": "Ambulance R-12 - \"Salus\"",
    "1FBCBCA34E539F85603E14976D9E0576": "Camion d'incendie R-12b - \"Salva\"",
    "32DC71B84E8A3699FDA27F9B8AFFD674": "Lance-roquettes",
    "A17DBC954D8472EB87663DBD963001C9": "Roquette",
    "A02D90114437558DB0FFC2B1D0CD65C9": "Camion-citerne RR-3 “Stolon”",
    "203F155C462839AE5CE288857F52D683": "Transmetteur Radio",
    "11B5651547E72A8A3D82DCAB82416054": "Station Radio",
    "55525820404120F931A25FB3ED589AB7": "Station de Radio",
    "58AEFCE54F8E98F2E6AA65AB7604DF4C": "Voie Ferroviaire",
    "35E8903B4FEE62FC2F42A8A286BE2253": "Voie Ferroviaire (biarc)",
    "4413370E406D5CD49703D48F1A25C186": "Voie Ferroviaire (Biarc)",
    "90CE9F4447D926485D79C3B74325CC63": "Voie Ferroviaire (Fondation)",
    "CB9BFB744A8A0E2CCA37BF89725F19B4": "Voie Ferroviaire (Fondation)",
    "F86480E64BFE40A6C69628B0D1C4584C": "Tempête de pluie",
    "B624938C40D0C8908A11598A62E21641": "Alliages Rares",
    "D09BE2244DF9D9BE4934C29DE427E2A6": "Métal Rare",
    "24E8024C42E83507ACBC9D966442C164": "Lire la pancarte",
    "61469E5549BF60D9BE0C0687A36E0B03": "Lire la pancarte",
    "89379DD942E913A7636BA3B45E7F1D2A": "Lire la pancarte",
    "B1367643468F5BD3334E01A278B08341": "Lire la pancarte",
    "7727A7E94F29E56EB088A6B7CFEE1F00": "Lire la plaque",
    "8D0FCD114391BFE66FBBDE8CC22E34C7": "Rébellion",
    "48EDBB7147EB5FE9076D49988AAFA9EB": "Reçois les mises à jour des renseignements sur la carte",
    "B53C95C64C4ACBD9FD9547AED07D8C8D": "Camouflage de Reconnaissance",
    "B9290DB845F7BA537FFC7E85AFAF68F5": "Recycleur",
    "7B14805B4515430A6FC8B4B9CA1871A9": "Réduction des dégâts contre les tranchées",
    "9B9CF76243BAC0B3EC597EBC7EB330CF": "Dégâts réduits contre les tranchées",
    "C0D4E8084AE9E5A1C4A490A4D7D4A42F": "Charbon raffiné nécessaire pour divers processus aux Installations.",
    "964344C74C8342461DA2C8B341121701": "Matériaux Raffinés",
    "7C5055A34306F42B649CF29F6C0292A8": "Des barres en métal raffinées nécessaires pour produire des structures et véhicules avancées à des Installations.",
    "BD756A6244CDA9F2EE9D38B4E428F2D8": "Raffinerie",
    "D2170AA740CF4177019D7598C7BAE7B7": "Raffinerie",
    "C5DD20C1472BECA1CABBAFBF2E87465B": "Réformateur",
    "5EEE3A3B4EC1A7ED5D703F9FE5BAFAE3": "Actualiser les réservations",
    "3B89366345C4FA458F38C59488BAAC90": "Actualiser les stocks privés",
    "E2B48E9546C1B2B9D362A2B83DBC9B22": "Actualise la Réservation présente pour cette structure. Actualise aussi les Bunkers et Installations connectés.\r\n\r\n<RichText.Regular12.Orange>Disponible pour tout membre de l'Escouade qui a réservé ce Bunker.</>",
    "8595AB4F4B9D205B7C8ECEBAC4DA4380": "Lien du régiment",
    "F00954E5483B0E6983A01A94535E1055": "Renforce les murs de la structure extérieure, empêchant tout dommage au-delà d'un certain seuil, sauf si les supports critiques de la structure sont touchés.",
    "BA34A1504540E1C723EB278332599B0A": "Libérer le Stock Réservé",
    "9939E62745B383B1EAE8F88AE69B05CF": "Transférer votre équipement dans le Stock Public.",
    "26AE3CA94C1D9C8B101C4DA0B27B9542": "Char d'Assaut Ancien",
    "3DFA137548BC3989A80FA1BE5C874960": "Base Relique",
    "BC080A664D772FF047FB29ABFC533C59": "Anciens Matériaux",
    "C6EB4A374C74BC8F9E47388F83F7BDBB": "Supprimer la réservation",
    "EF2885BD4BEA3FB4B63BB5A371B647F2": "Supprimez tous les membres et dissolvez définitivement ce régiment. AVERTISSEMENT : Cette opération ne peut pas être annulée.",
    "A3E7A1B94A9A46FBF3AACFA70276323F": "Retire l'arme à Trépied attachée au véhicule la plus proche.",
    "538987FB41DB7DA27AE04A86EB001B65": "Réparer",
    "A00E5DE6442055A1DBEE2CB17FF2BBBC": "Rapporte les mouvements ennemis proches aux joueurs équipés d'une radio",
    "0CA94AFC4D90B50CC3635F912B396CDB": "Camion reconverti",
    "14734E1441AD3F2D3F5736B465F0B518": "Ces cuirasses, qui proviennent d'anciennes guerres, sont très efficaces pour arrêter les tirs d'armes légères de l'ennemi. Cette protection se fait au prix d'un certain poids, et le porteur se sentira assez limité et encombré. ",
    "564E30B04DD216CDF4637782A446A0E1": "Nécessaire pour faire exploser les Charges Havoc. La Charge Havoc doit être placée avant le détonateur.",
    "AF1B7A034F1EAD11DEEF83A57F596B1F": "Système de Réservation",
    "9B77C6FB4FD38E4223DF3896281B11EE": "Réserver pour l'escouade active",
    "DF6832A44E1855CECD701B93FDFB5726": "Réserver pour l'escouade active",
    "375D7CD84DBF0AF587ADD1A480E2F311": "Réserver pour l'escouade",
    "FA295505471D354F4C279F8C77046DE7": "Réserver pour l'escouade",
    "B15400FD4480235C31383C88F57298D9": "Réserver Plusieurs",
    "A9FA41214C4940AA99B96D8C4C6841B2": "Réinitialise tous les délais d'expirations des stocks réservés accessibles.",
    "6D103E044CC5EA36B2862FAF0EBF6DBE": "Boite de ressources",
    "645260194768CFE6B510E38EA6DEC620": "Conteneur de ressources",
    "5E22DF22438E32BA5D1B28A564E722F3": "Formation aux ressources",
    "AA79F755487A6E61B35B1BA49AE433EF": "Formation aux ressources",
    "6147E0B3480979F73A3F85B922D685DD": "Station de Transfert de Ressource",
    "0C4533A44DFA9CC271010CA96A95F9D1": "Ressource utilisée pour construire Routes et Fondations.",
    "D506B5FD47C0B9A3B5D9C5B8361DE488": "Ressource utilisée pour la construction de structures avancées et la production d'objets spéciaux.",
    "63DAF590439D5D73B0C4C9B1B4F8CF43": "Ressource utilisée pour construire des structures de base et produire des objets.",
    "C19CCA2F41FDEFFC10683A890F0115FA": "Ressource utilisée pour la production d'armes explosives.",
    "A504F8984C562CEC686E90B9263BB755": "Ressource utilisée pour la production d'armes explosives lourdes.",
    "1A74322C4B604CD5CC9082A7A329AA10": "Les ressources sont utilisées pour tout fabriquer, des munitions aux fournitures médicales et chars.\r\n\r\nÉquipez votre Marteau et utilisez '{0}' sur les tas de ferraille. Les Moissonneuses peuvent aussi être utilisées pour obtenir des ressources. Les Composants et le Soufre nécessitent une Masse pour être collectés, elles sont fournies dans le coffre à côté.\r\n\r\nChaque objet nécessite différent matériaux pour être fabriqué, mais doivent d'abord être raffinés.\r\n\r\nEssayez de collecter des matériaux—que vous pourrez trouver plus loin—de les charger dans un des camions fournis puis de les amener jusqu'à la raffinerie à côté de vous.\r\n\r\nLà bas vous trouverez aussi une usine où vous pouvez utiliser certains de vos matériaux fraîchement raffinés.",
    "ADEADD7841513BA9D876B987D8873E52": "Les ressources peuvent aussi être obtenues par l'exploitation minière.\r\n\r\nLes mines nécessitent du carburant pour fonctionner et génèreront automatiquement des ressources au fil du temps. \r\n\r\nQuel type de carburant vous utilisez détermine la productivité de la mine. \r\n\r\nPour les besoins de la formation, le carburant vous est fournis dans le coffre à proximité. \r\n\r\nPour plus d'information, cliquez sur l'icône ‘?’ dans le coin du menu de la mine. ",
    "EF6DAC2B40678A71E32020A54CD07BBC": "Résultat",
    "9DD10CBE4FB59CF1842847B34A87F181": "Retourne le niveau d'eau à la normale et arrête la réparation.",
    "2234EB4E4BD90C64BCF4D4BD5CA1091D": "Réanimation...",
    "32CB66B746F5A47B25FE278297D31C70": "Fusil",
    "47613E5A46EB483553D70EBE995BB774": "Fusil",
    "56A98D894EF2A090763BD4BCA3F0B308": "Fusil",
    "7E822CA94DE34D1F702462BF914F4B2F": "Fusil",
    "90EF4E0C40EEEFEF10CD4BA4CD25499A": "Fusil",
    "9C57C8D24ABD75711D983A902905532A": "Fusil",
    "D89D655C497B051BD59AC89770F8413B": "Fusil",
    "AF001371424A286E942DCC860760278C": "Garnison de Fusiliers (Niveau 1)",
    "075868EB4E94FD51FD380F8C381DBD37": "Garnison de Fusiliers (Niveau 2)",
    "42EEA7854D28A34A1AF60E82A560C939": "Garnison de Fusiliers (Niveau 3)",
    "D96BE66A4A0B3DCBD89C599748F59F5B": "Casemate à fusil",
    "60EE65154F4BCE6F74E6D6B493A64D58": "Fusil S",
    "B585C67849600DA80772ACB071952CFB": "Atelier de Batterie de Roquettes",
    "C4080A27459B901F3D243EB3FA8099EE": "Point Zéro de Fusée",
    "861B180244AD7046A21D6DB790C5F8D3": "Fabrique de Roquettes",
    "8A45620B4F96D41204955FB73AA2C3FA": "Cible de Fusée",
    "08151D0642DC1E8836613682BB961F4F": "Planque",
    "39EA8D5F433B7A38700E7BB3C46862A5": "Planque",
    "3CEAF83648F676DB8CB431B02451461E": "Planque",
    "404334B8403C9E3A2287C1B00F64170C": "Contrôle du Ballast de Sécurité",
    "988F4FAA476CA69FC27EFD9FB02DC6A7": "Ferraille",
    "94EA0585470D4FC455D802A36F5B4DA4": "Champ de Ferraille",
    "9A3374E243514176D6E8C89DE671639B": "Mine de Ferraille",
    "FFF91C3540533ECCF2D46EA90D1100F6": "Ferraille qui peut être recyclée en d'autres ressources à une Raffinerie",
    "023A1A44419A8DCFE45230A0A9BB15A8": "Fusil Auto Sampo 77",
    "E6DCD38B491324D8D006BA970DC00C70": "Sac de sable",
    "442E5D434410A70B0829D39B1B23BA32": "Couverture de sac de sable",
    "3277B2694BA3B6C9005989849F22FAC6": "Mur de sacs de sable",
    "1F8EF85844956D33889CD2A8CCA6F273": "Sacs de sable",
    "48B66EE041A2F7B1E8D9E4911C544F41": "Sacs de sable",
    "37B739C040326A295FBAD29A69980A24": "Bac à sable",
    "66B0E0E4463094D80CF8E18B6331D5B4": "Tenue de Sapeur",
    "085EFC314A5ED7E6AE5689B0618A8C76": "Dispersion",
    "0B3D2EA049369C0D3FD8F396D7B613F1": "Char de Reconnaissance",
    "F07C33B944902581150548A9AAF7F565": "Char de reconnaissance",
    "FC650B6C4EF1535986D761B04AAF89FD": "Mine Marine",
    "68D59DCE485CB775AEE12EB44299E838": "Port",
    "FF73F38B42484E3E1D06C496753F7A0E": "Opérateur Sonar",
    "DFE2613E4B8ABE897743AEAC4ED2EA6F": "Servant de première ligne à la Republic Coastal Legion, les Conquerors sont depuis longtemps à la hauteur de leur nom. Ces bâtiments sont équipés de tout un arsenal pour faire face aux menaces, aussi bien en surface qu'en profondeur, notamment une station sonar spécialisée et des lanceurs de grenades sous-marines. Une jeune intriguante, Diana Geminus, a été la première à commander un Conqueror après avoir rapidement gravi les échelons grâce à ses nouvelles idées de défense contre les tentatives déplorables des nordistes.",
    "06DBF90B4DD3240C1C40098DB1CFE015": "Définir votre point de réapparition",
    "4F3E821E4FDA318CF08B058FD386F55C": "Poutres d'acier façonnées pour les processus les plus avancés aux Installations.",
    "B73B1D4D43DA9CB8DB0136BC11344A66": "Etagères pour ranger rations, fournitures et outils quotidiens.",
    "AC70734C44CA3C54CA0560A8605501EA": "Expédiable",
    "02A51A4F4CB0A44DEB11619062590179": "Conteneur de transport",
    "D058A4D446C86625165A51A257F46A11": "Chantier naval",
    "9D09A3A146AC3E155096D1A43D1F9208": "Champ de tir",
    "FCAFF62D41E098930CC6AC91EA1A0A5D": "Champ de Tir",
    "FDC400AE4D0E84CEEB23E28CC3021174": "Champ de Tir",
    "2971556A4BEFC6D9106968A2C42A10EE": "Fusil à pompe",
    "2DF761024848E3380A5A1186CE4EE625": "Pelle",
    "82BF8D5B4E37F6DCABA5029156BC176F": "Obus de Mortier à Fragmentation",
    "A13110FE4D0F08DE3EE819A4ED437CE1": "Char de siège",
    "A197F0D64ADFF54553133EA38D4B2F89": "Char de siège",
    "5A701006423EBFF956AC69A033696A12": "Panneau",
    "FE03995B40473603D6AAC885C356B6D3": "Pierre d'âme sinistre",
    "75BDCECF46934EAD9C0FF688FBA4A48E": "Masse",
    "01DACD804657A304B84552B0D7952670": "Ralentit l'infanterie ennemie tentant d'envahir cette tranchée.",
    "E896C1614A3C0A02B95E33A55EE0E5DB": "Ralentit l'infanterie ennemie essayant d'envahir cette tranchée.",
    "4FB16CB541D9FCA9974A1196EA097D00": "Petite Station d'Assemblage",
    "D72085A44C5EEA57347568B340632DAD": "Petit Wagon Conteneur",
    "53787B52481BBFEF3FDCD2BD7563602F": "Petite Wagon Plat",
    "4B3C13F94BE2C8B3746692A339A67DC2": "Petite Garnison",
    "B0E0E1AA475B9C9CB80F739E843DF3AB": "Voie Ferroviaire Étroite",
    "AB54351A4B0E35D06E641984B743B607": "Voie Étroite Ferroviaire (double arc)",
    "0FF966ED4A82F7C75C3F3EAE4F88F3E7": "Petite Voie Ferroviaire (Fondation)",
    "781A583A4DC82C26C74B0ABB7841568C": "Petit Wagon Conteneur de Liquide",
    "96AB0C5C45F9E3D456FDAEABD0AF8C1C": "Petite Locomotive",
    "A09F66644EAC732CBE1BA9B67F0FC537": "Fonderie",
    "BEC08E1949B113CF432AFC95233EE8A4": "Fumigène",
    "F8B8865A4EFE412330226CB108B39DA0": "Grenade Fumigène",
    "EFD138C94F4E6ACA0BAC20BABB58DDAA": "Tranchées attachantes",
    "3CA9E44E45250E66DCB89899E144276A": "Fusil de Précision",
    "8F512E2141E3F183CF5C5A9BFE1AE20D": "Fusil de précision",
    "08A2A0654E9646ADF476A3987B409B4A": "Tempête de neige",
    "355D8D104EF58C36507C4DB1BC7EE9C0": "Fournitures de Soldat",
    "793748BA4CC8F2C2CB1751837CB12EF0": "Fournitures de soldat",
    "CC8548A448DFF546A96E309678841337": "Sac à dos de soldats",
    "2B8B7F1148548A936E6B2F94A562E096": "Certains véhicules ont des armements qui peuvent être utilisés avec votre équipe pour causer des ravages chez vos adversaires. \r\n\r\nEn tant que tireur, vous devez avoir des munitions dans votre inventaire pour recharger avec '{0}'. Essayez d'utiliser la Voiture blindée avec un partenaire pour vous abituer à la position de tireur. \r\n\r\nChaque véhicule dans Foxhole a différentes fonctions. Si vous n'êtes pas sûr de la manière dont une chose fonctionne, n'hésitez pas à demander.  ",
    "43C9867E4E3B5B3D6E3588AC743681DD": "Opération Spéciale",
    "70003FDD4D67F7F978E61A9C5D8871AE": "Ressources Spéciales",
    "7F9002FE42143E7E4F63B0828656DC2E": "Manteau de Spécialiste",
    "8CFFFD224396FD43CB02DB8F031218C5": "Plaques de métal spécialisées forgées avec du Charbon qui sont nécessaires pour assembler des véhicules et équipements avancés.",
    "D56912E64A1A127922EAFDB69FD686BE": "Barres métalliques spécialisées enrichies avec de l'Essence qui sont nécessaires pour assembler des véhicules et équipements avancés.",
    "17C2335C49DB89EA0BD85A810EFEA909": "Stabilité",
    "2858B95D477BE3616909268BA1A0170D": "Voiture d'état-major",
    "C34A2FB94857EC9D681AF892CC709B74": "Voiture d'état-major",
    "4C1C4A0B4F1B09604DBDF8A0A404000A": "Escaliers",
    "A4220DDE4849335CD5B4C7A5F1EA43DB": "Escaliers",
    "051641854BE178DDD204AF91A4B95291": "Des escaliers se reliant à des passerelles surélevées, qui créent des passages par-dessus des Installations complexes.",
    "9BBCA83C49AFD1EB1B2556AAF6B16DF6": "Postures",
    "54D2DAEE4700528786FFA19DF1B7A4C1": "Munitions standard pour les Mitrailleuses de Campagne et les Canonnières.",
    "4A3D5405439242282D540AA77E2D234A": "Munitions standard pour les fusils à pompe.",
    "4AFE485746BDCB89EF2A16AE5CECF883": "Munitions standard pour les Fusils d'Assaut et les Voitures Blindées.",
    "BD8270B74380C56E45276E9E7E8F9426": "Munitions standard pour fusils antichars.",
    "D31A1FF745293A203BE77DA22EEBB595": "Munitions standard pour les mitrailleuses.",
    "2C5595CA46B3170887D872B2F2F54571": "Munitions standard pour les pistolets.",
    "A9DA31444CE32A93710583973166EF10": "Munitions standard pour les revolvers.",
    "3ABC7EBC4B512555E3DBA8AD24347CCF": "Munitions standard pour les fusils.",
    "A1C5E9754C9F75533D68528B2E243B88": "Munitions standard pour les fusils de précision.",
    "7158D09B4ED91F7E9216D89DAB7C0269": "Munitions standard pour les pistolet-mitrailleurs.",
    "D1548AD64E2FFE72656849ADCB43AFEB": "Roquette de calibre standard avec une charge explosive lourde. Chance d'enflammer les objets près de l'impact.",
    "1DE572914DDA8E281BACD9915438413E": "Roquette de calibre standard avec explosion incendiaire. Enflammera les objets près de l'impact.",
    "AD9FC2BE4173A0DB094CFCBE92D33101": "Obus explosif standard utilisé avec certains petits véhicules et armes d'infanterie.",
    "0CB0AF234F9F31685BA8ADAC7E4D0B24": "Pistolet standard Warden. Conçu par un armurier nevish, l'Ahti Model 2 est une arme de poing fiable que tout soldat devrait être fier de porter.",
    "9A6DA0AE460C590A50180B94CCA2E10D": "L'uniforme le plus courant de l'infanterie Coloniale, conçu pour la guerre générale de première ligne avec des armes telles que les fusils et les mitrailleuses.",
    "B2358CD049AFFE980ED73C82A6BCE85F": "Munition standard pour chars de bataille.",
    "9B3A3BC74C32D661B1C839BD38B1B105": "Munition standard pour petit canons.",
    "F0DC8DD047EDA70763142A87D753AF81": "Charge utile standard utilisée avec les Canons Tempête.",
    "CBF9459943B64C6C8E11D4AA292255D0": "Obus standard pour armes antichars.",
    "F1CB945245AA1CEFC60420A168B3E5CE": "Fusil standard Warden. Cette arme à verrou conçue pour être aussi robuste que possible fait ses preuves depuis plus d'un siècle sur les champs de bataille.",
    "533D7D4245ED3B754C6389B8AD37C383": "Grue Fixe",
    "0B79039143E31337A3FE37B7C9CCB277": "Moissonneuse Fixe (Charbon)",
    "3193D7AD409492DA9D7E549048AC026A": "Moissonneuse Fixe (Composants)",
    "0866E2E4410561ACD0173EADA388F07C": "Moissonneuse Fixe (Ferraille)",
    "49F6320A42E76498200CDA99A782CABD": "Moissonneuse Fixe (Soufre)",
    "899CCE394D1CD3C5FA6F6CABEBD9B621": "Matériaux de Construction en Acier",
    "8B527792437A4243830FC29706A49A8D": "Arrêter le ravitaillement à partir d'une source proche.",
    "D2BA20A445410CFFC9C78B9F85ED8A31": "Coffre",
    "6DB4ABFC45B8FCD7F96B8BBEDA844760": "Dépôt",
    "9900BC104072715445127597CB3B16B7": "Centre de stockage",
    "0B894BCC45D5553B2373019737947734": "Salle de Stockage (Niveau 2)",
    "903CBC5C4DB8775BEA393C85D1047486": "Salle de Stockage (Niveau 3)",
    "D51F160B4175A8C18D3098A35D5F41EC": "Navire de Stockage",
    "AFA2AC074EC14FF9C2B2958F9A3C0AEA": "Canon Tempête",
    "7AC7D1C84ECA532598277C84B7B969EE": "Fusil d'Assaut S",
    "8366FD1F48B499D05AEA7A980A5104BB": "Char Tempête",
    "57052C6B49A9A576E8768DA30903B338": "Carte stratégique",
    "D88C1B644C2C0C27B896F980A1374438": "Caisse de Structures",
    "319613AA4E24F741FCCF55B58D253EAA": "Stock du bâtiment",
    "1D099E8045D6579643ECA5B095EBA317": "Les structures et les joueurs peuvent prendre feu.\r\n\r\nEmpêchez les feux de se propager à d'autres structures en les arrosant avec de l'eau. Équipez un Seau d'Eau et remplissez le en vous mettant devant un puits et en appuyant sur '{0}'.\r\n\r\nVisez la structure en feu avec le seau d'eau en appuyant sur '{1}', et lancez le en cliquant '{2}'.",
    "4711DC3C4C3D4580A5178F821520E25C": "Pistolet-mitrailleur",
    "5BC0657242005B5F40FA339C5A8E2A90": "Pistolet-mitrailleur",
    "6BFED03041F24203C2028796FEE87FC1": "Pistolet-mitrailleur",
    "6DDC1F844EEDA819493F1FBE83430404": "Pistolet-mitrailleur",
    "0B4B70F64D4072C42D87F190721BFC7B": "Sous-marin",
    "CE7236AB46FB868883B90582D70DF74F": "Sous-marin",
    "BD9BF6F94FA2065AC528F6B9C859F0CA": "Déposer un Grand Objet",
    "2C5AFB1D4F92381ED13DD6ABC59E3BF4": "Soumettre l'équipement de la zone de chargement",
    "B07DBC4C4BE06930EA53C480A2EBC43E": "Déposer un patient",
    "EA1D54C04DA274D8BD5C118DF3850282": "Déposer le kit de départ",
    "0201D35240A1D38F7B6B889B754BB27F": "Soumettre les objets au stock",
    "D64EF3BC44CE2FABAA4ECBB8EAF5B822": "Stocker le véhicule",
    "854D88434F54C8F105B699913FE7744A": "Soumettez un soldat grièvement blessé de l'inventaire de cette structure à cet hôpital en tant que patient. Les patients ne peuvent être soignés que s'il y a un lit disponible.",
    "C4EB8C984A19BD1DD490CCAF9220B5C6": "Soumet l'équipement de la zone de chargement de la structure à ce stock. Cette fonction n'est disponible que lorsque l'on accède à cette structure depuis une grue qui a déployé des équipements dans la zone de chargement.",
    "0146D004490AC3150D0A4A9F23D6F35F": "Soumettre les articles de l'inventaire de la structure dans ce stock.",
    "A97B377D4D65B419A582BEBD7D8EE8AA": "Soumet l'équipement qui apparait dans l'inventaire du joueur après sa réapparition.",
    "68876C9049BF21CDAA575DA9766993FC": "Stocke le véhicule que vous conduisez actuellement. Le véhicule ne doit pas avoir de passagers à l'exception du conducteur et avoir un inventaire vide.",
    "751850F4463C0223822544A4F3918231": "Déposer votre objet encombrant équipé.",
    "F546B4DD4883E4AF4C7FF59D6533F5AD": "Soufre",
    "7F451D4442D7EE1241C7E49D1CD718EA": "Champ de Soufre",
    "820AE531463912B16EAE5F976C2FC0DA": "Mine de Soufre",
    "80B758FE4E346EE2AC991085E2A8AE76": "Soufre pouvant être raffiné en Poudre Explosive Lourde dans une Raffinerie",
    "FDF2D3094624CFB09EED95B3A0AEB9CA": "Barres métalliques enrichies en Soufre qui sont nécessaires pour assembler des véhicules et équipements avancés.",
    "86C830CF475A1F7961779CBE4F8D8022": "Réacteur Sulfurique",
    "8E2344B74E1F94020521D28B189DF9A8": "Super Char",
    "E67DC6294A30B98591EF8A9E28C95864": "Super Char",
    "26BE69E14476BAC566418FAEF5981A0E": "Fournitures pour l'entretien des structures. Stocker dans les Bases ou Tunnel de Maintenance pour éviter la dégradation des structures environnantes.",
    "6C5951884E249902F48F84BC579BFF8D": "Fournitures pour l'entretien des structures. Stocker dans les Bases afin d'empêcher la dégradation des Bunkers et Tranchées environnants lorsque les Fournitures de Garnison ne sont pas disponibles.",
    "821295C1473A530D7B78578A505EBE08": "Tirs de Suppression",
    "9B0706D84171E947C9329182248ED082": "Survivre plus d'un jour lorsque votre faction possède moins de 25% de tous les territoires.",
    "1B17069946CA8573587B88BA39E29B1D": "Survivre plus de 2 jours lorsque votre faction possède moins de 25% de tous les territoires",
    "564F2BAB42C15509140750B7041BF5F3": "Survivre pendant plus de 4 jours lorsque votre faction possède moins de 40% de tous les territoires.",
    "308E98C54020C1B935B9A6951714C6D9": "Nage",
    "4F6C071844A8536D948E1585056A31CB": "Chenillette T12 \"Actaeon\"",
    "8F4F84214641CBC48D256AAD8E439F72": "Batterie de Roquette T13 \"Deioneus\"",
    "D393C239427216CFEE9B618853C651E4": "Chenillette T14 \"Vesta\"",
    "818B555748C17156BC71229A32F2E408": "Chenillette T20 \"Ixion\"",
    "B06CAE044DC4163948A50E87ECD326D8": "Usine de Char",
    "1122285143C897768611A1B57A27BE56": "Piège à char",
    "0EFFE2024D52CF05ECFBA3822DD4AD72": "Chenillette",
    "3FD16D2F41C76A05B19205A6976B4AFB": "Chenillette",
    "8BDBF35D46B0F9B1DF4F6FB0CD17586F": "Chenillette",
    "A56BC8D54A394F83C3F6D0B35CC01425": "Chenillette",
    "F1929C02492EE23B0E74E298A81B3B65": "Combinaison de Tankiste",
    "03B7C25C48FF9FC5BA38F5801CB1CC7A": "Canon Tempest RA-2",
    "59137A27421F416A8EB0B6B27FC1750B": "Parcours d'essai",
    "9A7E36B74B8178096CDFB38CC56CC567": "L'\"Acheron\" est un véhicule amphibie blindé conçu pour transporter des troupes sur de grandes étendues d'eau afin de faciliter les débarquements coordonnés sur les plages et les assauts de flanc. ",
    "B85728FD47AB02CB9CE5BD9F71F1092F": "Le \"Battering Ram\" est une pièce d'artillerie antichar mobile tirant des obus anti-blindage de 68 mm.",
    "F7DC4D4349BBEA58C3D503A2C46B621C": "Le \"Talos\" est une modification Vélienne de la série 85, équipé d'un canon surdimensionné de 75 mm. Sachant qu'un canon si lourd serait probablement inadapté, les ingénieurs l'ont élaboré en répartissant le poids de telle sorte que le châssis de la série 85 puisse le supporter.",
    "60AAF3CF47DB617613EA11B55CBEE9E3": "La Canonnière 74b-1 Ronan est spécialisée pour rôder à grande vitesse entre les grands navires et percer leurs coques avec aise. Elle est armée de plusieurs trépieds pour soutenir le canon mortier central à explosifs lourds.",
    "EDC1300845D4F76D0D84589AA2DE48DE": "L'Ogive A0E-9 est un explosif dévastateur, capable de détruire des quartiers urbains ou même de petites villes entières. Il rase le paysage, rendant la reconstruction à court terme difficile pour l'ennemi. ",
    "80F355904A74E81A1017958EFD7FEDEA": "Le AC-b ou submersible de classe \"Trident\" apporte une polyvalence indispensable à la Republic Coastal Legion. Équipé d'une soute de munitions à chargement rapide, le \"Trident\" est capable de se réarmer et retourner rapidement en chasse. Le Combat Magister Curia commanda aux ingénieurs experts de Dimiourg le développement d'un submersible pour aider à contrer l'essor rapide de la technologie navale déployée par les Wardens et l'Alliance Nevish. La plupart du sénat critiqua Curia pour cette décision, puisqu'ils pensaient qu'il était plus prudent d'investir des resources dans les innovations pour le combat aérien. Après avoir constaté le retour et le redéploiement de plusieurs opérations AC-b à succès, il ne fut pas difficile de convaincre le Sénat.",
    "B0971D2F4F52F5CEC1827B91476D630C": "La variante Ascension Mk. V Flood est équipée d'un canon plus long et conçue pour les engagements à longue portée. ",
    "0B79EDEA473AE6A3AB26E89639BA76D3": "La grue Class 2 Mobile Auto-Crane de la Bassett Motor Society est utilisée pour soulever et repositionner des véhicules et des équipements très lourds.",
    "F8699DEE463164BEABD1AC8A6A1BB549": "Le cargo Ironship, navire de Bassett Motor Society, est utilisé pour le transport de fret et de véhicules lourds.",
    "7CB2F5544301F83080E54BB7C53660EC": "Le premier vaisseau-mère de la Bassett Motor Society, le BMS - Longhook, est un navire robuste et fiable qui constitue un excellent centre d'opérations pour la construction et l'entretien de bateaux plus petits destinés à transporter du personnel et du matériel. ",
    "0699A64A4BC0951810E4888500D73451": "Le Blakerow est une carabine dotée d'une cadence de tir élevée par rapport à son prédécesseur à verrou. Cette cadence de tir accrue se fait au détriment de la puissance d'arrêt ; cependant, sa polyvalence et sa légèreté compensent largement ses défauts apparents.",
    "A2188A324C95D58E8E160FAE3162D0E4": "Le navire de stockage Bluefin est un dépôt naval mobile, massif et polyvalent, capable de stocker des caisses de ressources, des véhicules et des munitions pour les voyages longue distance et le transport d'équipements de plage à plage. Bassett Motor Society est fier de fournir un navire polyvalent et de pointe à divers pays de Raka, Katoma et de l'Union Alliante. ",
    "442486104B75F9025ECC9C8A5C4BD5D0": "La Bomastone est une grenade à fragmentation de type \"bâton\" avec une poignée conçue pour faciliter le lancer sur des distances modérées.",
    "7A06F99C4E33063B047084890EF18C19": "Le Booker est un fusil d'assaut à fort impact tirant en rafales de 3 coups pour ceux qui aiment tirer en premier.",
    "1B2BFAB349D78169CCC6B6A25BA62399": "Les Caoivien ont bâti un empire à partir du nord froid et dangereux, mais les Grandes Guerres ont ébranlé notre nation autrefois fière. Ces sauvages du sud ont laissé notre patrie brisée et rompue.\r\n\r\nCe n'est pas juste notre patrie qu'ils menacent mais notre histoire, notre héritage.\r\n\r\nReprenez-les.",
    "6CFB3B86427F52AC29C9D68D64DBC191": "Le Caravaner est un véhicule de transport utilisé pour amener les troupes au front.",
    "D38B33304A774C0437BB208CBD8CF035": "Le char d'assaut Chieftan est équipé d'armements asymétriques, dont un canon de mortier de 250 mm et une tourelle à double canon de 12,7 mm.",
    "1A9B737E4D83147FCF65518288F3C40B": "Le Clancy Cinder est un fusil long classique de grande puissance, conçu pour être utilisé lors d'affrontements à moyenne ou longue portée. Il fut déployé pour la première fois avec les Hands lors d'une opération à haut risque en Acrithia.",
    "F6524B1C4152DE0DFC39E1B586166694": "Le canon Collins est une pièce d'artillerie antichar mobile tirant des obus anti-blindage de 68 mm.",
    "01BEC28C47A801E21D57A085F66B4EFF": "Les Coloniaux",
    "1346466449D3A6EB2C65CCAAE033B776": "Le Cometa T2-9 possède une puissance d'arrêt remarquable pour une arme de poing. Ce pilier Estrellan a traversé plusieurs générations grâce à sa qualité de fabrication et à sa conception.",
    "438F3CD74363F0AAEF56CB98AB2DCEAC": "Le Chantier de construction est utilisé pour construire des Conteneurs. \r\n\r\nLes Conteneurs peuvent être remplis d'objets et déplacés sur de longues distances avec un Camion plateau. \r\n\r\nPour déplacer les conteneurs ils doivent d'abord être emballés, et puis transportés une courte distance avec une grue.",
    "3E60ABC94798611BD07C9BAAEB91230B": "Le Cutler Launcher est capable de tirer une roquette non guidée sur de courtes distances avec une efficacité surprenante. Sa conception permet de le déployer et de le ranger facilement.",
    "15972C7545B83E4A8EB741B5B2FAA94A": "Le DAE 3b-2 tire des roquettes sur de longues distances depuis une position de sécurité. Cette arme singulière a été baptisée ainsi en raison des cris entendus sur le champ de bataille lors de son premier déploiement, certains qualifiant le tir de barrage de \"toile de la mort\".",
    "4E1022FE4EF72440780364BDF95AF505": "Le pistolet-mitrailleur Fiddler est une arme de combat urbain très répandue. Sa cadence de tir élevée et sa taille compacte en font une arme idéale pour les combats rapprochés.",
    "59DFACCF49AF5464C57237B93B8CC783": "La Foreman est une grue tout usage, sans superflu et simple à assembler. Parfaite pour transporter des charges lourdes dans des installations où le chargement et déchargement sont courants.",
    "90B06FA44793502825A9689C013556F0": "Le Fuelrunner est un engin de transport Dunne conçu pour transporter et distribuer de grandes quantités de carburant.",
    "61DF2EDD494F2CC91D69C89AEDA640C7": "La Gast est une mitrailleuse lourde Kraunienne mortelle mais encombrante. Elle est particulièrement adaptée à la tenue et à la défense des fortifications établies ou des structures en garnison contre l'infanterie.",
    "A9B9DA9741EE501731CA1D9D64935983": "Le char de classe HC “Ballista” est un char lourd conçu pour anéantir les défenses de l'adversaire avec son canon mortier Hades de 250 mm.",
    "433C5B094AC1C494D76EDAB28F5F76BC": "Le Hangman 757",
    "8779C9AA46D16F3160701EB9B5315BB5": "L'Interceptor PA-12 est un navire conçu pour transporter les troupes alliées et les véhicules légers à travers de grandes étendues d'eau. ",
    "2423E72544842BCA2E0DBFB11E9291FD": "Le char léger Ironhide est similaire au Mk. III mais il est renforcé avec des plaques d'acier lourd au détriment de la vitesse et de la maniabilité.",
    "FFA1F3254EF42A1EB01FFE8BD174C464": "Le Juggernaut est une variante renforcée du Flood, équipée d'un lance-flammes lourd qui utilise un agent adhésif sophistiqué. Ses patins de chenille en forme de pelle nuisent à sa vitesse de pointe, mais cette machine est tout à fait capable de faire face à des conditions météorologiques extrêmes.",
    "3C09623B4FA6DDC05E463ABFDE8D2BAC": "Le Mineseeker est la mule mécanisée de Bassett Motor Society. Cette petite locomotive 0-4-0 peut transporter des tonnes sur de courtes distances et a peu de frais. Elle est idéale pour les exploitations minières ou les chaînes d'approvisionnement à courte distance. ",
    "E749786542A80E615EB016AD60BEABE8": "Le Véhicule de Débarquement de Troupes Mulloy est un véhicule amphibie blindé conçu pour transporter des troupes sur de grandes étendues d'eau afin de faciliter les débarquements coordonnés sur les plages et les assauts de flanc.",
    "C19174CB40D6F3613874B7B1346F8545": "Le Neville est d'une polyvalence inégalée en tant qu'arme à feu antichar portative dotée d'un chargeur.",
    "D7BA015D4482D3DD4E09E2AB3B642485": "L'Ospreay",
    "D7D148314AAE5AE1F2DC71A2EB029626": "Le Rampart est un puissant canon de campagne antichar capable d'infliger des dégâts dévastateurs à tous les véhicules blindés, sauf pour les plus lourds de tous, tout en offrant à son équipage une protection balistique complète.",
    "850F3CFF42260CE5F0A038986A127D9C": "La raffinerie convertira la ferraille et d'autres ressources brutes en matériaux qui peuvent être utilisé pour produire des objets, véhicules et structures. \r\n\r\nPour une explication plus détaillée cliquez l'icône \"?\" dans le coin supérieur droit du menu de la raffinerie.",
    "F2596A28473784B9B4EE0D87323D3527": "L'ambulance Responder est capable de transporter des soldats gravement blessés ainsi que du matériel médical.",
    "A4D3755B41A9F39ACA9074BAC74B3B5B": "Le Scrap Hauler, conçu par Bassett Motor Society, est une machine industrielle destinée à réduire la ferraille et d'autres matériaux en ressources brutes utilisables. Les Scrap Haulers sont souvent utilisés pour extraire les ressources du champ de bataille à la fin des affrontements.",
    "B82355164AD3C111D9BB5281DDA2D279": "Le Shorerunner est un navire qui transporte les troupes alliées et les véhicules légers pour attaquer des rivages lointains.",
    "3CAB58034B77E4113A601DA182C623FC": "Le char d'assaut Silverhand est équipé d'un armement destructeur à double canon, et d'un lourd blindage frontal et arrière. Son canon frontal de 68 mm est associé à une tourelle plus légère de 40 mm. ",
    "85D2FD8A406336C041573A8F3842271D": "Le Snare Trap est un canon anti-aérien reconverti utilisé pour fortifier des positions fixes avec des mitrailleuses jumelées anti-infanterie.",
    "E72E497544109ADFC3642B85BDBFB596": "Le Centre de stockage est, comme son nom l'implique, une structure pour stocker des objets et véhicules pour une utilisation ultérieure. \r\n\r\nVous pouvez soumettre des caisses d'objets, des véhicules ou des conteneurs. \r\n\r\nPour une explication plus détaillée cliquez l'icône '?' dans le coin supérieur droit du menu du Centre de stockage.",
    "61C42C5947C2AFB915981DB8BFBD3815": "Le Tinderbox est un simple wagon utilisé pour transporter des liquides entre les installations.",
    "2C2BCDB4483B75B4E508C78B75B207A9": "Le lanceur de RPG Venom tire des charges antichars. Sa conception simple le rend facile à déployer, même dans les opérations à fort enjeu.",
    "75BFB22744B204E1D95020A42DE5259C": "L'armée Warden compte sur les éclaireurs pour fournir et recevoir des renseignements vitaux. Leur équipement est robuste et bien adapté aux opérations prolongées sur des terrains accidentés et par mauvais temps.",
    "32CC66094EC863747269CBB41F09B000": "Wardens",
    "37EB16184665B74CFE1F8FADC68453A1": "Le corps d'une A0E-9 stocke le carburant et l'instrumentation requis pour lancer l'ogive sur de longues distances.",
    "7A2EDF464686598F27A02389597E2DC6": "Ce véhicule est doté d`une mitrailleuse pour pouvoir exécuter rapidement des attaques.",
    "6D1768DD43D82B3F03D0EEA78D76D72C": "Les gouvernes, les réservoirs de carburant et les moteurs nécessaires au lancement sont tous logés dans le système de propulsion A0E-9.",
    "3FE2286D465132CE9080E1A8636ED174": "Le parcours de conduite est conçu pour que vous puissiez vous entraîner avec les contrôles de conduite. Pour pouvoir vous exercer, une sélection de véhicules vous a été fournie. \r\n\r\nUtilisez '{0}', '{1}', '{2}', '{3}' pour contrôler votre véhicule de la même manière que pour vous déplacer à pied. \r\n\r\nAppuyez sur '{4}' pour le frein à main.\r\n\r\nGérer votre vitesse attentivement autour du parcours et relâchez l'accélérateur dans les virages. \r\n\r\nIl y a des cibles éparpillées le long du parcours pour vous entraîner à viser lorsque vous êtes dans le sidecar d'une moto ou dans une Voiture blindée. Viser dans un véhicule se fait de la même manière. \r\n\r\nDans une position tireur/sidecar maintenez ‘{5}’ pour viser et ‘{6}’ pour tirer. ",
    "815659DC48C8D296E4AB8B809187CB4E": "Première chenillette de classe T à utiliser cette armature plus solide et des chenilles polyvalentes, la Vesta est aussi la première expérience des Véliens dans les armes lance-flammes. La \"Vesta\" possède une tourelle lance-flammes légère et un vaste espace de stockage pour l'approvisionnement en carburant additionnel requis.",
    "24EB8470474C85C204FA16A6F17CEDF8": "La pierre angulaire de tout bunker, ce foyer simple fonctionne sert à la fois de four et de chaleur dans les temps les plus froids, réchauffant une zone raisonnable autour de lui lorsque construit sur de solides fondations.",
    "9688E2684A7D074F7706E191E9B1BBDE": "La pierre angulaire de tout bunker, ce foyer simple fonctionne sert à la fois de four et de chaleur dans les temps les plus froids, réchauffant une zone raisonnable autour de lui lorsque construit sur de solides fondations.",
    "B1E9D8EA40AB241797F94EA444DC0819": "La pierre angulaire de tout bunker, ce foyer simple fonctionne sert à la fois de four et de chaleur dans les temps les plus froids, réchauffant une zone raisonnable autour de lui lorsque construit sur de solides fondations.",
    "7721733F48656E5E67F9319F10C8F1DB": "Le code d'accès à ce stock réservé sera copié dans votre presse-papiers afin de pouvoir le coller autre part.",
    "A6809E4A4CDC018329BB9D801439BE26": "Le code d'accès à ce Stock Réservé sera visible pendant quelques secondes.",
    "37E8AA9A49160F5C0BB65F8182B46B2F": "Le précurseur du fusil d'assaut. Le Sampo Auto-Rifle, est un chef-d'œuvre de son époque. Avec deux modes de tir, coup par coup et automatique, ce fusil polyvalent n'a peut-être pas la cadence de tir des armes automatiques, mais il compense largement cette lacune par son efficacité.",
    "93ABBB9F4AC1D651143243A65F44A2E8": "La fierté de l'arsenal antichar Warden, le Bonesaw MK.3 n'a qu'un but : pénétrer le blindage lourd des tanks Coloniaux.",
    "17B0C0F54DEBC4AB8643AF8BAD16DD9B": "Le principal fusil d'infanterie de la Colonial Legion. Son prédécesseur, le Volta Repeater, était une arme à feu robuste et fiable, mais il présentait de nombreuses limitations, notamment en ce qui concerne la cadence de tir. L'Argenti résout ce problème, tout en étant plus compact et plus léger.",
    "115CF636401D8116087368B4F058FD86": "Fleuron de la gamme des engins de chantier militaires de BMS, l'Overseer Sky-Hauler déplace plusieurs tonnes en un clin d'œil et bénéficie d'une grande mobilité même lorsque il est déployé le long des lignes de chemin de fer à fort trafic.",
    "9295B2ED4880B5F5FE72A3AAC076A630": "Fleuron de la gamme des engins de chantier militaires de BMS, l'Overseer Sky-Hauler déplace plusieurs tonnes en un clin d'œil et bénéficie d'une grande mobilité même lorsque il est déployé le long des lignes de chemin de fer à fort trafic.",
    "FFE8175A4A9B9AD53B3265AF06D3E1CC": "La troisième déclinaison du Niska Motor Carriage est équipée de deux mitrailleuses au détriment de la protection des passagers et de la puissance de feu globale. Cette modification était à l'origine un ajustement ad hoc effectué par les mécaniciens sur le terrain, mais elle a rapidement été demandée par les régiments de blindés sur la ligne de front Caoiva-Veli.",
    "4AF095F948FB27C90642DA81420D1E42": "Arme de prédilection des pirates et des contrebandiers, sa légende est bien méritée. Avec un pouvoir d'arrêt incroyablement élevé et un mécanisme de revolver unique, le Hangman joue souvent le rôle de juge, jury et bourreau.",
    "9AFF016F40CE0959551A75AE28C5C9AA": "Le \"Chariot\" est un véhicule de transport utilisé pour acheminer le personnel vers la ligne de front.",
    "D78E1F4C4C2D5620465BA694A619F496": "Le Char de bataille \"Halberd\" est renforcé par des sacs de sable et des patins de chenille, augmentant sa résistance globale aux dégâts. ",
    "BE1BFA70437F1D8BF9FAAA9C3DCEE46D": "Le char léger \"Kranesca\" est équipé d'un moteur surpuissant et d'un châssis renforcé, capable d'augmenter sa vitesse de pointe au détriment de l'accélération générale et de la maniabilité.",
    "BF2C21334B0DD34E51202CAADB695F6E": "Le char léger de classe H \"Pelekys\" est fortement modifié avec un châssis ouvert et équipé d'un canon antichar dévastateur à longue portée.",
    "99CB4B3F4DACA8B158FCF49B87B63479": "L'ambulance \"Salus\" est capable de transporter des soldats gravement blessés ainsi que du matériel médical.",
    "A13BAC034B2297951C46C8A5E6FC5AD0": "Le char de classe HC \"Scorpion\" est un véhicule de soutien de l'infanterie modérément blindé, équipé de deux mitrailleuses lourdes de forte puissance et de radios à courte portée pour un meilleur soutien en matière de renseignement. En outre, des sièges extérieurs sont disponibles pour l'infanterie. ",
    "AF3964A2441E144027F8BD83C1F986D1": "Le char d'assaut \"Spatha\" est doté d'une tourelle unique et destructrice de 40 mm qui tire des obus à haute vélocité. Cette tourelle spécialisée n'est pas aussi bien adaptée à la production en série que son homologue plus raffiné, le \"Falchion\".",
    "38267B8C45DB3CCD445ED19929A2F122": "Le camion-citerne \"Stolon\" est un modèle plus lourd de la série R, conçu pour transporter et distribuer de grandes quantités de carburant.",
    "E1D7657546240C5031F6E0BAC3D9B99F": "Le Grand Canon de Campagne \"Stygian Bolt\" est équipé d'un monstrueux canon de 94,5 mm accompagné d'un épais blindage incliné anti-explosion. Inspiré par les rangées d'étroits canyons dans leur terre natal de la province de Lacrista, les ingénieurs Meséens ont conçu cette arme de campagne pour protéger son équipage autant que possible des tirs secondaires tout en conservant un élan vers l'avant.",
    "33A737734A491EB9964D31AF80D98C44": "Il y a trois types d'équipement médical.\r\n\r\nÉquippez les bandages dans votre inventaire et appuyez sur '{2}' pour le sélectionner. Appliquez les Bandages sur vous-même pour arrêter les saignements. Le bandage est consommé. \r\n\r\nLes Trousses de premiers soins soignent les blessures et nécessitent des bandages. \r\n\r\nLes Kits de réanimation soigne les blessures critiques et nécessitent du Plasma Sanguin.\r\n\r\nÉquipez et utilisez les comme une arme.\r\n\r\nLes Kits de réanimation et les Trousses de premiers ne peuvent être utilisés que sur autrui.\r\n\r\nPour aider un camarade Blessé lorsque vous n'avez pas de fournitures, appuyez sur '{0}' sur leur corps Blessé pour les porter et les mettre à l'abri. Appuyez sur '{1}' pour les déposer devant un médecin.\r\n\r\nLes soldats Grièvement Blessés peuvent être ramassés avec '{0}' puis chargés dans une ambulance ou traités à un Hôpital ou Hôpital de campagne.",
    "51D3CD60463C81D302122E9B7586BBA4": "Blindage Thermique",
    "1D683EAB4982225ACCBB0980C5FB277F": "Ces casiers de rangement personnels sont simples et efficaces. ",
    "5B1EB0054208D30F4F698E9179336AD1": "Ce navire de transport BMS, le Bowhead, est spécialement conçu pour transporter de grandes quantités de conteneurs de ressources et équipé de compartiments pour les Moissonneuses de ressources. Nommé ainsi d'après une grande baleine, la Bassett Motor Society garantit que les ressources seront livrées sur les lignes de front où elles sont demandées et quand elle sont demandées grâce à un design efficace d'aire de chargement et une ossature robuste.",
    "342DA28B4C4A3029FBB5F99D1C0C98CA": "Ce véhicule utilitaire léger équipé d'une mitrailleuse constitue une plate-forme d'armement résistante et très rapide. Il est parfaitement adapté à l'appui de l'infanterie ou de blindés.",
    "C56715944D01D0E14051489137350ECD": "Ce vaisseau Nevish excelle à percer les flancs de la flotte Colonial. Armé de torpilles Moray et d'un sonar dernier cri, le Nakki assassine sans bruit. C'est ainsi que trois Nakkis se sont glissés de nuit derrière une flotte Colonial et l'ont détruite un navire après l'autre, poussant le Préfet Evander à battre en retraite. Leur \"Légion\" n'était pas du tout préparée à une attaque depuis les profondeurs de l'océan.",
    "C59ADBAA4C4BEFD92701E991CA0A57EC": "Ce véhicule utilitaire léger équipé d'un lance-roquettes constitue une plate-forme d'armement résistante et très rapide. Il est parfaitement adapté à l'appui de l'infanterie ou de blindés.",
    "BD7CD69B45945AFF7AB118ABB7F2760E": "Ce Véhicule Utilitaire Léger amphibie a été entièrement modifié pour pouvoir traverser les rivières et les lacs avec facilité. Il est toutefois déconseillé de s'aventurer en haute mer.",
    "B400D533415C222C56574C9FA19153D2": "Cette grenade à fragmentation anti-personnel est conçue avec un mécanisme à goupille et une mèche temporisée pour la sécurité de l'utilisateur. Les stries sur l'enveloppe permettent une meilleure prise en main et une efficacité accrue de la fragmentation.",
    "48932BD946AB6FDE083E5B92EC999903": "Cette structure sera votre point de réapparition. Vous ne pouvez assigner qu'un point de réapparition principal et un avancé. Des fournitures de soldat doivent se trouver dans le stock de cette structure pour que vous puissiez y réapparaître.",
    "3D8515CF482C4AAD3A5D798766060897": "Ce pistolet-mitrailleur est un classique, robuste et irremplaçable en tant qu'outil pour les combats à courte distance. Le Pitch Gun doit son nom aux marins de Mesea qui l'ont utilisé pour se défendre avec succès contre un raid nocturne sur les docks de Geraston. ",
    "ED86BD444DDBC5B1A9C9C1A39A083A53": "Cette arme à feu à courte portée est importée d'Estrellan. Conçue à l'origine pour la chasse au gibier, le Brasa est principalement utilisé dans les opérations urbaines.",
    "62EB2C6E4A48A437C7C2BAB1AF591D9E": "Une révision complète de la Voiture Blindée T3, renforcée par un blindage de char. Alors que ces défenses supplémentaires diminuent la vitesse maximale et la maniabilité du T12, l'ajout de chenilles augmente sa performance en terrain difficile.",
    "562007C64C8855278B7D439C1DD11117": "Le parcours est conçu pour vous tester.\r\n\r\nAmenez un ami et demandez-lui de vous tirer dessus lorsque vous bouger d'une couverture à une autre. Tirez-lui dessus le long du parcours. \r\n\r\nVoyez si vous pouvez toucher toutes les cibles sur votre chemin.",
    "5FF4998C41288C50E8A0319DDD57BF72": "Ce char meurtrier transforme n'importe que prédateur en proie. Le Noble Widow, destructeur de chars, est spécialisé en tactiques d'embuscade, attendant sa proie et la frappant d'obus ravageurs à haute vélocité.",
    "704EA4B74AD642B5CDCE20A02A87F4E0": "Cette grenade à explosif puissant, très dense, est conçue pour endommager les structures et les véhicules. ",
    "32A37722413D285B62E5BE8741D607F5": "Ce canon destructeur à courte portée est conçu pour l'engagement direct avec les fortifications ennemies. Le Wolfhound est équipé d'un blindage renforcé et d'un canon de 40 mm. ",
    "CCA8B7024C61056D854896AFFACF1112": "Cette variante précoce de l'O'Brien, le V.101 Freeman, est équipée d'une tourelle à canon balistique de 360 degrés au détriment de la vitesse de pointe.",
    "D5F4545E44CC54D27B13158991085715": "Ce poêle facile à construire est parfait pour se réchauffer dans le froid, tout en étant plus solide qu'un simple feu de camp.",
    "17889A604F86533E991EEAA1F68EF899": "Cette évolution du \"Bardiche\" est équipée de quatre lanceurs de RPG jumelés avec une mitrailleuse de calibre 12.7 mm à haute vélocité. Le \"Ranseur\" indique les progrès dans le design Kraunien, qui continuent d'améliorer des équipements obsolètes pour créer des blindés modernes et mortels.",
    "E366B9564B3EF37C3D682CA2F6CDBA88": "Ce canon de campagne est une arme antichar performante, bien qu'un peu fragile, fabriquée à partir de matériaux bon marché, d'un traitement rudimentaire et d'une technologie dépassée. Le canon de 20 mm qui y est fixé peut sembler ancien par rapport aux normes modernes, mais soyez assuré qu'il n'a aucun mal à percer les blindages modernes.",
    "4014E36D487D4FBCE39BD7AC9A41D5D6": "Cette colossale machine est le résultat des travaux de Gray Cullen. Autrefois considéré comme impossible, le Predator était la vision de Cullen sur la façon dont un grand navire pourrait opérer sur terre. Il est doté de deux séries de lance-grenades à 4 tubes et d'un redoutable canon de 94,5 mm orienté vers l'avant. Bien que les contraintes liées aux déplacements terrestres aient imposé certaines restrictions quant à la portée du projet, Cullen ne s'est pas laissé abattre et a procédé aux ajustements nécessaires pour concrétiser sa vision du vaisseau terrestre idéal.",
    "5C98C2CE4BF49E1FB1FF05877CB5DE6F": "Cette casemate fortement renforcée permet à l'infanterie en garnison, équipée de fusils antichars, de tirer sur les blindés ennemis en approche depuis une position sûre.",
    "13BC4C234178F376823DC6B83C56BF19": "Ce canon d'artillerie lourde est conçu pour neutraliser les fortifications ennemies depuis une position retranchée. Son long canon lourd confère au \"Thunderbolt\" une portée exceptionnelle.",
    "3DE65FF44A5B93C779BE0ABB51397AA0": "Ce canon lourd d'infanterie nécessite un trépied pour sa stabilité. Le Daucus est conçu pour donner à l'infanterie un appui contre les véhicules ennemis et les fortifications légères ou les garnisons fortifiées établies.",
    "88DE9A454C873522710799A27410DA32": "Cette mitrailleuse lourde est suffisamment encombrante pour nécessiter une surface stable pour maintenir sa stabilité. Les mitrailleuses de la série Malone sont des défenseurs inégalés sur le champ de bataille.",
    "90D4AA2540DFD8CC95F799AF32C3B0D0": "Cet explosif est conçu pour causer des dommages importants aux structures fortifiées et aux véhicules immobiles. ",
    "633F232149DF0FF7181D46834EC83E7F": "Ce véhicule de transport de charges lourdes est équipé de pneus renforcés, conçus à l'origine pour transporter de grandes quantités de ressources et d'armes lourdes le long des falaises escarpées de Sorovia.",
    "5920BD764CF99DB4CED8A1851C694B2E": "Cette plate-forme d'artillerie mobile très puissante est dotée d'un ensemble de robustes béquilles mécaniques qui lui permettent de supporter la puissance des tirs du canon de 150 mm. La variante \"Sarissa\" est une version particulièrement originale et ingénieuse du châssis du char Lance, qui permet une grande polyvalence lors des attaques de blindés et réduit considérablement le travail lié au transport et au déploiement des batteries d'artillerie statiques. ",
    "13DA94084D18594CC80AB3A9C181D9F9": "Ceci est disponible uniquement pour le constructeur d'origine de cette structure.\r\n\r\n<RichText.Regular12.Orange>Disponible pour le constructeur d'origine de cette structure.</>",
    "F47FB4AA4949EA79B9FF5AA1A7A301E5": "Ce \"Hatchet\" modifié présente un réservoir blindé fixé à l'arrière à côté d'une tourelle lance-flammes. Ce tank léger peut lancer des litres de carburant en feu sur une bonne distance, tandis que son équipage reste protégé derrière un blindage léger.",
    "3DF1B35D47B9CE4B59046D800F0D9889": "Ce fusil antichar monté offre une précision accrue par rapport à ses homologues autonomes. Le Typhon a été spécialement conçu pour absorber les chocs, ce qui permet des tirs plus rapides et plus réguliers.",
    "C84F81124E13B14FD56F39B119191D5C": "Cette Installation construite par les joueurs est connectée à plusieurs Mines de Ressources. Le Puits de Pétrole est connecté à un tuyau qui transportera automatiquement le Pétrole dans la raffinerie, et puis dans la centrale électrique.\r\n\r\nCommencez par accéder au Puits de Pétrole et démarrez une commande de Pétrole. Désignez la commande comme Public en utilisant le menu déroulant en haut à gauche. Cela mettra le Pétrole directement dans le Tuyau vers la Raffinerie de Pétrole.\r\n\r\nVoyez si vous pouvez comprendre comment raffiner du Pétrole et l'envoyer via Tuyaux dans la Centrale Électrique.",
    "E0F1A98441E920DF8691F5A2A81CBFD4": "Ce canon de campagne robuste permet non seulement à l'infanterie de tirer des obus de 75 mm avec aise, mais fournit aussi un bouclier anti-souffle incurvé pour une protection maximale contre les feux croisés.",
    "B26890C24C95E023BB20F4B870E107F8": "Ce canon à courte portée est conçu pour bombarder l'infanterie ennemie par des tirs indirects.",
    "F25F8A7A4097A9BE49ADDA98C025BA82": "Ce lanceur lourd, à porter sur l'épaule, est le premier du genre. Il dispose d'un blindage anti-souffle lourd et est capable de lancer des charges antichars sur des distances relativement grandes.",
    "61093A12400E33498D91E3A332D234F3": "Ce panneau a été utile",
    "E19BBD174F48F50EE6D0CBB3F40D91DC": "Ce panneau n'a pas été utile",
    "9FF2ABDF4C581B9D7BDEB4A866238209": "Cette simple variation de l'ambulance \"Salus\" est équipée d'une lance à incendie conçue pour éteindre les incendies de forêt.",
    "A1CD91CF4A350FD680590FA848BFA652": "Cette simple arme de campagne à canons jumelés de courte portée a du punch. Sa construction économique permet un assemblage assez élémentaire au détriment de la longévité. Conçu pour le soutien antichar, le Cestus est mieux utilisé dans les tactiques d'embuscade ou intégré à des lignes de blindés plus lourds.",
    "0E64E9AE41E3064701D69F9F30B7E9DF": "Ce simple véhicule utilitaire modifié est équipé d'une trappe renforcée permettant à un membre de l'équipage de bénéficier d'une visibilité accrue pour les opérations de reconnaissance intenses.",
    "CCE57F0A43666D639EA4D793746C078A": "Cette roquette à usage unique se tire à courte distance. Conçue pour transpercer les chars, l'Ignifist est l'outil idéal pour l'infanterie qui anticipe une résistance blindée. ",
    "049277874CA7CF1F1F546E86F5E560E6": "Ce petit char à été récemment remis en service pour l'arsenal Warden. Il possède une grande manœuvrabilité ainsi qu'une antenne lui permettant de la communication longue distance lors d'importantes missions de reconnaissance.",
    "5B043B4442B6B6E25CAFA0B996F519E3": "Ce camion standard est équipé d'une mitrailleuse légère à la place du siège passager. Il est bien adapté comme escorte pour les convois ou les opérations légèrement blindées.",
    "49D1A20E444A51680987CDBBCF2AF826": "Ce camion standard est équipé d'une benne de ressources à la place de la soute standard. Cela permet une plus grande capacité de ressources au détriment de l'espace pour la cargaison.",
    "CA9D64FC4F7A36C81344CAA19107CD67": "Ce camion standard est équipé d'une benne de ressources à la place de la soute standard. Cela permet une plus grande capacité de ressources au détriment de l'espace pour la cargaison. ",
    "566BD0554C6E2781BCFE47AF86AA07DB": "Ce camion standard est équipé de chenilles robustes, permettant un déplacement plus efficace sur les terrains difficiles, au détriment de la vitesse maximale.",
    "2D47D4064DE790F771F759A9562F1853": "Ce véhicule utilitaire léger dépouillé offre des places assises supplémentaires pour une petite équipe qui s'engage dans des tactiques d'attaque et de fuite.",
    "9D4DB74540030159144ED58C39288A18": "Cet uniforme, bien que peu pratique au combat, désigne le chef d'un régiment. Les officiers convenablement habillés peuvent discipliner librement leurs subordonnés. Les anciens officiers Meseans étaient la clé de l'organisation de la Légion. Cette tenue moderne rend hommage à leur héritage durable.",
    "99BFB4DB4B93D2BF0AFB8FA91B6DCA60": "Ce Fusil d'Assaut unique possède un chargeur tambour à haute capacité pensé pour un feu nourri en continu.",
    "102C44154CF1D9B99D1C4D80F9C0175F": "Cet outil de démolition unique est un long tube métallique rempli d'explosifs. Le \"Hydra’s Whisper\" est conçu pour détruire les structures hors d'atteinte qui entravent les mouvements et faire exploser les mines le long du tube.",
    "8D11C42F444FE99A9760A28D28A3C4EA": "Ce lanceur de RPG unique à double canon peut tirer deux RPG relativement rapidement. L'augmentation de la puissance de feu rend presque impossible l'utilisation par un seul soldat sans le soutien d'un support solide.",
    "6F03A66044D0E60A6827568086CA30FB": "Ce fusil unique tire trois coups en rapide succession. Le Fuscina est le premier de son genre, conçu pour effectuer des tirs de suppression lors d'assauts sur les retranchements fortifiés de l'ennemi.",
    "E8FF49EE4B17E8AFC3F8818B69550D65": "Cette arme de poing unique tire des rafales de trois projectiles. Le Cascadier n'a peut-être pas la puissance d'arrêt de ses cousins, mais compense grâce à sa légèreté, sa taille discrète et sa cadence de tir.",
    "1F21E6DD4BFA703C3302BDAA1D3A24F6": "Ce pistolet-mitrailleur unique et robuste n'est pas particulièrement pratique en mouvement, mais avec une visée minutieuse et un couvert adéquat, il se révèle être un véritable fléau au cœur de la nuit.",
    "BC78409F4C0ECAC44A3231A6A42A9711": "Cette variante du \"Bonesaw MK.3\" est spécialement conçue pour être utilisée avec un trépied. Cela lui confère une stabilité accrue et une portée effective maximale.",
    "3CE22F2F4F3A747CBCDCA884C44E4B2A": "Cette variante du R-5 Hauler standard est équipée d'une meilleure suspension et d'un meilleur système d'essieux, ce qui améliore la maniabilité générale. Toutefois, ces améliorations peuvent ne pas résister à des conditions météorologiques difficiles.",
    "A0ADCD954C88D93A356468B1F6FC351A": "Cela va retirer de tout le réseau connecté tout liquide du type stocké dans ce tuyau, permettant à de nouveaux liquides de passer dedans.\r\n\r\n<RichText.Regular12.Orange>Seuls les tuyaux avec une Réservation active seront vidés.</>",
    "5C6C2EEA4A1AF55FC3A47A9C7248BA3A": "Cette variante du \"Javelin\" est équipée d'une plate-forme de mortier à 360 degrés, conçue pour soutenir l'infanterie dans les opérations de première ligne.",
    "399F6DCE4F5CBA8474C1508C4AB13293": "Cette variante du \"Xiphos\" est équipée d'une tourelle antichar très puissante à la place de la plate-forme à mitrailleuses jumelées.",
    "1B93331345BB6FF3A35BFB903534EABF": "Faites le ménage avant un repas, lavez vos vêtements ou nettoyez la vaisselle grâce à une station de lavage. L'hygiène est essentielle pour éviter les infections et les maladies.",
    "4DE251764E2E9CB98C51928771111482": "Pour combattre l'ingénuité Caoivish, les Méséens ont développé leur propre système de propulsion RPG indirect. Des lanceurs jumelés sont installés sur une grande plateforme fixe pour maximiser la protection dans une position établie, plutôt que d'être relégué à un outil de guérilla.",
    "E65DB2424DF830078402629E7B020C22": "Pour ravitailler un véhicule, d'abord raffinez ou obtenez du diesel ou de l'essence. Pour les besoins de la formation, vous pouvez en trouvez dans le coffre près de la maison à proximité. \r\n\r\nAppuyez sur ‘{0}’ pour ouvrir votre inventaire et cliquez '{1}' sur le carburant pour l'équiper. \r\n\r\nUne fois équipée, fermez le menu, approchez vous du véhicule et maintenez ‘{1}’ jusqu'à ce vous soyez à cours de carburant.",
    "D4FB33DF4C4840AF16DF0DAB116A02D0": "Pour tourner la caméra, maintenez ‘{0}’ et bougez la souris.",
    "CA00BF9B4DFD3ADD3A738A835C2E6EC5": "Pour commencer une tranchée, vous avez d'abord besoin d'une pelle. Trouvez-en dans l'un des coffres à proximité. \r\n\r\nAvec votre pelle équipée, appuyez sur ‘{0}’ pour ouvrir le menu de construction.\r\n\r\nFaites votre sélection et, lorsque vous débutez une nouvelle tranchée, placez la parcelle comme pour toute autre structure. \r\n\r\nUne fois la parcelle placée, maintenez ‘{1}’ pour creuser. \r\n\r\nCela prendra du temps, mais creuser des tranchées est plus facile à plusieurs.",
    "893A70814DA3AA6879BF3BB21D9FA0B9": "Basculer Mode Secondaire",
    "07A4AC4248DE975EB2BC38A5F04E1194": "Activer/Désactiver Chat Vocal (Local)",
    "AEF4A4DC4A7D8B25993030B9CFEB88CC": "Activer/Désactiver Chat Vocal (Escouade)",
    "5BB77FC346A1FA4BCB6831BBACA656C3": "Torpille",
    "102EE32A4E97880745819385B4913327": "Ville",
    "61E0F27C4EE3E93AFE0E509D4A1D310B": "Quartier Général",
    "99DFC1CE459067F35E36F2A2ACF9EFA9": "Quartier Général",
    "EC5440CA43513ABE394C23BBCD530C82": "Quartier Général",
    "1440F4934D50CF78270BE498F0AE0479": "Remorque",
    "14BE7BEF426146EF3128E78A44636C22": "Remorque",
    "ECC459C14F0CE48CD3022991CF7CC1CD": "Assemblage de Train",
    "44347BB848F32F07DF9580B5C674B41C": "Transférer Torpille",
    "6111A794412124E77DB764BDC5E764B7": "Transférer Torpille",
    "1D919EAF4CA41E718E1921A15807C122": "Bus",
    "F21967B14A7EC84736BA428D37F5FA81": "Kit de Réanimation",
    "45AE3BE947CAC2B2C6723C9C57D1549C": "Grenade Tremola GPb-1",
    "90B803D9436F08A222133CA646C4ED14": "Tranchée (Niveau 1)",
    "74E989B744FF24AB38B10AAE0F9C5B02": "Tranchée (Niveau 2)",
    "84A7B5704DB2E61F06E91F819C52C317": "Tranchée (Niveau 3)",
    "37D5017B45C28CAEB3966B87673330F1": "Les fondamentaux des tranchées",
    "499F47EC45F69015EDF724A392D57999": "Connecteur de tranchée (Niveau 1)",
    "4F3155ED443FDFA70F754CB199E4AAAF": "Connecteur de tranchée (Niveau 2)",
    "C3A55C1546C54FACCFF7CEA671BFB545": "Connecteur de tranchée (Niveau 3)",
    "2EAB70C34E3EBB05E07D58A1A6D6638B": "Site de construction de Connecteur de tranchée",
    "A201A9224AF73E0339266C937179F807": "Site de construction de Tranchée",
    "AEE1E844448E5BDD0B82DEA9791C0CB3": "Tranchée d'emplacement (Niveau 1)",
    "6510FCE04BBFE9D922B27A832E1D6971": "Tranchée d'emplacement (Niveau 2)",
    "67668840461C54A7F1420F813820A754": "Tranchée d'emplacement (Niveau 3)",
    "C76CD2F44CF8F03DE31A7C91D757D976": "Site de construction de Tranchée d'emplacement",
    "366CF5134202DE6C16973BAAA1FD4318": "Toit de tranchée",
    "4644E1894D3140B8737D43A0CE835F1F": "Toit pour tranchée",
    "4C7D4017497B23EE9166D79AAAADF2C0": "Formation aux Tranchées",
    "9B3EF5104E40259744989DAC7045AAA9": "Formation aux tranchées",
    "A4C117564AE6190AB53CFC8710D3AEA7": "Formation aux tranchées",
    "A56BFFF74B9CA30EAB6B24ABAB803187": "Formation aux tranchées",
    "F2855D994844C80CA22211B006CFACC3": "Trépied",
    "542900CE4499CCF909016A876BBE29A6": "Usine de Trépied",
    "D70C348540A1FD5F04D53A9DB446A468": "Camion",
    "40FEEB8C494A469902EF7A87FCEB8813": "Tournant Décisif",
    "0DF5EE9B47D23BA89BD8BDBAFE42246C": "Tourelle",
    "1213DA5A4B0BDF537953448F4D2F8694": "Tourelle",
    "27BFB08849208F3358852D9667D6546F": "Tourelle",
    "3B3A09084AB6A72C9508359B478D8EDE": "Tourelle",
    "3FEF6CF946193B406D9350945AEEA37B": "Tourelle",
    "4B0724064D1EEDC7A9D5488E52AA09D2": "Tourelle",
    "598E5B8340153EFCA7A6D3BB161131C8": "Tourelle",
    "60E8089045422DA1B1A2E5A3E544A778": "Tourelle",
    "8A81FBEC4F4AB329D4717BA0F51E2E4E": "Tourelle",
    "8C2159F0443676232F901EBB7B834510": "Tourelle",
    "9E00642A4E6B8A6C389472A678A7D255": "Tourelle",
    "A5FC1C564F1C3401609CBEA238365CD9": "Tourelle",
    "B0FAEB69483CE85A6384A7BBA65EA685": "Tourelle",
    "CAD26D5E4649E9F5D210FE939D6D929C": "Tourelle",
    "D3F91CED4CCDE27002DA5DBFA845EFAD": "Tourelle",
    "DD79EF02455A441AFFEB53A5810F988F": "Tourelle",
    "F296A32340E52BB50A173DA89FCCC9AD": "Tourelle",
    "048FF53C4C19BCF7426D3799BEA2905F": "Tutoriel",
    "0801268348B2957F03516AAEBE236126": "Tutoriel",
    "0AD7DC1D48722FFE20FC00AF20785988": "Tutoriel",
    "0C6FEE2F4B4B53CD8FF70D82F98D082E": "Tutoriel",
    "11F31E7F48003D492817CAA508C4959D": "Tutoriel",
    "1401BA61410E2D6FD348EDB1FC20946D": "Tutoriel",
    "16106CD9415ED283576A299CFE0D373E": "Tutoriel",
    "16F080AA4D7C2AEB55F839B5D5914B9F": "Tutoriel",
    "223B4F0B4549B3AF3EEAB8AB4C204ACC": "Tutoriel",
    "22D6D23E4AFB1AB02B6C9C8F31DD4B2A": "Tutoriel",
    "3078C430418B433A4D4668B31D80800C": "Tutoriel",
    "37FB8E894E3440A7E91289B581678404": "Tutoriel",
    "3AB3CB4D4DB121BD83A806BE326D8365": "Tutoriel",
    "3DBE3C244A6511E5F691119F04A98672": "Tutoriel",
    "3F221BE047BBE4812FCB2E93DA6835AA": "Tutoriel",
    "47D4CDF04CB43741C6036A834A87BF76": "Tutoriel",
    "4F05D1984A8561ABFC7881918057E045": "Tutoriel",
    "52BE80B74684DA4D40AFB2A89A4DDE77": "Tutoriel",
    "572B9CD14758B158C623CEAA87F8525D": "Tutoriel",
    "5FD023894EDD58242992AF98C7CCDE10": "Tutoriel",
    "718A184F45BAD4371C3574A431BB731D": "Tutoriel",
    "72113C7442D995643546F2AC1CA6B5D6": "Tutoriel",
    "7657C9614DE00B19B17B0880BCB44658": "Tutoriel",
    "7AF8CE7D4ED24F0E14B4D79E947EE9C1": "Tutoriel",
    "99AC17C84B64AD83934955B7DEB7B8A2": "Tutoriel",
    "9E7BAB2C443323C51411288EB2928436": "Tutoriel",
    "9EC92899484C2749A800D89AB4807B95": "Tutoriel",
    "A97702CF43CE1D9A8E05879927E55D64": "Tutoriel",
    "AC1C657642B83E91B43B6DA620F6BA1A": "Tutoriel",
    "B058C8C64F6A47DDBCDECB893B092CC7": "Tutoriel",
    "B2A0445A40555BE301A105B2B407673C": "Tutoriel",
    "B6B44ADB4B679713D7FEB9ABC49E432C": "Tutoriel",
    "CECDD4C647749F542A0B29BB0F880D68": "Tutoriel",
    "CFC464D0480353B30E31569CCF26EA87": "Tutoriel",
    "D2C4358349A6BA2AAEAF82BF8FD48AC0": "Tutoriel",
    "D47FF5644EA67E85547DC4B393F704F7": "Tutoriel",
    "D9EF56CB4B5633104DE16CB278201BC2": "Tutoriel",
    "DEC4ED1245F83739D887AABD6677E2F3": "Tutoriel",
    "E7CBE61F494897B35D5B7597BB7297C9": "Tutoriel",
    "F7BA4BC64E22DB0C500069A115E5540B": "Tutoriel",
    "FB277A0D497AC9C3F6F4649DAF6B0B6D": "Tutoriel",
    "FBF716CC42659C37691EDD84411823F5": "Tutoriel",
    "FE9EBE5E4E7AD4124BFB99BA94A7B364": "Tutoriel",
    "FF3FCC274138DBEA320F239AE9399879": "Tutoriel",
    "675ED7F84DF98FD6BD2E9AAB03EA4BED": "Peu habitués au froid, les légionnaires doivent toujours s'adapter. Ce lourd pardessus est conçu pour atténuer les effets du froid tout en permettant une mobilité et une efficacité au combat optimales.",
    "EE118DA84850EE1C3792A4A747CF7174": "Munitions Non-Explosées",
    "C042C76744695DF15DF744815E609F89": "Uniforme",
    "F01F202E419CB6695A4B519C5F6067F5": "Contrairement à la série 85, le \"Bardiche\" est plus lourd et plus durable et est équipé d'une mitrailleuse lourde coaxiale et d'une puissante tourelle de 68 mm à canon court. L'ingénierie moderne Kraunienne permet un rechargement rapide, ce qui en fait un outil idéal pour combattre les blindages ennemis.",
    "75AB8FE84A86F6D4277D48B7ACF8B6C4": "Déverrouiller",
    "7EB9C9D944A4229BC78D8DBADF5A6ED0": "Déverrouille ce véhicule pour que n'importe quel joueur puisse y accéder.",
    "390C066E4C2FA2F6C2E3D38BBB687C2E": "Déballer",
    "97D3273D4EEB0CD842F7EFAAF4A917E0": "Déballer l'équipement dans la zone de chargement",
    "A900FC5D41B661D32B0BF6B4AAD68C60": "Déballe l'objet expédiable afin qu'il puisse être réutilisé.",
    "C572EB50426026BC88591DB9307C44AD": "Déballer l'objet à expédier. Cette fonction n'est disponible que si l'on accède à cette structure depuis une grue qui a déployé des équipements dans la zone de chargement.",
    "EA7E8F024DB199250BE79BA08DC92610": "Substances Instables",
    "D4B956C346CA1E5642177289D323532D": "Améliorer et modifier les tranchées",
    "1A369228461BEFED3E331880C8F35514": "Utiliser la molette souris pour élever la voie",
    "A075E56945A48EB182E37B92490E117E": "Utiliser la molette souris pour élever la voie",
    "98D8E4BA4632C629A811DEAB3787192A": "Utilisez la pierre pour accepter une malédiction primordiale et devenir l'hôte de l'esprit malveillant d'un Avartach.",
    "8F545E0048426B7F3E9299B3EE48F5BF": "Utilisez la pierre pour accepter une malédiction mineure et devenir l'hôte d'un esprit mort depuis longtemps.",
    "11F3C4D84BA7C71A4D3501AC9BB423B3": "Utilisez la pierre pour accepter une malédiction primordiale et devenir l'hôte de l'esprit malveillant d'un Balor Spawn.",
    "53F3B85D45EA88DE3E055A87AA7D07AE": "Utilisez cette Installation construite par les joueurs pour produire un Petit Train et placez le sur les rails en utilisant la Grue. Utilisez du charbon pour les ravitailler.\r\n\r\nVous pouvez connecter des wagons à la locomotive en les rapprochant puis en appuyant sur '{0}' ou '{1}' pour ouvrir le menu contextuel. Pour les déconnecter, utilisez une clé à molette.\r\n\r\nEssayez de produire un train qui peut livrer de l'Essence aux Installations de Mines de Ressources pour les faire marcher, et aussi ramener la ferraille qu'elles produisent.",
    "8E82923E4335B05159E475AD5ADF4C61": "Utilisez ce champ de tir pour expérimenter l'artillerie. Dans les conteneurs de stockage à proximité, vous trouverez des munitions et des jumelles. Lisez les panneaux pour plus d'informations.",
    "F17D729E4F340088340D20A5D33A4BA1": "Utilisez ce stand pour expérimenter l'artillerie. À l'intérieur des conteneurs de stockage à proximité, vous trouverez des munitions et des jumelles. Lisez les panneaux pour plus d'informations.",
    "5DD8ADCB4CB3A226F190A1AA1DB58A1F": "Utilisé par les médecins pour soigner les autres soldats.",
    "B34EDE9E464113E9D2727D8F515BE792": "Utilisé par les médecins pour réanimer les soldats blessés.",
    "9A407F074260034D38B3A3910AB1F582": "Utilisé pour construire des véhicules avancés.",
    "6A8A96BF4BFA6BF5A1D36FAAF6D3F982": "Utilisé pour relier des Lignes Électriques. Jusqu'à 4 lignes peuvent être attachées au même poteau.",
    "84E9996949F3F9A11ABCADA4EF3ECEB3": "Utilisé pour construire des défenses en Fil Barbelé.",
    "FAF8B2D74AA8A6AB2CE540907D2E30FA": "Utilisé pour construire des défenses en Poutrelle Métallique.",
    "49B8A1CF43181E9825221AA0B060DE83": "Utilisé pour construire des défenses en Sac de sable.",
    "AFDBDBB445543513C7DD549D7E397910": "Utilisé pour construire divers types de pipelines pour transporter des liquides.",
    "EC925A914580E90ADB6568904B743699": "Utilisé pour empêcher le mouvement de l'infanterie ennemie dans une zone. Cette structure est difficile à détruire avec des armes conventionnelles et doit être démontée avec une clé à molette.",
    "292BF39646EB298A64B12AA92E865556": "Utilisé pour ralentir les mouvements de l'infanterie ennemie. Peut être démonté avec une clé à molette.",
    "EBB791414DBF7EED5D7129B9D59B93F8": "Utilisé pour arrêter les saignements.",
    "022C953248AF6ED5FEF83FA8F2E86696": "Utilisant un mélange meurtrier de gaz inflammables et composés chimiques, le \"Molten Wind\" est l'arme d'infanterie la plus dévastatrice de la Légion Coloniale. En employant d'anciennes techniques, les chimistes Meséens ont développé une technique pour stabiliser et militariser les flammes liquides, qui transforme rapidement toute structure inflammable en véritable enfer.",
    "A71DF305443FCA5170FED896D5AC982D": "Sauts",
    "17E4C14547F7A71AAA51BB86BEF12BB9": "Formation aux véhicules et à l'artillerie",
    "20F447FC4BDF66099EC70097CA9F4369": "Formation aux véhicules et à l'artillerie",
    "BE46601E4365581494C9AEA56425C932": "Véhicule de combat",
    "459EEE8541430DE62B269381AE88F9E2": "Construction de véhicule",
    "72D954B54F5FEB3A119A8EBFD74B5EB8": "Caisse de véhicules",
    "B70E5E1546EA67EA21D02AAAB032BFCD": "Stockage pour Véhicule",
    "0A06D02F4F1C6AA36F1E72983602B77C": "Formation aux véhicules",
    "7A08F5DA42AB4991EB99F5B8A111E030": "Formation aux véhicules",
    "60BCB3404D4EB0A4C301C79852BE1596": "Formation aux véhicules - Appuyer sur 'E' pour lire le panneau devant vous.",
    "62CC261E4E964EC0D6C093B9FB735CDF": "Formation aux véhicules - Appuyer sur 'E' pour lire le panneau devant vous.",
    "0A8A828945E1DA4C991466A5C1D6A104": "Formation sur les véhicules et l'artillerie",
    "AD7A3A644ABD866DB2F32C8FA46C5A28": "Pièces de véhicules utilisées pour assembler les véhicules Anciens.",
    "B95F48F444B13FD8D00E719ED5AC27ED": "Véhicules",
    "E3061F75450C77B4E60E299E6D59B962": "Gilet pare-balles Velian",
    "D38017A043AE35CFEB2F05BFFEE7CF5E": "Afficher le Journal des Actions",
    "2F4842DD437179837A5AEFBB97554DD7": "Voir l'État du Moteur",
    "303E6BAF46672F827D298F89D541090F": "Voir l'État du Moteur",
    "B3F3C92A465C4140F42E8CAA25C11785": "Afficher le mot de passe",
    "039F9BB6447E1116D611818272C9FFC2": "Voir l'historique des évènements de la Région",
    "18AFFBEC4AB3882672067FB09EE390B0": "Afficher le Journal d'Actions du Stock Réservé",
    "486DDFBE41947322EC68068E52A0A271": "Afficher le Journal d'Actions du Stock",
    "0E12E2E24E1CFB7B0A277BA2D4FD48B4": "Voir l'arbre des technologies",
    "E8ED3E5E4457413CE9AB36AC83258442": "Afficher le journal des actions pour le stock réservé actuel.",
    "D7AC356C496F19916B50C0950DAC467A": "Afficher le journal d'actions pour le stock public",
    "929135D14764A4DE4D1D758BBEA86003": "Voir le journal des actions pour cette structure.",
    "1F621C1648CD0F6F797ABA8BD26C451C": "Consultez le journal des événements sensibles des joueurs dans cette région.",
    "00EABA4949026D59CBFC278A8C37F1E6": "Visibilité",
    "EC98CEBB478918935CE7DDB5D34E879B": "La visibilité est une considération importante lorsque vous traverser le champ de bataille. \r\n\r\nTout ce que votre soldat ne peut pas voir, deviendra invisible à l'écran. \r\n\r\nSe cacher dans l'herbe, derrières des murs et dans les buissons sont des options utiles pour une approche furtive. Tout déplacement lorsque vous êtes caché vous révèlera et si vous êtes caché près d'un soldat ennemi dans le même buisson, ou dans la fumée, il se peut que vous puissiez vous voir l'un l'autre. \r\n\r\nEssayez de tester les résultats avec d'autre soldats dans l'herbe devant.",
    "918C049D42456C9C70DD2092396AC802": "Mur (Niveau 1)",
    "DC034AAE488D643B6B1597A56C68D2CF": "Mur (Niveau 1)",
    "2722AC8F406D98EB1286028B6A7AA2A1": "Mur (Niveau 2)",
    "477869B14534F0ECCC356B81E835BC25": "Mur (Niveau 2)",
    "235F30394CED001CF6916696D97B5DDC": "Mur (Niveau 3)",
    "AD1A583646C7176663CD2E91E344D554": "Mur (Niveau 3)",
    "C436707642C26FC615E3158ECFD09DF5": "Uniforme d'Armure Warden",
    "00CA251B463F135BBF3EDDA4EAF8746F": "Les voitures blindées Warden sont des véhicules de combat urbain bien rodés. Ces modèles anti-infanterie sont munies de mitrailleuses jumelles.",
    "EA2128214680435E3B4BBEA83D4E4C9E": "Uniforme d'Ingénieur Warden",
    "4D0AC5244B13A47C8941009C85BCB6F5": "Uniforme Warden pour Munitions Lourdes",
    "694BDF4449C49C96C5B048A3438DE700": "Région d'Origine Warden",
    "424D68304F36C7F3F293E69FBDFE04BD": "Uniforme de Médecin Warden",
    "6D98174942355A95E6AD3BA2F8222859": "Uniforme d'Officier Warden",
    "833AD3274528861D543C7FB14E4720ED": "Uniforme d'Éclaireur Warden",
    "6F0900EA48A8B58CDB6E828B2AA8D91E": "Uniforme Hivernal Warden",
    "AE2B8CB44BD34A19BB744581D8135EEE": "Uniforme de Soldat Warden",
    "E6E31CA445C3C6B7EB325191EA4894C2": "Point d'Apparition Warden",
    "B8FE7D614032796029CC4FBF1422EEEA": "Uniforme de Tankiste Warden",
    "F616DCD34EB02F5E46FD6BA918A8AC18": "Uniforme Warden",
    "05281AB24E21E26A705DBE9AAC46DBB8": "Les spécialistes Warden ont besoin d'un uniforme optimisant leur capacité à transporter différentes munitions lourdes.",
    "1764606E426FEC81B69305B4734DE38A": "Station de Lavage",
    "BF346DD64665AECE25CA7A99F559900A": "Tour de guet",
    "824288EE43F33BA537D0A898D74027D6": "Eau",
    "EDAE889D425FA8ACF647DD85537D91F6": "Seau d'eau",
    "FF730C1E469AE4A99D457F886B7631C9": "Seau d'eau",
    "9E06F53144AC52789E387B86072A8BC9": "Pompe à Eau",
    "1035CEFF4BE551D6496A9E9C6D9F8094": "Formation sur les véhicules maritimes",
    "428EB85A4F85F55F5EB752BABEBBE174": "Formation aux véhicules aquatiques",
    "8433448C4D683BCAA53DFF8E67BE580D": "De l'eau... dans un bidon !",
    "07C5D94D4BBEBF8187110AB4DBABB7BB": "Formation à la conduite d'embarcations",
    "6D84A2D54B59F48498F7D99A884CFD10": "Formation aux embarcations à moteur",
    "B811505D48BE6582F67DB1AFB593784C": "Râtelier d'armes",
    "371422D246DF0EFF137498AE1508E008": "Armes",
    "AC69DB27422EDABB3D96D39974DFD8FC": "Plate-forme d'Armements",
    "315186DE41216D8FFEDA299279385EDA": "Station Météo",
    "FB726F6049EE79E99E8FC4A14DBA35AF": "Bienvenue à l'entraînement logistique de base. \r\n\r\nIci you pourrez interagir avec différentes structures du jeu. \r\n\r\nAppuyez sur '{0}' pour interagir avec une structure. Cela ouvrira son menu unique ainsi que son inventaire. \r\n\r\nSi vous n'êtes pas sûr comment s'utilise une structure, cliquez sur le '?' dans le coin supérieur droit de la barre de menu pour plus d'information. N'ayez pas peur de demander autour de vous!",
    "51FD8B2E4DFBBFDF4D56D9B36BC4C1F8": "Bienvenue à l'entraînement de base. \r\n\r\nIci vous pourrez tester les différents outils de base nécessaire pour être efficace sur la ligne de front. \r\n'{0}', '{1}' '{2}' '{3}'\r\nSuivez le parcours devant pour commencer. Les panneaux le long du chemin expliqueront les contrôles et fonctionnalités de base.\r\n\r\nSi vous avez des questions sur quoi que ce soit, n'ayez pas peur de demander dans le chat.",
    "12FF44B542E14ECC02F8269D9734EEFD": "Bienvenue au stand de tir",
    "E9B503F942ED2A2ADAC8F79B0D77053F": "Bienvenue au stand de tir",
    "0B8DC5AA4943CB768A61BAAD3F1EABBA": "Bienvenue au stand de tir. \r\n\r\nIci vous pouvez vous entraîner aux fondamentaux du tir et du combat.",
    "B401AA914B004B5937511A9BF775A69C": "Lorsqu'il est fixé à un masque à gaz, ce filtre fournit de l'air frais à l'utilisateur.",
    "22D8AB584B5470EB43C7FFB73C3C7BAA": "Lorsque vous utilisez l'artillerie, vous contrôlerez la direction et la distance.\r\n\r\nNOTE : Tourner nécessite que deux joueurs soient sur le canon.\r\n\r\nAppuyez sur '{0}' pour prendre place.\r\n\r\nSur l'emplacement de droite, utilisez ‘{1}’ pour changer la distance. Sur l'emplacement de gauche, ‘{2}’ et '{3}’ changeront l'azimut. \r\n\r\nSur l'emplacement de droite, lorsque votre cible est confirmée appuyez sur ‘{4}’ pour tirer.\r\n\r\nMais attention, vous aurez besoin d'un troisième joueur pour observer les impacts, en utilisant des jumelles. Les jumelles n'ont pas autant de portée que l'Artillerie, donc la coordination avec votre observateur est primordiale afin d'obtenir un réglage précis. \r\n\r\nPlacez votre observateur en éclairage, et communiquez avec lui pour déterminer si vous avez touché votre cible. \r\n\r\nDes jumelles sont fournies pour l'entraînement dans le coffre à côté.",
    "5A2593F2474A8350890231AB87E6E934": "Bien que le Noble Firebrand Mk. XVII soit un char lance-flammes dévastateur, il fallait un moyen plus efficace pour employer des armes incendiaires. C'est ainsi qu'est né le Wild Jack. Nommé d'après les idoles enflammées fabriquées par les enfants pour Dead Harvest, le Wild Jack est une variante du Highlander.",
    "8957B70144F68175D0FA9CAB7D1B1F21": "Reconnu comme le premier fusil d'assaut, l'Aalto est une prouesse de l'ingénierie Caoivish. Avec ses deux modes de tir, il peut être utilisé comme arme d'assaut à tir rapide ou comme fusil à moyenne portée.",
    "0027C25143C7C3CFA1A9B390BC088D5B": "Munition pour Willow's Bane",
    "8743966042226481CA97D2AC0A86BE4D": "Manche à Air",
    "AF7B30484B84F7CB3B281FB4EC8DDD28": "Manche à Air",
    "F8A3D28742D634ECEC6163ADACD70588": "Avec tout cet équipement, nager est difficile et demande beaucoup d'énergie. \r\n\r\nVous ne pouvez pas allez bien loin sans vous noyer alors surveillez votre endurance. Une fois celle-ci vide, vous mourrez. \r\n\r\nAvec toute votre endrance, essayez de nager jusq'aux échelles du côté opposé, et appuyez sur '{0}' pour grimper sur le quai.",
    "9CAE023F4D6042AF4DACB4AC7370BC80": "Avec sa mitrailleuse montée, le \"Doru\" est le complément parfait pour tout assaut sur rivage. ",
    "54D8167245B1B50D9CE74B9F8C8E00A7": "Avec un blindage renforcé au détriment de la vitesse, le \"Hoplite\" est une force redoutable dans le feu du combat.",
    "B8AEACB148375A119C80A3838F06BD14": "Poste de travail",
    "AA602FB24C71152B3EE62896715959FD": "Carte du monde",
    "74F1E8D84EEC202C23F02F959E1E4183": "Soldat blessé",
    "979F348E476AB09C06619CBF2E6995C2": "Débris",
    "69F2D0974F432FDCE56A81BDE1DD86DF": "Clé à Molette",
    "2E4B840B4AED4B87E6D74CA93E5D98FA": "commandes de conduite",
    "3AE507584369FD2FC1DDB8A4B8737DE8": "commandes de conduite",
    "52A39AEC4BA7A075D47F82A76AF30FD7": "commandes de conduite",
    "8DC17D5049D5C53800E416A5849A23AE": "Commandes de conduite",
    "E46F446B4FB93483B329D6B781BE29AB": "de type feu",
    "D2FFEB7A4DDFF3E02982FFB82938DAD5": "en savoir plus sur les munitions",
    "E9C2441C44E9328C21405B9ECD8A5B4E": "en apprendre plus à propos des munitions",
    "E747912D4465E130809C94B5A1180DED": "en savoir plus sur les Chantiers de Construction",
    "FE16BB5A4178EBDDC9BB86A2F3350916": "en savoir plus sur les Chantiers de Construction",
    "A2B07D6D44094B7CA842C5A93A04D408": "en apprendre plus sur les Installations",
    "DE5DAC9C4B5F7FD886D106B6C843C494": "en apprendre plus sur les Installations",
    "ED00BAF94AF2C27F68EC4BBF640E134D": "en apprendre plus sur les Installations",
    "05052DAD41CF9D748271B8BC61E763A4": "en apprendre plus sur la Production de Véhicule dans les Installations et les Petits Trains",
    "B15766254CBE636492CB0080D846985F": "en apprendre plus sur la Production de Véhicule dans les Installations et les Petits Trains",
    "C91E1797417390787B3FB59436DB01CB": "en apprendre plus sur la Production de Véhicule dans les Installations et les Petits Trains",
    "0AE4C8F34A5F6212CCAE4A976607CBB6": "en apprendre plus à propos des usines",
    "FEC11FD847A9C6DD31D197AD6D46AAB3": "en apprendre plus à propos des usines",
    "A309E0B0403AF0804C7ACCB0DD9E0035": "en savoir plus sur les Pipelines et Puits de Pétrole",
    "DAA0AF194D3AA860AB0664AF00C27B6B": "en savoir plus sur les Pipelines et Puits de Pétrole",
    "E5A7A1B84B050EB4165EE88DB78AF4F0": "en savoir plus sur les Pipelines et Puits de Pétrole",
    "30B855D14F4AEFBDE1676CBE54F4ACC6": "En apprendre plus à propos des contrôles de base",
    "97E0A56A40BFC7F65568AFBAF40C5D42": "apprendre les contrôles de base",
    "EC63965742494F58F11D309A1FCCE8A9": "En apprendre plus à propos des contrôles",
    "C368E4ED4CA40114892452977F45DD4F": "Apprendre les bases de la logistique",
    "E24061E84F11225974EB8DB0D111F6A2": "En apprendre plus à propos de la logistique de base",
    "7EE1C3A44047C1B57E37529CA65790BA": "en apprendre plus à propos de la formation de base",
    "86CBA7F8444C4B7B43BE3DBFE39A9E50": "en apprendre plus à propos de la formation de base",
    "8EF9CA7642541BE5AB6FB99009B8745C": "En apprendre plus à propos de la construction",
    "DB2FB8054A66961C6F0B7CB7C1D33F20": "En apprendre plus à propos de la construction",
    "7AD262E44C3C77920290DD835E1B8883": "en apprendre plus à propos des contrôles de la caméra",
    "8334DA784C51F1050F20668B66F70035": "En apprendre plus à propos des contrôles de la caméra",
    "15CBAAAF444E8BB14B0225A8B9C2A8A3": "en savoir plus sur comment construire un véhicule",
    "B8F903D64635261730FDE9985CBE4555": "apprendre à construire un véhicule",
    "0088363B4641F06AFB1B6D8434D8CC45": "En apprendre plus à propos de la couverture et la suppression",
    "596A4C18475A884A349DA89C998F9125": "En apprendre plus à propos de la couverture et la suppression",
    "1648D9CB40AD089B019BACB7367D558F": "en apprendre plus à propos du carburant",
    "3D0704E24CCF2CB9AA1235A8F65C5221": "En apprendre plus à propos du carburant",
    "4083E87C4DAC28C312D348ADCB9AAA2C": "en apprendre plus à propos du carburant",
    "45C660634250266DDC004084FB427F4E": "en apprendre plus à propos du carburant",
    "7ECC25004268E3CA76406683EA80A357": "en apprendre plus à propos du carburant",
    "A744CD30491C9AF5983FAF8851351001": "En apprendre plus à propos du carburant",
    "C29878954260D69AF4656BABB040DB3B": "En apprendre plus à propos du carburant",
    "038D3B2148F31508E344E6A50EEF5FC5": "En apprendre plus à propos des grenades",
    "43E16D3848F8183807D6488C68464915": "En apprendre plus à propos des grenades",
    "3D0B5D1744B51D052CAB7E9AD792C289": "en apprendre plus à propos des échelles",
    "E68E55A5481559D0EA824D98657DDB89": "En apprendre plus à propos des échelles",
    "338AAFAE4F262FAE27EF109D9A92EBAD": "en apprendre plus à propos de la médecine",
    "D698F1D7470753ED87798BBF8912B018": "en apprendre plus à propos de la médecine",
    "A0C195214C9186376B85B8A0E07D22C1": "en apprendre plus à propos des mines",
    "C4ADEC65428F7683E98259ADCEB9AD1B": "En apprendre plus à propos des mines",
    "020540A545F5F426A471F79933DB5F7B": "En savoir plus sur l'énergie, les tuyaux et le béton",
    "44A907C8455E25A7FB9296ADA6F28752": "En savoir plus sur l'énergie, les tuyaux et le béton",
    "3BB992D54076D3702B06E4BEEE604E47": "en apprendre plus à propos des ressources",
    "B2F15C704927A49523FB22837FE94AF0": "en apprendre plus à propos des ressources",
    "A403145C4DAD6312956840BC2F94429D": "En apprendre plus sur le réglage de votre point d'apparition",
    "D07A2DCF4E4FA1966CF19883A74152C1": "Apprendre à selectionner votre point d'apparition",
    "200F5D2948953AF1D5561B8CB45FF3EE": "En apprendre plus à propos de la stabilité",
    "8C7B95FD4724AE91E4DAC983B46270ED": "En apprendre plus à propos de la stabilité",
    "1D0CDFFA404E58CDEB32A4992CC9E736": "en apprendre plus à propos des postures",
    "F0BD5D1A4908CF32CE87979297B8A204": "en apprendre plus à propos des postures",
    "D506A6924D602B067A7AF2BFA3E1B355": "en savoir plus sur la natation",
    "EF97D9524BD64CBDA61469BDEEA094C2": "en savoir plus sur la nage",
    "2B32EA074E6A4EE1C11EC39FC4A4C81F": "En apprendre plus sur l'épreuve de course",
    "BE91DB20459FAC26A3E71A9CA3E03203": "En apprendre plus sur l'épreuve de course",
    "293C49F74943881F631C7A8C056B9A50": "En apprendre plus à propos de la Raffinerie",
    "51A7B2794418A064FD3D1385BE4AA6F9": "En apprendre plus à propos de la Raffinerie",
    "A142E4034F175C32125BDA9DFC2FD53B": "En apprendre plus à propos de la raffinerie",
    "E1F7024F4B3A52DC2F7768BB2049A147": "En apprendre plus à propos de la raffinerie",
    "760780A44F68536E8D769D8806B5D6D6": "En apprendre plus à propos des Entrepôts",
    "970418F24E274F2DF6140AA674E73BE4": "En apprendre plus à propos des Entrepôts",
    "4E714FF343F9AFF20F76DE97DDF061E3": "en savoir plus sur le champ d'artillerie",
    "E2014FD546985D97B8AE4F8805CE855B": "en savoir plus sur le polygone de tir",
    "780E80A946C193372A5B86BDEEE9295B": "En apprendre plus à propos des tranchées",
    "A5C5B02249EC3A683756709DA8330671": "En apprendre plus à propos des tranchées",
    "641312794ECF05A52229039F2435C4D3": "En apprendre plus sur la connexion des tranchées",
    "EB61E5F2412949DE0C54FF9558134CC3": "en savoir plus sur l'agencement des tranchées",
    "03763D2E47A40D779BFE48ABBD891653": "En apprendre plus à propos de l'amélioration et de la modification des tranchées",
    "BEF99AB346278DA350703EAFACFE8CB7": "apprenez à améliorer et à modifier les tranchées",
    "D9C68AA04C9DB47E51A7609C4C168ECA": "en savoir plus sur les sauts",
    "EB4565C64FAE40B37F19A2AB01A61057": "en savoir plus sur les sauts",
    "21C52C1445DDE46224F6D28133B8651A": "En apprendre plus à propos des armes",
    "47E331D448BD5876C983D48C5C614B76": "En apprendre plus à propos des armes",
    "7ABF21D94A081CBA5F8428A1C4C2F3B6": "ouvrir la carte de déploiement",
    "AE6DA3D94266574B76FE289A4466D6B5": "en savoir plus sur les munitions",
    "FCC34A374DDE1BDF144E1E997F81B7C6": "en savoir plus sur les munitions d'artillerie",
    "08EC3C104782AC39BB860CBF5AAA8944": "apprendre les bases de l'Artillerie",
    "E9266B2B49708818A1A8DABB3CECCAEC": "apprendre les contrôles de base",
    "711202284F51E5F3F67B94A259957C3C": "en savoir plus sur le minage basique",
    "82BD7AD141DF7DBCA3B8848E052BFC5C": "en savoir plus sur la formation de base",
    "94A7480045AF0BD426D06787C4151763": "en savoir plus sur la construction",
    "6A1F48124732AF8FBC4EDE96CE1BBEF5": "en savoir plus sur les contrôles de la caméra",
    "2448B8A2473A60B402825293DD660F91": "en savoir plus sur les Chantiers de Construction",
    "9CFE905D411686EEFBE935B8220D5129": "en apprendre plus à propos de la Couverture et la Suppression",
    "09E3A48C44768734DAB94DB43F236534": "en apprendre plus à propos des usines",
    "8F4E011C4B9907EF624E4D84180F54D0": "en savoir plus sur l'artillerie de campagne",
    "03F2BD49496DBDCC7CE2EF87EE87FBF5": "en apprendre plus sur les Feux et les Seaux d'Eau",
    "9EC484BD418FBBAAA81B13B38C51768E": "en savoir plus sur le carburant",
    "CC221D66405D5D937DDB2DBBD0013109": "en savoir plus sur les grenades",
    "3DAFC1904E06A0330CD543AEE9AAC5C4": "en savoir plus sur les échelles",
    "03FF59AD481859B5D3F03AAA464ADEB6": "en apprendre plus sur la médecine",
    "CCB9F7174B8EF9603CA88C9CFFD31F4F": "en savoir plus sur les Mines",
    "B0FC1C6D436D73B8A215069514BCE298": "en savoir plus sur l'énergie, les tuyaux et le béton.",
    "A15E50C842D13938A888D394C57FC648": "en savoir plus sur les Raffineries",
    "DBD70EAD498C06984D4D73A6412BACA8": "en savoir plus sur l'assignation du point d'apparition",
    "158EA3EE4EAFD6DE2ACE90BB0EAEBBF2": "en apprendre plus sur la connexion des tranchées",
    "42C9953244A2E547E724F2A084B337F8": "en savoir plus sur les fournitures de soldat",
    "5152A8C6472718ADDFC3BB899B8870C4": "en savoir plus sur les ressources spéciales",
    "BAC568854E21F76ECC6090815A03DFF6": "en savoir plus sur la Stabilité",
    "5CDFA67D4CEF0F8585D92AA362482EC1": "en savoir plus sur les postures",
    "5A0BE9F04E26D36AEFCFCEBA55A0EF20": "en savoir plus sur les installations de stockage",
    "524C9CA04B1BEF52EFF8568BFC714EE1": "en savoir plus sur la nage",
    "7A792E304FA050FDE3A54EA1EE886F10": "en savoir plus sur les Tranchées",
    "DE6588614A4C91A7B8394E9BC978C669": "lire à propos des Modifications et Améliorations de Tranchées",
    "A0D11951442BED25FC916B8748F62176": "en savoir plus sur les sauts",
    "5B8CB6644F96A5432014D6BBA080C9FC": "lire à propos de la Visibilité",
    "0A3063974DD6BA50E078B592865444DC": "apprendre les contrôles des véhicules nautiques",
    "1F03C87A46C06A8A42506E82B683ED93": "en savoir plus sur les armes",
    "48353CF944B23C3C2137BABC530388F6": "en savoir plus sur le vent",
    "F86E47C7459AA8988ACC359EDE768A70": "en savoir plus sur les contrôles basiques de conduite",
    "0280D14E4BEDB25E13AF72B8205F922E": "apprendre sur la formation à la logistique basique",
    "BE048D3844ECFB09ECA443ABC68D59F0": "en savoir plus sur le ravitaillement en carburant",
    "527191D34969B0CE333D1F95180ADD22": "en savoir plus sur le champ de tir",
    "DF72F2B3479ED64AC290BA86B06B7A0C": "apprendre le Système de Réservation",
    "75E3D7774784307D86886AB075C41FCE": "en savoir plus sur le parcours test",
    "97F028E942F5E6E8605FB08AF2CE03AF": "en savoir plus sur le combat de véhicule",
    "39DABAB1465FEE3E79767AABA724E8CC": "en savoir plus sur la construction de véhicule",
    "6450546E4CB6BC314CE09BB057DDA3E8": "en savoir plus sur les véhicules",
    "712D0E064A2AB3A2651E44BB5316562A": "lire le rapport",
    "67E77A2A424BF07EF7C82ABF5819F808": "lire la pancarte",
    "51C18A614140C992A0A56AB2E32D7B2D": "voir l'état de la guerre",
    "082F996F443450ADAA53759564EB09F6": "En apprendre plus à propos de l'artillerie",
    "28A0B67A47D6A5005E69C69E81990A9C": "En apprendre plus à propos de l'artillerie",
    "B9116999448514474BF020A8533216B0": "En apprendre plus à propos de l'artillerie",
    "71E8568F4C38101A2F23159D46A04EBE": "En apprendre plus à propos de l'armement des véhicules",
    "E0BA5C464F90932280B594B962D17DEA": "En apprendre plus à propos de l'armement des véhicules",
    "011B5AEE44AE74D7485D56B68B3CB9AF": "En apprendre plus à propos des véhicules",
    "11D5F20A432A71B07E745F8FC7D0DF1E": "En apprendre plus à propos des véhicules",
    "887539864C80B1027E005581B6F575E3": "En apprendre plus à propos des véhicules",
    "E8E840F348003C254669E98F8A4FF38F": "en savoir plus sur les véhicules",
    "22136F9849FE26E3CB5B679431A1B0FB": "Voir le monument",
    "DC49F557408D54D58463F3B9A504E112": "Munitions de \"Molten Wind\" v.II",
    "1B1D7EE34D1F9D18ABDAE0AB42CAAF45": "Torche \"Molten Wind\" v.II",
    "7E46E2A240D435B554270B8520F4BEEB": "\"Le Pitch Gun\" mc.V"
  },
  "STActions": {
    "ActionAim": "Viser",
    "ActionAimToggle": "Changer Visée",
    "ActionAppendMapCoordinates": "Ajouter les Coordonnées de Carte",
    "ActionBuild": "Construire",
    "ActionCameraZoom": "Zoom Caméra",
    "ActionCenterMapOnPlayer": "Centrer la Carte sur le Joueur",
    "ActionChangeChatTab": "Changer l'Onglet de Chat",
    "ActionChangeGear": "Changer de vitesse",
    "ActionClimb": "Grimper",
    "ActionEmbarkContextMenu": "Menu Contextuel d'Embarquement",
    "ActionEmoteCheer": "Emote - Acclamer",
    "ActionEmoteGoForward": "Emote - Avancer",
    "ActionEmoteHalt": "Emote - Halte",
    "ActionEmoteRallyPoint": "Emote - Point de Ralliement",
    "ActionEmoteSalute": "Emote - Saluer",
    "ActionEmoteSurrender": "Emote - Se Rendre",
    "ActionEmoteWave": "Emote - Faire Signe",
    "ActionEquipPrimary": "Équiper Primaire",
    "ActionEquipSecondary": "Équiper Secondaire",
    "ActionEquipTertiary": "Équipez Tertiaire",
    "ActionFire": "Tirer",
    "ActionForceDropLargeItem": "Forcer Lâcher Grand Objet",
    "ActionHandbrake": "Frein à main",
    "ActionInteractContextMenu": "Interagir avec Menu Contextuel",
    "ActionInventory": "Inventaire",
    "ActionLockVehicle": "Verrouiller Véhicule",
    "ActionMount": "Monter",
    "ActionMoveBack": "Reculer",
    "ActionMoveForward": "Avancer",
    "ActionMoveLeft": "Bouger à Gauche",
    "ActionMoveRight": "Bouger à Droite",
    "ActionPushToTalkSquad": "PTT Escouade Actuelle",
    "ActionPushToTalkLocal": "PTT Voix Locale",
    "ActionInteractLargeItem": "Ramasser, Lâcher, ou Déposer un Grand Objet",
    "ActionPlaceCallout": "Lancer un Appel",
    "ActionPlaceStructure": "Placer Structure",
    "ActionPlayerInteractMode": "Mode Interaction Joueur",
    "ActionRadioBackpackTransmit": "Transmettre Transmetteur Radio",
    "ActionReload": "Recharger",
    "ActionReply": "Répondre",
    "ActionRotateCamera": "Tourner Caméra",
    "ActionRotateCameraLeft": "Tourner Caméra à Gauche",
    "ActionRotateCameraRight": "Tourner Caméra à Droite",
    "ActionRotateStructure": "Tourner Structure",
    "ActionSpectateNextPlayer": "Observer le Joueur Suivant",
    "ActionSpectatePreviousPlayer": "Observer le Joueur Précédent",
    "ActionSwitchSeats": "Changer de Siège",
    "ActionSwitchToSeat01": "Passer au Siège 1",
    "ActionSwitchToSeat10": "Passer au Siège 10",
    "ActionSwitchToSeat02": "Passer au Siège 2",
    "ActionSwitchToSeat03": "Passer au Siège 3",
    "ActionSwitchToSeat04": "Passer au Siège 4",
    "ActionSwitchToSeat05": "Passer au Siège 5",
    "ActionSwitchToSeat06": "Passer au Siège 6",
    "ActionSwitchToSeat07": "Passer au Siège 7",
    "ActionSwitchToSeat08": "Passer au Siège 8",
    "ActionSwitchToSeat09": "Passer au Siège 9",
    "ActionTakeScreenshot": "Prendre Capture d'Écran",
    "ActionTextChat": "Chat Textuel",
    "ActionToggleAlerts": "Basculer Alertes",
    "ActionCalloutsMenu": "Ouvrir/Fermer le Menu d'Appels",
    "ActionToggleCrouch": "Basculer Accroupir",
    "ActionToggleInterface": "Basculer l'Interface",
    "ActionMap": "Ouvrir/Fermer la Carte",
    "ActionToggleMode": "Changer de Mode",
    "ActionPlayerScreen": "Basculer Écran Joueur",
    "ActionToggleProne": "Basculer Allonger",
    "ActionSecureMap": "Basculer la Carte Sécurisée",
    "ActionToggleVoiceChat": "Activer/Désactiver Chat Vocal",
    "ActionUse": "Utiliser",
    "ActionViewRoofs": "Voir les Toits"
  },
  "STStructures": {
    "ImodStrategicMapDesc": "Un tableau équipé de diverses cartes de la région et de statistiques utiles. Une planification et une navigation soignées sont les clés de toute opération réussie.",
    "ImodSandbagsDesc": "Une barrière défensive qui entrave le mouvement de l'ennemi et fournit une couverture pendant le combat.",
    "ImodRadioStationDesc": "Une installation radio à longue portée conçue pour transmettre des ordres en cas de besoin. Parfois, il n'y a pas le temps de délivrer un message à la main.  ",
    "ImodLatrineDesc": "Un endroit sûr pour faire ses affaires. Après tout, tout le monde doit le faire.",
    "ImodKitchenDesc": "Un espace sûr et propre pour préparer des rations ou des aliments récupérés. ",
    "ImodChalkBoardDesc": "Un simple tableau noir pour la planification des opérations.",
    "ImodWorkstationDesc": "Un poste de travail qui répond à divers besoins. Écrire une lettre à ses proches. Répertorier un inventaire des rations restantes. Tout le monde peut utiliser un bureau solide.",
    "ImodStairsBunkerDesc": "Permet d'accéder facilement au toit de ce Bunker",
    "ImodFiringPortDesc": "Permet de tirer des armes d'infanterie depuis la sécurité de ce bunker.",
    "ImodBridgeDesc": "Permet aux véhicules de traverser cette tranchée.",
    "PipeModInsulationDesc": "Un matériau isolant pour empêcher les tuyaux de geler durant les conditions météorologiques difficiles.",
    "ImodBarbedWire": "Fil Barbelé",
    "ImodBunksDesc": "Des lits empilés les uns sur les autres. Cela n'a peut-être pas l'air très confortable, mais quand il est temps de se reposer, la couchette d'un soldat est sa maison.",
    "ImodBridge": "Pont",
    "ImodBunks": "Couchettes",
    "ImodChalkBoard": "Tableau noir",
    "ImodComputerModule": "Module d'ordinateur",
    "ImodComputerModuleDesc": "Le déchiffrage de messages codés nécessite parfois plus que la seule main d'œuvre. Ces modules informatiques de pointe pourraient bien faire l'affaire. ",
    "ImodDoorway": "Porte d'entrée",
    "ImodFiringPort": "Port de Tir",
    "PipeModInsulation": "Tuyau Isolé",
    "ImodInteriorFiringPort": "Port de tir intérieur",
    "ImodKitchen": "Cuisine",
    "ImodLadder": "Échelle",
    "ImodLockers": "Casiers",
    "ImodPantry": "Garde-manger",
    "ImodLadderDesc": "Permet d'accéder à ce bunker depuis le toit.",
    "ImodPipes": "Tuyaux",
    "ImodInteriorFiringPortDesc": "Fournit une couverture contre les ennemis qui sont entrés dans ce bunker",
    "ImodTrenchRoofDesc": "Fournit une couverture contre les ennemis qui sont entrés dans ce bunker",
    "ImodStairsDesc": "Permet un accès facile pour entrer et sortir de cette tranchée.",
    "ImodDoorwayDesc": "Permet l'accès à ce bunker.",
    "ImodPipesDesc": "Fournit les connexions électriques des Générateurs aux améliorations de Bunker.",
    "ImodRadioStation": "Station Radio",
    "ImodSandbags": "Sacs de sable",
    "ImodPantryDesc": "Des étagères pour stocker les rations, les fournitures et les outils de la vie quotidienne.",
    "ImodBarbedWireDesc": "Ralentit l'infanterie ennemie tentant d'envahir cette tranchée.",
    "ImodStairs": "Escaliers",
    "ImodStrategicMap": "Carte stratégique",
    "ImodLockersDesc": "Ces casiers de rangement personnels sont simples et efficaces. ",
    "ImodWashStationDesc": "Faites le ménage avant un repas, lavez vos vêtements ou nettoyez la vaisselle grâce à une station de lavage. L'hygiène est essentielle pour éviter les infections et les maladies.",
    "ImodTrenchRoof": "Toit de tranchée",
    "ImodWashStation": "Station de Lavage",
    "ImodWorkstation": "Station de travail"
  },
  "STTutorial": {
    "TutorialActionHoldCamera": "(Maintenir)\r\nPivoter Caméra\r\n\r\n(Ctrl+Défilement Molette)\r\nZoom Cinématique",
    "TutorialActionHoldRotateStructure": "(Maintenir)\r\nTourner Structure",
    "TutorialActionHoldAim": "(Maintenir) Viser",
    "TutorialActionCycleWeapons": "Changer d'Armes",
    "TutorialActionEnterVehicle": "Monter dans Véhicule",
    "TutorialActionLocalVoiceChat": "Chat Vocal Local",
    "TutorialActionMove": "Déplacer"
  },
  "UObjectToolTips": {
    "AnimNode_LayeredBoneBlend:LayerSetup": "Configuration des parties du squelette à mélanger pour chaque couche. Permet\n certaines parties de l'arbre doivent être estompées ou omises de la pose.",
    "AnimNode_LayeredBoneBlend:CurveBlendOption": "Comment mélanger les calques ensemble"
  },
  "War": {
    "LightUtilityVehicle": "Véhicule utilitaire léger",
    "Turret": "Tourelle"
  }
}